{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/virat-kohli-brother-vikas-kohli-slams-rahul-vaidyas-comments-avneet-kaur-2721720-2025-05-08",
      "headline": "Virat Kohli's brother slams Rahul Vaidya's comments: What a loserCricketer Virat Kohli's brother, Vikas Kohli, has reacted to Rahul Vaidya's comments where he called him a 'joker'. Vikas, in his note, emphasised the nation's current situation and mentioned how Rahul is using the cricketer's name to gain followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-director-k-ramnarayan-on-replacing-sonu-nigam-songs-saying-sorry-will-not-cut-it-2721650-2025-05-08",
      "headline": "Kannada director on replacing Sonu Nigam's songs: He must pay a priceKannada director, who replaced two Sonu Nigam songs in his upcoming film 'Kuladalli Keelyavudo' following the singer's concert controversy, said that his apology is not enough. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/1-film-every-3-years-why-are-young-telugu-directors-delaying-film-productions-2721616-2025-05-08",
      "headline": "1 film every 3 years: Why are young Telugu directors delaying film productions?Once celebrated for rapid, inventive filmmaking, new directors of the Telugu cinema now take two-three years between projects. Rising budgets, cautious OTT deals and a shrinking writing pool have forced even proven talents into lengthy pauses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reveals-training-ranveer-singh-for-his-debut-film-2721577-2025-05-08",
      "headline": "Was Nawazuddin Siddiqui Ranveer Singh's acting coach? Costao actor revealsNawazuddin Siddiqui revealed he trained Ranveer Singh ahead of his debut in Band Baaja Baaraat, during his days as an acting workshop mentor. While he guided many aspiring actors, Siddiqui credited Ranveer's success to his own talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pawandeep-rajan-indian-idol-12-winner-out-of-icu-friend-shares-pic-from-hospital-2721611-2025-05-08",
      "headline": "Singer Pawandeep Rajan out of ICU, friend shares pic from hospitalIndian Idol 12 winner Pawandeep Rajan recently met with a serious car accident near Moradabad, has been shifted from the ICU to a private room. His friend Govind Digari shared the update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-donates-rs-10-crore-from-retro-profits-to-agaram-foundation-2721542-2025-05-08",
      "headline": "Suriya donates Rs 10 crore from Retro profits to Agaram FoundationActor Suriya, along with Retro director Karthik Subbaraj, donated Rs 10 crore to the Agaram Foundation, funding education for underprivileged children. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-begins-kantara-2-last-schedule-after-junior-artiste-death-2721486-2025-05-08",
      "headline": "Rishab Shetty begins last schedule of Kantara 2 after death of junior artisteRishab Shetty's 'Kantara: Chapter 1', a prequel to the 2022 blockbuster film, is among the most highly-anticipated Indian films of the year. Despite several setbacks during production, the makers have now entered the final schedule of shoots for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/munawar-faruqui-shehnaaz-gill-kubbra-sait-celebs-attend-acting-workshop-saurabh-sachdeva-2721573-2025-05-08",
      "headline": "Munawar Faruqui, Shehnaaz Gill, and celebs take acting class from Saurabh SachdevaShehnaaz Gill, Karan Veer Mehra, Munawar Faruqui, Kubbra Sait, and others participated in a workshop conducted by veteran actor Saurabh Sachdeva. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/reborn-rich-season-2-production-confirmed-without-song-joong-ki-2721540-2025-05-08",
      "headline": "Reborn Rich Season 2 production confirmed without Song Joong-kiThe popular 2022 K-drama 'Reborn Rich' has been officially renewed for its eagerly-awaited second season, promising a gripping tale of ambition, love, and power within a global corporation. Fans can look forward to a large-scale production that aims to connect emotionally with international audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/piku-and-its-healing-powers-how-a-film-becomes-so-much-more-2721544-2025-05-08",
      "headline": "Piku and its healing powers: How a film becomes so much more...'Piku', starring Amitabh Bachchan, Deepika Padukone, and the late legendary actor, Irrfan, completes 10 years today. While on the surface, it remains a film about a father-daughter relationship and the art of subtle romance, it is so much more than that. It, in fact, is life itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/filmmakers-rush-to-secure-operation-sindoor-title-15-studios-seek-registration-2721518-2025-05-08",
      "headline": "Filmmakers rush to secure Operation Sindoor title, 15 studios seek registrationFollowing India's precision strikes on terror camps, numerous Bollywood studios are rushing to register the title 'Operation Sindoor' for potential war films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-says-taimur-has-stage-fear-doesnt-want-to-perform-publicly-2721512-2025-05-08",
      "headline": "Saif Ali Khan says Taimur has stage fear, doesn't want to perform publiclyTaimur Ali Khan, son of actors Saif Ali Khan and Kareena Kapoor Khan, is not interested in acting, said his father. Saif shared that his son feels shy on stage and doesn't like performing in front of people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-opens-up-about-directors-comment-on-her-motherhood-priorities-amid-busy-schedule-2721475-2025-05-08",
      "headline": "When director told Deepika she's 'taking motherhood seriously': Is it compliment?In a recent interview, Deepika Padukone shared an incident where a director commented on her commitment to motherhood. Deepika welcomed her daughter, Dua, in September last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prateik-babbar-smita-patil-recalls-being-a-drug-addict-was-thrown-out-of-film-institute-2721517-2025-05-08",
      "headline": "Prateik Smita Patil recalls being a drug addict: Was thrown out of film instituteActor Prateik Smita Patil opened up on battling substance abuse. The 'HIT 3' and 'Sikandar' actor revealed that he regrets being in that reckless phase of life. Patil also narrated how he was 'thrown out' of a film institute due to addiction.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-mandana-karimi-reacts-after-outrage-over-instagram-post-mentioning-operation-sindoor-2721510-2025-05-08",
      "headline": "Proud of India, have deep respect for government: Mandana Karimi after backlashIranian actor Mandana Karimi faced backlash after her Instagram post mentioning Operation Sindoor. Now, she had reacted to it, clarifying that she is proud of India and has deep respect for the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-rani-mukerjis-hum-tum-to-re-release-on-may-16-kunal-kohli-2721505-2025-05-08",
      "headline": "Nostalgia alert! Saif Ali Khan, Rani Mukerji's Hum Tum to re-release on May 16Actors Saif Ali Khan and Rani Mukerji's 'Hum Tum' is set to re-release in theatres on May 16. The film is directed by Kunal Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-recalls-his-kambakht-one-sided-love-says-it-still-hurts-2721472-2025-05-08",
      "headline": "Karan Johar recalls his 'kambakht' one-sided love, says it still hurtsKaran Johar talked about experiencing one-sided love, and becoming the 'worst version' of himself, until he used those difficult feelings to 'empower' himself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dept-q-trailer-the-queens-gambit-maker-scott-frank-team-up-with-matthew-goode-2721471-2025-05-08",
      "headline": "Dept. Q trailer: The Queen's Gambit maker promises hooking investigative thrillerThe new Netflix series 'Dept. Q', created by Scott Frank of 'The Queen's Gambit' fame, features Matthew Goode as an eccentric detective dealing with past trauma while solving cold cases in Scotland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/aimee-lou-wood-clarifies-rumours-about-snl-skit-and-her-viral-crying-pics-2721470-2025-05-08",
      "headline": "Aimee Lou Wood on SNL skit and her viral crying pics: People are quite boredActor Aimee Lou Wood, best known for 'Sex Education', has spoken up about the viral photos of her crying in public, days after the controversial SNL skit. She clarified that the pictures were unrelated and also urged people to stop over analysing everything. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-attack-state-funeral-terrorists-pakistan-army-civilians-killed-claims-pahalgam-attack-2721710-2025-05-08",
      "headline": "State funerals for terrorists in Pakistan: India rejects 'civilians killed' chargeIndia on Thursday strongly rejected claims of civilian casualties in Tuesday's strikes on terror camps in Pakistan and condemned Islamabad for allegedly according state funerals to the terrorists killed in the operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pak-deliberately-killed-sikhs-in-india-targeted-gurdwara-government-on-deaths-in-shelling-in-jks-poonch-2721713-2025-05-08",
      "headline": "Pak deliberately killed Sikhs, targeted gurdwara in J&K: India on LOC shellingForeign Secretary Vikram Misri said that Pakistan is using religion to indoctrinate people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-lahore-blasts-multiple-series-of-explosions-sirens-people-panic-smoke-clouds-india-operation-sindoor-strikes-2721373-2025-05-08",
      "headline": "India repels Pak attack on targets in 15 cities, neutralises Lahore's air defenceThe government said Pakistan's drones and missiles were neutralised by the Integrated Counter UAS Grid and the Russia-made S-400 Triumf air defence systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-live-updates-indian-armed-forces-carried-out-precision-strike-at-terrorist-camps-2720648-2025-05-07",
      "headline": "PM at high-level meet with Defence Minister, NSA Ajit DovalOperation Sindoor Live Updates: India carried out precision strikes on terror camps in Pakistan and Pakistan-occupied Kashmir in response to the April 22 Pahalgam terror attack which killed 26 people. The government said its actions have been \"focused, measured and non-escalatory in nature\" and that \"no Pakistani military facilities have been targeted\". Prime Minister Narendra Modi told his colleagues in the Cabinet meeting that it was a proud moment for everyone following the operation. The government held an all-party meeting today and briefed the Opposition following Operation Sindoor.  Follow Indiatoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-foiled-pakistan-missile-drone-attack-night-awantipora-bhuj-rajasthan-integrated-counter-uas-grid-air-defence-2721593-2025-05-08",
      "headline": "How India foiled Pak's attack, turned its missiles, drones into dudsIndia's shield of sensors, missiles, and jammers snapped into action across 1,800 km of Indian airspace, as Pakistan fired a swarm of drones and missiles after Operation Sindoor. From the heights of Awantipora to the salt flats of Bhuj, every incoming threat was hunted down by India's Integrated Counter-UAS Grid and Air Defence systems. What exactly are they and how do these systems work? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-original-escalation-government-india-pak-air-defence-systems-counterstrikes-2721694-2025-05-08",
      "headline": "Pahalgam attack was original escalation: India on counterstriking Pak systemsA day after Operation Sindoor targeted terror camps in Pakistan and Pakistan-occupied Kashmir, Foreign Secretary Vikram Misri said the original escalation was the April 22 Pahalgam terror attack, in which 26 civilians were killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-leaves-lahore-defenceless-hits-china-made-hq-9-missile-shield-hq-9p-air-defence-system-pakistan-2721592-2025-05-08",
      "headline": "India destroys China-made missile shield in Lahore. What are Pak's HQ-9, HQ-16?India countered an aerial attack by Pakistan on the night of May 7 and hit its air defence system. India's strike destroyed the HQ-9P and HQ-16 missile defence systems, built by China and customised for Pakistan. China uses the HQ-9 system, with a longer range of surface-to-air missiles, for its defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-dismisses-claims-attack-on-dam-near-neelum-jhelum-project-in-pok-operation-sindoor-2721703-2025-05-08",
      "headline": "Blatant lie: India on claims of attack on dam near Neelum-Jhelum project in POKPakistan on Wednesday alleged that India had \"deliberately targeted\" the Neelum-Jhelum hydropower project, calling it \"violation of international conventions\". India today thoroughly junked the allegations, calling them \"an absolute and complete fabrication.\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/s-400-vs-shaheen-3-missile-power-in-focus-as-india-pak-tensions-rise-operation-sindoor-2721665-2025-05-08",
      "headline": "S-400 vs Shaheen-3: Missile power in focus after Operation SindoorIndia's S-400 Triumf, dubbed \"Sudarshan Chakra\" in IAF service, is one of the world's most advanced air defence systems. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/stop-pakistani-content-immediately-national-security-centre-otts-media-streaming-platforms-advisory-operation-sindoor-2721662-2025-05-08",
      "headline": "Stop Pakistani content immediately: Centre to OTTs, media streaming platformsCiting national security concerns after the April 22 Pahalgam terror attack, the Indian government on Thursday ordered all OTT and streaming platforms to immediately remove Pakistan-origin content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rawalpindi-cricket-stadium-damaged-after-being-hit-by-drones-2721584-2025-05-08",
      "headline": "Drone hits Rawalpindi stadium hours before Pakistan Super League match: SourcesA match between Peshawar Zalmi and Karachi Kings was scheduled for 8 pm today, but a drone strike has damaged parts of the stadium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pak-lying-since-birth-trying-communalise-anti-terror-strikes-india-foreign-secretary-vikram-misri-operation-sindoor-2721734-2025-05-08",
      "headline": "Pak lying since birth, trying to communalise India's anti-terror strikes: Foreign secy MisriA desperate Pakistan has tried to give a communal colour to India's anti-terror strikes as part of Operation Sindoor. India's Foreign Secretary Vikram Misri called out Pakistan's lies, saying that the country has been lying since it was born in 1947."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-air-defence-systems-lahore-thwarts-attack-military-installations-operation-sindoor-2721683-2025-05-08",
      "headline": "Op Sindoor not over yet as India makes Pak pay for drone attack. 10-point recapIndia on Thursday destroyed an air defence system at Lahore after Pakistan attempted to strike a number of military targets in Northern and Western India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anyone-attempting-to-harm-indias-sovereignty-must-be-prepared-for-op-sindoor-like-action-warns-rajnath-singh-2721619-2025-05-08",
      "headline": "Test our patience, and be ready for a quality response: Rajnath Singh warns PakDefence Minister Rajnath Singh said that India has always acted like a responsible nation with great restraint. In a warning to Pakistan, Rajnath Singh said that India's restrained actions do not mean that anyone can misuse our patience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-advisory-personnel-citizens-in-lahore-after-drone-explosions-leave-or-shelter-in-place-2721576-2025-05-08",
      "headline": "Leave safely: US advisory for personnel, citizens in Lahore after drone explosionsUS citizens who find themselves in an \"area of active conflict\" have been advised to leave if they can do so safely. \"If it is not safe to leave, they should shelter-in-place,\" the US asked its citizens in Lahore and Pakistan's Punjab Province."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-cross-border-shelling-along-loc-jk-kupwara-2721288-2025-05-08",
      "headline": "15 civilians, jawan killed in Pak firing along LoC; UN team, villagers evacuatedThe latest round of shelling came hours after India launched Operation Sindoor, a high-precision military offensive that struck nine terror camps in Pakistan and Pakistan-Occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistans-islamist-army-chief-asim-munir-is-such-a-dangerous-foe-2721637-2025-05-08",
      "headline": "Why Pakistan's Islamist army chief Asim Munir is such a dangerous foeMunir emerged as one of the most powerful army chiefs of Pakistan without having to topple the civilian dispensation but overplayed his hand with the Pahalgam attack\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/burnt-cash-discovered-row-cji-sanjiv-khanna-sends-inhouse-inquiry-report-on-justice-yashwant-varma-president-prime-minister-2721700-2025-05-08",
      "headline": "Chief Justice sends Delhi judge cash scandal inquiry report to President, PMChief Justice of India Sanjiv Khanna sent a confidential inquiry report on Justice Yashwant Varma, along with his response, to the President and Prime Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/agra/story/taj-mahal-high-alert-yellow-zone-operation-sindoor-india-pak-tensions-2721667-2025-05-08",
      "headline": "Taj Mahal on high alert as India-Pak tensions escalate after Op SindoorA high alert has been issued in the yellow zone of the Taj Mahal after tension between India and Pakistan escalated following Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-reduced-sexual-desire-a-common-long-term-side-effect-of-cancer-treatment-2721634-2025-05-08",
      "headline": "How cancer treatment affects sex, desire, and connectionReduced libido after cancer treatment isn't just about hormones or physical scars (that's a part too), but it's also a layered experience of emotional trauma, body image shifts, and persistent side effects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/keeping-indian-skies-safe-s-400-triumf-air-defence-system-tracks-targets-enemy-missiles-2721647-2025-05-08",
      "headline": "Keeping India's skies safe: How S-400 tracks and targets enemy missilesThe S-400 Triumf is a mobile surface-to-air defence system developed by Russia and is considered one of the best globally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/jaish-e-mohammad-chief-masood-azhar-pakistan-op-sindoor-2721680-2025-05-08",
      "headline": "Pak MP admits to India targeting Jaish chief Masood Azhar under Op SindoorIn response to the deadly Pahalgam attack in Jammu and Kashmir on April 22, India launched precision strikes on nine terror camps in Pakistan and Pakistan-occupied Kashmir under Op Sindoor on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-sudarshan-chakra-s-400-air-defence-missile-systems-foil-pakistan-drone-attacks-targets-neutralised-2721562-2025-05-08",
      "headline": "Russia-made 'Sudarshan Chakra' thwarted Pak's midnight drone-missile attackPakistan attempted to strike multiple military targets across northern and western India using drones and missiles. The aerial assault was neutralised by the S-400 air defence systems."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-postpones-psl-fixture-amid-rising-tensions-with-india-2721724-2025-05-08",
      "headline": "Pakistan postpones PSL match in Rawalpindi Stadium after India's counter-strikesThe Pakistan Cricket Board confirmed the postponement of Thursday's PSL 2025 match after a drone struck the Rawalpindi Cricket Stadium. The future of PSL is in doubt amid the rising tensions between India and Pakistan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-chennai-super-kings-ms-dhoni-gujarat-titans-2721717-2025-05-08",
      "headline": "CSK stint felt like an internship: GT's Sai Kishore on time with 5-time IPL championsGT spinner Sai Kishore said that his time with CSK felt like an internship for him and helped him shape the way he sees the game. Kishore spent two years with CSK before joining GT during the IPL 2022 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-punjab-kings-vs-delhi-capitals-updates-today-match-2721702-2025-05-08",
      "headline": "PBKS vs DC Live: Punjab look to seal playoff berth against nervy DelhiIPL 2025, PBKS vs DC Live Updates: The Kings, led by Shreyas Iyer, have a chance to become the first team to qualify for the playoffs. The Capitals, on the other hand, are looking to regain their lost momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-tribute-to-rohit-sharma-after-test-retirement-2721695-2025-05-08",
      "headline": "Shubman Gill's fitting tribute to Rohit Sharma: Will remember your learnings foreverStar India batter Shubman Gill paid tribute to Rohit Sharma following his retirement from Tests on May 7. Rohit scored 4301 runs in the longest format and also captained the team in 24 games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-bcci-rajiv-shukla-indian-team-2721697-2025-05-08",
      "headline": "Rohit Sharma's Test retirement his own call, no pressure from BCCI: Rajiv ShuklaBCCI vice-president Rajiv Shukla has said that Rohit Sharma's Test retirement was the 38-year-old's call and the cricket board didn't pressurise him into making the decision. Rohit retired from Test cricket on May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-italian-open-comeback-live-streaming-2721688-2025-05-08",
      "headline": "Jannik Sinner comeback: When and where to watch World No.1 in Italian OpenItalian Open 2025: World No.1 Jannik Sinner will make his comeback on May 9 when he faces the winner of the match between Federico Cina and Mariano Navone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-kapil-dev-reaction-odi-world-cup-2027-2721653-2025-05-08",
      "headline": "Very few played cricket like Rohit Sharma, taking his place difficult: Kapil DevLegendary Kapil Dev praised Rohit Sharma's conduct and contribution to Indian cricket. The World Cup-winning captain also weighed on the chances of Rohit representing India in the ODI World Cup in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-pakistan-cricket-board-india-strikes-meeting-2721643-2025-05-08",
      "headline": "PCB calls emergency meeting to discuss PSL 2025 futureThe Pakistan Cricket Board (PCB) has confirmed an emergency meeting to discuss the future of the Pakistan Super League (PSL) in 2025 amid escalating tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-kl-rahul-crisis-man-criticism-indian-team-2721642-2025-05-08",
      "headline": "Rohit calls Rahul his 'crisis man': Has been an important player for meRohit Sharma said that KL Rahul has been his crisis man for the past few years, as the 33-year-old puts his hand up for any role that is put in front of him. Rahul has played as a wicketkeeper and middle-order batter under Rohit's captaincy in ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-ipl-2025-marco-jansen-sandeep-sharma-2721623-2025-05-08",
      "headline": "Rajasthan rope in South Africa pacer to replace injured Sandeep SharmaIPL 2025: Rajasthan Royals (RR) have picked Nandre Burger as a replacement for Sandeep Sharma, who has been ruled out of the tournament due to a finger injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-recalls-rohit-sharmas-test-debut-in-tribute-to-retiring-captain-2721585-2025-05-08",
      "headline": "Sachin Tendulkar recalls Rohit Sharma's Test debut in tribute to retiring captainLegendary India cricketer Sachin Tendulkar recalled Rohit Sharma's Test debut against West Indies at Eden Gardens, Kolkata in 2013 following his retirement from the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-kapil-dev-reaction-odi-world-cup-2027-2721653-2025-05-08",
      "headline": "Very few played cricket like Rohit Sharma, taking his place difficult: Kapil DevLegendary Kapil Dev praised Rohit Sharma's conduct and contribution to Indian cricket. The World Cup-winning captain also weighed on the chances of Rohit representing India in the ODI World Cup in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-pakistan-cricket-board-india-strikes-meeting-2721643-2025-05-08",
      "headline": "PCB calls emergency meeting to discuss PSL 2025 futureThe Pakistan Cricket Board (PCB) has confirmed an emergency meeting to discuss the future of the Pakistan Super League (PSL) in 2025 amid escalating tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-kl-rahul-crisis-man-criticism-indian-team-2721642-2025-05-08",
      "headline": "Rohit calls Rahul his 'crisis man': Has been an important player for meRohit Sharma said that KL Rahul has been his crisis man for the past few years, as the 33-year-old puts his hand up for any role that is put in front of him. Rahul has played as a wicketkeeper and middle-order batter under Rohit's captaincy in ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-ipl-2025-marco-jansen-sandeep-sharma-2721623-2025-05-08",
      "headline": "Rajasthan rope in South Africa pacer to replace injured Sandeep SharmaIPL 2025: Rajasthan Royals (RR) have picked Nandre Burger as a replacement for Sandeep Sharma, who has been ruled out of the tournament due to a finger injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-recalls-rohit-sharmas-test-debut-in-tribute-to-retiring-captain-2721585-2025-05-08",
      "headline": "Sachin Tendulkar recalls Rohit Sharma's Test debut in tribute to retiring captainLegendary India cricketer Sachin Tendulkar recalled Rohit Sharma's Test debut against West Indies at Eden Gardens, Kolkata in 2013 following his retirement from the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shifted-dharamshala-ahmedabad-operation-sindoor-2721566-2025-05-08",
      "headline": "PBKS vs MI: IPL match likely to be shifted from Dharamshala to AhmedabadIPL 2025, PBKS vs MI: The Gujarat Cricket Association confirmed that the BCCI requested the board to host Sunday's match between Punjab Kings and Mumbai Indians. Dharamshala was scheduled to host the big-ticket game, but the closure of the airport after Operation Sindoor has led to "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-to-honour-indian-armed-forces-with-b-praak-performance-in-dharamshala-2721541-2025-05-08",
      "headline": "BCCI to honour Indian armed forces with B Praak performance in DharamshalaThe BCCI will honour the Indian armed forces with a special tribute ahead of the IPL 2025 clash between Punjab Kings and Delhi Capitals in Dharamshala on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-pbks-dharamshala-weather-forecast-rain-updates-2721536-2025-05-08",
      "headline": "PBKS vs DC Dharamshala weather forecast today: Will rain affect crunch IPL 2025 game?IPL 2025: Delhi Capitals take on Punjab Kings in a crucial clash at the HPCA Stadium in Dharamshala. Both teams would not want rain interruption as the result of the big-ticket game could be decisive to their playoffs hopes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-should-lead-indias-test-side-on-england-tour-anil-kumble-2721516-2025-05-08",
      "headline": "Jasprit Bumrah should lead India's Test side on England tour: Anil KumbleFormer India skipper Anil Kumble said he would like to see pace spearhead Jasprit Bumrah lead India in their five-match Test tour of England in June-July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakaravarthy-fined-25-per-cent-of-his-match-fees-for-code-of-conduct-breach-2721483-2025-05-08",
      "headline": "BCCI punishes Varun Chakravarthy for IPL code of conduct breach vs CSKKolkata Knight Riders (KKR) spinner Varun Chakravarthy was fined 25 percent of his match fee and handed one demerit point for breaching the IPL Code of Conduct against Chennai Super Kings (CSK) at Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-indian-commentary-standard-criticism-explosive-interview-2721464-2025-05-08",
      "headline": "Rohit Sharma slams Indian commentary standards, says criticism is agenda-drivenRohit Sharma accused Indian commentators of focusing on a single star player and repeatedly discussing his personal life, rather than appreciating and analysing the game itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-dc-ipl-2025-preview-predicted-xi-team-news-dharamshala-pitch-conditions-2721444-2025-05-08",
      "headline": "DC in must-win territory against PBKS in Dharamsala as playoff race heats upPBKS vs DC, IPL 2025 Preview: Delhi Capitals will be desperate to halt their downward slide and keep their playoff hopes alive when they face an in-form Punjab Kings in a high-stakes IPL 2025 clash in Dharamsala on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-childhood-coach-dineesh-lad-explains-2721428-2025-05-08",
      "headline": "Rohit Sharma did not announce Test retirement in a hurry: Childhood coachRohit Sharma's childhood coach Dinesh Lad said his ward did not take the decision to retire from Test cricket in haste. Rohit announced retirement weeks ahead of the selection for the Test team for the tour of England, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakaravarthy-fined-25-per-cent-of-his-match-fees-for-code-of-conduct-breach-2721483-2025-05-08",
      "headline": "BCCI punishes Varun Chakravarthy for IPL code of conduct breach vs CSKKolkata Knight Riders (KKR) spinner Varun Chakravarthy was fined 25 percent of his match fee and handed one demerit point for breaching the IPL Code of Conduct against Chennai Super Kings (CSK) at Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-indian-commentary-standard-criticism-explosive-interview-2721464-2025-05-08",
      "headline": "Rohit Sharma slams Indian commentary standards, says criticism is agenda-drivenRohit Sharma accused Indian commentators of focusing on a single star player and repeatedly discussing his personal life, rather than appreciating and analysing the game itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-dc-ipl-2025-preview-predicted-xi-team-news-dharamshala-pitch-conditions-2721444-2025-05-08",
      "headline": "DC in must-win territory against PBKS in Dharamsala as playoff race heats upPBKS vs DC, IPL 2025 Preview: Delhi Capitals will be desperate to halt their downward slide and keep their playoff hopes alive when they face an in-form Punjab Kings in a high-stakes IPL 2025 clash in Dharamsala on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-childhood-coach-dineesh-lad-explains-2721428-2025-05-08",
      "headline": "Rohit Sharma did not announce Test retirement in a hurry: Childhood coachRohit Sharma's childhood coach Dinesh Lad said his ward did not take the decision to retire from Test cricket in haste. Rohit announced retirement weeks ahead of the selection for the Test team for the tour of England, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-mikel-arteta-arsenal-better-team-loss-psg-2721419-2025-05-08",
      "headline": "Arteta claims Arsenal are best team in Champions League despite semi-final exitMikel Arteta claimed that Arsenal were the best team in the Champions League and insisted they were \"better\" than PSG, despite their semi-final defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-dc-sunil-joshi-press-conference-yuzi-chahal-dharamsala-2721407-2025-05-08",
      "headline": "Chess champion Yuzi Chahal has always proved naysayers wrong: PBKS coach JoshiIPL 2025: Speaking to the press on the eve of their game against Delhi Capitals in Dharamsala, Punjab Kings' spin-bowling coach Sunil Joshi heaped praise on Yuzvendra Chahal's consistency in the IPL and his ability to bounce back from setbacks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-lhuandre-pretorius-replacement-nitish-rana-2721403-2025-05-08",
      "headline": "Replacement spree continues as RR sign 19-year-old South Africa starRajasthan Royals have signed Lhuan-dre Pretorius to replace the injured Nitish Rana. This move comes amid a broader trend of mid-season player replacements in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-deserved-a-farewell-test-manoj-tiwari-2721401-2025-05-08",
      "headline": "Rohit Sharma deserved a farewell Test: Manoj TiwaryFormer India batter and Bengal captain Manoj Tiwari feels Rohit Sharma deserved a proper farewell on the field rather than an announcement via social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-csk-chennai-super-kings-batting-coach-mike-hussey-press-conference-2721378-2025-05-08",
      "headline": "IPL 2025: Win over KKR brings immense satisfaction, says CSK's batting coachChennai Super Kings batting coach Michael Hussey said the hard-fought win over KKR would bring immense satisfaction to the players, support staff, and fans alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-csk-beat-kkr-playoff-chances-2721372-2025-05-08",
      "headline": "Ajinkya Rahane believes KKR can still qualify for playoffs despite CSK lossKolkata Knight Riders captain Ajinkya Rahane remains hopeful of playoff qualification following a heartbreaking loss to Chennai Super Kings at Eden Gardens on Wednesday. He believes KKR can still make it if they win their remaining two league matches, both of which are away fixtures.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-dc-delhi-capitals-coach-hemang-badani-pre-match-press-conference-2721367-2025-05-08",
      "headline": "DC head coach praises 'Operation Sindoor' as India strikes Pakistan terror campsDelhi Capitals (DC) head coach Hemang Badani expressed his heartfelt support for the Indian Army during a pre-match press conference ahead of DC's IPL 2025 encounter against Punjab Kings (PBKS) on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-ajinkya-rahane-reaction-2721357-2025-05-08",
      "headline": "Rohit Sharma's Test retirement surprises Ajinkya Rahane: I will call himRohit Sharma's sudden Test retirement came as a shock to Ajinkya Rahane, his longtime teammate and friend. Speaking moments after KKR's loss to CSK on Wednesday, a visibly surprised Rahane learned of the news during the post-match press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-jasprit-bumrah-captain-shubman-gill-deputy-msk-prasad-2721353-2025-05-08",
      "headline": "Jasprit Bumrah should captain in England Tests, Shubman Gill his deputy: MSK PrasadIndia tour of England: Speaking to IndiaToday.in, former chairman of selectors MSK Prasad dismissed concerns over Jasprit Bumrah's fitness and urged the selection committee to appoint him captain for the England Tests. India are on the lookout for Rohit Sharma's successor after the 38-year-old retired from Test cricket on Wednesday, May 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-on-rohit-sharma-test-retirement-2721347-2025-05-08",
      "headline": "Who will not miss Rohit Sharma? Virender Sehwag on star batter's Test retirement Virender Sehwag heaped praise on Rohit Sharma and said that everyone will miss having the star batter in the squad after he announced his Test retirement on Wednesday, May 7. Sehwag feels that Rohit will have no regrets about making the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-playoff-qualification-scenario-explained-2721342-2025-05-08",
      "headline": "IPL 2025: Can KKR make it to the playoffs despite heartbreaking CSK loss?KKR's title defence took a massive hit after their heartbreaking loss to CSK at the Eden Gardens on Wednesday, May 7. However, the three-time champions can still make it to the playoffs, but will need help from others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-head-coach-hemang-badani-comments-on-uncertainty-around-pbks-game-2721271-2025-05-08",
      "headline": "DC head coach on uncertainty around Delhi vs Punjab game: Have full faith in BCCIDelhi Capitals (DC) head coach Hemang Badani opened up on the uncertainty around their upcoming game against Punjab Kings in Dharamsala and put his faith in BCCI to take the right call. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}