{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-july-usd-24-billion-lg-hdb-reason-bse-nse-trading-upcoming-public-listings-2749017-2025-07-01",
      "headline": "July turns hot for IPOs as firms race to raise $2.4 billionFirms are gearing up to raise around $2.4 billion through initial public offerings (IPOs) in July. If this target is reached, it will mark the strongest IPO month since December 2023, following a solid $2 billion raised in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-blog-digital-india-10-years-linkedin-people-movement-2748806-2025-07-01",
      "headline": "Digital India turns 10, PM Modi says it's become a people's movementIn the blog titled 'A Decade of Digital India', on LinkedIn, PM Modi said the Digital India initiative is no longer just a government programme but a 'people's movement.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-forbes-list-2025-new-york-mumbai-billionaires-top-10-cities-wealth-ultra-rich-mukesh-ambani-2748773-2025-07-01",
      "headline": "New York tops billionaire list. Which Indian city made it to the top 10?Globally, nearly a quarter of the world's 3,028 billionaires live in just 10 cities across six countries. These cities continue to attract wealth due to strong business ecosystems, investor-friendly policies, and thriving industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25500-asian-paints-up-2-percent-2748711-2025-07-01",
      "headline": "Sensex opens flat, Nifty above 25,500; Asian Paints up 2%The S&P BSE Sensex was up 186.04 points to 83,792.50, while the NSE Nifty50 added 56.35 points to 25,573.40 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-70-years-when-start-why-year-history-customer-share-price-imperial-bank-of-calcutta-2748710-2025-07-01",
      "headline": "SBI turns 70: Why bank's blue keyhole has stood the test of timeAfter independence, under the first 5-year plan's push for rural development, the government nationalised the Imperial Bank. On July 1, 1955, the State Bank of India was born under the State Bank of India Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/look-rich-or-be-rich-startup-founder-on-middle-class-dilemma-2748370-2025-06-30",
      "headline": "Look rich or be rich: Startup founder on middle class dilemmaToday, many people in the middle class are busy trying to look rich, rather than actually becoming rich. Costly gadgets, fancy brunches and trendy holidays are often paid for with loans and EMIs, says founder and CEO, Shyam Achuthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8-years-of-gst-top-5-achievements-you-should-know-2748325-2025-06-30",
      "headline": "8 years of GST: Top 5 achievements you should knowSince its launch, GST has strengthened India's revenue and expanded the taxpayer base, with collections reaching a record Rs 22.08 lakh crore in 2024–25, as per PIB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gautam-adani-celebrates-three-birthdays-every-year-2748051-2025-06-29",
      "headline": "Why Gautam Adani celebrates three birthdays every yearBaffling as it may seem, apart from the day he was born, Adani celebrates two other dates. They are dates when he actually snatched life from the jaws of death. These were times when he repeatedly stared down the abyss and emerged unscathed, yet profoundly transformed. Here then is the story of Adani's three birthdays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-paints-to-acquire-majority-stake-in-akzo-nobel-india-2746932-2025-06-27",
      "headline": "JSW Paints to acquire majority stake in Akzo Nobel IndiaWith this move, JSW Paints will take sole control of Akzo Nobel India, which operates under the Dulux brand, and emerge as the fourth-largest player in the decorative paints segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-140-points-higher-nifty-above-25600-it-stocks-gain-2746923-2025-06-27",
      "headline": "Sensex, Nifty open higher for 4th straight session as global cues aid momentumThe BSE Sensex opened with a gain of over 140 points and was trading 89.06 points higher at 83,844.93 around 9:22 am. The NSE Nifty50 breached the 25,600-mark at the open before paring some gains to trade 25.35 points up at 25,574.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-job-portals-careerbuilder-monster-file-for-bankruptcy-2746877-2025-06-27",
      "headline": "Once-dominant online job boards CareerBuilder, Monster go bankruptCreated through the September merger of CareerBuilder and Monster, the Chicago-based company said it agreed to sell its job board operations, its most recognisable business, to JobGet, which has an app for so-called gig workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-announces-full-group-album-release-in-spring-2026-and-global-world-tour-plans-after-completing-military-service-recording-to-begin-in-the-united-states-this-july-2749114-2025-07-01",
      "headline": "BTS announces 2026 comeback album and world tour on Weverse live with all 7 membersBTS members revealed exciting plans during a Weverse live broadcast, confirming their first full group album in four years and a global world tour starting next spring. Recording will begin in the United States from July as the group reunites after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-recalls-being-shunned-at-school-after-father-boney-married-sridevi-2749113-2025-07-01",
      "headline": "Anshula Kapoor recalls being shunned at school after father Boney married SrideviSocial media influencer Anshula Kapoor shared that she was cornered by her classmates after her father, Boney Kapoor, married Sridevi. She said divorces were not common back in the 90s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-admitted-she-is-pro-botox-everybody-wants-to-look-good-2749118-2025-07-01",
      "headline": "When Shefali Jariwala admitted she is pro Botox: Everybody wants to look goodBefore her sudden death, Shefali Jariwala had said she supports Botox and skin treatments to look good. An old interview where she spoke about fitness, beauty, and self-care is now going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-ex-wife-seema-sajdeh-london-family-holiday-co-parenting-2749083-2025-07-01",
      "headline": "Sohail Khan, ex-wife Seema Sajdeh enjoy London holiday with sonsSohail Khan and ex-wife Seema Sajdeh reunited in London for a family holiday with their sons. Despite their divorce, they continue to co-parent, bringing the family together for special occasions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dilip-joshi-to-quit-taarak-mehta-ka-ooltah-chashmah-creator-clarifies-2749098-2025-07-01",
      "headline": "Dilip Joshi to quit Taarak Mehta Ka Ooltah Chashmah? Creator clarifiesAmid strong speculation about Dilip Joshi's exit from Taarak Mehta Ka Ooltah Chashmah, the show's creator Asit Kumarr Modi, has addressed the rumours and shared his perspective.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-calls-horror-emotionally-draining-says-she-misunderstood-the-genre-before-maa-2749092-2025-07-01",
      "headline": "Kajol calls horror emotionally draining, says she misunderstood the genre before MaaKajol, who stars in her first horror film 'Maa', shared she isn't a fan of the genre and will watch the movie only for professional reasons. She described the experience as emotionally draining and admitted horror required a completely different acting approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-reunite-sasural-simar-ka-shweta-sinha-snehal-sahay-2749021-2025-07-01",
      "headline": "Dipika Kakar-Shoaib Ibrahim reunite with Sasural Simar Ka co-starsActor Dipika Kakar, who recently underwent surgery for a liver tumour, reunited with her 'Sasural Simar Ka' co-stars Shweta Sinha and Snehal Sahay during her recovery. The emotional reunion  brought back fond memories, and the friends even planned a future trip together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cid-hrishikesh-pandey-talks-about-career-struggles-says-success-is-about-timing-2749037-2025-07-01",
      "headline": "CID actor Hrishikesh Pandey on career struggles: Success is all about timing'CID' actor Hrishikesh Pandey discussed the importance of timing in the entertainment industry. He shared his insights on the importance of being at the right place and at the right time. The actor also noted that the role of competition and character choice are very important in acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pati-patni-aur-woh-2-sara-ali-khan-wamiqa-gabbi-ayushmann-khurrana-sequel-2749036-2025-07-01",
      "headline": "Ayushmann Khurrana, Sara Ali Khan, Wamiqa Gabbi in Pati Patni Aur Woh 2: ReportsAyushmann Khurrana has reportedly replaced Kartik Aaryan in 'Pati Patni Aur Woh 2'. He will be joined by Sara Ali Khan and Wamiqa Gabbi in the lead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-shankar-no-call-game-changer-failure-producer-sirish-dil-raju-2749044-2025-07-01",
      "headline": "Game Changer producer says Ram Charan, Shankar didn't call him after film's failureMore than six months after its release, 'Game Changer' is back in conversation as producer Sirish revealed that neither Ram Charan nor director Shankar reached out following the film's box office failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maalik-trailer-rajkummar-rao-turns-cold-blooded-gangster-actioner-2748992-2025-07-01",
      "headline": "Maalik trailer: Rajkummar Rao turns cold-blooded gangster in actionerActor Rajkummar Rao will be back on the big screen with his upcoming film 'Maalik.' The trailer of the actioner was unveiled by the makers on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-rajinikanth-reaction-chikitu-song-from-coolie-we-can-tell-he-enjoyed-2749038-2025-07-01",
      "headline": "Anirudh on Rajinikanth's reaction to Chikitu song from Coolie: We can tell he enjoyedRajinikanth's 'Coolie' is one of the most anticipated Indian films of the year, and the buzz around its recently released song, 'Chikitu', composed by Anirudh Ravichander is proof of that. The composer recently revealed what Rajinikanth's reaction was after listening to the song."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-damaged-me-financially-says-producer-dil-raju-2749010-2025-07-01",
      "headline": "Ram Charan's Game Changer damaged me financially, says producer Dil RajuProducer Dil Raju, in a recent interview, admitted that he had anticipated the financial setback of Game Changer. While the Ram Charan-starrer fell short of expectations, Raju expressed confidence that Sankranthiki Vasthunnam would help offset the losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jimin-and-jungkook-return-are-you-sure-season-2-confirms-bts-agency-2749012-2025-07-01",
      "headline": "BTS' Jimin and Jungkook return for Are You Sure Season 2: ReportsAs per reports, BTS members Jimin and Jungkook are returninf=g with the second season of 'Are You Sure'. The filming of the season has already been done."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-was-disappointed-with-ajiths-role-in-asoka-heres-why-2749034-2025-07-01",
      "headline": "Exclusive: Vishnu Manchu was disappointed with Ajith's role in Asoka. Here's whyActor Vishnu Manchu shared his eagerness to step into Hindi cinema but emphasised that he is waiting for a role that genuinely excites him. He also recalled feeling disappointed by Ajith Kumar's \"small\" role in Shah Rukh Khan's 'Asoka'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-arjun-rampal-on-rana-naidu-2-embracing-grey-roles-real-life-influences-2745712-2025-07-01",
      "headline": "Exclusive: Arjun Rampal on Rana Naidu 2, embracing grey roles, real-life influencesActor Arjun Rampal, in an interview with IndiaToday.in, shared his experience of working on 'Rana Naidu 2'. He also spoke about drawing inspiration from real-life stories and depicting the truth in films based on historical events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/selena-gomez-returns-alex-russo-wizards-beyond-wavery-place-season-2-reboot-2748980-2025-07-01",
      "headline": "Wizards Beyond Wavery Place 2: Selena Gomez returns as Alex Russo in rebootSelena Gomez has confirmed joining 'Wizards Beyond Waverly Place' Season 2. She will be seen playing Alex Russo in the reboot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-veer-mehra-begins-shoot-for-silaa-omung-kumar-directs-antagonist-role-2748927-2025-07-01",
      "headline": "Karan Veer Mehra starts shooting for Silaa, Chum Darang cheers him onActor Karan Veer Mehra has started filming for 'Silaa' alongside director Omung Kumar. He shared the mahurat shot with cast members, supported by Chum Darang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-ajay-devgn-neeru-bajwa-bring-patiala-swag-in-films-title-track-2749016-2025-07-01",
      "headline": "Son of Sardaar 2: Ajay Devgn, Neeru Bajwa bring Patiala swag in film's title trackThe title track of 'Son of Sardaar 2' has been released, bringing vibrant Punjabi energy and a fresh twist to the much-anticipated sequel. Featuring Ajay Devgn's return as Jassi and a star-studded cast, the film promises a blend of fun, chaos, and desi charm, set to hit theatres on July 25."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-hit-deadlock-over-agriculture-centre-wont-concede-on-dairy-sources-2749067-2025-07-01",
      "headline": "India-US trade deal talks deadlocked as government stands firm on 'red line'According to top government sources, India has refused to budge on dairy, a sector employing over 80 million people in India, many of them smallholder farmers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-on-elon-musk-deportation-from-us-will-have-to-look-into-it-2749077-2025-07-01",
      "headline": "After head back to South Africa jibe, Trump 'looking into' deporting Elon MuskDonald Trump's comment came shortly after he launched a scathing attack on Elon Musk over government subsidies and the electric vehicle mandate. In a post on Truth Social, Trump claimed that Musk \"may have to close up shop and head back home to South Africa\", arguing that the billionaire had received \"more subsidies than any human being in history\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-gangrape-case-arrest-lifts-lid-on-kolkata-gangrape-accused-monojit-mishras-decade-long-crime-spree-2749124-2025-07-01",
      "headline": "Arrest lifts lid on Kolkata gangrape accused's decade-long crime spreeMonojit Mishra, a 31-year-old Trinamool Congress Chhatra Parishad (TMCP) leader, was arrested on June 28 along with two others for allegedly raping the woman inside a college guard room, a day after she filed a police complaint. A medical report confirmed signs of forced penetration, bite marks, and scratch injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-alexander-zverev-coco-gauff-mirra-andreeva-2749216-2025-07-02",
      "headline": "Zverev, Gauff make shock R1 exit, Andreeva, Rybakina advanceWimbledon 2025: Alexander Zverev and Coco Gauff crashed out in the opening round after losing to Arthur Rinderknech and Dayana Yastremska respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-bihars-rs-100-crore-highway-an-obstacle-course-thanks-to-trees-in-middle-of-road-2748620-2025-07-01",
      "headline": "Bihar's Rs 100 crore highway an obstacle course, thanks to trees in middle of roadA Rs 100 crore national highway widening project between Jehanabad and Gaya has resulted in a bizarre, dangerous outcome: several massive trees are standing tall right in the middle of the freshly built four-lane highway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Highlights: French Open champion Coco Gauff knocked out in Round 1Wimbledon 2025 Day 2 Live Score: Alexander Zverev crashed out in the first round after losing to Arthur Rinderknech. Jessica Pegula made a shocking first-round exit after losing to Elisabetta Cocciaretto. Jannik Sinner has advanced to the second round after beating Luca Nardi in straight sets. Barbora Krejcikova beat Alexandra Eala and went through to the second round.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-give-and-take-needed-says-s-jaishankar-as-us-talks-up-trade-deal-progress-2749161-2025-07-01",
      "headline": "'Give and take' needed, says S Jaishankar as US talks up trade deal progressExternal Affairs Minister S Jaishankar on Monday said India and the United States were engaged in \"intricate\" trade negotiations and expressed hope that both sides would find a middle ground through mutual give and take to reach a successful outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/who-the-fork-are-you-zohran-mamdani-must-be-condemned-eating-with-hands-viral-video-2749000-2025-07-01",
      "headline": "Who the Fork Are You?Donald Trump's MAGA crazies have taken exception to Zohran Mamdani using his fingers to eat food. Primitive, they said. So, the author gives them a schooling -- and a scalding -- for knowing @&#t about eating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-bill-proposes-500-percent-tariff-on-india-china-over-russia-business-ties-senator-lindsey-graham-2749133-2025-07-01",
      "headline": "US bill proposes 500% tariff on India, China over Russia business tiesA proposed US bill backed by President Donald Trump could slap massive tariffs on nations buying Russian oil. The move aims to isolate Moscow and bring it to the table for peace talks on Ukraine, but risks diplomatic and economic fallout with key partners, including India and China, even as New Delhi is in the midst of negotiating a trade deal with Washington."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/senior-counsel-sips-from-beer-mug-during-gujarat-high-court-virtual-hearing-contempt-action-2749192-2025-07-02",
      "headline": "Gujarat lawyer sips from beer mug during virtual hearing, faces contempt actionThe bench stated that Bhaskar Tanna's senior counsel title should be withdrawn after he was seen sipping from a beer mug and talking on the phone while virtually attending a hearing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-calcutta-high-court-alimony-rs-4-lakh-monthly-estranged-wife-hasin-jahan-2749156-2025-07-01",
      "headline": "Setback for Mohammed Shami as court orders Rs 4 lakh alimony to ex-wifeThe Calcutta High Court has ordered Indian pacer Mohammed Shami to pay Rs 4 lakh every month to his estranged wife, Hasin Jahan, and their daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-raj-thackeray-party-workers-thrash-shopkeeper-for-refusing-to-speak-marathi-2749193-2025-07-02",
      "headline": "Video: Raj Thackeray party workers thrash shopkeeper for refusing to speak MarathiA video has surfaced online, showing MNS workers abusing and assaulting a shopkeeper in Maharashtra over his reluctance to speak Marathi. The MNS workers were celebrating the Mahayuti government's decision to cancel the order mandating a three-language policy in schools. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/shefali-jariwala-death-top-aestheticians-explain-anti-ageing-fixation-among-celebs-2749117-2025-07-01",
      "headline": "Shefali Jariwala death: Top aestheticians explain anti-ageing fixation among celebsMumbai's top celebrity aestheticians shed light on the craze for anti-ageing and how one can avoid any kind of complications while undergoing these treatments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-big-beautiful-tax-spending-bill-clears-senate-jd-vance-tie-breaker-2749147-2025-07-01",
      "headline": "Trump's 'big beautiful' tax, spending bill clears Senate, JD Vance was tie-breakerVice President JD Vance broke a 50-50 tie to push it over the top. The three Republicans opposing the bill were Senators Thom Tillis of North Carolina, Susan Collins of Maine and Senator Rand Paul of Kentucky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-shafali-verma-record-womens-t20is-england-vs-india-2749189-2025-07-01",
      "headline": "Smriti Mandhana, Shafali Verma script history again in Women's T20IsENG-W vs IND-W: Smriti Mandhana and Shafali Verma set the record for most runs as a pair in Women's T20Is, going past the Australian duo of Beth Mooney and Alyssa Healy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-manas-ranjan-bhunia-trivialises-kolkata-rape-case-calls-it-small-incident-2749144-2025-07-01",
      "headline": "Bengal Minister calls Kolkata college gangrape 'small incident', then clarifiesManas Ranjan Bhunia further trivialised the heinous crime in which a Trinamool youth leader is the prime accused, saying \"incidents do take place\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-estee-lauders-homemade-creams-grew-into-an-international-luxury-brand-2749111-2025-07-01",
      "headline": "Estée Lauder began in a restaurant kitchen and built brands like MAC and CliniqueEstée Lauder was both the mother and the mother brand behind beauty giants like MAC, Clinique, and Tom Ford. Few know this global empire began in a restaurant kitchen in Queens -- driven by a woman who simply knew what women wanted, and ended as one of the richest self-made women in history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-high-court-hears-x-corp-plea-against-railways-takedown-notice-centre-says-officers-are-not-tom-dick-and-harry-2749129-2025-07-01",
      "headline": "Officers, not Tom, Dick and Harry: Karnataka High Court to X on Railways' noticeX Corp India moved the Karnataka High Court challenging a Railways notice to block a viral video, asking why every Tom, Dick and Harry officer sends notice. The Centre defended its officers, saying no social media intermediary can expect completely unregulated functioning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/act-committed-by-some-policemen-unforgivable-mk-stalin-transfers-tamil-nadu-custodial-death-case-to-cbi-2749109-2025-07-01",
      "headline": "Unforgivable act by policemen: MK Stalin transfers custodial death case to CBITamil Nadu Chief Minister MK Stalin announced the transfer of the Thiruppuvanam custodial death case to the CBI after confirming that police assault led to the youth's death. The Tamil Nadu government assured full cooperation with the CBI probe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shame-vivek-ramaswamy-hits-back-at-troll-targeting-zohran-mamdani-usha-vance-2749116-2025-07-01",
      "headline": "It's a shame: Vivek Ramaswamy slams troll targeting Zohran Mamdani, Usha VanceRepublican leader Vivek Ramaswamy denounced the \"race-obsessed fringe of the right\" after white supremacist Nick Fuentes grouped him with fellow Indian-origin figures Zohran Mamdani and Usha Vance in a xenophobic post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/british-influencer-miles-routledge-finds-airpods-in-jhelum-pakistan-a-year-after-losing-it-in-dubai-blames-indians-2748823-2025-07-01",
      "headline": "Cow-worshipping Indians to blame: UK vlogger after finding stolen AirPods in PakBritish YouTuber Miles Routledge found his stolen AirPods in Pakistan a year after losing them in Dubai. However, he directed his outrage at India, criticising Indian culture after being told that an Indian man had stolen his AirPods and sold them to a Pakistani. Last year, Routledge had sparked controversy for racist posts targeting Indians and for joking about nuking India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/hindu-krishna-temple-utah-spanish-fork-attacked-thrice-gun-shot-attack-june-hate-crime-iskcon-reacts-2749042-2025-07-01",
      "headline": "Krishna temple in Utah attacked thrice with guns in June in alleged hate crimeA Hindu temple in Utah has been repeatedly shot at over several nights in June. Bullets hit key parts of the temple, including its dome and worship hall window. Authorities are investigating and are suspecting a hate crime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/narcotics-control-bureau-busts-darknet-cartel-ketamelon-seizes-drugs-worth-rs-35-lakh-cryptocurrency-2749132-2025-07-01",
      "headline": "India's darknet drug kingpin busted, drugs, Rs 1 crore in cryptocurrency seizedThe NCB recovered 1,127 blocks of lysergic acid diethylamide (LSD) and 131.66 grams of Ketamine contraband, apart from digital assets worth Rs 70 lakh. The anti-drug body also seized USDT cryptocurrency worth over Rs 1 crore."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-alexander-zverev-coco-gauff-mirra-andreeva-2749216-2025-07-02",
      "headline": "Zverev, Gauff make shock R1 exit, Andreeva, Rybakina advanceWimbledon 2025: Alexander Zverev and Coco Gauff crashed out in the opening round after losing to Arthur Rinderknech and Dayana Yastremska respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-bcci-asia-cup-schedule-2749213-2025-07-02",
      "headline": "ACC writes to BCCI to confirm schedule amid fears of revenue lossThe Asian Cricket Council (ACC) has urged the BCCI to swiftly finalise the Asia Cup schedule, highlighting mounting pressure from media rights partners and sponsors concerned about potential revenue setbacks due to delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/petra-kvitova-emma-navarro-wimbledon-farewell-defeat-2749195-2025-07-02",
      "headline": "Emotional Kvitova bids farewell to Wimbledon after heartbreaking defeatWimbledon 2025: Two-time champion Petra Kvitova bid goodbye to SW19 after losing to Emma Navarro of the United States in straight sets on Tuesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-shafali-verma-record-womens-t20is-england-vs-india-2749189-2025-07-01",
      "headline": "Smriti Mandhana, Shafali Verma script history again in Women's T20IsENG-W vs IND-W: Smriti Mandhana and Shafali Verma set the record for most runs as a pair in Women's T20Is, going past the Australian duo of Beth Mooney and Alyssa Healy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-indoors-after-suspicious-package-birmingham-2749178-2025-07-01",
      "headline": "Indian cricketers stay indoors after suspicious packet found in BirminghamThe Indian cricket team was asked to stay indoors following a suspicious package alert near their hotel in Birmingham. Authorities evacuated nearby buildings as a precaution before lifting the cordon an hour later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-record-england-women-vs-india-women-bristol-2749055-2025-07-01",
      "headline": "Smriti Mandhana joins Rohit Sharma in elite club with 150 T20IsENG-W vs IND-W: Smriti Mandhana became only the third Indian to play 150 T20Is when she stepped out for India's second T20I against England at the County Ground in Bristol. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-backs-two-spinners-strategy-england-second-test-birmingham-2749160-2025-07-01",
      "headline": "Shubman Gill backs two-spinner theory for 2nd Test: Unusual but it worksIndia Test skipper Shubman Gill has said that while it is unusual to play two spinners at Edgbaston, the typical English weather has been absent this summer. With the country experiencing exceptionally dry conditions, the pitch might favour the inclusion of two spinners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-calcutta-high-court-alimony-rs-4-lakh-monthly-estranged-wife-hasin-jahan-2749156-2025-07-01",
      "headline": "Setback for Mohammed Shami as court orders Rs 4 lakh alimony to ex-wifeThe Calcutta High Court has ordered Indian pacer Mohammed Shami to pay Rs 4 lakh every month to his estranged wife, Hasin Jahan, and their daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/barbora-krejcikova-alexandra-eala-wimbledon-round-1-2749154-2025-07-01",
      "headline": "What the hell: Barbora Krejcikova in awe of Alexandra Eala after R1 scareWimbledon 2025: Defending champion Barbora Krejcikova worked hard against Alexandra Eala before winning the first-round match 3-6, 6-2, 6-1 on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/katerina-siniakova-qinwen-zheng-barbora-krejcikova-jannik-sinner-wimbledon-2749140-2025-07-01",
      "headline": "Siniakova stuns Zheng, Krejcikova survives scare, Sinner dominates NardiWimbledon: Doubles World No.1 Katerina Siniakova stormed into the second round after beating Qinwen Zheng. Barbora Krejcikova and Jannik Sinner also won their respective Round 1 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-backs-two-spinners-strategy-england-second-test-birmingham-2749160-2025-07-01",
      "headline": "Shubman Gill backs two-spinner theory for 2nd Test: Unusual but it worksIndia Test skipper Shubman Gill has said that while it is unusual to play two spinners at Edgbaston, the typical English weather has been absent this summer. With the country experiencing exceptionally dry conditions, the pitch might favour the inclusion of two spinners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-calcutta-high-court-alimony-rs-4-lakh-monthly-estranged-wife-hasin-jahan-2749156-2025-07-01",
      "headline": "Setback for Mohammed Shami as court orders Rs 4 lakh alimony to ex-wifeThe Calcutta High Court has ordered Indian pacer Mohammed Shami to pay Rs 4 lakh every month to his estranged wife, Hasin Jahan, and their daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/barbora-krejcikova-alexandra-eala-wimbledon-round-1-2749154-2025-07-01",
      "headline": "What the hell: Barbora Krejcikova in awe of Alexandra Eala after R1 scareWimbledon 2025: Defending champion Barbora Krejcikova worked hard against Alexandra Eala before winning the first-round match 3-6, 6-2, 6-1 on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/katerina-siniakova-qinwen-zheng-barbora-krejcikova-jannik-sinner-wimbledon-2749140-2025-07-01",
      "headline": "Siniakova stuns Zheng, Krejcikova survives scare, Sinner dominates NardiWimbledon: Doubles World No.1 Katerina Siniakova stormed into the second round after beating Qinwen Zheng. Barbora Krejcikova and Jannik Sinner also won their respective Round 1 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-edgbaston-predicted-playing-xi-shubman-gill-2749122-2025-07-01",
      "headline": "2nd Test, Predicted Playing XI: Arshdeep-Kuldeep in, Shardul out?India face huge selections calls ahead of the 2nd Test match at Edgbaston. Shubman Gill has already confirmed that the team will play 2 spinners, which will have big impact on the combination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-viktor-axelsen-prakash-padukone-academy-vimal-kumar-2749120-2025-07-01",
      "headline": "Tall, fierce and focused: Ayush Shetty reminds Viktor Axelsen of his younger self20-year-old Ayush Shetty, standing tall at 6-foot-4, won the US Open in June, claiming his first senior title. The boy from Mangalore once reminded Danish great Viktor Axelsen of his younger self. Vimal Kumar of the Prakash Padukone Badminton Academy reflects on Ayush's journey: from backyard rallies in Mangalore to breaking into the world's top 35 in men's singles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-2nd-test-shubman-gill-tail-lack-of-runs-2749103-2025-07-01",
      "headline": "Gill urges batters to take more responsibility amidst lower-order strugglesIndia captain Shubman Gill has called for more responsibility from the top order amid lower order struggles in the Test series. Nitish Reddy might be included in the playing XI to beef up the Indian lower order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-zimbabwe-1st-test-corbin-bosch-all-round-performance-2749101-2025-07-01",
      "headline": "Bosch's all-round brilliance leads South Africa to 328-run win over ZimbabweSouth Africa thrashed Zimbabwe by a commanding 328 runs in the first Test at Queens Sports Club, with all-rounder Corbin Bosch delivering a standout performance, claiming his maiden five-wicket haul to go along with a century in the first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-press-conference-england-vs-india-2nd-test-2749095-2025-07-01",
      "headline": "Gill breaks silence on Bumrah's availability for 2nd Test vs EnglandENG vs IND: Shubman Gill said that Jasprit Bumrah is available for the second Test, but mentioned that a call on his selection will be taken on the eve of the match. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-r-ashwin-kuldeep-yadav-india-playing-xi-2749090-2025-07-01",
      "headline": "Ashwin backs Kuldeep for Edgbaston Test to strengthen India's bowling attackFormer India spinner R Ashwin has said that the Indian team management must include left-arm wrist-spinner Kuldeep Yadav in the playing XI if they are to have any chance of doing well in the second Test at Edgbaston against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-daria-kasatkina-alex-de-minaur-wimbledon-results-2749081-2025-07-01",
      "headline": "Jessica Pegula stunned in Round 1, Kasatkina, De Minaur advanceWimbledon: Jessica Pegula faced a shock first-round exit after Elisabetta Cocciaretto defeated her in straight sets. Daria Kasatkina and Alex de Minaur defeated Emiliana Arango and Roberto Carballes Baena respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-jasprit-bumrah-press-conference-england-vs-india-2nd-test-2749095-2025-07-01",
      "headline": "Gill breaks silence on Bumrah's availability for 2nd Test vs EnglandENG vs IND: Shubman Gill said that Jasprit Bumrah is available for the second Test, but mentioned that a call on his selection will be taken on the eve of the match. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-r-ashwin-kuldeep-yadav-india-playing-xi-2749090-2025-07-01",
      "headline": "Ashwin backs Kuldeep for Edgbaston Test to strengthen India's bowling attackFormer India spinner R Ashwin has said that the Indian team management must include left-arm wrist-spinner Kuldeep Yadav in the playing XI if they are to have any chance of doing well in the second Test at Edgbaston against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-daria-kasatkina-alex-de-minaur-wimbledon-results-2749081-2025-07-01",
      "headline": "Jessica Pegula stunned in Round 1, Kasatkina, De Minaur advanceWimbledon: Jessica Pegula faced a shock first-round exit after Elisabetta Cocciaretto defeated her in straight sets. Daria Kasatkina and Alex de Minaur defeated Emiliana Arango and Roberto Carballes Baena respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-operation-sindoor-wcl-legends-match-2749066-2025-07-01",
      "headline": "India vs Pakistan on a cricket field for first time since Operation SindoorIndia and Pakistan veterans are set to meet in an exhibition match at Edgbaston on July 20. The game is set to be played against the backdrop of recent tensions between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-trade-talks-sanju-samson-dhruv-jurel-ipl-sources-2749069-2025-07-01",
      "headline": "Rajasthan Royals get trade-off offers for six of its players: IPL sourcesRajasthan Royals might be revisiting their squad composition for the 2026 IPL, with at least six of their players attracting trade-off interest from various franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-unfazed-by-bumrah-availability-india-england-test-series-2024-2749041-2025-07-01",
      "headline": "Ben Stokes dismisses Bumrah factor; pleased with his bowling rhythmEngland captain Ben Stokes dismissed the talk about Jasprit Bumrah being available for only three of the five Tests as \"India's problem\" and said he expects the \"passionate\" visitors to put up a tough fight in the second Test, regardless of their team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andrew-flintoff-wwe-undertaker-wrestlemania-royal-rumble-appearance-2749040-2025-07-01",
      "headline": "Flintoff reveals how he nearly joined WWE, trained to face the UndertakerAndrew Flintoff revealed the surprising tale of how he almost ended up wrestling in the WWE. He even mentioned how he had pitches for a feud with the Undertaker and appearances for WrestleMania and Royal Rumble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-anderson-peters-ruled-out-2749026-2025-07-01",
      "headline": "Neeraj Chopra Classic: Former world champion pulls out due to injuryFormer world champion Anderson Peters has withdrawn from the Neeraj Chopra Classic due to injury. His absence reshapes the competition lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dangerous-player-ben-stokes-india-england-headingley-2749023-2025-07-01",
      "headline": "Rishabh Pant is very dangerous player, really enjoy watching him bat: Ben StokesEngland captain Ben Stokes praises Indian wicketkeeper-batter Rishabh Pant for his fearless batting and game-changing skills. Pant's twin centuries at Headingley and record-breaking performance have made him a key player in the ongoing Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-sumit-antil-sun-pharma-doctor-day-2749004-2025-07-01",
      "headline": "Neeraj Chopra invited me to NC Classic: Paralympic champion Sumit AntilNeeraj Chopra invited Paralympic gold medallist Sumit Antil to participate in his historic javelin event in Bengaluru, revealed the latter in an exclusive interview with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-icc-t20i-rankings-india-england-charani-2748977-2025-07-01",
      "headline": "ICC Player Rankings: Smriti Mandhana moves to third spot in T20IsIndia vice-captain Smriti Mandhana on Tuesday moved up one spot to be ranked third in the ICC rankings for batters in women's T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-gujarat-ioc-visit-2748950-2025-07-01",
      "headline": "Indian delegation visits Olympic headquarters in major push for 2036 hosting dreamsA high-level Indian delegation visited the IOC headquarters in Lausanne to advance the 2036 Olympic bid. The visit comes amid a pause in the host selection process, but India remains determined to host the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-giovanni-perricard-fastest-serve-record-taylor-fritz-2748934-2025-07-01",
      "headline": "Watch: French player smashes Wimbledon record with 246 kph serve vs FritzFrance's Giovanni Perricard created history in the opening day of Wimbledon 2025 as the 6' 8 in player smashed the record for the fastest serve in the tournament's history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Highlights: French Open champion Coco Gauff knocked out in Round 1Wimbledon 2025 Day 2 Live Score: Alexander Zverev crashed out in the first round after losing to Arthur Rinderknech. Jessica Pegula made a shocking first-round exit after losing to Elisabetta Cocciaretto. Jannik Sinner has advanced to the second round after beating Luca Nardi in straight sets. Barbora Krejcikova beat Alexandra Eala and went through to the second round.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-auction-rishabh-pant-digvesh-rathi-2748900-2025-07-01",
      "headline": "Rishabh Pant among 10 IPL players to feature in Delhi Premier League auctionDelhi Premier League auction is set to seem some of the biggest cricketing talent in the country. More than 10 IPL stars are going to participate in the auction including the likes of Rishabh Pant and Digvesh Rathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-simone-inzaghi-al-hilal-manchester-city-mount-everest-2748889-2025-07-01",
      "headline": "Climbed Mount Everest: Inzaghi on Al-Hilal's win vs Manchester CitySimone Inzaghi compared their victory over Manchester City to climbing Mount Everest without oxygen. Such was the victory for the Saudi-based side against the Premier League giants in Manchester City. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}