{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-rupee-value-not-falling-us-dollar-rbi-2673597-2025-02-02",
      "headline": "Rupee not falling against any currency other than US dollar: Nirmala SitharamanFinance Minister Nirmala Sitharaman rejected criticism of the rupee's decline, stating it remains stable against most currencies despite a stronger US dollar. She attributed volatility to global factors and highlighted India's strong macroeconomic fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pazhampori-parippu-vada-ada-malayali-tea-stall-snacks-18-percent-gst-rate-2673379-2025-02-02",
      "headline": "Gone bananas! Most Kerala tea-time snacks come under 18% GST From 'pazhampori' to 'ada' and 'undam pori,' beloved Malayali tea-time snacks find themselves caught in the bewildering GST maze. These humble delicacies come with an 18 per cent GST tag, all because they do not have the required 'classification' to be put elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/harley-davidson-import-duty-tax-price-drop-union-budget-imported-bikes-2673462-2025-02-02",
      "headline": "Harley-Davidson bikes to get cheaper as Centre cuts tariff amid Trump threatDonald Trump has consistently pushed for reducing trade barriers, especially on products that the US manufactures, and the high tariff on Harley-Davidson has been a point of contention in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-increased-tds-limit-rs-50000-to-rs-100000-exemption-for-nss-big-relief-for-senior-citizens-2673279-2025-02-01",
      "headline": "Increased TDS limit, exemption for NSS: Big relief for senior citizens Budget 2025 announced major tax reforms for senior citizens, reducing their tax burden and giving a boost to their savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-budget-2025-consumption-growth-investment-savings-investment-praises-tax-relief-nirmala-sitharaman-2673294-2025-02-01",
      "headline": "Will boost savings, investment, consumption, growth: PM on BudgetPrime Minister Narendra Modi praised the Union Budget 2025, calling it a \"force multiplier\" that will boost savings, investment, consumption, and growth. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-tds-reforms-announced-and-limit-for-senior-citizens-doubled-2673246-2025-02-01",
      "headline": "TDS reforms announced, limit for senior citizens doubledBudget 2025: Finance Minister Nirmala Sitharaman announced an increase in the TDS threshold in the Union Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-congratulates-nirmala-sitharaman-finance-minister-everybody-praising-budget-2025-very-good-2673247-2025-02-01",
      "headline": "Everyone's praising you, Budget is very good: PM praises Nirmala SitharamanThe Prime Minister walked up to the bench where Nirmala Sitharaman was seated and expressed his gratitude for presenting her eighth and the Modi 3.0 government's first Budget today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-no-income-tax-payable-up-to-rs-12-lakh-says-nirmala-sitharaman-2673235-2025-02-01",
      "headline": "No tax payable up to Rs 12 lakh income: Budget bonanza for middle classFinance Minister Nirmala Sitharaman announced that taxpayers with salaries up to Rs 12 lakh would not be required to pay tax in the new tax regime. Sitharaman also proposed changes in the slab structure of the new income tax regime. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-budget-2025-2026-new-income-tax-bill-next-week-unveil-finance-minister-2673216-2025-02-01",
      "headline": "New Income Tax Bill next week, will focus on easing taxpayer convenience: Finance MinisterFinance Minister Nirmala Sitharaman to unveil new Income Tax Bill next week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-government-to-prioritise-msmes-2673205-2025-02-01",
      "headline": "Boost for MSMEs, classification investment cap to be hiked 2.5 times The Indian government would strengthen the country's MSME sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-budget-2025-2026-income-tax-middle-class-spending-power-2673191-2025-02-01",
      "headline": "Middle class hero with massive tax relief, Bihar big beneficiaryFinance Minister Nirmala Sitharaman announced big reforms focused on income tax relief for the middle class in addition to major reforms in agriculture, with Bihar in focus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-common-man-farmers-women-youth-union-budget-2025-to-2026-cabinet-meeting-aspirations-2673189-2025-02-01",
      "headline": "Budget for common man, says PM Modi at Cabinet meet: SourcesBudget 2025-2026 is likely to provide a much-needed boost to the middle class amid high inflation with the nation's GDP growth projected to slow down to a four-year low of 6.4 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-stock-market-investors-get-tax-relief-tax-long-term-capital-gains-tax-short-term-capital-gains-tax-ltcg-2673167-2025-02-01",
      "headline": "Will stock market investors get tax relief from this budget?Capital gains tax and stock market investors: Experts anticipate that Budget 2025 should not announce new taxes, instead, provide tax rebates to boost the consumption levels and revive market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/stock-market-opening-bell-budget-day-jitters-sensex-nifty-open-flat-as-investors-await-key-announcements-2673163-2025-02-01",
      "headline": "Sensex gains over 300 points, Nifty goes past 23,600  Live UpdatesStock market today: The S&P BSE Sensex was up by 278.80 points to 77,779.37, while the NSE Nifty50 gained 81.80 points to 23,590.20 as of 11:29 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-use-this-income-tax-calculator-to-check-your-tax-outgo-calculate-your-tax-2673160-2025-02-01",
      "headline": "Use this income tax calculator to check your tax outgo under both regimesCalculate income tax online: Experts suggest that 'Modi 3.0' may introduce measures to make the new income tax regime more appealing to taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-cylinder-prices-cut-slashed-reduced-19-kg-rs-7-ahead-of-union-budget-2025-to-2026-2673144-2025-02-01",
      "headline": "Commercial LPG cylinder rates slashed by Rs 7 ahead of Union BudgetThe rate of 19 kg commercial LPG cylinders has been reduced by Rs 7 ahead of the Union Budget 2025-26. A commercial LPG cylinder will now be available in Delhi for Rs 1,797."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-is-stock-market-open-for-trading-today-nse-bse-timing-sensex-nifty-2673143-2025-02-01",
      "headline": "Budget 2025: Is stock market open for trading today?Stock market today: The Budget is one of the most important events for the stock market, with policy changes and fiscal measures often leading to sharp movements in stock prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/economic-survey-shares-india-path-for-viksit-bharat-2047-2672975-2025-01-31",
      "headline": "India must grow at 8% for at least 10 years for 'Viksit Bharat': Economic SurveyThe Indian economy is expected to grow between 6.3% to 6.8% in FY26, according to the Economic Survey. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-why-can-middle-class-expect-relief-tomorrow-change-sin-tax-structure-increase-in-basic-exemption-level-women-centric-schemes-pradhan-mantri-awas-yojna-2672909-2025-01-31",
      "headline": "Why middle class can expect tax relief todayUnion Budget 2025 Expectations: The government is likely to roll out schemes that focus on offering economic and tax relief to the middle class, poor and women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-gain-bull-run-ride-consumer-goods-wave-ahead-of-budget-2025-economic-survey-2672896-2025-01-31",
      "headline": "Sensex, Nifty rally as markets ride consumer goods wave ahead of BudgetSensex Nifty rise ahead of Budget 2025: The S&P BSE Sensex surged 740.76 points to end at 77,500.57, while the NSE Nifty50 gained 258.90 points to close at 23,508.40."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/67th-grammys-full-winners-list-2025-2673751-2025-02-03",
      "headline": "Grammys winners list: Beyonce wins Best Country, Sabrina takes home Best Pop AlbumThe 2025 Grammy Awards is taking place at Crypto.com Arena at Los Angeles. Beyonce is leading the nominees with 11 nods for her acclaimed album Cowboy Carter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-wife-bianca-censori-escorted-out-of-grammys-report-2673745-2025-02-03",
      "headline": "Rapper Kanye West, wife Bianca Censori escorted out of Grammys: ReportAccording to reports, Rapper Kanye West and wife Bianca Censori arrived at the Grammys 2025 uninvited and were soon escorted out by security. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/grammys-2025-red-carpet-sabrina-carpenter-a-vision-in-blue-jaden-smith-castle-headpiece-2673744-2025-02-03",
      "headline": "Grammys red carpet: Taylor Swift is a vision in red, Sabrina stuns in baby blueThe 2025 Grammys are officially underway, with stars gracing the red carpet in their most glamorous looks yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/former-us-president-jimmy-carter-wins-posthumous-grammy-for-best-audiobook-2673742-2025-02-03",
      "headline": "Former US President Jimmy Carter wins posthumous Grammy for Best AudiobookFormer US President Jimmy Carter won posthumous Grammy for narrating an audiobook of his Sunday school lessons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-awards-2025-live-updates-sabrina-carpenter-taylor-swift-2673741-2025-02-03",
      "headline": "Grammys 2025: Beyonce wins Best Country Album67th Annual Grammy Awards live updates: The Grammy Awards have kickstarted in Los Angeles. Singer Beyonce is leading the race with the highest number of nominations (11). The awards ceremony is being hosted by TV personality and writer Trevor Noah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-2-actor-lee-joo-shil-dies-at-80-south-korean-veteran-actor-2673686-2025-02-02",
      "headline": "Squid Game 2 actor Lee Joo-shil dies at 80Beloved South Korean actor Lee Joo-shil has died at 80 after a brief battle with stomach cancer. She was most recently seen in Squid Game 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-malik-on-opening-for-fav-human-ed-sheeran-mathematics-tour-hyderabad-2673672-2025-02-02",
      "headline": "Armaan Malik on opening for 'fav human' Ed Sheeran: Had to pull up a special setSinger Armaan Malik is set to perform as the opening act for Ed Sheeran's concert in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ricky-kej-to-anoushka-shankar-indian-origin-artistes-nominated-for-grammys-2025-2673602-2025-02-02",
      "headline": "Ricky Kej to Anoushka Shankar: Meet Indian origin artistes nominated for Grammys 2025Several Indian musicians and artists of Indian origin have been nominated for the 2025 Grammy Awards. This includes seasoned winners like Ricky Kej and Anoushka Shankar, alongside newcomers such as Varijashree Venugopal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/old-clips-of-udit-narayan-kissing-alka-yagnik-shreya-ghoshal-go-viral-amid-backlash-stmp-2673604-2025-02-02",
      "headline": "Old clips of Udit Narayan kissing Alka Yagnik, Shreya Ghoshal go viral amid backlashVeteran singer Udit Narayan is under fire after videos of him kissing female fans at events surfaced online. Amid the backlash, old clips of him kissing Alka Yagnik and Shreya Ghoshal are going viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/raghav-chadha-jams-with-mika-singh-on-something-something-at-delhi-rally-2673598-2025-02-02",
      "headline": "Raghav Chadha jams with Mika Singh on Something Something at Delhi rallyAAP leader Raghav Chadha was seen jamming with singer Mika Singh during a political rally in Delhi. The duo performed a popular track amid the ongoing election campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/millind-gaba-wife-pria-beniwal-announce-pregnancy-2673552-2025-02-02",
      "headline": "Singer Millind Gaba, wife Pria Beniwal announce pregnancy: Our hearts are fullSinger Millind Gaba and his wife Pria Beniwal are expecting their first child. They got married in 2022. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflixs-the-sandman-cancelled-after-two-seasons-neil-gaiman-sexual-harassment-2673415-2025-02-01",
      "headline": "Netflix's The Sandman cancelled, to end with Season 2The production of The Sandman has been cancelled following sexual harassment allegations against creator Neil Gaiman. Despite this, Netflix will still release season two in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-shark-tank-kunal-bahl-on-pricing-differences-in-android-ios-2673400-2025-02-01",
      "headline": "Shark Tank's Kunal Bahl reflects on pricing differences between iPhone, AndroidIn an exclusive chat, Kunal Bahl addressed the ongoing debate about app pricing differences on Android and iOS. He also shared insights on the impact of online shopping in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tillotama-shome-on-misrepresentation-and-underrepresentation-of-northeast-india-exclusive-2673378-2025-02-01",
      "headline": "Tillotama Shome on 'misrepresentation, under-representation' of Northeast IndiaActor Tillotama Shome spoke to India Today in an exclusive interview about playing Meghna Barua in Paatal Lok 2. The actor talked about how Indian cinema 'misrepresents' and 'under-represents' Northeast India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cult-of-fear-asaram-bapu-review-a-fair-look-at-rise-and-fall-of-indias-notorious-godman-2673269-2025-02-01",
      "headline": "Cult of Fear – Asaram Bapu review: A fair look at rise and fall of notorious GodmanReleased-Wed Jan 29, 2025In Cult of Fear-Asaram Bapu, you see the testimonies of Bapu's followers, the victims of his cult, journalists and researchers trying to explain how he did what he did. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/udit-narayan-reacts-to-controversy-over-kissing-female-fans-on-lips-2673228-2025-02-01",
      "headline": "Singer Udit Narayan on controversy over kissing female fans: Hum decent log haiVideos of singer Udit Narayan kissing female fans on the lips during a live performance went viral. Now, the singer has addressed the controversy and called it fans' 'deewangi', and said it shouldn't be given so much attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/raftaar-manraj-jawanda-stunning-pics-from-sikh-and-south-indian-wedding-ceremonies-2673222-2025-02-01",
      "headline": "Stunning pics from Raftaar-Manraj's Sikh and South Indian wedding ceremoniesRapper Raftaar married fashion stylist Manraj Jawanda in a dual wedding ceremony recently. The two shared a few dreamy pictures from their two weddings on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-khushi-kapoor-ready-for-nadaaniyan-in-his-debut-netflix-film-check-1st-poster-2673203-2025-02-01",
      "headline": "Ibrahim Ali Khan-Khushi Kapoor ready for 'Nadaaniyan' in his debut Netflix filmIbrahim Ali Khan announced his debut film, titled Nadaaniyan, with Khushi Kapoor on Saturday. It's a Netflix film directed by Shauna Gautam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-dakota-johnson-new-video-from-maha-kumbh-2025-goes-viral-as-couple-takes-holy-dip-at-sangam-2673193-2025-02-01",
      "headline": "Chris Martin's new video from Maha Kumbh goes viral as he takes holy dip at SangamColdplay's Chris Martin and Dakota Johnson were seen taking a holy dip at the Sangam in Maha Kumbh 2025 in a new video shared by a fan on Instagram. At one point, Chris also folded his hands and greeted the fellow devotees at the Sangam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pataal-lok-2-bandish-bandits-2-yeh-kaali-kaali-ankhein-2-squid-game-2-the-art-if-making-successful-sequel-tanya-bami-nikhil-madhok-2673036-2025-02-01",
      "headline": "Paatal Lok 2 to Yeh Kaali Kaali Ankhein 2: The art of making successful sequelOTT platforms are capitalising on the growing demand for sequels as audiences crave familiar characters and stories amid rapid global changes. Netflix India's Tanya Bami and Prime Video India's Nikhil Madhok decode how they green-light a sequel in this week's Cinematic Saturday."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-absolutely-impose-tariffs-european-union-treated-us-so-badly-2673753-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump hints at imposing tariffs on European Union: Treated us so terriblyDuring his first stint in the White House in 2018, Donald Trump imposed tariffs on European steel and aluminium exports, sparking a trade war with the 27-nation bloc, which retaliated with tit-for-tat tariffs on American goods including whiskey and motorcycles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/2-indian-students-dead-car-crash-ireland-2-injured-2673750-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 Indian students killed, 2 injured in Ireland car crash, Irish PM 'shocked'Two Indian students, Cherukuri Suresh Chowdhary and Bhargav Chitturi, died in a car crash in Ireland, while two others were injured and are receiving treatment, Irish Police confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-pm-hopeful-chrystia-freeland-donald-trump-25-tariffs-madness-betrayal-america-closest-friend-2673748-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canadian PM candidate's on-air meltdown over Trump tariffs: 'Just cut it out'Chrystia Freeland said Donald Trump's decision to impose sweeping tariffs on Canada was \"an act of economic warfare\" and also warned that Americans were \"going to be astonished\" by the response of her country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-awards-2025-live-updates-sabrina-carpenter-taylor-swift-2673741-2025-02-03?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Chappell Roan wins Grammy for Best New Artist67th Annual Grammy Awards live updates: The Grammy Awards have kickstarted in Los Angeles. Singer Beyonce is leading the race with the highest number of nominations (11). The awards ceremony is being hosted by TV personality and writer Trevor Noah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-airlines-plane-catches-fire-on-runway-in-houston-passengers-evacuated-2673730-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: US airliner catches fire on runway, passenger yells 'Please get us out'A United Airlines flight to New York was evacuated on Sunday after its engine caught fire before takeoff from Houston, and all 104 passengers safely exited without any injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-amrit-snan-preparations-up-police-prayagraj-basant-panchami-2673613-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grand Amrit Snan marks Basant Panchami at Maha Kumbh, lakhs take holy dipThe Amrit Snan is the grandest and most sacred ritual of the Maha Kumbh Mela, attracting millions of pilgrims from around the world to the banks of the Triveni Sangam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-wife-bianca-censori-escorted-out-of-grammys-report-2673745-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rapper Kanye West, wife Bianca Censori escorted out of Grammys: ReportAccording to reports, Rapper Kanye West and wife Bianca Censori arrived at the Grammys 2025 uninvited and were soon escorted out by security. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-attack-arvind-kejriwal-sheeshmahal-delhi-assembly-polls-congress-aap-2673708-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Came in WagonR, went into 'sheeshmahal': Rahul Gandhi jabs Arvind KejriwalRahul Gandhi accused his INDIA bloc ally, Arvind Kejriwal, for failing to keep the promises he made while entering into politics, including cleaning Delhi's water and Yamuna River. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-says-pain-will-be-worth-the-price-after-tariffs-on-canada-mexico-china-2673718-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says tariffs could bring Americans 'pain' but will be 'worth the price'US President Donald Trump said that American citizens may feel economic \"pain\" from his tariffs on Mexico, Canada and China, but argued that it was \"worth the price\" to secure US interests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-doval-book-launch-religion-islam-authoritarianism-and-underdevelopment-ahmet-t-kuru-2673725-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Free thinking, instrospection important to avoid religious conflict: Ajit DovalNational Security Advisor Ajit Doval pointed out that \"religion-based conflicts are inevitable\" since all ideologies are competitive, and if they do not compete, they \"stagnate and eventually perish\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/67th-grammys-full-winners-list-2025-2673751-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grammys winners list: Beyonce wins Best Country, Sabrina takes home Best Pop AlbumThe 2025 Grammy Awards is taking place at Crypto.com Arena at Los Angeles. Beyonce is leading the nominees with 11 nods for her acclaimed album Cowboy Carter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isros-navigation-satellite-mission-nvs-02-faces-setback-navic-orbit-adjustment-2673727-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Setback for Isro's navigation mission as NVS-02 satellite thrusters fail to igniteIsro faced a setback in its mission to position the NVS-02 satellite in the desired orbit due to thruster failure, but is working on alternative strategies to utilise the satellite in its current elliptical orbit for the NavIC navigation system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/grammys-2025-red-carpet-sabrina-carpenter-a-vision-in-blue-jaden-smith-castle-headpiece-2673744-2025-02-03?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Grammys red carpet: Taylor Swift is a vision in red, Sabrina stuns in baby blueThe 2025 Grammys are officially underway, with stars gracing the red carpet in their most glamorous looks yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suresh-gopi-upper-caste-should-handle-tribal-affairs-ministry-bjp-kerala-cpi-controversy-2673666-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Brahmin should handle tribal affairs: Union Minister sparks row, later clarifiesUnion Minister Suresh Gopi, the actor-turned-politician, expressed his personal interest in heading the Ministry of Tribal Affairs and revealed that he had requested Prime Minister Narendra Modi to allocate the portfolio to him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-r-praggnanandhaa-vs-d-gukesh-tata-steel-chess-final-2673728-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Praggnanandhaa stuns world champion Gukesh to win Chess MastersGrandmaster R Praggnanandhaa won the Tata Steel Masters 2025, beating world champion D Gukesh in a thrilling tiebreak in Wijk aan Zee, Netherlands on Sunday, February 2. Gukesh, who was unbeaten till the last round of the tournament was outclassed by two of his Indian compatriots, in back to back matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-philadelphia-plane-crash-debris-flies-into-diner-customer-duck-for-cover-video-surfaces-2673645-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Philadelphia plane crash debris flies into diner, customers duck for coverA video surfaced online, showing debris from the plane that crashed in Philadelphia flying into a nearby diner and hitting customers even as they tried to duck for cover. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-5th-t20i-mumbai-abhishek-sharma-on-his-century-vs-england-at-wankhede-stadium-2673746-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Abhishek, don't throw it away: How 3 India seniors played big part in special hundredIND vs ENG: Opener Abhishek Sharma bludgeoned his way to a 37-ball hundred in the 5th and final T20I of the series. Abhishek revealed after his knock that three seniors from the Indian team played a big part in his record knock.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-to-stop-south-africa-funding-pending-probe-into-alleged-mistreatment-of-certain-classes-of-people-2673740-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump to cut all future aid to South Africa over mistreatment of 'certain people'Donald Trump alleged that South Africa is \"confiscating land\" and \"treating certain classes of people VERY BADLY\" as he announced his intention to end aid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-man-gujarat-wife-private-videos-instagram-police-case-divorce-2673733-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahmedabad man posts wife's private videos online after she seeks divorceAn Ahmedabad man has been charged for allegedly posting private videos of his 21-year-old wife online in retaliation after she sought a divorce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-woman-convinces-husband-to-sell-kidney-for-rs-10-lakh-then-elopes-with-money-2673734-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman convinces husband to sell kidney for Rs 10 lakh, decamps with money, loverA West Bengal woman convinced her husband to sell his kidney to improve their financial situation and enroll their 12-year-old daughter in a better school. Then she eloped with the money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/doge-working-120-hours-a-week-elon-musk-defends-work-ethic-amid-concerns-2673599-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk touts DOGE's 120-hour workweek vs US bureaucracy: 'Losing so fast'Elon Musk, who was appointed by Donald Trump to lead DOGE, has positioned the agency as a disruptive force in Washington, aiming to root out inefficiency and corruption in government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/new-tax-regime-budget-2025-it-slabs-nirmala-sitharaman-cbdt-2673697-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fresh slabs may prompt over 90% taxpayers to choose new regime: Tax body chiefRavi Agrawal, in a post-Budget interview, pointed out that the income tax payment provisions announced in Budget 2025 not only benefit those who earn Rs 12 lakh per annum, but across all income brackets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-tariff-united-states-justin-trudeau-mexico-import-duties-trade-war-ottawa-2673729-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Time to choose Canadian products: Justin Trudeau urges amid tariff war with USThe Justin Trudeau administration in Canada announced a mechanism for Canadian businesses to obtain relief from retaliatory tariffs set to take effect against the United States in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-ghaziabad-man-lured-using-dating-app-threatened-with-obscene-videos-arrested-2673710-2025-02-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man duped in queer dating app scam, loses Rs 1.4 lakh after being filmedGhaziabad Police have arrested three people for allegedly using Grinder, a gay dating app, to befriend men, lure them into a trap, and extort money by threatening them with private videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-on-marriage-plans-have-allowed-enough-chatter-around-my-personal-life-2673683-2025-02-02",
      "headline": "Arjun Kapoor on marriage plans: Have allowed enough chatter around my personal lifeAt the trailer launch of Mere Husband Ki Biwi, Arjun Kapoor addressed questions about his marriage plans. The actor emphasised focusing on the film while hinting at sharing personal updates at the right time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/junaid-khan-on-being-privileged-says-producers-will-cast-me-even-without-seeing-any-public-presence-2673660-2025-02-02",
      "headline": "Junaid Khan on being privileged: Nobody has said anything negative to meActors Junaid Khan and Khushi Kapoor candidly discuss the advantages their privileged backgrounds afford them in the film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/iifa-2025-laapataa-ladies-stree-2-bhool-bhulaiyaa-3-lead-nominations-details-stmp-2673625-2025-02-02",
      "headline": "IIFA 2025: Laapataa Ladies, Stree 2, Bhool Bhulaiyaa 3 lead nominationsThe International Indian Film Academy Awards (IIFA) 2025 will see Laapataa Ladies, Bhool Bhulaiyaa 3, and Stree 2 vying for top honours. Check out the full details of nominations here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/priyanka-chopra-takes-break-from-ssmb-29-shoot-for-brothers-wedding-in-mumbai-2673628-2025-02-02",
      "headline": "Priyanka Chopra takes break from SSMB 29 shoot for brother's wedding in MumbaiActor Priyanka Chopra arrived in Mumbai for her brother's wedding. The actor is in India for the shoot of her upcoming film with SS Rajamouli and Mahesh Babu. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-5th-t20i-mumbai-abhishek-sharma-on-his-century-vs-england-at-wankhede-stadium-2673746-2025-02-03",
      "headline": "Abhishek, don't throw it away: How 3 India seniors played big part in special hundredIND vs ENG: Opener Abhishek Sharma bludgeoned his way to a 37-ball hundred in the 5th and final T20I of the series. Abhishek revealed after his knock that three seniors from the Indian team played a big part in his record knock.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-r-praggnanandhaa-vs-d-gukesh-tata-steel-chess-final-2673728-2025-02-03",
      "headline": "Praggnanandhaa stuns world champion Gukesh to win Chess MastersGrandmaster R Praggnanandhaa won the Tata Steel Masters 2025, beating world champion D Gukesh in a thrilling tiebreak in Wijk aan Zee, Netherlands on Sunday, February 2. Gukesh, who was unbeaten till the last round of the tournament was outclassed by two of his Indian compatriots, in back to back matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-gautam-gambhir-champions-trophy-odis-2673722-2025-02-02",
      "headline": "Gautam Gambhir wants 'aggressive' India in ODIs before Champions TrophyIND vs ENG: Indian head coach Gautam Gambhir said that he wanted India to play the aggressive brand of cricket in ODIs as well after their dominating run in the T20 series against England, which they won 4-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gautam-gambhir-interview-bgt-dressing-room-controversy-shivam-dube-concussion-substitute-2673721-2025-02-02",
      "headline": "Gambhir jokes about 'substitute' Shivam Dube, addresses dressing room rumoursIndia head coach Gautam Gambhir addressed the India dressing room rumours for the first time since Border-Gavaskar Trophy. Gambhir also commented on the controversy surrounding Shivam Dube's substitution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-5th-t20i-abhishek-sharma-yuvraj-singh-tweet-mumbai-2673713-2025-02-02",
      "headline": "Abhishek Sharma on Yuvraj Singh's tweet after 135: 1st one without flying chappalAbhishek Sharma was ecstatic to see Yuvraj Singh's congratulatory message to him after 135 against England in the 5th T20I on Sunday, February 2. Abhishek scored 135 off just 54 balls and picked 2 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/lamine-yamal-dribble-barcelona-vs-alaves-match-highlights-2673700-2025-02-02",
      "headline": "Watch: Lamine Yamal dribbles past entire midfield as Barca beat Alaves 1-0Barcelona vs Alaves: Lamine Yamal dribbled past nearly the entire Alaves midfield on Sunday, February 2. Yamal's ridiculous control was on full show as Barcelona closed in on LaLiga leaders Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-mumbai-t20i-report-2673699-2025-02-02",
      "headline": "Abhishek 135 helps India seal biggest T20I win over England, bag series 4-1IND vs ENG: Abhishek Sharma scored 135 runs and picked up two wickets as India won the T20I series with a clinical 150-run win in the fifth and final T20I on Sunday at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-sachin-tendulkar-5th-t20i-mumbai-2673693-2025-02-02",
      "headline": "'High voltage' Abhishek Sharma torments England, Sachin Tendulkar in aweIND vs ENG: Abhishek Sharma drew praise from Sachin Tendulkar after scoring 135 runs off 54 balls with 7 fours and 13 sixes against England in the fifth and final T20I at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-hundred-mumbai-india-vs-england-record-stats-2673692-2025-02-02",
      "headline": "Abhishek Sharma smashes 135, breaks string of records: Stat PackAbhishek Sharma played his best over T20I knock on Sunday, February 2, in the 5th T20I against England. Abhishek broke a string of records in the innings as India posted 247/9 in the final match of the series in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-highest-individual-score-by-indian-wankhede-mumbai-2673689-2025-02-02",
      "headline": "Abhishek Sharma scores 135, highest individual T20I score by an IndianAbhishek Sharma broke the record for the highest score by an Indian in T20Is as he put England to the sword at the Wankhede stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-la-lakers-land-luka-doncic-trade-anthony-davis-to-dallas-mavericks-reports-2673681-2025-02-02",
      "headline": "LA Lakers land Luka Doncic, trade Anthony Davis to Dallas Mavericks: ReportsThe Los Angeles Lakers are all set to land Luka Doncic after trading Anthony Davis to the Dallas Mavericks in a mega deal. Doncic is all set to link up with LeBron James at Lakers after he returns from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-mumbai-t20i-report-2673699-2025-02-02",
      "headline": "Abhishek 135 helps India seal biggest T20I win over England, bag series 4-1IND vs ENG: Abhishek Sharma scored 135 runs and picked up two wickets as India won the T20I series with a clinical 150-run win in the fifth and final T20I on Sunday at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-sachin-tendulkar-5th-t20i-mumbai-2673693-2025-02-02",
      "headline": "'High voltage' Abhishek Sharma torments England, Sachin Tendulkar in aweIND vs ENG: Abhishek Sharma drew praise from Sachin Tendulkar after scoring 135 runs off 54 balls with 7 fours and 13 sixes against England in the fifth and final T20I at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-hundred-mumbai-india-vs-england-record-stats-2673692-2025-02-02",
      "headline": "Abhishek Sharma smashes 135, breaks string of records: Stat PackAbhishek Sharma played his best over T20I knock on Sunday, February 2, in the 5th T20I against England. Abhishek broke a string of records in the innings as India posted 247/9 in the final match of the series in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-highest-individual-score-by-indian-wankhede-mumbai-2673689-2025-02-02",
      "headline": "Abhishek Sharma scores 135, highest individual T20I score by an IndianAbhishek Sharma broke the record for the highest score by an Indian in T20Is as he put England to the sword at the Wankhede stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-la-lakers-land-luka-doncic-trade-anthony-davis-to-dallas-mavericks-reports-2673681-2025-02-02",
      "headline": "LA Lakers land Luka Doncic, trade Anthony Davis to Dallas Mavericks: ReportsThe Los Angeles Lakers are all set to land Luka Doncic after trading Anthony Davis to the Dallas Mavericks in a mega deal. Doncic is all set to link up with LeBron James at Lakers after he returns from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanju-samson-india-vs-england-short-ball-jofra-archer-mark-wood-2673679-2025-02-02",
      "headline": "5 in 5: Sanju Samson continues to lose his wicket to short ballSanju Samson continued to lose his wicket to short ball in the 5-match series against England. Samson played all 5 games in the series and lost his wicket to a short delivery in every single game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-abhishek-sharma-record-mumbai-t20i-century-2673678-2025-02-02",
      "headline": "Abhishek Sharma rattles England to hit India's second-fastest T20I century IND vs ENG: Abhishek Sharma hit the second-fastest T20I hundred for India off 37 balls. The left-hander reached the landmark in the fifth T20I against England at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-5th-t20i-abhishek-sharma-fifty-17-balls-mumbai-2673674-2025-02-02",
      "headline": "IND vs ENG: Abhishek Sharma breaks Suryakumar Yadav's record with 17-ball 50Abhishek Sharma broke Suryakumar Yadav's record for the fastest fifty by an Indian at home as he put the England bowlers to the sword. Abhishek hit his fifty in just 17 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shami-arahdeep-singh-harshit-rana-shivam-dube-mumbai-t20i-2673670-2025-02-02",
      "headline": "Mohammed Shami replaces Arshdeep, no place for concussion sub HarshitIND vs ENG: Mohammed Shami replaced Arshdeep Singh in the playing XI for the fifth and final T20I against Jos Buttler's England on Sunday at the Wankhede Stadium in Mumbai. Shami could not take a wicket on his India return during the Rajkot T20I. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-5th-t20i-jos-buttler-impact-subs-concussion-substitute-mumbai-2673669-2025-02-02",
      "headline": "4 impact subs? Did Buttler take a dig at India after Pune concussion sub fiascoFans have been left wondering if England skipper Jos Buttler took a dig after saying that his side will have 4 impact subs for the Mumbai T20I. The England camp were left unhappy with the Pune concussion substitute fiasco. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-gongadi-trisha-asia-cup-2673659-2025-02-02",
      "headline": "Who is Gongadi Trisha? Asia Cup winner, now double world championU19 Women's T20 World Cup: Gongadi Trisha was stupendous throughout the tournament, helping India win the title after beating South Africa in the final on Sunday. The 19-year-old hammered 309 runs and picked up seven wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-women-t20-world-cup-win-niki-trisha-vaishnavi-profile-2673652-2025-02-02",
      "headline": "Meet the Indian stars from victorious U19 Women's T20 World Cup teamIndia hammered South Africa in the Women's U19 T20 World Cup to successfully defend their title. Meet some of the key players from the victorious Indian team who performed sensationally well in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-5th-t20i-jos-buttler-impact-subs-concussion-substitute-mumbai-2673669-2025-02-02",
      "headline": "4 impact subs? Did Buttler take a dig at India after Pune concussion sub fiascoFans have been left wondering if England skipper Jos Buttler took a dig after saying that his side will have 4 impact subs for the Mumbai T20I. The England camp were left unhappy with the Pune concussion substitute fiasco. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-gongadi-trisha-asia-cup-2673659-2025-02-02",
      "headline": "Who is Gongadi Trisha? Asia Cup winner, now double world championU19 Women's T20 World Cup: Gongadi Trisha was stupendous throughout the tournament, helping India win the title after beating South Africa in the final on Sunday. The 19-year-old hammered 309 runs and picked up seven wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-women-t20-world-cup-win-niki-trisha-vaishnavi-profile-2673652-2025-02-02",
      "headline": "Meet the Indian stars from victorious U19 Women's T20 World Cup teamIndia hammered South Africa in the Women's U19 T20 World Cup to successfully defend their title. Meet some of the key players from the victorious Indian team who performed sensationally well in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-2025-india-beat-togo-4-0-to-secure-world-group-i-berth-2673651-2025-02-02",
      "headline": "Dominant India blank Togo 4-0 to secure World Group I berthDavis Cup 2025: India dominated Togo with a 4-0 victory at the DLTA Complex on Sunday, securing a spot in the World Group I Play-offs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-announce-patrick-dorgu-ruben-amorim-old-trafford-2673643-2025-02-02",
      "headline": "Manchester United announce Patrick Dorgu as Ruben Amorim's statement signingPatrick Dorgu is officially a Manchester United player as the club announced the signing of the Danish defender on Sunday, February 2. Dorgu signed a lengthy contract with United as Ruben Amorim finally got his big signing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-jammu-kashmir-reach-quarterfinal-182-run-win-vs-baroda-2673639-2025-02-02",
      "headline": "Jammu and Kashmir storm into quarterfinal with 182-run win vs BarodaRanji Trophy: Jammu and Kashmir hammered Baroda by 182 runs and sealed their place in the quarterfinals of the premier domestic tournament. Jammu & Kashmir, Vidarbha, Haryana, and Saurashtra qualified as the top-ranked teams from their respective groups.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-sourav-ganguly-rohit-sharma-virat-kohli-2673637-2025-02-02",
      "headline": "Ganguly backs Rohit Sharma, Virat Kohli to return to form in Champions TrophyChampions Trophy: Former India captain Sourav Ganguly backed senior India batters Rohit Sharma and Virat Kohli to return to form during the ICC tournament. Ganguly also felt that India are not the outright favourites to lift the ICC title.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}