{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-other-details-2635692-2024-11-19",
      "headline": "Zinka Logistics IPO allotment: How to check status, latest GMP and other detailsZinka Logistics IPO allotment: Investors can check their allotment status on the Bombay Stock Exchange (BSE) website or through the registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-calls-for-affordable-interest-rates-after-piyush-goyals-remarks-rbi-governor-shaktikanta-das-2635670-2024-11-19",
      "headline": "Nirmala Sitharaman calls for 'affordable' interest rates after Piyush GoyalThe Reserve Bank of India's (RBI) Monetary Policy Committee (MPC) has kept key interest rates unchanged since February 2023, citing persistent inflation pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-bull-run-sensex-up-1000-points-nifty-jumps-worst-over-key-things-to-know-2635666-2024-11-19",
      "headline": "Sensex surges 1,000 points, snaps 7-session losing streak. Is the worst over?Stock market today: At 11:36 am, the Sensex was up 1044.89 points at 78,383.90, while the NSE Nifty50 advanced 304.50 points to 23,758.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amazon-flipkart-executives-foreign-direct-investment-rules-violation-ed-probe-2635634-2024-11-19",
      "headline": "ED likely to summon top Amazon, Flipkart executives over FDI rule violationsThe ED's investigation stems from multiple complaints alleging that Amazon and Flipkart have been violating Foreign Direct Investment (FDI) rules by directly or indirectly favouring select vendors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-aerospace-giant-boeing-layoffs-washington-oregon-south-carolina-financial-crisis-2635628-2024-11-19",
      "headline": "Boeing to cut over 2,500 workers in US amid financial crisisNearly 2,200 layoff notices went to workers in Washington and another 220 in South Carolina, the two states where Boeing builds commercial airliners. Boeing declined to comment on the layoffs on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-19-2024-precious-metals-record-hike-on-mcx-2635621-2024-11-19",
      "headline": "Gold, silver price today, November 19, 2024: Precious metals record hike on MCXGold Price Today November 19, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/meta-competition-commission-of-india-penalty-213-crore-decision-whatsapp-policy-disagree-plan-to-appeal-2635616-2024-11-19",
      "headline": "Meta to appeal India's Rs 213-crore penalty order over WhatsApp policyThe Competition Commission of India (CCI) on Monday imposed a penalty of Rs 213.14 crore on social media major Meta for unfair business ways with respect to WhatsApp privacy policy update done in 2021."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-open-for-bidding-subscribe-skip-good-bad-review-latest-gmp-2635615-2024-11-19",
      "headline": "NTPC Green Energy IPO open for bidding: Should you subscribe? Check latest GMPThe initial public offering (IPO) makes NTPC Green Energy the third-largest IPO of the year, following Hyundai Motors India's Rs 28,756 crore IPO and Swiggy's Rs 11,327 crore issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shaktikanta-das-tenure-as-rbi-governor-second-term-likely-to-be-extended-report-2635600-2024-11-19",
      "headline": "Shaktikanta Das' tenure as RBI governor likely to be extended: Report Shaktikanta Das, who has been heading the RBI since December 2018, has already surpassed the typical five-year term. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rebound-to-open-higher-despite-mixed-global-cues-ril-shares-gains-1-percent-2635592-2024-11-19",
      "headline": "Market rally: Sensex, Nifty rebound to open higher; RIL gains 1% The S&P BSE Sensex added 663.48 points to 78,002.49, while the NSE Nifty50 was up 203.85 points to 23,657.65"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-fined-rs-213-crore-over-whatsapp-privacy-policy-by-competition-commission-of-india-2635519-2024-11-18",
      "headline": "Meta fined Rs 213 crore over WhatsApp privacy policy by competition regulatorThe Competition Commission of India has directed Meta to \"cease and desist\" from anti-competitive practices."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-lost-200-points-nifty-in-red-tcs-it-ril-stocks-fall-2635228-2024-11-18",
      "headline": "Sensex, Nifty extend losses amid weak rupee and IT sector declineThe S&P BSE Sensex lost 241.30 points to close at 77,339.01, while the NSE Nifty50 was down 78.90 points to end at 23,453.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cryptocurrency-revival-us-elections-donald-trump-india-demand-high-taxes-2635196-2024-11-18",
      "headline": "Will Bitcoin's revival boost India's appetite for cryptos despite high taxes?The crypto market has been riding a wave of optimism following Donald Trump's election as US president, with hopes that his administration will adopt a crypto-friendly stance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-deal-done-to-acquire-iphone-plant-tamil-nadu-pegatron-2635175-2024-11-18",
      "headline": "Tata seals deal to acquire 60% of Pegatron's Tamil Nadu iPhone plant: ReportUnder the agreement, Tata will hold a 60% stake in the plant and oversee daily operations, while Pegatron will retain the remaining 40% and provide technical support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/telangana-government-announces-100-percent-tax-exemption-for-electric-vehicles-ev-2635158-2024-11-18",
      "headline": "Telangana government announces 100% tax exemption for electric vehiclesThe Telangana government's initiative is a part of its broader electric vehicle policy aimed at creating an eco-friendly transport system while reducing pollution levels in Hyderabad and other urban centres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-india-to-move-bengaluru-headquarters-new-office-near-airport-to-cut-costs-report-2635151-2024-11-18",
      "headline": "Amazon India to move Bengaluru headquarters to cut costs: ReportThe relocation is aimed at reducing costs and will involve vacating 500,000 square feet of office space across 18 floors at the WTC, which is owned by Brigade Enterprises Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-tells-india-recruiters-not-to-ask-for-marital-status-in-iphone-job-ads-2635148-2024-11-18",
      "headline": "Foxconn tells India recruiters not to ask for marital status in iPhone job adsFoxconn, which employs thousands of women at the iPhone factory at Sriperumbudur, near Chennai, outsources recruitment of assembly-line workers to third-party vendors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-correction-selloff-smallcap-and-midcap-shares-brokerages-fpi-selling-impact-2635116-2024-11-18",
      "headline": "Stock market correction: How bad is the selloff in smallcap and midcap space?Stock Market Correction: Despite aggressive selling by foreign portfolio investors (FPIs) in Indian equities, ICICI Securities recently noted that small-cap and mid-cap indices have shown relative resilience compared to the Nifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-are-falling-in-india-but-rising-globally-explained-3-reasons-why-2635081-2024-11-18",
      "headline": "Gold prices are falling in India but rising globally. 3 reasons whyGold prices have seen a decline, bringing prices closer to lows recorded in September. Globally, however, gold prices have edged higher due to geopolitical and economic factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-bloodbath-on-dalal-street-four-things-to-know-2635058-2024-11-18",
      "headline": "Sensex, Nifty fall as market bloodbath continues. 4 things investors should knowStock market correction: Sensex and Nifty have entered a correction zone, marked by a drop of more than 10% from their recent highs. The sell-off has rattled retail investors, many of whom are now asking a pressing question: Has the market bottomed out, or is there more pain ahead?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-environment-minister-gopal-rai-writes-centre-seeks-nod-artificial-rain-air-crisis-2635680-2024-11-19",
      "headline": "Delhi Minister writes to Centre, seeks nod for artificial rain amid air crisisThe Delhi Minister's letter to the Centre comes as the national capital is battling with deteriorating air pollution levels. On Tuesday, the Air Quality Index stood at 494 under the 'severe plus' category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-grants-anticipatory-bail-to-malayalam-actor-siddique-in-rape-case-2635661-2024-11-19",
      "headline": "Court relief for actor Siddique in rape case: 'Facebook post but no complaint'The charges against actor Siddique came as a spate of sexual misconduct allegations rocked the Malayalam film industry earlier this year. During the hearing, the Supreme Court asked the complainant why it took eight years to lodge the complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-retention-rishabh-pant-delhi-capitals-reason-money-sunil-gavaskar-2635664-2024-11-19",
      "headline": "Rishabh Pant breaks silence on leaving Delhi Capitals: 'Not about money' IPL Auction: Wicketkeeper-batter Rishabh Pant, in a surprising move, was not retained by Delhi Capitals ahead of the mega auction. Pant took to social media and said their split was not because of money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/onion-price-rise-reason-link-maharashtra-assembly-election-export-restriction-nashik-2635671-2024-11-19",
      "headline": "Why Maharashtra election is to blame for onion-less salad, runny gravyOnion prices have remained very high for some months now and are driving temporary culinary changes. One of the measures the Centre takes to tackle high onion prices is to stop exports. However, with the upcoming elections in Maharashtra, India's biggest onion producer, the government has dithered in doing so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nayanthara-beyond-the-fairytale-review-wholesome-story-of-a-successful-woman-in-love-on-netflix-2635684-2024-11-19",
      "headline": "Nayanthara Beyond The Fairytale review: Wholesome story of successful woman in love Released-Mon Nov 18, 2024Nayanthara: Beyond The Fairytale on Netflix is the story of an ordinary woman who happens to be a star, not because she was served stardom on a platter, but because she worked hard for it. This is the story of earning power, showing strength, and making every success count with a bit of dreaminess. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-pollution-severe-plus-category-overall-aqi-2635536-2024-11-19",
      "headline": "Delhi chokes in smog, AQI at 494; flights delayed, schools go online Live Updates Delhi AQI: Air quality across the national capital region has deteriorated, with several air monitoring stations touching the 500-mark (severe plus) on Tuesday morning. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-sikh-woman-indian-origin-19-year-old-halifax-walmart-store-oven-death-2635613-2024-11-19",
      "headline": "Canadian police rule out foul play in Sikh woman's death in Walmart ovenA month after a 19-year-old Sikh woman, Gursimran Kaur, was found dead at a Walmart store oven in Canada, police declared her death non-suspicious, finding no evidence of foul play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-bull-run-sensex-up-1000-points-nifty-jumps-worst-over-key-things-to-know-2635666-2024-11-19",
      "headline": "Sensex surges 1,000 points, snaps 7-session losing streak. Is the worst over?Stock market today: At 11:36 am, the Sensex was up 1044.89 points at 78,383.90, while the NSE Nifty50 advanced 304.50 points to 23,758.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/diljit-dosanjh-replaces-alcohol-with-coke-in-lyrics-at-hyderabad-concert-coca-cola-reacts-2635702-2024-11-19",
      "headline": "Diljit Dosanjh replaces alcohol with Coke in song's lyrics, Coca-Cola reactsDiljit Dosanjh replaced the lyrics of his song which mentioned alcohol with Coca-Cola at his Hyderabad concert. The company reacted to one of the viral videos of his performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aqi-pollution-diesel-trucks-buses-flouting-grap-4-restrictions-2635612-2024-11-19",
      "headline": "'Paid Rs 200 to cops': How diesel trucks are flouting Delhi anti-pollution curbsDelhi AQI: With pollution soaring to extremely severe levels in Delhi and despite the implementation of GRAP-4 measures, India Today found that diesel trucks and buses were freely plying on the roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/indians-driving-birth-tourism-canada-citizenship-truth-nigerians-china-immigrants-trudeau-british-columbia-2635278-2024-11-19",
      "headline": "Are Indians driving birth tourism in Canada? Here's the truthIn a video that has gone viral, a Canadian named claimed Indian women were flooding Canada's hospitals for childbirth. This phenomenon is called 'birth tourism', and is aimed at gaining Canadian citizenship for the newborn. But are Indians driving birth tourism in Canada? This is what data says. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/johnny-tiger-travels-300-km-from-maharashtra-to-telangana-in-search-of-mate-2635718-2024-11-19",
      "headline": "From Maharashtra to Telangana: Tiger 'Johnny' travels 300 km in search of mateA male tiger, named Johnny, travelled 300 km from Maharashtra to Telangana, apparently to find a mate. The tiger's journey, which began in the third week of October, was tracked by a radio collar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kim-kardashian-beats-tesla-robot-optimus-in-a-rock-paper-scissors-game-instagram-stories-video-2635642-2024-11-19",
      "headline": "Kim Kardashian beats Elon Musk's humanoid robot in a rock-paper-scissors gameKim Kardashian challenged Tesla's robot, Optimus, to a game of rock-paper-scissors, and the result was pure entertainment to watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-calls-for-affordable-interest-rates-after-piyush-goyals-remarks-rbi-governor-shaktikanta-das-2635670-2024-11-19",
      "headline": "Nirmala Sitharaman calls for 'affordable' interest rates after Piyush GoyalThe Reserve Bank of India's (RBI) Monetary Policy Committee (MPC) has kept key interest rates unchanged since February 2023, citing persistent inflation pressures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/meta-competition-commission-of-india-penalty-213-crore-decision-whatsapp-policy-disagree-plan-to-appeal-2635616-2024-11-19",
      "headline": "Meta to appeal India's Rs 213-crore penalty order over WhatsApp policyThe Competition Commission of India (CCI) on Monday imposed a penalty of Rs 213.14 crore on social media major Meta for unfair business ways with respect to WhatsApp privacy policy update done in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2635596-2024-11-19",
      "headline": "Champions Trophy: Back channel talks on to convince Pakistan to accept hybrid modelChampions Trophy: Top cricket administrators are trying to convince Pakistan to start working towards a hybrid model for the marquee eight-team tournament. PCB chairman Mohsin Naqvi, on Monday, reiterated Pakistan's stance, offering to ease India's safety concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/a-mysterious-signal-came-before-the-biggest-tonga-eruption-it-was-missed-2635675-2024-11-19",
      "headline": "Mysterious signal raced through Earth before Tonga volcano eruptedThis seismic signal travelled a great distance, indicating an unusually large event was about to happen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/2024-jharkhand-assembly-elections-a-tale-of-two-tigers-how-loud-will-jairam-mahto-roar-in-jharkhands-political-jungle-2635327-2024-11-18",
      "headline": "How loud will Jairam Mahto roar in Jharkhand's political jungle?JMM veteran Champai Soren has donned BJP colours while Mahto, the other tiger, and his fledgling party JKLM are forcing the established players to rethink their strategies"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/shashi-tharoor-delhi-air-pollution-quality-index-should-it-even-remain-capital-of-india-attack-government-worsening-conditions-2635531-2024-11-19",
      "headline": "Should Delhi even remain India's capital: Shashi Tharoor on worsening pollutionDelhi AQI: Congress MP Shashi Tharoor, in yet another attack on the central government for not taking action on Delhi's worsening pollution, said that the government has failed to address the issue despite years of worsening air conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-rohit-sharma-missing-perth-test-michael-clarke-2635669-2024-11-19",
      "headline": "Rohit Sharma's call to miss Perth Test defended by Michael Clarke: Family firstMichael Clarke has come out in support of Rohit Sharma's decision to miss the Perth Test and be with his family as he welcomed his second child. Rohit and his wife Ritika welcomed a baby boy on November 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/kashmera-shah-freak-accident-us-krushna-abhishek-updates-2635629-2024-11-19",
      "headline": "Kashmera Shah suffers freak accident in US, husband Krushna Abhishek shares updateKashmera Shah, currently in USA, experienced a 'freak accident', resulting in a major injury. Her husband, Krushna Abhishek, provided a health update, assuring fans she is fine now and is under medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-external-affairs-minister-china-foreign-minister-wang-yi-border-pm-modi-xi-jinping-ladakh-lac-2635606-2024-11-19",
      "headline": "S Jaishankar, Chinese Foreign Minister meet for first time since border dealBrazil G20 Summit: External Affairs Minister S Jaishankar noted that the implementation of the border agreement between India and China has proceeded as planned. He met his Chinese counterpart Wang Yi on the sidelines of the G20 Summit in Brazil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dehradun-car-accident-6-killed-students-drive-after-party-over-bmw-2635504-2024-11-19",
      "headline": "Post-party drive, attempt to overtake BMW: Timeline of deadly Dehradun crashPolice said that the Innova covered the 600-meter distance from the bus stop to the accident site in just 13 seconds, a speed exceeding 120 km/h."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-police-chinese-national-fang-chenjin-arrested-rs-100-crore-stock-trading-cyber-fraud-case-2635599-2024-11-19",
      "headline": "Rs 100-crore online trading scam on WhatsApp busted, Chinese man arrestedThe Delhi cyber police said that the accused was involved in online stock trading scams operated through WhatsApp groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nayanthara-beyond-the-fairytale-review-wholesome-story-of-a-successful-woman-in-love-on-netflix-2635684-2024-11-19",
      "headline": "Nayanthara Beyond The Fairytale review: Wholesome story of successful woman in love Released-Mon Nov 18, 2024Nayanthara: Beyond The Fairytale on Netflix is the story of an ordinary woman who happens to be a star, not because she was served stardom on a platter, but because she worked hard for it. This is the story of earning power, showing strength, and making every success count with a bit of dreaminess. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/one-tree-hill-actor-paul-teal-dies-at-35-after-battling-cancer-2635667-2024-11-19",
      "headline": "One Tree Hill actor Paul Teal dies at 35 after cancer battleActor Paul Teal, famed for his role in One Tree Hill, has died at 35 after battling cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bharat-dev-varma-dies-moon-moon-sen-husband-raima-sen-father-2635662-2024-11-19",
      "headline": "Bharat Dev Varma, actor Moon Moon Sen's husband and Raima Sen's father, diesActor Moon Moon Sen's husband, and father of Raima and Riya Sen, Bharat Dev Varma, died today in Kolkata. Further details are awaited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-all-we-imagine-as-light-snub-rrr-wasnt-india-official-oscar-entry-2635641-2024-11-19",
      "headline": "Rana Daggubati: RRR wasn't sent as India's official Oscar entry, but it wonRana Daggubati discussed the omission of All We Imagine as Light as India's official Oscar submission. He drew a parallel with RRR, a non-official submission that succeeded at the Oscars."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-batting-slip-cordon-rahul-jurel-padikkal-jaiswal-2635695-2024-11-19",
      "headline": "India's slip cordon picture from nets hints at batting order for Perth TestIndia's practice session ahead of the Perth Test offered some intriguing hints about the potential playing XI. With Shubman Gill and Rohit Sharma unavailable, the team is searching for replacements at the top of the order. Visuals from the nets, shared on social media, suggest that Devdutt Padikkal and Dhruv Jurel are likely to get a nod. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-shubman-gill-number-three-rahul-dravid-2635694-2024-11-19",
      "headline": "Not like Pujara or me, but Shubman Gill will succeed at No. 3 in Australia: DravidRahul Dravid has backed Shubman Gill to excel in the No.3 role for India during the upcoming Border-Gavaskar trophy, starting from November 22. Gill has performed will since taking over the No.3 spot from Cheteshwar Pujara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-rohit-sharma-missing-perth-test-michael-clarke-2635669-2024-11-19",
      "headline": "Rohit Sharma's call to miss Perth Test defended by Michael Clarke: Family firstMichael Clarke has come out in support of Rohit Sharma's decision to miss the Perth Test and be with his family as he welcomed his second child. Rohit and his wife Ritika welcomed a baby boy on November 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-retention-rishabh-pant-delhi-capitals-reason-money-sunil-gavaskar-2635664-2024-11-19",
      "headline": "Rishabh Pant breaks silence on leaving Delhi Capitals: 'Not about money' IPL Auction: Wicketkeeper-batter Rishabh Pant, in a surprising move, was not retained by Delhi Capitals ahead of the mega auction. Pant took to social media and said their split was not because of money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/champions-trophy-backdoor-talks-on-to-convince-pakistan-on-hybrid-model-2635654-2024-11-19",
      "headline": "Backdoor talks on to convince Pakistan on hybrid Champions Trophy Top cricket administrators are trying to convince Pakistan to start working towards a hybrid model for the marquee eight-team tournament. PCB chairman Mohsin Naqvi, on Monday, reiterated Pakistan's stance, offering to ease India's safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mike-tyson-jake-paul-fight-draws-record-betting-for-a-combat-sports-event-2635638-2024-11-19",
      "headline": "Mike Tyson-Jake Paul fight draws record betting for a combat sports eventJake Paul secured a unanimous victory over former heavyweight champion Mike Tyson, a result that may have been underwhelming from a competitive perspective but nevertheless attracted record betting activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-on-this-day-november-19-australia-odi-world-cup-pat-cummins-ahmedabad-2635630-2024-11-19",
      "headline": "OTD in 2023, Australia win World Cup: When Cummins silenced the Ahmedabad crowdOn this day in 2023:  November 19 will forever echo as a day of heartbreak for Indian cricket, as dreams of glory crumbled before a resolute Australian side that thrived against all odds. In a deafening silence at the world's largest stadium, hope turned to despair as the coveted World Cup slipped away from the home team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/no-shafali-verma-india-squad-women-odi-series-vs-australia-2635617-2024-11-19",
      "headline": "No Shafali Verma as India name squad for women's ODI series in AustraliaDynamic opener Shafali Verma was not picked as India named their 16-member squad for the upcoming three-match women's ODI series against Australia. Shafali managed just 56 runs in the recent home series against New Zealand, with her last ODI half-century dating back to July 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pat-cummins-tick-of-test-series-win-vs-india-2635595-2024-11-19",
      "headline": "Australia's Pat Cummins eager to 'tick off' Test series win over IndiaPat Cummins has never been part of a victorious Test series against India, but the Australian captain is determined to change that in the upcoming Border-Gavaskar Trophy, which begins on November 22 in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2635596-2024-11-19",
      "headline": "Champions Trophy: Back channel talks on to convince Pakistan to accept hybrid modelChampions Trophy: Top cricket administrators are trying to convince Pakistan to start working towards a hybrid model for the marquee eight-team tournament. PCB chairman Mohsin Naqvi, on Monday, reiterated Pakistan's stance, offering to ease India's safety concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rohit-sharma-aggression-border-gavaskar-trophy-michael-vaughan-2635580-2024-11-19",
      "headline": "Who will be India's Kohli and Shastri in Australia this time, asks Vaughan Border-Gavaskar Trophy: Former England captain Michael Vaughan highlighted the role of powerful leaders like Virat Kohli and Ravi Shastri in the dressing room in their previous two tours to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-on-this-day-november-19-australia-odi-world-cup-pat-cummins-ahmedabad-2635630-2024-11-19",
      "headline": "OTD in 2023, Australia win World Cup: When Cummins silenced the Ahmedabad crowdOn this day in 2023:  November 19 will forever echo as a day of heartbreak for Indian cricket, as dreams of glory crumbled before a resolute Australian side that thrived against all odds. In a deafening silence at the world's largest stadium, hope turned to despair as the coveted World Cup slipped away from the home team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/no-shafali-verma-india-squad-women-odi-series-vs-australia-2635617-2024-11-19",
      "headline": "No Shafali Verma as India name squad for women's ODI series in AustraliaDynamic opener Shafali Verma was not picked as India named their 16-member squad for the upcoming three-match women's ODI series against Australia. Shafali managed just 56 runs in the recent home series against New Zealand, with her last ODI half-century dating back to July 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pat-cummins-tick-of-test-series-win-vs-india-2635595-2024-11-19",
      "headline": "Australia's Pat Cummins eager to 'tick off' Test series win over IndiaPat Cummins has never been part of a victorious Test series against India, but the Australian captain is determined to change that in the upcoming Border-Gavaskar Trophy, which begins on November 22 in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2635596-2024-11-19",
      "headline": "Champions Trophy: Back channel talks on to convince Pakistan to accept hybrid modelChampions Trophy: Top cricket administrators are trying to convince Pakistan to start working towards a hybrid model for the marquee eight-team tournament. PCB chairman Mohsin Naqvi, on Monday, reiterated Pakistan's stance, offering to ease India's safety concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rohit-sharma-aggression-border-gavaskar-trophy-michael-vaughan-2635580-2024-11-19",
      "headline": "Who will be India's Kohli and Shastri in Australia this time, asks Vaughan Border-Gavaskar Trophy: Former England captain Michael Vaughan highlighted the role of powerful leaders like Virat Kohli and Ravi Shastri in the dressing room in their previous two tours to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-x-factor-travis-head-khawaja-smith-2635575-2024-11-19",
      "headline": "Jasprit Bumrah is India's X-factor, incredible in every format: Travis HeadBorder-Gavaskar Trophy: Australian batter Travis Head has lauded Jasprit Bumrah as a formidable challenge for Australian batters, highlighting his unpredictable bowling style. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-indias-opening-options-in-australia-in-rohit-sharmas-absence-dhruv-jurel-aus-vs-ind-kl-rahul-2635457-2024-11-19",
      "headline": "No Rohit and Gill for India in Perth Test: Top 5 options to bat in top-orderTeam India find themselves in a precarious position as they're without their captain, Rohit Sharma, for the first Test in Perth. The situation worsened with Shubman Gill's injury. India will have to reshuffle their batting line-up and ensure they get the combination right for the series opener, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-alex-carey-unfazed-josh-inglis-test-wicketkeeper-competition-2635561-2024-11-19",
      "headline": "Alex Carey unfazed by Josh Inglis's challenge for Test wicketkeeper roleAlex Carey is unfazed by another wicketkeeper, Josh Inglis,'s addition to Australia's Test squad. Carey highlighted his camaraderie with Inglis in the \"Keepers Club\" despite competing for the wicketkeeper role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohli-batting-form-antagonising-australia-ravi-shastri-2635545-2024-11-19",
      "headline": "Virat Kohli can find batting form by antagonising Australia: Ravi ShastriBorder-Gavaskar Trophy: With the opening Test in Perth just days away, Ravi Shastri called for Virat Kohli to revisit the fiery, antagonist role that made him a menace for Australian teams early in his career. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-yashasvi-will-be-better-player-after-bgt-ravi-shastri-2635541-2024-11-19",
      "headline": "Yashasvi will be a better batter when he leaves Australia's shores: Ravi ShastriBorder-Gavaskar Trophy: Former Indian coach Ravi Shastri reckons 'world-class' Yashasvi Jaiswal will return as a more polished batter from the Australia tour. Shastri is confident the young opener will rise above the challenges and further refine his game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-kerr-kristie-mewis-pregnancy-football-2635526-2024-11-19",
      "headline": "Australia's Sam Kerr announces pregnancy with Kristie MewisAustralia's Sam Kerr and Kristie Mewis of the United States are set to become parents. The duo announced it through an Instagram post on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-marsh-bowler-australia-vs-india-tests-2635496-2024-11-18",
      "headline": "Have put in enough work: Bowler Mitchell Marsh ready to make it happenAUS vs IND: Mitchell Marsh is set to shoulder added responsibility in the bowling department in Cameron Green's absence during the five-match Test series in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-held-by-malaysia-to-1-1-draw-end-2024-winless-2635475-2024-11-18",
      "headline": "India held by Malaysia to 1-1 draw, end 2024 winless Rahul Bheke scored in the 39th minute, but Malaysia held India to a 1-1 draw in the International Friendly on Monday at the Gachibowli Stadium in Hyderabad. With the result, India finished 2024 without winning even one of their 11 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-yashasvi-will-be-better-player-after-bgt-ravi-shastri-2635541-2024-11-19",
      "headline": "Yashasvi will be a better batter when he leaves Australia's shores: Ravi ShastriBorder-Gavaskar Trophy: Former Indian coach Ravi Shastri reckons 'world-class' Yashasvi Jaiswal will return as a more polished batter from the Australia tour. Shastri is confident the young opener will rise above the challenges and further refine his game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-kerr-kristie-mewis-pregnancy-football-2635526-2024-11-19",
      "headline": "Australia's Sam Kerr announces pregnancy with Kristie MewisAustralia's Sam Kerr and Kristie Mewis of the United States are set to become parents. The duo announced it through an Instagram post on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-marsh-bowler-australia-vs-india-tests-2635496-2024-11-18",
      "headline": "Have put in enough work: Bowler Mitchell Marsh ready to make it happenAUS vs IND: Mitchell Marsh is set to shoulder added responsibility in the bowling department in Cameron Green's absence during the five-match Test series in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-held-by-malaysia-to-1-1-draw-end-2024-winless-2635475-2024-11-18",
      "headline": "India held by Malaysia to 1-1 draw, end 2024 winless Rahul Bheke scored in the 39th minute, but Malaysia held India to a 1-1 draw in the International Friendly on Monday at the Gachibowli Stadium in Hyderabad. With the result, India finished 2024 without winning even one of their 11 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-syed-mushtaq-ali-trophy-2024-25-bengal-border-gavaskar-trophy-2635473-2024-11-18",
      "headline": "Mohammed Shami named in Bengal squad for Syed Mushtaq Ali Trophy 2024-25Star India fast bowler Mohammed Shami has been named in the Bengal squad for the Syed Mushtaq Ali Trophy 2024-25. Shami recently made a comeback to professional cricket in the Ranji Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pakistan-cricket-board-national-womens-championship-team-hotel-fire-2635436-2024-11-18",
      "headline": "Pakistan Cricket Board ends Women's Championship after fire incident The Pakistan Cricket Board (PCB) was forced to suddenly halt the National Women's Championship on Monday after a fire broke out in the team hotel, putting five players in a potentially dangerous situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-finals-rafael-nadal-live-streaming-2635428-2024-11-18",
      "headline": "Rafael Nadal at Davis Cup Finals LIVE Streaming: All you need to knowDavis Cup Finals: Rafael Nadal is all set to be in action when Spain and the Netherlands lock horns in the quarterfinals to be held on November 19 at the Palacio Deportes Martin Carpena in Malaga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-daniel-vettori-ipl-auction-perth-test-2635394-2024-11-18",
      "headline": "Australia assistant coach Vettori chooses IPL auction over Perth Test: ReportBorder Gavaskar Trophy: Australia have been supportive of assistant coach Daniel Vettori's decision to attend the IPL auction in Jeddah during the Perth Test. Vettori is the head coach of SunRisers Hyderabad. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}