{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirav-modis-brother-in-law-maiank-mehta-pardoned-in-rs-13000-crore-pnb-scam-case-2794352-2025-09-27",
      "headline": "Nirav Modi's brother-in-law Maiank Mehta pardoned in Rs 13,000 crore PNB scam caseA special CBI court granted pardon to Maiank Mehta, brother-in-law of fugitive diamantaire Nirav Modi, in the Rs 13,000 crore Punjab National Bank fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-733-points-nifty-below-24700-pharma-it-stocks-hit-hard-2793901-2025-09-26",
      "headline": "Sensex tumbles 733 points as pharma, IT stocks hitThe sell-off came after the United States announced a steep 100% tariff on imports of branded and patented pharmaceutical products, effective October 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-air-passengers-rise-to-1317-lakh-in-august-2025-amid-rising-costs-icra-report-2793857-2025-09-26",
      "headline": "Indian air passengers rise to 131.7 lakh in August 2025 amid rising costs: ReportIndia's aviation sector is bouncing back, but the journey isn't without turbulence. Rising fuel costs, operational challenges, and financial pressures are testing airlines, even as passenger traffic shows steady growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-800-points-nifty-fall-pharma-it-auto-fmcg-shares-trump-announcement-2793865-2025-09-26",
      "headline": "Sensex tanks 800 points: Why is stock market falling today?By 2:37 pm, the S&P BSE Sensex had lost 782.71 points to trade at 80,376.97, while the NSE Nifty50 slipped 247.10 points to 24,643.75. Both indices were on track to end the week in negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/18-upcoming-ipos-next-week-glottis-fabtech-om-freight-advance-agrolife-sme-public-listings-2793844-2025-09-26",
      "headline": "Investors brace for IPO wave as 18 public listings hit Dalal Street next weekThe four mainboard IPOs opening next week together aim to raise over Rs 850 crore. Apart from them, 14 SME IPOs will also open for bidding next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-private-grievance-platforms-claim-denied-2793797-2025-09-26",
      "headline": "Why more insurance policyholders are turning to private grievance platformsAs claim rejections soar and official channels frustrate, policyholders turn to private grievance platforms. Experts warn regulatory reform and competent brokers could restore trust in India's struggling insurance system."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-devara-2-announced-koratala-siva-2794343-2025-09-27",
      "headline": "Jr NTR's Devara 2 announced on first film's anniversary On the first anniversary of 'Devara', the makers have confirmed the much-awaited sequel, 'Devara 2', thrilling fans across the nation. The original film's gripping storyline and Jr NTR's powerful dual roles have set high expectations for the upcoming action-packed continuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-episode-34-farrhana-bhatt-becomes-captain-gaurav-khanna-lashes-out-over-fair-play-2794342-2025-09-27",
      "headline": "Bigg Boss 19 episode 34: Farrhana wins captaincy, Gaurav fumes over unfair decision In the latest episode of 'Bigg Boss 19', Farrhana Bhatt defeated Gaurav Khanna to become the new captain of the house. The loss didn't sit well with Gaurav, who lashed out at the opposition team, demanding fair play and transparency in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-2-first-look-tovino-thomas-dulquer-salmaan-charlie-michael-malayalam-superhero-saga-2794331-2025-09-27",
      "headline": "Lokah 2 first look: Tovino Thomas takes superhero saga ahead, Dulquer Salmaan joins The Lokah universe is set to expand with the official announcement of 'Lokah Chapter 2', featuring Tovino Thomas and Dulquer Salmaan in a darker, thrilling sequel. Following the massive success of 'Lokah Chapter 1: Chandra', fans can expect an ambitious continuation of India's biggest Malayalam superhero saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-namashi-chakraborty-feels-bollywood-needs-talent-not-surnames-2793577-2025-09-27",
      "headline": "Exclusive: Namashi Chakraborty feels Bollywood needs talent, not surnames Actor Namashi Chakraborty, who recently featured in director Vivek Agnihotri's 'The Bengal Files', shared his views on opportunities for young talent, in an interview with IndiaToday.in. He also spoke about his actor father Mithun Chakraborty, films based on real events and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-the-paradise-mohan-babu-is-fierce-in-first-look-as-shikanja-maalik-2794309-2025-09-27",
      "headline": "Nani's The Paradise: Mohan Babu is fierce in first look as Shikanja Maalik Mohan Babu is making a powerful comeback as the menacing villain Shikanja Maalik in Nani's upcoming multi-language film 'The Paradise'. The film, directed by Srikanth Odela, is set for a global release in March 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-celebrates-partner-michael-polansky-42nd-birthday-with-romantic-tribute-2794311-2025-09-27",
      "headline": "Lady Gaga celebrates partner Michael Polansky's 42nd birthday with romantic tribute Lady Gaga celebrated her partner Michael Polansky's 42nd birthday with heartfelt post, calling it her favourite day of the year and praising his achievements. She also expressed gratitude for his support in her personal life and career, including their shared journey with her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-social-reckoning-the-social-network-sequel-announced-releases-in-october-2026-2794294-2025-09-27",
      "headline": "The Social Reckoning: The Social Network sequel set to open on October 9, 2026 Aaron Sorkin is making a comeback with 'The Social Reckoning', a sequel to his 2010 hit 'The Social Network', exploring Facebook's recent turbulent history. The film will spotlight whistleblower Frances Haugen and the controversies that have shaped the social media giant in the last decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/are-thursday-film-premieres-shaking-up-indian-cinema-old-rulebook-pawan-kalyan-og-sunny-sanskari-ki-tulsi-kumari-2792834-2025-09-27",
      "headline": "Are Thursday film premieres shaking up Indian cinema's old rulebook? Indian cinema is shifting gears as Thursday premieres rise alongside the classic Friday release, giving films a longer weekend run. Fuelled by fan frenzy and box office strategy, the trend signals flexibility, but without erasing Friday's cultural pull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-remembers-late-zubeen-garg-with-throwback-photo-urges-for-fast-investigation-2794287-2025-09-27",
      "headline": "Papon remembers late Zubeen Garg with throwback photo, urges for fast investigation Papon paid tribute to late singer Zubeen Garg, sharing memories and calling for a swift investigation into his death. Meanwhile, manager Siddhartha Sharma clarified the ownership of Garg's songs, confirming that earnings from his later works will go to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-giddhs-radhika-lavu-on-national-award-cinema-survival-sanjay-mishra-2793958-2025-09-27",
      "headline": "Exclusive: Giddh's Radhika Lavu on National Award, cinema, survival, Sanjay Mishra National Award-winning filmmaker Radhika Lavu opens up about her short film 'Giddh - The Scavenger', starring Sanjay Mishra. In an exclusive interview, she reflects on cinema, survival, the female gaze, and what her win means for independent and regional storytellers in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-cites-deepika-padukones-schedule-as-cook-dilip-wants-to-invite-star-2794073-2025-09-27",
      "headline": "Farah Khan cites Deepika Padukone's schedule as cook Dilip wants to invite star Farah Khan, who directed Deepika Padukone in her debut film 'Om Shanti Om', recently spoke about the actor's busy schedule. She was responding to her cook, Dilip, who wanted to invite the star for a vlog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-recalls-earning-rs-1000-a-week-with-unusual-demand-from-producer-2794246-2025-09-27",
      "headline": "Saif Ali Khan recalls earning Rs 1,000 a week with unusual demand from producer Saif Ali Khan shared that during his early Bollywood days he earned just Rs 1,000 a week, with the unusual condition of kissing the producer on the cheek ten times. He describes the 1990s as a \"net practice\" era of trial and error, before breaking through with films like 'Dil Chahta Hai' and 'Omkara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-shares-pavitra-rishtas-navratri-memories-with-sushant-singh-rajput-2794241-2025-09-27",
      "headline": "Ankita Lokhande shares Pavitra Rishta's Navratri memories with Sushant Singh Rajput Ankita Lokhande recently shared a nostalgic 'Pavitra Rishta' clip featuring late Sushant Singh Rajput, recalling their iconic on-screen chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-box-office-day-2-pawan-kalyan-film-slows-down-after-huge-opening-2794227-2025-09-27",
      "headline": "They Call Him OG box office day 2: Pawan Kalyan film slows down after huge opening Pawan Kalyan's 'They Call Him OG' shattered records with a Rs 100 crore India opening and Rs 144 crore worldwide debut, surpassing Rajinikanth's 'Coolie' and Prabhas' 'Saaho'. Despite a sharp day-two drop, the gangster action thriller continues its strong box office run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-box-office-collection-day-1-india-oscar-entry-sees-a-rs-30-lakh-opening-2794221-2025-09-27",
      "headline": "Homebound box office day 1: India's Oscar entry sees a Rs 30 lakh opening Neeraj Ghaywan's Oscar entry 'Homebound' opened to a modest Rs 30 lakh at the Indian box office, despite international acclaim and a star cast of Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-reacts-to-wearing-daughter-adira-initials-to-national-film-awards-2794147-2025-09-26",
      "headline": "Rani Mukerji reacts to wearing daughter Adira initials to National Film Awards Rani Mukerji shared the heartfelt reason behind the customised necklace bearing her daughter's initials at the National Film Awards, symbolising her daughter's presence on her special day. She also spoke about women's freedom to choose their paths in a male-dominated industry during the India Today Conclave Mumbai 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-tina-are-still-relevant-rani-mukerji-cherishes-national-award-win-with-srk-2794143-2025-09-26",
      "headline": "Rahul-Tina are still relevant: Rani Mukerji cherishes National Award-win with SRK Actor Rani Mukerji appeared at India Today Conclave Mumbai 2025 for the session titled, 'Queen of Reinvention: National Award to Motherhood, Winning it All'. She shared her Rahul Tina moment at the National Award and also spoke about her character in 'Mrs. Chatterjee vs Norway'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/backstage-siblings-from-living-room-jams-to-sold-out-shows-2794131-2025-09-26",
      "headline": "Backstage Siblings: From living room jams to sold-out shows Backstage Siblings, India's first jamming band by siblings Raghav and Prachi, performed on Day 2 of India Today Conclave Mumbai 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-says-her-father-was-heartbroken-on-national-award-snub-for-black-2794102-2025-09-26",
      "headline": "Rani Mukerji says her father was heartbroken on National Award snub for Black Actor Rani Mukerji spoke at India Today Conclave Mumbai 2025. She recalled the time when her father was heartbroken over her not winning a National Award for Sanjay Leela Bhansali's 'Black'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-tears-into-pakistan-at-un-pakistan-prime-minister-shehbaz-sharif-operation-sindoor-unga-session-petal-gahlot-2794279-2025-09-27",
      "headline": "If destroyed runways look like victory...: India tears into Pakistan at UNIndia hit back at Pakistan Prime Minister Shehbaz Sharif's UNGA speech, mocking his \"victory\" claim in the May 7-10 conflict and blasting Islamabad for glorifying terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-may-extend-parliamentary-panels-terms-by-2-years-boost-for-shashi-tharoor-2794244-2025-09-27",
      "headline": "Centre may extend Parliamentary panels' terms by 2 years, boost for Shashi TharoorWhile changes in committee chairs are unlikely, Congress MP Shashi Tharoor, who chairs the external affairs committee, could retain his position for another two years despite recent differences with his party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-sri-lanka-super-4-dew-dubai-heat-pakistan-2794228-2025-09-27",
      "headline": "Cramps and dew: IND vs PAK final could turn out to be very different tomorrowIndia brushed aside Pakistan in two back-to-back matches in the Asia Cup. But if Friday's game against Sri Lanka is any indication, the final could turn out to be far trickier than expected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/handcuffed-feet-tied-71-year-old-punjab-grandmother-deported-from-us-recounts-ordeal-watch-video-2794358-2025-09-27",
      "headline": "Handcuffed, feet tied: Punjab grandmother, 71, deported from US recounts ordealSpeaking to reporters, Kaur said she has been under deportation proceedings since 2012 due to not having a passport, although she held a valid work permit and other identification documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/what-is-otrovert-personality-trait-word-coined-by-rami-kaminski-2793156-2025-09-27",
      "headline": "How Dr Rami Kaminski coined 'otrovert', the word Internet can't stop talking aboutThere's a new personality trait on the block, and it's all over the internet. You have probably already come across it. The man who coined it, Dr. Rami Kaminski, in an exclusive conversation with India Today, decodes the term. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/barack-obama-donald-trump-old-men-white-house-dictator-autism-paracetamol-link-claims-2794326-2025-09-27",
      "headline": "Did Obama troll Trump? Ex-US President says 80% of world's problems involve old menIn remarks seen as a barb at US President Donald Trump, former President Barack Obama said \"80 per cent of the world's problems involved old men hanging on, building pyramids and putting their names on everything\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bareilly-i-love-muhammad-protest-clashes-police-action-violence-2794163-2025-09-26",
      "headline": "UP cleric Tauqeer Raza, key accused in 'I Love Muhammad' row in Bareilly, arrestedViolence broke out in Bareilly after a proposed 'I Love Muhammad' march, leading to stone-pelting and vandalism near mosques and marketplaces. Police have lodged 11 FIRs against over 2,000 people and arrested cleric Tauqeer Raza Khan, naming him in two cases along with several IMC functionaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-para-athletics-championships-2025-india-hosts-devendra-jhajharia-exclusive-2794332-2025-09-27",
      "headline": "How India brought its first-ever World Para Athletics Championships to DelhiThe World Para Athletics Championships kicked off in New Delhi's Jawaharlal Nehru Stadium on Saturday, September 27. IndiaToday.in spoke to Devendra Jhajharia about what went on behind the scenes to bring the event to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-devara-2-announced-koratala-siva-2794343-2025-09-27",
      "headline": "Jr NTR's Devara 2 announced on first film's anniversaryOn the first anniversary of 'Devara', the makers have confirmed the much-awaited sequel, 'Devara 2', thrilling fans across the nation. The original film's gripping storyline and Jr NTR's powerful dual roles have set high expectations for the upcoming action-packed continuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-bsnls-swadeshi-4g-network-commissions-nearly-98000-mobile-4g-towers-from-odisha-2794310-2025-09-27",
      "headline": "PM unveils BSNL's swadeshi 4G network, commissions 97,500 towersPM also commissioned more than 97,500 mobile 4G towers built by BSNL, including 92,600 sites featuring the new 4G technology. The towers, established at a cost of around Rs 37,000 crore, use entirely indigenous technology, positioning India among a select group of nations with domestic telecom manufacturing capabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gurugram-thar-accident-four-dead-as-thar-crashes-into-divider-on-gurugram-highway-2794219-2025-09-27",
      "headline": "5 killed as speeding Thar crashes into divider on national highway in GurugramAccording to police sources, all the victims were wearing wristbands from a pub, suggesting that they had likely attended a late-night party before arriving at Jharsa Chowk, where the accident took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/bangladeshi-diaspora-protests-muhammad-yunus-un-minority-violence-video-glbs-2794200-2025-09-27",
      "headline": "Go back to Pakistan: Bangladeshi Diaspora Protests against Yunus outside UNMembers of the Bangladeshi diaspora held a protest outside the United Nations in New York against interim chief adviser Muhammad Yunus, citing increased atrocities on minorities. The demonstration reflected ongoing unrest and deepening divisions following last year's regime change in Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-cites-deepika-padukones-schedule-as-cook-dilip-wants-to-invite-star-2794073-2025-09-27",
      "headline": "Farah Khan cites Deepika Padukone's schedule as cook Dilip wants to invite starFarah Khan, who directed Deepika Padukone in her debut film 'Om Shanti Om', recently spoke about the actor's busy schedule. She was responding to her cook, Dilip, who wanted to invite the star for a vlog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ai-could-replace-40-per-cent-of-jobs-soon-and-superintelligence-may-arrive-by-2030-sam-altman-2794295-2025-09-27",
      "headline": "AI could replace 40 per cent of jobs soon: Sam AltmanOpenAI CEO Sam Altman predicts AI will achieve superintelligence by 2030, transforming science and work. His vision highlights rapid AI progress and the need to align technology with human values. But, on the contrary, this development will lead to massive job loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-2-first-look-tovino-thomas-dulquer-salmaan-charlie-michael-malayalam-superhero-saga-2794331-2025-09-27",
      "headline": "Lokah 2 first look: Tovino Thomas takes superhero saga ahead, Dulquer Salmaan joinsThe Lokah universe is set to expand with the official announcement of 'Lokah Chapter 2', featuring Tovino Thomas and Dulquer Salmaan in a darker, thrilling sequel. Following the massive success of 'Lokah Chapter 1: Chandra', fans can expect an ambitious continuation of India's biggest Malayalam superhero saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-senator-tom-cotton-backs-donald-trumps-h-1b-crackdown-plans-2-new-bills-to-put-american-workers-first-2794250-2025-09-27",
      "headline": "US Senator backs Trump's H-1B crackdown, plans bills to put American workers firstSenator Tom Cotton threw his weight behind H-1B visa reforms, saying he will soon introduce legislation to tighten oversight and put American workers first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-shares-french-husbands-monthly-marriage-review-viral-x-post-2794304-2025-09-27",
      "headline": "French man's monthly 'marriage review' for Indian wife leaves Internet in splitsAn Indian woman has shared her French husband's witty monthly \"marriage review,\" and social media can't get enough of their candid approach to love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-528-26-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/apple-airpods-pro-3-review-better-anc-heart-rate-monitoring-and-different-sound-2794284-2025-09-27",
      "headline": "Apple AirPods Pro 3 review: Better ANC, heart rate monitoring, and different soundHow do you surpass a product that is already almost perfect? That is the dilemma Apple has faced when it comes to AirPods Pro. And it is evident in the newly-launched AirPods Pro 3, which is better in some aspects but doesn't feel like an upgrade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-influencers-share-videos-of-navratri-celebrations-they-go-viral-2794341-2025-09-27",
      "headline": "Pakistani influencers share videos of Navratri celebrations, they go viralPakistani influencers shared videos of Navratri celebrations that have gone viral on social media. The clips show crowds joyfully performing garba and dandiya, with Goddess Durga's idol placed in the pandals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/are-thursday-film-premieres-shaking-up-indian-cinema-old-rulebook-pawan-kalyan-og-sunny-sanskari-ki-tulsi-kumari-2792834-2025-09-27",
      "headline": "Are Thursday film premieres shaking up Indian cinema's old rulebook?Indian cinema is shifting gears as Thursday premieres rise alongside the classic Friday release, giving films a longer weekend run. Fuelled by fan frenzy and box office strategy, the trend signals flexibility, but without erasing Friday's cultural pull."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/undertrial-claims-torture-in-up-jail-drinks-powdered-glass-with-water-2794340-2025-09-27",
      "headline": "Chaos at court: Undertrial claims torture in jail, drinks powdered glass with waterThe prisoner, lodged in Mahoba jail on rape charges, claimed he drank powdered glass after alleged torture by fellow inmates. He was rushed to hospital and later referred to a medical college, officials said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/hyderabad-flood-heavy-rain-pounds-hyderabad-roads-flooded-thousands-evacuated-as-river-musi-overflows-2794258-2025-09-27",
      "headline": "Heavy rain pounds Hyderabad, roads flooded, 1,000 evacuated as River Musi overflowsThe heavy rain has put low-lying areas at risk, with Telangana Chief Minister Revanth Reddy instructing officials to evacuate people immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/great-sanskrit-riddle-why-seats-remain-unfilled-at-top-delhi-university-colleges-2794320-2025-09-27",
      "headline": "The Great Sanskrit Riddle: Why few study it when it's basking in renewed glory?Despite Delhi University's prestige and government support for Sanskrit, admissions for the subject remain low, as students increasingly opt for in-demand courses, leaving several seats vacant even in top colleges."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-devi-wins-silver-bronze-para-archery-world-championships-2025-2794354-2025-09-27",
      "headline": "Sheetal Devi clinches silver and bronze in World Archery Para C'ships team events Paris Paralympics bronze medallist Sheetal Devi shone at the Para Archery World Championships in South Korea, winning silver in the women's team and bronze in the mixed team events on September 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-para-athletics-championships-2025-india-hosts-devendra-jhajharia-exclusive-2794332-2025-09-27",
      "headline": "How India brought its first-ever World Para Athletics Championships to Delhi The World Para Athletics Championships kicked off in New Delhi's Jawaharlal Nehru Stadium on Saturday, September 27. IndiaToday.in spoke to Devendra Jhajharia about what went on behind the scenes to bring the event to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-backs-jemimah-rodrigues-womens-world-cup-2025-2794330-2025-09-27",
      "headline": "Suryakumar backs Jemimah to fire in Women's World Cup: We learn a lot from her Suryakumar Yadav has backed Jemimah Rodrigues to shine in the Women's World Cup 2025, praising her calmness, positivity, and ability to perform under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-super-over-win-sri-lanka-pakistan-asia-cup-final-morne-morkel-2794329-2025-09-27",
      "headline": "India's super over win vs Sri Lanka good preparation for Asia Cup final: Morkel India bowling coach Morne Morkel feels that the super over thriller against Sri Lanka was the right way to prepare for the upcoming Asia Cup 2025 final against Pakistan. India edged past the Lankan Lions after holding their nerves in the tense clash on Saturday, September 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-vs-sri-lanka-abhishek-sharma-sanath-jayasuriya-dubai-2794321-2025-09-27",
      "headline": "IND vs SL: Is Abhishek Sharma Sanath Jayasuriya 2.0? Sri Lanka coach responds Sanath Jayasuriya heaped praise on Abhishek Sharma and said that he could see shades of himself in the Indian opener. Abhishek scored his third consecutive fifty of the tournament in the Super 4s clash against Sri Lanka in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-2025-abhishek-sharma-fails-no-panic-gavaskar-2794293-2025-09-27",
      "headline": "What if Abhishek Sharma fails in Asia Cup final? No need to panic, says Gavaskar Sunil Gavaskar has claimed that India doesn't need to panic in the Asia Cup final even if Abhishek Sharma suffers a rare failure. Gavaskar backed the rest of the batters to step up in such a situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-interview-suryakumar-yadav-assess-pitch-asia-cup-2025-final-pakistan-2794292-2025-09-27",
      "headline": "Sunil Gavaskar's advice for Suryakumar Yadav before final: Give yourself 3 to 4 balls Asia Cup 2025, IND vs PAK: Legendary batter Sunil Gavaskar advised Suryakumar Yadav to take a few deliveries in the middle to assess pitch conditions before playing his natural game in the final against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-consoles-dunith-wellalage-india-win-asia-cup-super-over-thriller-2794249-2025-09-27",
      "headline": "Watch: Suryakumar Yadav consoles Dunith Wellalage after India's Super Over win Indian captain Suryakumar Yadav consoled Sri Lanka's Dunith Wellalage on-field after their Super 4 clash, showing empathy following Wellalage's recent bereavement. India narrowly defeated Sri Lanka on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-powerplay-strategy-morne-morkel-asia-cup-2025-ind-vs-pak-final-2794254-2025-09-27",
      "headline": "Powerplay boom: Jasprit Bumrah's use in 1st six overs defended by India bowling coach India bowling coach Morne Morkel has defended the use of Jasprit Bumrah in the powerplay overs during the Asia Cup 2025. Bumrah has five wickets in four matches so far in the Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-backs-arshdeep-singh-asia-cup-final-performance-sri-lanka-2794243-2025-09-27",
      "headline": "Clutch Arshdeep Singh deserves to play Asia Cup final: Irfan Pathan Irfan Pathan backed Arshdeep Singh for a spot in the Asia Cup final clash against Pakistan after his match-winning display against Sri Lanka, praising his yorker skills alongside Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-sarita-history-world-archery-para-championships-2025-2794242-2025-09-27",
      "headline": "World Archery Para C'ships: Sheetal, Sarita storm into women's compound team final Sheetal Devi and Sarita pulled off a stunning performance to defeat the top-seeded Phoebe Paterson Pine and Jessica Stretton of Great Britain to reach the final of the women's compound team event on Friday, September 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-interview-suryakumar-yadav-assess-pitch-asia-cup-2025-final-pakistan-2794292-2025-09-27",
      "headline": "Sunil Gavaskar's advice for Suryakumar Yadav before final: Give yourself 3 to 4 balls Asia Cup 2025, IND vs PAK: Legendary batter Sunil Gavaskar advised Suryakumar Yadav to take a few deliveries in the middle to assess pitch conditions before playing his natural game in the final against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-consoles-dunith-wellalage-india-win-asia-cup-super-over-thriller-2794249-2025-09-27",
      "headline": "Watch: Suryakumar Yadav consoles Dunith Wellalage after India's Super Over win Indian captain Suryakumar Yadav consoled Sri Lanka's Dunith Wellalage on-field after their Super 4 clash, showing empathy following Wellalage's recent bereavement. India narrowly defeated Sri Lanka on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-powerplay-strategy-morne-morkel-asia-cup-2025-ind-vs-pak-final-2794254-2025-09-27",
      "headline": "Powerplay boom: Jasprit Bumrah's use in 1st six overs defended by India bowling coach India bowling coach Morne Morkel has defended the use of Jasprit Bumrah in the powerplay overs during the Asia Cup 2025. Bumrah has five wickets in four matches so far in the Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-backs-arshdeep-singh-asia-cup-final-performance-sri-lanka-2794243-2025-09-27",
      "headline": "Clutch Arshdeep Singh deserves to play Asia Cup final: Irfan Pathan Irfan Pathan backed Arshdeep Singh for a spot in the Asia Cup final clash against Pakistan after his match-winning display against Sri Lanka, praising his yorker skills alongside Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-sarita-history-world-archery-para-championships-2025-2794242-2025-09-27",
      "headline": "World Archery Para C'ships: Sheetal, Sarita storm into women's compound team final Sheetal Devi and Sarita pulled off a stunning performance to defeat the top-seeded Phoebe Paterson Pine and Jessica Stretton of Great Britain to reach the final of the women's compound team event on Friday, September 26. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}