{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-is-now-tax-free-check-who-benefits-and-how-income-tax-exemption-2759508-2025-07-22",
      "headline": "NOIDA is now tax-free. Check who benefits and howAt a time when cities are competing hard to attract businesses and investors, this tax relief could give NOIDA a fresh edge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-receives-plea-to-cut-28-percent-gst-on-aerated-drinks-2759502-2025-07-22",
      "headline": "Government receives plea to cut 28% GST on aerated drinksThe matter is likely to be taken up at the upcoming 56th GST Council meeting, expected to be held in mid-August. The meeting is already set to review a broader rate rationalisation framework, with officials indicating that certain slabs and cesses may be simplified or merged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ex-icici-ceo-chanda-kochhar-rs-64-crore-vibe-videocon-tribunal-bribe-case-report-2759484-2025-07-22",
      "headline": "Chanda Kochhar found guilty in Rs 64-crore Videocon bribe case: ReportAn appellate tribunal gave this ruling in an order dated July 3. The tribunal said that the money was routed through Kochhar's husband Deepak Kochhar, using a company connected to Videocon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-indian-homebuyers-growing-wealth-or-buying-liabilities-explains-consultant-2759436-2025-07-22",
      "headline": "Are Indian homebuyers growing wealth or buying liabilities? Explains consultantA real-estate consultant points out that the middle class often assumes owning a house means they are moving forward, but in reality, possession alone does not guarantee real financial progress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-rcom-fraud-sbi-allegation-cbi-case-trouble-reliance-communications-2759429-2025-07-22",
      "headline": "SBI to approach CBI after tagging Anil Ambani and RCom as 'fraud'SBI's exposure to Reliance Communications includes a fund-based principal outstanding of Rs 2,227.64 crore, along with interest and expenses since August 26, 2016. In addition, there is a non-fund based bank guarantee exposure of Rs 786.52 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-stricter-digital-banking-rules-what-it-means-for-you-2759405-2025-07-22",
      "headline": "RBI proposes stricter digital banking rules: What it means for youTo keep online fraud in check, all banks must use proper fraud detection tools and keep an eye on unusual transactions. They should also study how customers usually spend money so that any odd activity can be spotted quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-ban-sebi-removal-with-conditions-investigation-ongoing-stock-market-manipulation-2759369-2025-07-22",
      "headline": "Sebi clears Jane Street to resume trading, with strings attachedJane Street was allowed to return to the markets after it complied with a key part of Sebi's interim order. The firm deposited Rs 4,844 crore in an escrow account held with a scheduled commercial bank in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-see-sharp-rally-after-q1-results-buy-sell-or-hold-2759367-2025-07-22",
      "headline": "Eternal shares see sharp rally after Q1 results. Buy, sell or hold?The rally comes on the back of strong performance across verticals, with quick commerce overtaking food delivery in terms of Net Order Value (NOV) for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-jump-14-after-q1-results-check-target-price-brokerage-views-2759364-2025-07-22",
      "headline": "Eternal shares jump 14% after Q1 results. Check target price, brokerage viewsThe stock rose 13.38% to Rs 307.50 on the Bombay Stock Exchange at 9:34 am, crossing the Rs 300 milestone for the first time and extending its recent upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-md-anup-kumar-resigns-fuels-buzz-around-indusind-bank-ceo-role-2759355-2025-07-22",
      "headline": "Bajaj Finance MD Anup Kumar Sinha resigns amid IndusInd Bank CEO role buzBajaj Finance shares were up 0.82% on the Bombay Stock Exchange around 9:17 am, while IndusInd Bank rose nearly 2.4%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rally-sensex-opens-267-points-higher-nifty-above-25100-eternal-jumps-10-2759351-2025-07-22",
      "headline": "Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%The S&P BSE Sensex was up by 204.96 points to 82,405.30, while the NSE Nifty5o gained 43.90 points to 25,123.55 as of 9:30 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hrithik-roshan-calls-vir-das-fool-volume-the-best-stand-up-reinstalls-app-to-say-2759489-2025-07-22",
      "headline": "Hrithik Roshan calls Vir Das Fool Volume best stand-up everHrithik Roshan praised Vir Das' Netflix special 'Fool Volume', calling it the best stand-up show ever. The actor shared that he even reinstalled Instagram just to say so. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-undergoes-anti-ageing-laser-treatment-to-look-youthful-in-next-decade-report-2759402-2025-07-22",
      "headline": "Angelina Jolie undergoes laser treatments to look youthful in next decade: ReportIn a bid to look youthful, Hollywood actor Angelina Jolie has reportedly undergone serious laser treatments. The 50-year-old prioritises self-care with dermatologist's assistance. She is said to be no stranger to Botox and has been using it for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-daughter-malti-marie-steals-the-spotlight-with-her-princess-moment-2759414-2025-07-22",
      "headline": "Priyanka Chopra's daughter Malti steals the spotlight with her princess momentPriyanka Chopra shared adorable new photos of her daughter Malti Marie, delighting fans with glimpses of her playful and princess-like moments. Earlier, the actor shared that Malti loves the Disney character Moana and dressing up, and has even started calling herself 'Malti Marie Moana Chopra Jonas.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-meme-on-taking-ranveer-singh-opinion-is-every-couple-ever-2759447-2025-07-22",
      "headline": "Deepika's meme about taking Ranveer's advice has every couple relatingDeepika Padukone shared a funny meme about asking Ranveer Singh's opinion after already making a decision, giving fans a peek into their playful relationship. The couple, who became parents last year, often share light-hearted moments that fans love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-back-home-recovering-from-dengue-to-begin-kingdom-promotions-2759498-2025-07-22",
      "headline": "Vijay Deverakonda back home recovering from dengue, to begin Kingdom promotionsVijay Deverakonda was discharged from a private hospital after recovering from dengue. He will kickstart 'Kingdom' promotions soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-calls-her-and-hrithik-roshan-og-crushes-amid-saiyaara-vs-kaho-naa-pyaar-hai-comparison-2759441-2025-07-22",
      "headline": "Ameesha Patel calls her and Hrithik OG crushes amid Saiyaara vs Kaho Naa comparisonActor Ameesha Patel recently addressed ongoing comparisons between 'Saiyaara' and 'Kaho Naa... Pyaar Hai'. She called her and Hrithik Roshan the OG crushes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-release-rs-600-for-early-premiere-shows-andhra-pradesh-telangana-2759475-2025-07-22",
      "headline": "Hari Hara Veera Mallu: Rs 600 for premiere shows, Rs 12.5 crore in pre-salesPawan Kalyan's 'Hari Hara Veera Mallu', will have special premiere shows in Andhra Pradesh and Telangana on July 24 at 9 pm. The two governments have given permission to cap the ticket price at Rs 600. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-to-handle-kajol-and-twinkle-khanna-bring-drama-and-fun-to-new-talk-show-2759466-2025-07-22",
      "headline": "Two Much to handle? Kajol and Twinkle Khanna bring drama and fun to new talk showKajol and Twinkle Khanna bring their candid personalities to the new talk show 'Two Much', featuring open discussions on relatable topics. The series will be streaming soon on Prime Video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raashii-khanna-joins-pawan-kalyan-sreeleela-ustaad-bhagat-singh-2759421-2025-07-22",
      "headline": "Raashii Khanna joins Pawan Kalyan, Sreeleela in Ustaad Bhagat Singh'Thiruchitrambalam' actor Raashii Khanna has joined the cast of the upcoming Telugu film 'Ustaad Bhagat Singh', starring actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-bandar-premiere-toronto-film-festival-2025-2759449-2025-07-22",
      "headline": "Anurag Kashyap, Bobby Deol's Bandar to premiere at Toronto Film FestivalAnurag Kashyap's new film 'Bandar', starring Bobby Deol and Sanya Malhotra, is set to premiere at the Toronto International Film Festival 2025. The film, inspired by true events, marks a significant milestone for Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-dating-rumours-denied-saiyaara-box-office-success-2759409-2025-07-22",
      "headline": "Saiyaara actor Ahaan Panday is not dating Shruti Chauhan: Source'Saiyaara' actor Ahaan Panday is at the centre of dating rumours with Shruti Chauhan. However, sources have dismissed the speculation, emphasising genuine professional admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-war-2-trailer-to-release-on-this-day-mark-your-calendars-2759407-2025-07-22",
      "headline": "Hrithik Roshan-Jr NTR's War 2 trailer to release on this day - mark your calendars!The trailer for 'War 2', starring Hrithik Roshan, Jr NTR and Kiara Advani, will release this month. The film is set for a grand release on August 14 as a big Independence Day experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-4-detailed-report-yrf-unlocks-smashing-monday-rs-150-crore-week-ahead-2759403-2025-07-22",
      "headline": "Saiyaara box office Day 4: YRF unlocks smashing Monday, Rs 150 crore week aheadSaiyaa box office Day 4: YRF's new love story is winning the hearts of the audience. The Mohit Suri-directorial has already crossed the benchmark of Rs 100 crore and is looking at wrapping up its first week at around Rs 150 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-denies-dating-elli-avrram-calls-her-difficult-to-work-with-music-video-chaandaniya-2759380-2025-07-22",
      "headline": "Ashish Chanchlani says he could never date Elli AvrRam. Here's whyInfluencer Ashish Chanchlani and actor Elli AvrRam addressed dating rumours in a recent live session on Instagram. Chanchlani denied dating the actor and shared the challenges of working with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-flies-to-sri-lanka-for-daughters-birthday-before-ssmb29-shoot-2759135-2025-07-22",
      "headline": "Mahesh Babu flies to Sri Lanka for a quick getaway with family amid SSMB 29 shootTelugu actor Mahesh Babu flew to Sri Lanka with his family to celebrate daughter Sitara's birthday. The actor will resume shooting for SS Rajamouli's 'SSMB 29' soon, with Priyanka Chopra, Prithviraj and R Madhavan likely to join the ensemble cast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-clears-rs-600-premiere-ticket-hikes-for-pawan-kalyans-hari-hara-veera-mallu-despite-revanth-reddys-earlier-ban-after-pushpa-2-stampede-allu-arjun-2759386-2025-07-22",
      "headline": "Telangana okays premiere, price hike for Pawan Kalyan film despite Pushpa 2 tragedyThe Telangana government approved a Rs 600 premiere and ticket hikes for Pawan Kalyan's Hari Hara Veera Mallu, sparking a political row. This contradicts Revanth Reddy's earlier vow to ban such privileges after the Pushpa 2 stampede. Producer AM Rathnam credited Rohin Reddy, Revanth Reddy's aide, for securing permissions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-varun-dhawan-ranveer-singh-praise-ahaan-panday-aneet-padda-film-saiyaara-2759346-2025-07-22",
      "headline": "Saiyaara se Aashiqui: Shraddha, Varun and Ranveer praise Ahaan and Aneet's filmActors Shraddha Kapoor, Varun Dhawan and Ranveer Singh have praised the recently released 'Saiyaara' on social media. The film stars newcomers Ahaan Panday and Aneet Padda in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ramayana-hopes-mahavatar-narasimha-director-ashwin-kumar-exclusive-2759368-2025-07-22",
      "headline": "All hopes on Ramayana now: Mahavatar Narsimha director Ashwin Kumar | ExclusiveAshwin Kumar reflects on the setbacks of Adipurush and the enduring appeal of Bharat's ancient stories. He shares optimism about the high-budget Ramayana duologyand the growing demand for culturally rooted Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-fahadh-faasil-nazriya-nazim-hridayapoorvam-moment-2759350-2025-07-22",
      "headline": "Mohanlal, Fahadh and Nazriya's night to remember after viral Hridayapoorvam momentMohanlal, his family, Fahadh Faasil and Nazriya enjoyed a get-together with their friends. This celebration comes after the release of 'Hridayapoorvam' teaser."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-got-many-opportunities-to-serve-country-wish-him-good-health-pm-after-veeps-resignation-2759439-2025-07-22",
      "headline": "He got many opportunities to serve India: PM after Jagdeep Dhankhar's resignationVice President Jagdeep Dhankhar resignation on the opening day of the Monsoon Session has sparked a political storm, with opposition parties expressing bafflement over the sudden move.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-2025-live-bihar-sir-pahalgam-oppsition-mps-lok-sabha-rahul-gandhi-modi-2759323-2025-07-22",
      "headline": "Live: Both houses of Parliament adjourned amid Opposition uproarParliament Session Live Updates: The Monsoon Session resumed at 11 am on Tuesday after a stormy start marked by repeated adjournments and Jagdeep Dhankhar's surprise resignation as the Vice President. There was a meeting of floor leaders of both Lok Sabha and Rajya Sabha, with Leader of Opposition Rajya Sabha Mallikarjun Kharge and Leader of Opposition Lok Sabha Rahul Gandhi present. Several opposition MPs have moved adjournment notices seeking a debate on alleged irregularities in Bihar's voter rolls. Meanwhile, a motion to remove a High Court judge Yashwant Varma, signed by several opposition MPs, has been filed with the Rajya Sabha Chairman. A similar notice, backed by 152 MPs including Rahul Gandhi, has gone to the Lok Sabha Speaker. Sources said both Houses may admit the motions and begin forming an enquiry committee under the Judges (Enquiry) Act. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-resignation-vice-president-reasons-theories-bihar-elections-snub-2759444-2025-07-22",
      "headline": "3 theories floating on Jagdeep Dhankhar's shock exit as Vice PresidentOn Monday, in a surprising move, Jagdeep Dhankhar resigned as Vice President, citing health concerns. The reason, however, had few takers. It has led to a flurry of speculation in political circles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-issues-found-air-india-completes-fuel-control-switch-inspection-of-boeing-787-737-fleets-2759507-2025-07-22",
      "headline": "No issues found: Air India completes fuel control switch checks on Boeing fleetAir India says it has found no faults in the fuel control switch locking mechanism across its Boeing 787 and 737 fleets, after inspections ordered by the aviation regulator following the June 12 Ahmedabad plane crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iconic-fighter-jet-mig-21-to-retire-after-62-years-ceremonial-send-off-on-september-19-2759481-2025-07-22",
      "headline": "Fighter jet MiG-21 to be retired after 62 years, ceremonial send-off in SeptemberThe iconic fighter jet MiG-21, which was key in major conflicts, including the 1965 and 1971 wars, the Kargil War, and Operation Sindoor, is set to be retired by the Indian Air Force."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delay-apache-indian-army-aviation-corps-united-states-2759452-2025-07-22",
      "headline": "Apache helicopters finally arrive after 15-month delay, Army hails milestone momentSources aware of the schedule have confirmed that the freshly received helicopters are to be assembled and inspected before they are handed to the Indian Army's Aviation Corps."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-collapsed-during-an-event-in-delhi-rajya-sabha-parliament-vice-president-resignation-lok-sabha-monsoon-2759496-2025-07-22",
      "headline": "Jagdeep Dhankhar collapsed during an event in Delhi on July 17: SourcesJagdeep Dhankhar had collapsed during an event in Delhi on July 17, days before his resignation as Vice President citing health reasons, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-rivals-ideate-nitish-kumar-inks-the-script-behind-the-bihar-election-sop-story-2025-bihar-assembly-elections-2759029-2025-07-21",
      "headline": "What rivals ideate, Nitish inks: The script behind the Bihar election sop storyCall him a borrower of plans or a master of the political long game, Nitish Kumar may well be turning Opposition blueprints into a poll-winning manifesto of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-royal-navys-f-35-flies-out-of-keralas-thiruvananthapuram-airport-after-being-stranded-for-37-days-2759389-2025-07-22",
      "headline": "After month-long snag in Kerala, British F-35 fighter jet finally flies homeAfter being grounded for over a month due to a technical glitch, the British F-35 fighter jet stationed at Thiruvananthapuram International Airport finally flies back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-refuses-to-stay-qr-code-order-for-eateries-along-kanwar-yatra-route-in-up-uttarakhand-2759459-2025-07-22",
      "headline": "Supreme Court refuses to halt QR code order for Kanwar Yatra eateries for nowThe Supreme Court, noting that Tuesday was the last day of the Kanwar Yatra, said it would not go into the legality of the directives by UP and Uttarakhand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-shubhanshu-shukla-shows-his-recovery-regimen-after-space-mission-2759497-2025-07-22",
      "headline": "Video: Shux going through intense recovery regimen after space missionKnown for his calm demeanour and passion for space exploration, Shukla described the profound effects of microgravity on the human body during spaceflight and the challenges faced upon returning to Earth's gravity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-carens-clavis-ev-review-first-drive-is-this-the-family-ev-india-has-been-waiting-for-2759434-2025-07-22",
      "headline": "Kia Carens Clavis EV review, first drive: Is this the family EV India has been waiting forKia has launched the electric version of their recently introduced MPV, the Carens Clavis. So is this the everyday EV India has been waiting for? We find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhars-recent-remarks-in-focus-after-sudden-exit-will-retire-in-august-2027-2759468-2025-07-22",
      "headline": "Will retire in 2027: Jagdeep Dhankhar's 10-day-old video in focus after sudden exitA video of Vice President Jagdeep Dhankhar saying he would retire in 2027 has resurfaced amid speculation over his sudden resignation citing medical reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-rajya-sabha-business-advisory-jp-nadda-kiren-rijiju-parliament-2759363-2025-07-22",
      "headline": "Was Jagdeep Dhankhar snubbed? Ministers' no-show at meet fuels resignation rowJagdeep Dhankhar was allegedly disappointed over the absence of key ministers JP Nadda and Kiren Rijiju at the crucial Business Advisory Committee meeting on Monday evening.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pulls-up-cbi-dont-have-guts-misses-indiabulls-housing-finance-hearing-2759344-2025-07-22",
      "headline": "Don't even have guts to come here? Supreme Court blasts CBI for no-showThe top court was hearing a petition challenging the Delhi High Court's order rejecting a plea for a court-monitored probe into allegations of siphoning of funds by Indiabulls Housing Finance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/uorfi-javed-botched-lip-viral-video-what-to-keep-in-mind-before-getting-a-lip-filler-2759150-2025-07-22",
      "headline": "What to keep in mind before getting a lip filler?The stigma associated with beauty-enhancement cosmetic procedures, such as lip fillers and Botox, has subsided over time. Celebrities now openly discuss it even when it goes wrong (Uorfi Javed, for instance).  If you are someone planning to get one, there are things that you should know."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-rcom-fraud-sbi-allegation-cbi-case-trouble-reliance-communications-2759429-2025-07-22",
      "headline": "SBI to approach CBI after tagging Anil Ambani and RCom as 'fraud'SBI's exposure to Reliance Communications includes a fund-based principal outstanding of Rs 2,227.64 crore, along with interest and expenses since August 26, 2016. In addition, there is a non-fund based bank guarantee exposure of Rs 786.52 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/raghav-chadha-pushes-for-free-yearly-health-check-ups-amid-post-covid-heart-attack-risks-2759415-2025-07-22",
      "headline": "Raghav Chadha pushes for free yearly health check-ups amid post-Covid heart risksRaghav Chadha urged making annual health check-ups a legal right, highlighting rising heart attacks and health issues in India post Covid-19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-are-what-we-think-how-to-rewire-the-brain-change-our-future-2759025-2025-07-21",
      "headline": "We are what we think: How to rewire the brain, change our futureFive ways to break out of deep-seated, limiting notions and embrace life-changing personal growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-meme-on-taking-ranveer-singh-opinion-is-every-couple-ever-2759447-2025-07-22",
      "headline": "Deepika's meme about taking Ranveer's advice has every couple relatingDeepika Padukone shared a funny meme about asking Ranveer Singh's opinion after already making a decision, giving fans a peek into their playful relationship. The couple, who became parents last year, often share light-hearted moments that fans love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankar-resigns-health-reasons-political-speculation-congress-india-bloc-parliament-lok-sabha-rajya-sabha-monsoon-2759318-2025-07-22",
      "headline": "Despite frequent run-ins, why Veep's surprise exit left Opposition in disbeliefVice President Jagdeep Dhankhar's sudden resignation citing health reasons has taken both the ruling and opposition parties by surprise. The unexpected move has triggered intense speculation and prompted swift strategic huddles among political leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/brainfuck-meaning-mental-chaos-cognitive-dissonance-gen-z-addiction-mental-health-burnout-world-brain-day-2759423-2025-07-22",
      "headline": "Brain f***ed is more than a feeling. Expert links it to mental overloadIt's not a clinical diagnosis, but \"brainf*ck\" has become Gen Z's shorthand for emotional chaos, mental spirals, and overstimulated reality. From plot twists to reel edits, the term captures a shared glitch in thought and feeling, and psychology might actually have a few answers for why we have it"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/timeline-of-dharmasthala-mass-burial-allegations-karnataka-whistleblowers-claims-fir-and-sit-investigation-2759345-2025-07-22",
      "headline": "Dharmasthala mass burial case: Timeline of key events, how investigation unfoldedA whistleblower alleged mass burials and sexual assaults in the temple town of Dharmasthala in Karnataka between 1998–2014, sparking public outrage. His complaint, evidence, and fresh allegations led the state to form an SIT to investigate the claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-undergoes-anti-ageing-laser-treatment-to-look-youthful-in-next-decade-report-2759402-2025-07-22",
      "headline": "Angelina Jolie undergoes laser treatments to look youthful in next decade: ReportIn a bid to look youthful, Hollywood actor Angelina Jolie has reportedly undergone serious laser treatments. The 50-year-old prioritises self-care with dermatologist's assistance. She is said to be no stranger to Botox and has been using it for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-daughter-malti-marie-steals-the-spotlight-with-her-princess-moment-2759414-2025-07-22",
      "headline": "Priyanka Chopra's daughter Malti steals the spotlight with her princess momentPriyanka Chopra shared adorable new photos of her daughter Malti Marie, delighting fans with glimpses of her playful and princess-like moments. Earlier, the actor shared that Malti loves the Disney character Moana and dressing up, and has even started calling herself 'Malti Marie Moana Chopra Jonas.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-meme-on-taking-ranveer-singh-opinion-is-every-couple-ever-2759447-2025-07-22",
      "headline": "Deepika's meme about taking Ranveer's advice has every couple relatingDeepika Padukone shared a funny meme about asking Ranveer Singh's opinion after already making a decision, giving fans a peek into their playful relationship. The couple, who became parents last year, often share light-hearted moments that fans love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-back-home-recovering-from-dengue-to-begin-kingdom-promotions-2759498-2025-07-22",
      "headline": "Vijay Deverakonda back home recovering from dengue, to begin Kingdom promotionsVijay Deverakonda was discharged from a private hospital after recovering from dengue. He will kickstart 'Kingdom' promotions soon."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-decider-england-vs-india-record-2759511-2025-07-22",
      "headline": "Harmanpreet eyes major landmark as India gear up for ODI deciderENG-W vs IND-W: Harmanpreet Kaur is on the cusp of reaching the landmark of 4000 runs in Women's ODIs. She will get her chance in the third ODI on Saturday in Chester-le-Street. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-sudarshan-gopaladesikan-indian-origin-technical-director-2759503-2025-07-22",
      "headline": "Who is Sudarshan Gopaladesikan? Newcastle's Indian-origin technical directorSudarshan Gopaladesikan's appointment as Newcastle United's Technical Director marks a rare breakthrough for Indian-origin professionals in the Premier League, highlighting the growing influence of Indian talent in elite football's backroom and performance spaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-r-ashwin-on-anshul-kamboj-zaheer-bumrah-2759493-2025-07-22",
      "headline": "Anshul Kamboj belongs to same variety of pacers as Zaheer, Jasprit Bumrah: AshwinEngland vs India: Former India off-spinner R Ashwin believes uncapped pacer Anshul Kamboj belongs to a rare breed of fast bowlers, in the mould of Zaheer Khan and Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-aircrash-dhaka-school-t20i-series-2759485-2025-07-22",
      "headline": "Bangladesh cricketers to wear black armbands to mourn Dhaka school tragedyBAN vs PAK: Bangladesh cricketers will wear black armbands in the second T20I in respect of the victims of the tragic aircraft crash at Milestone School and College in Dhaka's Uttara area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-manchester-test-lords-hearbreak-india-eye-comeback-2759478-2025-07-22",
      "headline": "Can India bounce back in England after Lord's heartbreak?England vs India: After the Lord's heartbreak, the Shubman Gill-led Indian side must regroup quickly to script a historic comeback in the final two Tests. India have suffered twin injury setbacks ahead of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-start-august-2-women-competition-august-17-2759464-2025-07-22",
      "headline": "Delhi Premier League to start on August 2, women's competition from August 17The second edition of the Delhi Premier League (DPL) is set to kick off on August 2 with a grand Opening Ceremony, followed by the first men's match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-youth-fitness-sport-2759443-2025-07-22",
      "headline": "Lots of people don't play sport: MS Dhoni on declining youth fitnessMS Dhoni said that the fitness of people in India is going down since they don't play enough sports. The veteran was amongst India's fittest cricketers, having won three ICC titles as captain from 2007 to 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-dawson-returns-england-test-squad-replaces-shoaib-bashir-manchester-test-india-2759432-2025-07-22",
      "headline": "Who is Liam Dawson? England spinner makes Test comeback after 8 years vs IndiaEngland have announced their playing XI for the fourth Test against India, with Liam Dawson returning to the side after an eight-year absence. The Hampshire all-rounder replaces the injured Shoaib Bashir and is expected to bolster the lower-order batting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-burns-emotional-reaction-italy-reach-icc-t20-world-cup-2026-2759418-2025-07-22",
      "headline": "Really proud of this group: Burns emotional after leading Italy to T20 World CupProudly guiding Italy to their first-ever ICC Men's T20 World Cup qualification, Joe Burns called it one of the most emotional and meaningful moments of his cricketing journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-vs-india-ricky-ponting-rahul-dravid-4th-test-2759419-2025-07-22",
      "headline": "Joe Root aims to kill three birds with one stone, eyes massive jumpENG vs IND, 4th Test: Joe Root has the chance to become the second-highest run-scorer in Test cricket, going past Ricky Ponting, Jacques Kallis and Rahul Dravid. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-joins-list-of-marquee-withdrawals-from-canadian-open-2759394-2025-07-22",
      "headline": "Carlos Alcaraz withdraws from Canadian Open citing muscle fatigueWorld No.2 Carlos Alcaraz has joined the growing list of top players withdrawing from next week's Canadian Open in Toronto, citing the need to recover from muscle issues following his defeat to Jannik Sinner in the Wimbledon final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-youth-fitness-sport-2759443-2025-07-22",
      "headline": "Lots of people don't play sport: MS Dhoni on declining youth fitnessMS Dhoni said that the fitness of people in India is going down since they don't play enough sports. The veteran was amongst India's fittest cricketers, having won three ICC titles as captain from 2007 to 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-dawson-returns-england-test-squad-replaces-shoaib-bashir-manchester-test-india-2759432-2025-07-22",
      "headline": "Who is Liam Dawson? England spinner makes Test comeback after 8 years vs IndiaEngland have announced their playing XI for the fourth Test against India, with Liam Dawson returning to the side after an eight-year absence. The Hampshire all-rounder replaces the injured Shoaib Bashir and is expected to bolster the lower-order batting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-burns-emotional-reaction-italy-reach-icc-t20-world-cup-2026-2759418-2025-07-22",
      "headline": "Really proud of this group: Burns emotional after leading Italy to T20 World CupProudly guiding Italy to their first-ever ICC Men's T20 World Cup qualification, Joe Burns called it one of the most emotional and meaningful moments of his cricketing journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-vs-india-ricky-ponting-rahul-dravid-4th-test-2759419-2025-07-22",
      "headline": "Joe Root aims to kill three birds with one stone, eyes massive jumpENG vs IND, 4th Test: Joe Root has the chance to become the second-highest run-scorer in Test cricket, going past Ricky Ponting, Jacques Kallis and Rahul Dravid. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-joins-list-of-marquee-withdrawals-from-canadian-open-2759394-2025-07-22",
      "headline": "Carlos Alcaraz withdraws from Canadian Open citing muscle fatigueWorld No.2 Carlos Alcaraz has joined the growing list of top players withdrawing from next week's Canadian Open in Toronto, citing the need to recover from muscle issues following his defeat to Jannik Sinner in the Wimbledon final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-team-pace-bowling-confusion-kamboj-recalled-manchester-test-2759371-2025-07-22",
      "headline": "Aakash Chopra questions Indian team management over Kamboj-Rana confusionFormer India opener Aakash Chopra has raised concerns over the Indian men's Test team management, calling out the lack of clarity in their handling of pace bowling options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/video/breaking-kayfabe-cm-punk-rhea-ripley-on-wwe-unreal-aj-lee-return-2759281-2025-07-22",
      "headline": "Breaking kayfabe: CM Punk, Rhea Ripley on WWE Unreal, AJ Lee returnSpeaking exclusively to India Today, WWE Superstars CM Punk and Rhea Ripley opened up on WWE's new docuseries on NetFlix 'WWE: Unreal' and how breaking kayfabe meant for them. The duo also commented on AJ Lee's potential return to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-backs-washington-sundar-india-test-all-rounder-2759356-2025-07-22",
      "headline": "Ravi Shastri backs Washington Sundar to be genuine all-rounder for many yearsFormer India coach Ravi Shastri has endorsed Washington Sundar as a long-term all-rounder in Test cricket. Sundar's potential and performances suggest he could become a key player if given more opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zheng-qinwen-us-open-elbow-surgery-2759357-2025-07-22",
      "headline": "Paris gold medallist Zheng Qinwen pulls out of US Open after elbow surgeryUS Open 2025: China's Zheng Qinwen has withdrawn from the upcoming hard-court major following elbow surgery and will not compete in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-bryan-mbeumo-reaction-brentford-premier-league-2759328-2025-07-22",
      "headline": "Bryan Mbeumo completes Manchester United move: Club of my dreamsManchester United have signed forward Bryan Mbeumo from Brentford until 2030, with the option to extend for a further year, United said on Monday. United paid 65 million pounds ($88 million) to Brentford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-brendon-mccullum-england-vs-india-lords-2759333-2025-07-22",
      "headline": "No more nice guys: Brook on how McCullum encouraged England at Lord'sENG vs IND: Harry Brook said how Brendon McCullum motivated England not to be the guys in the Lord's Test, which the home team narrowly won by 22 runs to go 2-1 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-england-lords-test-2759320-2025-07-22",
      "headline": "England showed at Lord's that they can adapt and adjust: Brydon CarseENG vs IND: Brydon Carse said that England were happy with their approach in the Lord's Test, which they had won by 22 runs to take a crucial 2-1 lead in the five-match series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-bryan-mbeumo-reaction-brentford-premier-league-2759328-2025-07-22",
      "headline": "Bryan Mbeumo completes Manchester United move: Club of my dreamsManchester United have signed forward Bryan Mbeumo from Brentford until 2030, with the option to extend for a further year, United said on Monday. United paid 65 million pounds ($88 million) to Brentford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-brendon-mccullum-england-vs-india-lords-2759333-2025-07-22",
      "headline": "No more nice guys: Brook on how McCullum encouraged England at Lord'sENG vs IND: Harry Brook said how Brendon McCullum motivated England not to be the guys in the Lord's Test, which the home team narrowly won by 22 runs to go 2-1 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-england-lords-test-2759320-2025-07-22",
      "headline": "England showed at Lord's that they can adapt and adjust: Brydon CarseENG vs IND: Brydon Carse said that England were happy with their approach in the Lord's Test, which they had won by 22 runs to take a crucial 2-1 lead in the five-match series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-virat-kohli-manoj-tiwary-england-vs-india-2759315-2025-07-22",
      "headline": "Captain Gill trying to copy Kohli with aggression: Ex-India cricketerFormer India cricketer Manoj Tiwary criticised Shubman Gill and claimed the current Test captain is trying to copy Virat Kohli's aggression on the field. Gill was at the centre of controversy when he had run-ins with England players during Lord's Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/6-indian-badminton-players-out-of-world-university-games-over-administrative-lapse-2759279-2025-07-21",
      "headline": "6 Indian badminton players out of World University Games over admin lapseThe Indian badminton team that won mixed team bronze at the World University Games is facing controversy over player selection. Administrative errors barred six players from competing, prompting demands for accountability and justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-fitness-akash-deep-injury-2759255-2025-07-21",
      "headline": "Pant shakes off injury concerns, Akash Deep all but out of Manchester TestRishabh Pant has shaken off injury concerns and took part in batting and wicketkeeping sessions as the Indian team's preparations for the Manchester Test was in full flow on Monday, July 21. However, Akash Deep seems to be all but ruled out of the match as the pacer continues to struggle with a groin issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-mohammed-siraj-workload-management-manchester-test-2759231-2025-07-21",
      "headline": "Mohammed Siraj on workload management chatter: Almighty has kept me healthyMohammed Siraj has brushed aside talk about workload management, saying that he is focused on making most of the opportunity presented to him. Siraj has played all the matches so far in the series and has bowled a total of 109 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-playing-xi-liam-dawson-return-manchester-test-2759208-2025-07-21",
      "headline": "Liam Dawson returns after 8 years as England announce Manchester Test lineupLiam Dawson has made a return to the England Test team lineup after a gap of eight years as the hosts revealed their playing XI for the match against India in Manchester on Monday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-harry-brook-joe-root-best-test-batter-all-time-2759201-2025-07-21",
      "headline": "Not in the same league: Brook hails Root as best Test batter of all-timeHarry Brook opened up on the ongoing tussle in the ICC rankings between himself and Joe Root. Whilst he may be close to taking the number one spot, he acknowledged Joe Root as the best Test batter of all-time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-harry-brook-england-lords-test-payback-2759196-2025-07-21",
      "headline": "Bumrah bowled one over: Brook on England's moment of payback at Lord'sHarry Brook reveaed that it was that one over by Jasprit Bumrah on Day 3 that lit a fire in England's belly as they went on to give it back to India to take the win at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-mohammed-siraj-lords-heartbreak-2759166-2025-07-21",
      "headline": "Felt like I won't get out, took time to recover: Mohammed Siraj on Lord's heartbreakMohammed Siraj recalled the Lord's Test heartbreak and said that he felt he wouldn't get out during the final day of the match. Siraj was the final man to be dismissed in dramatic fashion in the Lord's Test as England took the lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-india-were-scared-manchester-test-2759138-2025-07-21",
      "headline": "India were scared: Brook reveals why England hold advantage in 4th TestHarry Brook believes India's fearful tactics have only boosted England's confidence ahead of the crucial fourth Test in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-to-play-manchester-test-mohammed-siraj-2759112-2025-07-21",
      "headline": "ENG vs IND: Jasprit Bumrah will play Manchester Test, says Mohammed SirajMohammed Siraj has confirmed that Jasprit Bumrah will play the upcoming Manchester Test against England, which will begin on July 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-rishabh-pant-lead-indias-practice-session-ahead-of-manchester-test-2759107-2025-07-21",
      "headline": "Shubman Gill, Rishabh Pant lead India's practice session ahead of 4th TestShubman Gill and Rishabh Pant lead the way in India's practice session ahead of the fourth Test in Old Trafford, Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-kevin-pietersen-sarfaraz-khan-weightloss-transformation-2759083-2025-07-21",
      "headline": "Shaw should see this: Pietersen praises Sarfaraz's stunning transformationKevin Pietersen shared a cheeky dig at Prithvi Shaw as he reacted to Sarfaraz Khan's insane weightloss transformation"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}