{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-trade-deal-a-boost-for-long-term-ties-amid-global-uncertainty-eu-vp-kaja-kallas-2858618-2026-01-27",
      "headline": "India–EU trade deal a boost for long-term ties amid global uncertainty: EU VP Kaja KallasDescribed as the \"mother of all deals\", India–EU trade pact is expected to boost trade, lower barriers, and deepen economic ties between the two sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/new-tax-regime-explained-key-changes-so-far-and-what-budget-2026-may-bring-2858548-2026-01-27",
      "headline": "New Tax Regime explained: Key changes so far and what Budget 2026 may bringWith the core structure already in place, Budget 2026 is expected to focus on fine-tuning rather than major overhauls. The government is likely to continue strengthening the new regime as a low-tax, low-complexity option suited to a wide range of taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-simpler-rules-and-digital-support-boost-indias-e-commerce-sector-2858474-2026-01-27",
      "headline": "Budget 2026: Will simpler rules and digital support boost India's e-commerce sector?With India's e-commerce ecosystem expanding rapidly, expectations from Budget 2026 are centred on regulatory simplicity and digital infrastructure to support millions of online sellers and platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-trade-deal-fta-what-it-means-for-consumers-explained-2858438-2026-01-27",
      "headline": "India-EU FTA explained: What the 'mother of all trade deals' means for youIndia and EU have finalised the mother of all deals, laying the groundwork for cheaper goods, stronger jobs and a deeper Indian presence in global markets. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-320-points-higher-nifty-above-25100-axis-bank-up-india-eu-fta-2858437-2026-01-27",
      "headline": "Sensex ends 320 points higher; Nifty above 25,100; Axis Bank up 5%The S&P BSE Sensex was up 319.78 points to 81,857.48, while the NSE Nifty50 added 127.50 points to 25,175.40 as of 3:51 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-india-eu-trade-deal-antonio-costa-pm-modi-eu-2858411-2026-01-27",
      "headline": "Video: EU's Antonio Costa whips out Indian OCI card to PM Modi's laughterWhile talking about the historic Indo-EU trade deal, Antonio Costa speaks about his roots in Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-embraer-sign-mou-for-regional-aircraft-production-in-india-report-2858397-2026-01-27",
      "headline": "Adani Group, Embraer sign MoU for regional aircraft production in India: ReportIn a joint statement, Adani and Embraer said they had signed a memorandum of understanding (MoU) to explore cooperation across aircraft manufacturing, supply chains, aftermarket services and pilot training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-trade-deal-what-will-become-cheaper-after-fta-wine-pharma-planes-2858389-2026-01-27",
      "headline": "From cars to wine: What may get cheaper after the India–EU trade dealEuropean goods from cars and wine to olive oil and medical devices are set to become more affordable in India as tariffs fall and shoppers gain wider choice and savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-plans-new-atms-to-dispense-small-currency-notes-report-2858366-2026-01-27",
      "headline": "Government plans new ATMs to dispense small currency notes: ReportWhile digital payments are growing rapidly, cash continues to play a key role in daily life for many Indians. Daily wage workers, street vendors, small shopkeepers and commuters often rely on cash for routine purchases and travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-senior-citizens-get-higher-tax-exemption-and-pensions-2858350-2026-01-27",
      "headline": "Budget 2026: Will senior citizens get higher tax exemption and pensions?Ahead of Budget 2026, senior citizens are seeking stronger healthcare support, higher pensions and meaningful tax relief. Experts say focused policy action is needed to build a dignified and affordable senior care ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-eu-trade-deal-details-tariff-cut-european-cars-beer-wine-medical-equipment-2858338-2026-01-27",
      "headline": "European cars, medicines, wine: What gets cheaper after India-EU trade deal Live UpdatesThe biggest headline is autos. India will gradually cut tariffs on European cars to 10%, a huge drop from an effective duty load that often reaches about 70% today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-prices-jump-by-nearly-rs-25000-whats-behind-the-sudden-rally-2858328-2026-01-27",
      "headline": "Silver prices jump by nearly Rs 25,000: What's behind the sudden rally?Silver prices are enjoying a rally like never before. On Tuesday, the white metal suddenly jumped by about Rs 25,000, leaving investors wondering whether this is a short-term spike or the start of a bigger trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-fta-cheaper-bmw-mercedes-volkswagen-skoda-cars-2858320-2026-01-27",
      "headline": "India-EU trade deal: Will European cars really get cheaper?For years imported cars from Europe have attracted some of the highest duties in the world. A fully built model faces taxes of about 70% to 110%. That is the single biggest reason a BMW, Audi or Mercedes costs so much more in India than it does in Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-trade-deal-fta-news-agreement-status-talks-finalised-implementation-date-2858290-2026-01-27",
      "headline": "EU-India trade deal announced. But why wasn't it signed today?India and the European Union (EU) announced the conclusion of negotiations on a long-awaited free trade agreement (FTA) on Tuesday. However, the trade deal, which marks a major milestone, was not signed today. That is because the deal has to undergo legal vetting, translation and ratification. This is when the EU-India FTA might come into force."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-eu-trade-deal-fta-sensex-nifty-market-impact-fii-selling-auto-stocks-2858306-2026-01-27",
      "headline": "India-EU FTA: Will Sensex, Nifty rally because of European Union trade deal?The deal aims to open up India's large and closely protected market to freer trade with the 27-nation European bloc, which is also India's biggest trading partner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-trade-deal-fta-what-it-means-for-you-goods-services-costs-explained-2858279-2026-01-27",
      "headline": "India-EU trade deal: What FTA may change for goods, services and your costsConsumers can expect cheaper European cars, more affordable electronics and smoother services access as India and the European Union prepare to officially announce the conclusion of negotiations on their long-awaited free trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-sensex-nifty-fell-today-despite-india-eu-trade-deal-auto-stocks-fii-selling-gold-silver-rise-2858262-2026-01-27",
      "headline": "Why Sensex, Nifty fell today despite India-EU trade deal announcement?Sensex fell more than 400 points in early trade, while the Nifty dropped close to 100 points. However, both indices recovered part of the losses and were trading higher by around 9:40 am. Despite this recovery, the overall mood on the Street remained cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-down-nse-bse-fall-gold-silver-high-2858254-2026-01-27",
      "headline": "Sensex, Nifty open lower despite India-EU trade deal hopes; RIL down 1%The S&P BSE Sensex was down 393.37 points to 81,144.33, while the NSE Nifty50 lost 96.65 points to 24,952.00 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-today-record-highs-check-rates-in-your-city-bullion-mcx-futures-safe-haven-2858251-2026-01-27",
      "headline": "Gold, silver reach record highs. Check gold and silver rates in your cityGold futures jumped over 1.7% to hit a record high of Rs 159,820 per 10 grams. Silver futures saw an even sharper move, rising around 6% to touch a record high of Rs 354,780 per kg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-trading-setup-nse-bse-likely-to-open-higher-why-india-eu-fta-2858242-2026-01-27",
      "headline": "Sensex, Nifty today: Stock market likely to open higher. Here's whyGift Nifty futures were trading at 25,187 at around 8:30 AM. This suggests that the Nifty 50 may open above its previous close of 25,048.65 recorded on Friday. Stock markets were closed on Monday due to the Republic Day holiday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamta-kulkarni-resigns-as-kinnar-akhadas-maha-mandleshwar-calls-spiritual-decision-2858657-2026-01-27",
      "headline": "Mamta Kulkarni resigns as Kinnar Akhada's Maha Mandleshwar, calls spiritual decision Mamta Kulkarni announced her voluntary resignation as Maha Mandleshwar of Kinnar Akhada, effective January 27, 2026, calling it a personal spiritual decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/calling-it-off-arijit-singh-retires-as-playback-singer-says-wont-take-new-assignments-2858649-2026-01-27",
      "headline": "I am calling it off: Arijit Singh announces retirement from playback singing Arijit Singh announced his decision to retire from playback singing, thanking fans for years of love and support while calling it a fulfilling journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-shares-sweet-birthday-note-for-bobby-deol-calls-him-lord-bobby-2858624-2026-01-27",
      "headline": "Sunny Deol shares sweet birthday note for Bobby Deol, calls him Lord Bobby Sunny Deol wished brother Bobby Deol a heartfelt happy birthday as the actor turned 57 on January 27, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/amruta-khanvilkar-on-stigma-as-a-marathi-actor-still-face-it-choose-to-ignore-it-2858560-2026-01-27",
      "headline": "Amruta Khanvilkar on stigma as a Marathi actor: Still face it, choose to ignore it Amruta Khanvilkar opened up about facing persistent stereotypes and stigma as a Marathi actor despite her long career. While acknowledging that industry norms regarding age, marriage, and weight are finally shifting, she emphasised her choice to ignore labels and focus on growth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-says-roadies-drama-is-only-on-camera-its-all-friendly-off-screen-2858592-2026-01-27",
      "headline": "Neha Dhupia says Roadies drama is only on camera, it's all friendly off screen Neha Dhupia shared that despite the heated arguments seen on MTV Roadies, the gang leaders share a friendly and cordial bond off camera."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bafta-2026-manipuri-film-boong-nominated-in-best-childrens-family-film-category-2858590-2026-01-27",
      "headline": "BAFTA 2026: Manipuri film Boong nominated in Best Children's & Family Film category Manipuri film Boong has been nominated for BAFTA (British Academy of Film and Television Arts) 2026 in the Best Children's and Family Film category. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-ammakai-free-breakfast-draws-long-queues-freebie-culture-debate-2858537-2026-01-27",
      "headline": "Shilpa Shetty's AmmaKai Free Breakfast draws long queues, freebie culture debate Shilpa Shetty's restaurant AmmaKai drew massive crowds after announcing a free breakfast on Republic Day, with people lining up hours before opening. Videos of the long queues went viral, sparking a social media debate on the culture of freebies and public mindset."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mimi-chakraborty-alleges-harassment-at-live-event-organiser-denies-claims-2858503-2026-01-27",
      "headline": "Mimi Chakraborty alleges harassment at live event, organiser denies claims Actor and ex-MP Mimi Chakraborty filed a police complaint alleging harassment and disruption during a live stage performance in West Bengal's Bongaon. Event organisers denied the charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-once-did-c-grade-films-to-put-bread-and-butter-on-the-table-2858506-2026-01-27",
      "headline": "Archana Puran Singh once did C-grade films to put \"bread and butter on the table\" Archana Puran Singh and Parmeet Sethi opened up about a difficult phase in their marriage, marked by financial pressure and career struggles in their early years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nakuul-mehta-says-fatherhood-has-taught-him-to-chase-quieter-wins-exclusive-2858453-2026-01-27",
      "headline": "Nakuul Mehta says fatherhood has taught him to chase quieter wins I Exclusive Nakuul Mehta opened up about how fatherhood has reshaped his ambition while promoting his latest series, Space Gen Chandrayaan. The actor discussed raising his son away from screen culture and emphasised that his success is a collective effort rather than individual glory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/border-2-film-release-praised-by-alia-bhatt-boosts-audience-interest-positive-reviews-2858459-2026-01-27",
      "headline": "Border 2: Alia Bhatt smitten by Varun's performance, praises entire team Alia Bhatt recently praised Sunny Deol's latest release 'Border 2', which has been met with favourable reviews from both critics and audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/2200-page-thesis-tere-ishk-mein-gets-phd-level-backlash-over-major-plot-detail-2858447-2026-01-27",
      "headline": "2,200-page thesis? Tere Ishk Mein gets PhD-level backlash over major plot gaffe The depiction of a 2,200-page thesis in Netflix's Tere Ishk Mein has sparked widespread amusement and criticism among PhD students, igniting a social media conversation about academic accuracy in films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-attends-president-murmus-hi-tea-dreams-once-felt-too-big-but-i-showed-up-2858448-2026-01-27",
      "headline": "Samantha attends President Murmu's hi-tea: Dreams once felt too big, but I showed up Actor Samantha Ruth Prabhu expressed her happiness after attending the At-Home Reception hosted by President Droupadi Murmu at Rashtrapati Bhavan on Republic Day. She shared some pictures with a heartfelt caption on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/soha-ali-khan-praises-ashnoor-kaur-for-graceful-response-to-body-shaming-2858462-2026-01-27",
      "headline": "Soha Ali Khan praises Ashnoor Kaur for graceful response to body shaming Soha Ali Khan praised Bigg Boss 19 fame Ashnoor Kaur for speaking up with grace after facing body shaming on a national platform."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-actor-kavya-gowdas-husband-hospitalised-after-alleged-stabbing-2858456-2026-01-27",
      "headline": "Actor Kavya Gowda alleges assault, sexual threats; husband stabbed in family clash Kavya Gowda's husband, Somashekar, was hospitalised after an alleged stabbing during a family dispute in Bengaluru. Police have registered a case and launched an investigation into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/welcome-to-the-jungle-movie-release-date-akshay-kumar-suniel-shetty-2858419-2026-01-27",
      "headline": "Welcome to the Jungle: Akshay Kumar's star-studded comedy set for summer release The upcoming comedy film 'Welcome to the Jungle, starring Akshay Kumar and Suniel Shetty alongside a large Bollywood ensemble, is slated to release in theatres this summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-returns-hyderabad-resume-ss-rajamoulis-varanasi-mahesh-babu-2858429-2026-01-27",
      "headline": "Priyanka Chopra returns to Hyderabad to resume Rajamouli's Varanasi. See pic Priyanka Chopra has departed for Hyderabad to resume shooting for filmmaker SS Rajamouli's highly anticipated drama Varanasi, where she stars opposite Mahesh Babu. The project also features Prithviraj Sukumaran and is scheduled for release in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/isha-koppikar-opens-up-on-long-work-hours-debate-says-terms-must-be-mutual-2858432-2026-01-27",
      "headline": "Terms must be mutual: Isha Koppikar opens up on long work hour debate Isha Koppikar weighed in on the film industry's long shift-hour debate, saying work hours should be mutually agreed upon while signing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-coolie-suffered-rs-40-50-crore-loss-due-to-a-rating-says-lokesh-kanagaraj-2858427-2026-01-27",
      "headline": "Rajinikanth's Coolie suffered Rs 40-50 crore loss due to A rating: Lokesh Kanagaraj Lokesh Kanagaraj revealed that his film Coolie, starring Rajinikanth, was asked to make 35 cuts by the CBFC and received an A certificate. The director said the rating led to a massive revenue loss."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/calling-it-off-arijit-singh-retires-as-playback-singer-says-wont-take-new-assignments-2858649-2026-01-27",
      "headline": "I am calling it off: Arijit Singh announces retirement from playback singingArijit Singh announced his decision to retire from playback singing, thanking fans for years of love and support while calling it a fulfilling journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-eu-trade-deal-details-tariff-cut-european-cars-beer-wine-medical-equipment-2858338-2026-01-27",
      "headline": "European cars, medicines, wine: What gets cheaper after India-EU trade deal  Live UpdatesThe biggest headline is autos. India will gradually cut tariffs on European cars to 10%, a huge drop from an effective duty load that often reaches about 70% today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/eu-chief-ursula-von-der-leyen-india-success-silent-jab-donald-trump-davos-speech-2858538-2026-01-27",
      "headline": "When India succeeds...: EU Chief's silent swipe at Trump's 'if US booms' speech?EU chief Ursula von der Leyen's remark that India's success brings global stability, made as India and the EU finalised their biggest-ever trade deal, echoed rhetoric once used by Donald Trump to frame America as the world's economic engine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/ugc-new-equity-regulations-anti-caste-discrimination-indian-universities-2858325-2026-01-27",
      "headline": "India already has anti-discrimination laws, so why this new UGC rule?The UGC has introduced new regulations to enforce anti-caste discrimination measures in higher education institutions. However, experts and critics question the need for these rules given existing laws and raise concerns about enforcement and due process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mira-bhayander-flyover-danger-four-to-two-lanes-mumbai-congress-criticism-mmrda-defence-2858533-2026-01-27",
      "headline": "4 lanes abruptly turning 2 on flyover near Mumbai sparks ridicule, alarmA debate has erupted in Mira-Bhayander over a flyover where a four-lane section abruptly narrows to two lanes, with the Congress calling it an engineering failure while the MMRDA insists the design was planned to ease local traffic bottlenecks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vihaan-malhotra-century-india-beat-zimbabwe-u19-world-cup-super-six-clash-2858587-2026-01-27",
      "headline": "U19 World Cup: Vihaan Malhotra 109 powers India to 204-run win over ZimbabweVihaan Malhotra's century powered India to a dominant 204-run win over Zimbabwe in their first Super Six match of the ICC Under-19 World Cup 2026 at the Queen's Sports Club in Bulawayo on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-chants-disrupt-karnataka-cm-siddaramaiah-protest-rally-2858630-2026-01-27",
      "headline": "Who's shouting DK, DK? Siddaramaiah loses cool at Bengaluru rallyDespite repeated appeals to stop the sloganeering, the chants of \"DK, DK\" continued, prompting an angry reaction from the Chief Minister, who was seen scolding the workers on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-european-union-trade-deal-what-it-means-modi-trump-us-2858342-2026-01-27",
      "headline": "Why Daddy Trump won't like India-EU Mother of all DealsIndia-EU FTA: A continent Donald Trump has mocked and pressured over his Greenland ambition, signing a trade deal with a country he has sought to corner with sky-high tariffs, will no doubt be a sore sight. Will this nudge Trump to secure a trade with India?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/himachal-pradesh/story/himachal-pet-pitbull-dog-refuses-to-leave-dead-owner-side-despite-heavy-snowstorm-in-chamba-valley-2858441-2026-01-27",
      "headline": "Pit bull refuses to leave dead owner's side for 4 days despite snowstormThe owner of the canine and his cousin were on a trek seeking to shoot videos of snowfall taking place in Himachal Pradesh's Chamba Valley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-did-it-eu-chief-ursula-von-der-leyen-pm-modi-as-mother-of-all-trade-deals-announced-2858396-2026-01-27",
      "headline": "We did it: India, EU announce 'mother of all trade deals' amid global churnDescribing India and the European Union as \"two giants who chose a win-win partnership,\" Ursula said the deal is expected to cut around 4 billion euros in tariffs, providing a major boost to businesses on both sides and strengthening supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghanistan-taliban-criminal-procedure-code-courts-divide-society-four-classes-mullahs-legal-shield-2858388-2026-01-27",
      "headline": "Taliban bring varna system in Afghanistan, make mullahs untouchableAfghanistan's Taliban's newly issued Criminal Procedure Code has triggered alarm among rights groups about dividing Afghan society into rigid classes, where religious elites (mullahs) will enjoy near-immunity from punishment for crimes. Critics say the Taliban have revived slavery-like legal categories and given legal sanctity to violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eu-council-president-antonio-costa-oci-card-goa-roots-pm-modi-trade-deal-2858377-2026-01-27",
      "headline": "EU boss 'Babush' Antonio Costa flaunts India's OCI card. What's his Goa link?European Council President Antonio Luis Santos da Costa unexpectedly took out his OCI card and spoke about his personal connection to India during the India-EU trade deal announcement. How is he linked to India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-ammakai-free-breakfast-draws-long-queues-freebie-culture-debate-2858537-2026-01-27",
      "headline": "Shilpa Shetty's AmmaKai Free Breakfast draws long queues, freebie culture debateShilpa Shetty's restaurant AmmaKai drew massive crowds after announcing a free breakfast on Republic Day, with people lining up hours before opening. Videos of the long queues went viral, sparking a social media debate on the culture of freebies and public mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-announces-up-to-ps3-million-in-scholarships-empowering-future-global-leaders-2856640-2026-01-23",
      "headline": "University of Bath School of Management announces up to £3 million in scholarships, empowering future global leadersStrategic Scholarship Investment Aimed at Attracting Exceptional Talent Worldwide"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bafta-2026-manipuri-film-boong-nominated-in-best-childrens-family-film-category-2858590-2026-01-27",
      "headline": "BAFTA 2026: Manipuri film Boong nominated in Best Children's & Family Film categoryManipuri film Boong has been nominated for BAFTA (British Academy of Film and Television Arts) 2026 in the Best Children's and Family Film category. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-t20-world-cup-participation-bangladesh-support-hafeez-inzamam-2858557-2026-01-27",
      "headline": "Don't support Bangladesh at the cost of Pakistan cricket: Ex-Pak playersPakistan should avoid harming its relationship with the world governing body, and support for Bangladesh should not come at the cost of national cricket, former players and board officials said as the PCB deferred its decision on participating in the upcoming T20 World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-navy-uss-abraham-lincoln-strike-group-carrier-presence-near-iran-sparks-speculation-on-khamenei-heir-bunker-hideout-2858420-2026-01-27",
      "headline": "Buzz on Khamenei's heir, bunker hideout as US armada inches closer to IranThere is a buzz that Iran's Supreme Leader, Ayatollah Khamenei, has sought security in a bunker and the regime is trying to identify an heir. This comes even as the US builds up its naval power close to Iran after a brutal crackdown on protests by the Khamenei regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/miami-university-a-top-us-destination-for-future-tech-and-engineering-leaders-2856701-2026-01-23",
      "headline": "Miami University: A Top U.S. Destination for Future Tech and Engineering LeadersMiami University Expands Opportunities for International Students Through Industry-Integrated Computer Science & Engineering Programs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ugc-bill-protest-live-updates-equity-regulations-row-guidelines-2858313-2026-01-27",
      "headline": "UGC 2026 row Live: Key differences between 2012 and 2026 UGC anti-discrimination rulesUGC Guidelines 2026 Row Live Updates: The UGC controversy has spread across the country, with several states witnessing protests by students and youth. Bureaucrats have also stepped in, with at least one official resigning after calling the guidelines harmful to students from upper castes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-gst-official-deputy-commissioner-ayodhya-resigns-shankaracharya-row-cites-moral-duty-pm-modi-cm-yogi-2858602-2026-01-27",
      "headline": "UP GST official resigns amid row over Shankaracharya, cites moral duty to PM and CMThe Shankaracharya controversy in Uttar Pradesh has spilled into administrative circles, with Ayodhya GST Deputy Commissioner Prashant Kumar Singh resigning in support of PM Modi and CM Yogi, days after a Bareilly city magistrate quit and was suspended later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-textiles-ready-made-garment-sector-economy-crisis-muhammad-yunus-eu-fta-trade-deal-2858146-2026-01-27",
      "headline": "India helped Bangladesh weave a success story. It'll now fight it out in EuropeIndia didn't just help Bangladesh in its 1971 Liberation War but supported it throughout its development journey. India helped Bangladesh build the ready-made garments sector, which helped pull millions out of poverty. Some say India sacrificed its own textiles industry for that. Now, that very sector will see competition from Indian exports, especially in the European markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/british-womans-scathing-review-of-indigo-long-haul-flight-goes-viral-2858606-2026-01-27",
      "headline": "British woman's scathing review of IndiGo long-haul flight goes viralA British woman's video alleging poor service on an IndiGo London-Mumbai flight has drawn attention to the airline's long-haul amenities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/snowfall-after-effect-to-trigger-cold-wave-in-north-and-central-india-on-wednesday-2858521-2026-01-27",
      "headline": "Chilly after-effects of snowfall, rain to dominate WednesdayThe western disturbance currently affecting the Himalayan region has brought snowfall across higher reaches and rain in parts of the plains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mallikarjun-kharge-rahul-gandhi-republic-day-celebrations-seating-arrangements-defence-ministry-2858514-2026-01-27",
      "headline": "Had to send our secretaries to find seats: Mallikarjun Kharge on R-Day seating rowCongress chief Mallikarjun Kharge said he and Rahul Gandhi were \"insulted\" with third-row seats at the Republic Day ceremony, asserting that their secretaries had to find their seats and arrange passes. The Centre had said special arrangements were made for Kharge."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vihaan-malhotra-century-india-beat-zimbabwe-u19-world-cup-super-six-clash-2858587-2026-01-27",
      "headline": "U19 World Cup: Vihaan Malhotra 109 powers India to 204-run win over Zimbabwe Vihaan Malhotra's century powered India to a dominant 204-run win over Zimbabwe in their first Super Six match of the ICC Under-19 World Cup 2026 at the Queen's Sports Club in Bulawayo on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-sourav-ganguly-pretoria-capitals-graeme-smith-2858648-2026-01-27",
      "headline": "SA20 wants to have coach Sourav Ganguly back despite final heartbreak: Graeme Smith Despite suffering another final heartbreak in South Africa, Graeme Smith wants to see Sourav Ganguly make a return to the SA20 as a coach. Ganguly helped Pretoria Capitals reach the final of the SA20 2026 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-led-india-white-ball-cricket-revolution-rahul-dravid-2858646-2026-01-27",
      "headline": "Rohit Sharma led India's white-ball evolution from the front: Rahul Dravid Rahul Dravid reflected on India's rise in white-ball cricket and the evolution of leadership within the team, while crediting Rohit Sharma for spearheading the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-tiktok-dance-gift-carlos-alcaraz-australian-open-2026-2858629-2026-01-27",
      "headline": "Aryna Sabalenka wins hearts with cheeky birthday request to Carlos Alcaraz Aryna Sabalenka sparked a fun moment at the 2026 Australian Open after her quarter-final win, joking that she would gift Carlos Alcaraz a TikTok dance in a nod to their shared birthday and past viral clip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-harry-brook-joe-root-unbeaten-centuries-decider-sri-lanka-odi-2858616-2026-01-27",
      "headline": "SL vs ENG: Brook channels inner Stone Cold Steve Austin after hundred in 3rd ODI Harry Brook decided to channel his inner Stone Cold Steve Austin as he celebrated his incredible knock against Sri Lanka by imitating the WWE legend's iconic beer smash. Brook and Root's hundreds helped England post 357 against Sri Lanka in the series decider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naaz-hosts-icc-t20-world-cup-trophy-at-india-today-mediaplex-ahead-of-2026-tournament-ytvd-2858615-2026-01-27",
      "headline": "Nikhil Naaz Hosts ICC T20 World Cup Trophy At India Today MediaPlex Ahead Of 2026 Tournament On this Special Report, India Today's Nikhil Naaz provides an exclusive close-up look at the ICC T20 World Cup trophy at the network's Noida office. Highlighting India's status as defending champions, Naaz notes, 'India going to this particular tournament as the defending champion' with a chance to become the first team to win the title three times. The transcript details India's formidable form, having won 32 matches with only five losses in the last 18 months. The tournament is scheduled to begin on 7th February 2026, with the final on 8th March. Naaz discusses the $2.5 million prize money and praises the Indian squad, featuring stars like Suryakumar Yadav, Hardik Pandya, and Jasprit Bumrah. The report also touches upon the historical significance of the trophy, tracing back to MS Dhoni's 2007 victory, while contrasting the current accessibility of the silverware with previous controversies involving other cricket tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-delhi-capitals-vs-gujarat-giants-live-updates-vadodara-2858599-2026-01-27",
      "headline": "DC vs Gujarat Giants LIVE Score: Mooney departs as Giants lose quick wickets Delhi Capitals (DC) vs Gujarat Giants (GGW), WPL 2026 Live Score: Beth Mooney has scored a half-century, but the Gujarat Giants have lost wickets at crucial stages keeping the Capitals in the game in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-2026-vihaan-malhotra-hundred-india-vs-zimbabwe-2858585-2026-01-27",
      "headline": "Who is Vihaan Malhotra? RCB starlet scores India's 1st hundred in U19 World Cup 2026 Vihaan Malhotra slammed the first Indian hundred of the U19 World Cup 2026, scoring an unbeaten 109 vs Zimbabwe as India posted 352 in Bulawayo. Here's a look at a quick profile of the Indian vice-captain, who has been a key figure in India's campaign so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-form-morne-morkel-t20-world-cup-india-new-zealand-series-2858578-2026-01-27",
      "headline": "Sanju will find form: India bowling coach backs Samson ahead of T20 World Cup India bowling coach Morne Morkel has played down concerns over Sanju Samson's form slump, backing the wicketkeeper-batter to rediscover his touch ahead of the T20 World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-martin-india-drunk-driving-accident-vadodara-2858570-2026-01-27",
      "headline": "Ex-India batter Jacob Martin arrested for drunk driving after accident in Vadodara Former Indian cricketer Jacob Martin was arrested for drink-driving after crashing into parked cars in Vadodara on Monday. Martin played 10 ODIs for India from 1999 to 2001. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-t20-world-cup-participation-bangladesh-support-hafeez-inzamam-2858557-2026-01-27",
      "headline": "Don't support Bangladesh at the cost of Pakistan cricket: Ex-Pak players Pakistan should avoid harming its relationship with the world governing body, and support for Bangladesh should not come at the cost of national cricket, former players and board officials said as the PCB deferred its decision on participating in the upcoming T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-australian-open-semi-final-career-grand-slam-2026-2858554-2026-01-27",
      "headline": "Carlos Alcaraz nears Career Grand Slam dream with maiden semis berthAustralian Open: Carlos Alcaraz stormed into his maiden semi-final at Melbourne Park after beating Alex de Minaur in straight sets and will next be up against Alexander Zverev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-t20i-lockie-ferguson-exclusive-injuries-suck-refuses-slow-down-2858498-2026-01-27",
      "headline": "Injuries suck, but rare breed Lockie Ferguson refuses to slow downIn an era of flat decks and relentless schedules, the 150kph tearaway is a dying breed. Lockie Ferguson opens up on the gruelling reality of rehab, casual contracts, and why, despite the physical toll, he refuses to turn down the heat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-exits-australian-open-quarterfinals-svitolina-victory-ranking-shift-2858467-2026-01-27",
      "headline": "Coco Gauff destroys racket in anger after AUS Open exit, video goes viralCoco Gauff was defeated by Elina Svitolina in just over an hour during the Australian Open quarterfinals, leading to her visible frustration. Gauff smashed her racket in the corridors of the arena after the loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elina-svitolina-returns-wta-top-10-australian-open-quarter-final-2858482-2026-01-27",
      "headline": "From cradle to court: Elina Svitolina cherishes top 10 comeback after motherhoodAustralian Open: Elina Svitolina is set to return to the top 10 of the WTA rankings after advancing to her maiden semi-final at Melbourne Park following her win over Coco Gauff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-retirement-not-difficult-kevin-pietersen-interview-odi-test-cricket-india-vs-new-zealand-2858452-2026-01-27",
      "headline": "KL Rahul opens up potential India retirement: Don't think it will be difficultKL Rahul has admitted retirement thoughts have crossed his mind but insists the time is still away. The India batter said he will step aside honestly when the moment arrives, without dragging his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-urges-australian-open-to-allow-fitness-trackers-2858440-2026-01-27",
      "headline": "Frustrated Aryna Sabalenka urges Australian Open to reconsider fitness tracker banWorld No.1 Aryna Sabalenka has urged the Australian Open to reconsider its ban on ITF-approved fitness trackers after voicing frustration following a dominant Melbourne quarter-final win that kept her on track for a third title in four years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-extends-melbourne-stars-contract-bbl-16-squad-update-2858431-2026-01-27",
      "headline": "BBL: Glenn Maxwell signs two-year contract extension with Melbourne StarsGlenn Maxwell has renewed his contract with Melbourne Stars for two more years. Maxwell has featured in 123 matches and amassed 3,193 runs in the green jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-media-accreditation-rejected-icc-rework-process-reports-2858424-2026-01-27",
      "headline": "Bangladesh media claim T20 WC accreditation rejected, ICC reworks process: ReportThe ICC has reworked its media accreditation process for Bangladeshi journalists after Bangladesh's T20 World Cup withdrawal. The move follows claims of rejected applications and fresh uncertainty over coverage in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-elina-svitolina-australian-open-2026-semi-finals-2858409-2026-01-27",
      "headline": "Zverev overcomes Tien to reach semis, Svitolina knocks out GauffAlexander Zverev battled past Learner Tien in Tuesday's quarter-finals to book his place in the semi-finals, while Elina Svitolina stunned Coco Gauff to advance to the last four at the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-abhishek-sharma-troubles-new-zealand-bowling-jacob-oram-2858400-2026-01-27",
      "headline": "Why are NZ unable to stop Abhishek Sharma's mayhem? Bowling coach revealsAbhishek Sharma's explosive batting has left New Zealand bowlers struggling in the ongoing T20I series. New Zealand aims to learn from this experience as they prepare for the T20 World Cup 2026, revealed bowling coach Jacob Oram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/michael-schumacher-recovery-update-sitting-upright-after-skiing-accident-2858365-2026-01-27",
      "headline": "Michael Schumacher no longer bedridden, shows rare progress 12 years after accidentTwelve years after his devastating skiing accident, Formula One legend Michael Schumacher has shown rare signs of progress, with a Fox Sports report stating that he is no longer bed-bound."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-scotland-pakistan-origin-pacer-india-visa-confident-bangladesh-2858353-2026-01-27",
      "headline": "T20 World Cup: Scotland confident on getting India visa for Pakistan-origin pacerScotland are confident of securing Indian visas in time for the T20 World Cup despite late entry. Cricket Scotland expects Pakistan-origin pacer Safyaan Sharif and teammates to receive clearance before travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-richardson-retires-professional-cricket-impactful-bowling-career-2858340-2026-01-27",
      "headline": "Australia's T20 World Cup winner Richardson retires from professional cricketKane Richardson, a member of Australia's 2021 T20 World Cup-winning squad and one of the Big Bash League's most prolific bowlers, has announced his retirement from professional cricket after 17 seasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-under-19-world-cup-live-score-vaibhav-suryavanshi-2858296-2026-01-27",
      "headline": "IND vs ZIM, U-19 live: India U19 hammer Zimbabwe by 204 runsIND vs ZIM, U-19 World Cup live score: India have continued their dominating run in the tournament with a dominating 204-run win at the Queens Sports Oval in Bulawayo. Vihaan Malhotra scored a hundred after which Ayush Mhatre and Udhav Mohan's three-wicket haul took India past the finish line. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-shakib-al-hassan-eyewash-tamim-iqbal-reaction-bcb-2858294-2026-01-27",
      "headline": "Is Shakib homecoming Bangladesh's eyewash after T20 World Cup axe? Ex-captain in splitsTamim Iqbal has warned Bangladesh against using Shakib Al Hasan as an eyewash after the T20 World Cup setback. The former captain said Shakib's return must be based on merit, not damage control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-winner-with-virat-kohli-ajitesh-argal-wpl-2026-umpire-2858284-2026-01-27",
      "headline": "Once an U19 World Cup winner with Virat Kohli, Ajitesh Argal now officiates in WPLOnce an U19 World Cup winner alongside Virat Kohli, Ajitesh Argal's journey through Indian cricket has taken a quiet but compelling turn. In the ongoing season of the Women's Premier League (WPL), Argal has been seen not with the ball in hand but with an umpire's counter, officiating at the highest level of the women's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sanju-samson-lean-patch-t20-world-cup-ajinkya-rahane-back-advice-2858265-2026-01-27",
      "headline": "India should continue to back Sanju Samson: Rahane's advice for struggling openerAjinkya Rahane has urged India to continue backing Sanju Samson despite his lean run in the T20I series. The former batter stressed belief, freedom and patience as key during the World Cup build-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-trains-with-young-bowlers-jsca-ranchi-ipl-2026-preparation-2858261-2026-01-27",
      "headline": "MS Dhoni shares wisdom with youngsters at Jharkhand nets, begins IPL preparationsMS Dhoni was spotted training with youngsters at the JSCA International Cricket Stadium in Ranchi. He also guided the emerging talent, sharing his experiences with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-usa-boycott-sepp-blatter-urges-fans-former-president-ice-agents-2858244-2026-01-27",
      "headline": "Former FIFA President joins World Cup boycott calls, urges fans to stay away from USAFormer FIFA president Sepp Blatter has backed boycott calls, urging fans to avoid the USA during the 2026 World Cup. He cites security, civil rights, travel bans and immigration enforcement concerns surrounding tournament hosts now."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}