{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-4x-expected-listing-gain-gmp-close-to-100-percent-2597080-2024-09-10",
      "headline": "Bajaj Housing Finance IPO subscribed over 4x, GMP nears 100%Bajaj Housing Finance has demonstrated impressive growth, with a compound annual growth rate (CAGR) of 30.9% in AUM from Fiscal 2022 to 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jupiter-wagons-stock-price-down-correction-good-buying-opportunity-2597061-2024-09-10",
      "headline": "Jupiter Wagons stock down 12% in a month. Is it a buying opportunity?On Tuesday, the stock extended its losses, dropping to a day's low of Rs 490. At 1:22 pm, shares of Jupiter Wagons were trading 1.24% lower at Rs 502.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/p-n-gadgil-jewellers-ipo-opens-review-good-bad-subscribe-skip-expert-view-gmp-2597060-2024-09-10",
      "headline": "P N Gadgil Jewellers IPO opens: Should you subscribe or skip?P N Gadgil Jewellers IPO is a book-built issue which includes a fresh issue of 1.77 crore shares, amounting to Rs 850 crore, and an offer for sale of 52 lakh shares, totalling Rs 250 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-power-share-price-gains-today-solar-power-cell-production-explained-2597031-2024-09-10",
      "headline": "Explained: Why Tata Power shares soared over 5% today Tata Power shares jumped after the company's subsidiary, TP Solar, began commercial production of solar cells at its new plant in Tirunelveli, Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-up-5-percent-bull-run-key-triggers-analyst-view-2597004-2024-09-10",
      "headline": "Suzlon Energy shares up 5%. Will positive momentum continue? Suzlon Energy shares were up nearly 5% after the company announced a major 1.17 GW order win from NTPC Green Energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adanis-usd-185-billion-airport-deal-in-kenya-nairobi-jomo-kenyatta-hits-legal-roadblock-2596992-2024-09-10",
      "headline": " Gautam Adani's $1.85 billion airport deal in Kenya hits legal roadblockThe deal faced opposition from various groups in Kenya, with a key legal challenge filed by the Kenya Human Rights Commission and the Law Society of Kenya"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-surges-stock-trend-expert-view-2596958-2024-09-10",
      "headline": "Explained: Why Paytm shares jumped 9% in early tradeIn the past week, Paytm's share price has risen by more than 13%, and in the last month, it has gone up by over 30%. Over the last three months, Paytm's stock has jumped by more than 74%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-join-hands-to-expand-semiconductor-industry-chips-act-itsi-all-you-need-to-know-2596941-2024-09-10",
      "headline": "US, India join hands to expand semiconductor industry. All you need to know The US Department of State will collaborate with the India Semiconductor Mission, under India's Ministry of Electronics and IT, to explore ways to grow and diversify the semiconductor ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-worlds-first-trillionaire-gautam-adani-second-in-line-dubai-based-informa-connect-academy-2596928-2024-09-10",
      "headline": "Elon Musk set to be world's 1st trillionaire, second could be an IndianTesla CEO Elon Musk is set to become the world's first trillionaire, with an Indian business tycoon close behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-marginally-higher-on-positive-global-cues-paytm-up-9-percent-2596922-2024-09-10",
      "headline": "Sensex, Nifty open marginally higher on positive global cues; Paytm up 9%The S&P BSE Sensex was down 47.27 points to 81,512.27, while the NSE Nifty50 shed 18.70 points to 24,917.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wazirx-security-partner-liminal-company-cyberattack-security-breach-audit-findings-2596809-2024-09-09",
      "headline": "Crypto firm WazirX's security partner says no evidence of cyberattack on its systemThe cyberattack on crypto exchange WazirX in July, that led to a loss of about Rs 2,000 crore in digital assets, had originated from their end, according to its security partner and digital asset custody company, Liminal Custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rates-cancer-drugs-namkeen-health-insurance-postponed-nirmala-sitharaman-2596666-2024-09-09",
      "headline": "GST rates on cancer drugs cut, decision on health insurance postponedFinance Minister Nirmala Sitharaman, who chaired the GST Council meeting, said that GST rates on some cancer drugs have been reduced to 5 per cent from 12 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-insurance-premiums-to-next-meeting-report-2596572-2024-09-09",
      "headline": "GST Council delays decision on insurance premiums to next meeting: ReportCurrently, policyholders are paying 18% GST on their premiums, and many hoped this rate would be reduced to ease the financial pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-fully-subscribed-on-day-1-check-latest-gmp-subscription-2596536-2024-09-09",
      "headline": "Bajaj Housing Finance IPO fully subscribed. Check latest GMP, subscriptionBajaj Housing Finance IPO fully subscribed: The proceeds from this public offering will be used to strengthen Bajaj Housing Finance's capital base, positioning it to meet future business needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-end-higher-as-financial-stocks-surge-godfrey-phillips-down-5-percent-2596482-2024-09-09",
      "headline": "Sensex, Nifty end higher as financial stocks surge, Godfrey Phillips down 5%The S&P BSE Sensex added 375.61 points to close at 81,559.54, while the Nifty50 gained 84.25 points to end at 24,936.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-civil-aviation-minister-ram-mohan-naidu-government-to-monitor-airline-prices-amid-holiday-travel-surge-2596476-2024-09-09",
      "headline": "Government to monitor airline prices amid holiday travel surgeThe festive season typically sees a spike in travel demand, which often leads to increased ticket prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-madhabi-puri-buch-cotroversy-allegations-hindenburg-congress-internal-protests-2596441-2024-09-09",
      "headline": "Caught in a whirlwind: Sebi's Madhabi Puri Buch faces mounting scrutinyUnder increasing pressure from external allegations and internal unrest, Sebi Chairperson Madhabi Puri Buch faces a turbulent period marked by accusations of conflict of interest and claims of a toxic work culture. The path ahead remains uncertain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/18-percent-gst-income-on-transactions-under-rs-2000-awaits-fitment-committee-call-report-2596433-2024-09-09",
      "headline": " 18% GST on transactions under Rs 2,000 awaits fitment committee's call: ReportThe GST council did not make a final decision and chose to refer the issue to the fitment committee for further analysis and recommendations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscribe-or-not-key-details-price-band-gmp-and-brokerage-preview-2596377-2024-09-09",
      "headline": "Bajaj Housing Finance IPO: Should you subscribe or skip?Bajaj Housing Finance IPO: The company aims to raise up to Rs 7,000 crore through the IPO, which includes both fresh equity and an offer-for-sale component."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-factory-closure-germany-first-time-87-years-cut-cost-carmaker-manufacturing-2596366-2024-09-09",
      "headline": "Volkswagen proposes first-ever factory closure in Germany. Why it's a big deal?Volkswagen's management has revealed that the company's core brand needs to save 10 billion euros by 2026. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-says-sikhs-not-allowed-to-wear-turbans-in-india-bjp-reaction-national-spokesperson-rp-singh-2596960-2024-09-10",
      "headline": "Row over Rahul Gandhi's remark on Sikhs in India, BJP asks 'Remember 1984?'Congress MP Rahul Gandhi sparked controversy with remarks on religious freedom in India, specifically addressing the Sikh community, during an event in Herndon, Virginia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sitaram-yechury-critical-respiratory-support-doctors-monitoring-condition-cpim-general-secrtary-health-update-2597020-2024-09-10",
      "headline": "CPI(M) leader Sitaram Yechury on respiratory support, condition criticalThe CPI(M) said in a statement that Yechury is admitted at the intensive care unit of the hospital and is being treated for an acute respiratory tract infection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-mother-slams-mamata-banerjee-durga-puja-festivities-money-bjp-suvendu-adhikari-2596976-2024-09-10",
      "headline": "Kolkata doctor's mother blasts Mamata Banerjee's 'insensitive' Durga Puja callWest Bengal Chief Minister Mamata Banerjee's call for the public to focus on Durga Puja celebrations instead of protesting the rape and murder of a Kolkata doctor has ignited outrage, particularly from the victim's grieving mother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-is-bringing-sleep-apnea-detection-to-apple-watch-and-this-could-be-game-changer-for-many-indians-2597065-2024-09-10",
      "headline": "Apple is bringing sleep apnea detection to Apple WatchApple introduced a new Sleep Apnea detection feature with the launch of the Apple Watch Series 10. The feature is aimed at helping users detect if they are suffering from Sleep Apnea and take timely action by monitoring breathing disturbances during sleep. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-your-nail-polish-toxic-2596627-2024-09-10",
      "headline": "Is your nail polish toxic?Experts suggest avoiding ingredients like toluene, formaldehyde, and dibutyl phthalate, as they can be toxic to the body and come with numerous side effects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-three-districts-curfew-imposed-imphal-west-east-thoubal-violence-drone-rocket-attacks-2596988-2024-09-10",
      "headline": "Curfew imposed in three Manipur districts amid drone, rocket attacksThe conflict in Manipur has escalated again, with recent incidents of violence and protests adding to the turmoil. Due to the escalation of violence in the state, a curfew has been imposed in Imphal East, Imphal West and Thoubal districts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-worlds-first-trillionaire-gautam-adani-second-in-line-dubai-based-informa-connect-academy-2596928-2024-09-10",
      "headline": "Elon Musk set to be world's 1st trillionaire, second could be an IndianTesla CEO Elon Musk is set to become the world's first trillionaire, with an Indian business tycoon close behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-psychological-collapse-speaks-to-god-rahul-gandhi-us-visit-lok-sabha-elections-fairness-2597005-2024-09-10",
      "headline": "Knew it was psychological collapse when PM said he speaks to God: Rahul Gandhi Congress MP Rahul Gandhi suggested that PM Modi's statement about speaking to God was a sign of \"psychological collapse\" and a loss of confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/camera-button-is-key-feature-of-iphone-16-and-iphone-16-pro-here-is-everything-it-will-do-2596925-2024-09-10",
      "headline": "Check out Camera Control, the coolest feature of iPhone 16 and iPhone 16 ProThe new Camera Control on iPhone 16 series adds an interesting feature, which can be used for a number of different functions while capturing. Let's find out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-bjp-chief-son-sanket-bawankule-audi-accident-nagpur-occupants-drunk-cctv-2597036-2024-09-10",
      "headline": "Maharashtra BJP chief's son was inside Audi, 2 other occupants were drunk: CopsThe Audi car owned by Chandrashekhar Bawankule's son hit several vehicles in Nagpur's Ramdaspeth, injuring two people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-vs-sachin-tendulkar-statistical-comparison-2596496-2024-09-10",
      "headline": "How realistic is Joe Root's threat to Sachin Tendulkar's record?England batter Joe Root is slowly closing in on Sachin Tendulkar in the list of leading run scorers in Test cricket. Here's a look at their numbers at different stages of their career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/mpox-doesnt-easily-spread-through-air-transmits-human-to-human-person-to-person-2597041-2024-09-10",
      "headline": "Mpox doesn't easily spread through air: How it transmits among humansA study by the US health agency has suggested that mpox cannot easily spread through air. The dangerous new strain of mpox has been reported to be transmitted via sexual conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dubai-princess-sheikha-mahra-al-maktoum-launches-perfume-divorce-weeks-after-public-split-with-husband-2596932-2024-09-10",
      "headline": "Dubai princess launches perfume 'Divorce' weeks after public split with husbandDubai Princess Shaikha Mahra Mohammed Rashed Al Maktoum has launched a perfume - 'Divorce.' This comes weeks after she publicly divorced her husband in an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-ajmer-train-derailment-bid-cement-blocks-railway-tracks-case-registered-police-2596894-2024-09-10",
      "headline": "Second train derailment bid in 2 days, cement blocks found on track in AjmerA major train tragedy was averted also on Sunday when the Kalindi Express, travelling from Prayagraj to Bhiwani in Haryana, hit an LPG cylinder placed on the rail track in Kanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/kerala-high-court-government-malayalam-film-industry-metoo-sexual-assault-cases-justice-hema-committee-report-slams-2596933-2024-09-10",
      "headline": "Court blasts Kerala over #MeToo cases in film industry: Silence not an optionThe Kerala High Court pulled up the state government for inaction over the Justice Hema committee report, which exposed sexual exploitation of women in the Malayalam film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-15-and-iphone-14-india-prices-officially-reduced-by-rs-10000-here-are-the-new-prices-2597032-2024-09-10",
      "headline": "iPhone 15 and iPhone 14 India prices officially reduced by Rs 10,000: Here are the new pricesApple reduces iPhone 15 and iPhone 14 prices in India by Rs 10,000, making premium models more affordable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-siddharth-apple-event-tim-cook-2596926-2024-09-10",
      "headline": "Camera Control and smile. Actors Aditi Rao, Siddharth with Apple boss Tim CookActors Aditi Rao Hydari and Siddharth attended the launch of iPhone 16 in the USA. They shared new pictures with Apple CEO, Tim Cook, on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-blasts-democratic-party-illegal-immigration-us-election-2024-donald-trump-2596983-2024-09-10",
      "headline": "Elon Musk blasts Democrats over illegal immigration: Last real election if... In a tweet, the Tesla CEO alleged that the goal of almost all Democratic leaders was to \"legalise 15 million illegal immigrants as soon as possible, as well as bring in tens of millions more\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/iphone-16-pro-16-pro-max-first-look-whats-new-and-should-you-buy-the-new-apple-flagships-2596977-2024-09-10",
      "headline": "iPhone 16 Pro, 16 Pro Max first look: What's new and should you buy it?The Apple iPhone 16 Pro and 16 Pro Max bring significant updates for the camera and the two phones also get a new A18 Pro processor that is faster and more energy efficient. Here's a quick look at what the two phones offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-to-call-home-share-latest-update-after-starliners-empty-return-2596948-2024-09-10",
      "headline": "Sunita Williams to call home, share updates after Starliner's returnThe Earth-to-space call is scheduled for Friday, September 13, where astronauts Sunita Williams and Butch Wilmore will participate in a news conference from the International Space Station (ISS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/auto-news/story/mercedes-benz-e-class-2596463-2024-09-10",
      "headline": "2024 Mercedes-Benz E-Class first look: A selfie camera, more tech and luxury than ever beforeIt has been 30 years since Mercedes-Benz launched the E-Class in India as the W124 variant. Now it is time to launch the V214 version, and it sure is after keeping the passenger pampered to an all-new level.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/apple-iphone-16-and-iphone-16-pro-quick-review-all-the-changes-you-cannot-see-2596870-2024-09-10",
      "headline": "Apple iPhone 16 and iPhone 16 Pro quick review: All the changes you cannot seeApple has launched new iPhones: the iPhone 16, iPhone 16 Plus, iPhone 16 Pro and the iPhone 16 Pro Max. They might look familiar but there are some significant changes under the hood. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/dont-hate-mr-modi-rahul-gandhi-us-university-event-2596965-2024-09-10",
      "headline": "Don't hate Mr Modi, says Rahul Gandhi at US university eventThe Leader of Opposition in the Lok Sabha and Congress MP, Rahul Gandhi, stated that his point is view is different from that of Prime Minister Narendra Modi's, but he doesn't hate PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-four-astronauts-set-to-launch-on-private-polaris-dawn-mission-2588144-2024-09-10",
      "headline": "LIVE: Polaris Dawn launch delayed by two hours due to poor weatherThis endeavour will test SpaceX's new extravehicular activity (EVA) suits, designed for future long-duration missions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-hilarious-reply-father-chunky-panday-asks-her-cook-every-day-2597070-2024-09-10",
      "headline": "Ananya Panday's hilarious reply to Chunky after he asks her to cook dailyAnanya Panday had a humorous exchange with her father Chunky Panday when he asked her to cook daily. The actor is currently seen in Call Me Bae."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/khel-khel-mein-director-mudassar-aziz-akshay-kumar-low-phase-2597057-2024-09-10",
      "headline": "Khel Khel Mein director opens up about Akshay Kumar's low phaseMudassar Aziz, director of Khel Khel Mein, discussed Akshay Kumar's recent career challenges, comparing them to a cricketer's temporary dip in form while affirming his enduring talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stree-2-box-office-collection-day-26-rajkummar-rao-shraddha-kapoor-2597053-2024-09-10",
      "headline": "Stree 2 box office Day 26: Rajkummar Rao film now competing with JawanStree 2, starring Rajkummar Rao and Shraddha Kapoor, continues to perform well at the box office. The film is close to surpassing the lifetime collection of Shah Rukh Khan's Jawan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/priyanka-chahar-choudhary-ankit-gupta-perform-aarti-ganpati-visarjan-2597050-2024-09-10",
      "headline": "Watch: Priyanka Choudhary, Ankit Gupta perform 'aarti' during Ganpati 'visarjan'Actors Priyanka Chahar Choudhary and Ankit Gupta performed 'aarti' together during Ganpati 'visarjan'. The two were also joined by Abhishek Kumar. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-steve-smith-opening-test-coach-andrew-mcdonald-2597074-2024-09-10",
      "headline": "Will Steve Smith continue to open in Tests? Australia still undecided, says coachAustralia head coach Andrew McDonald refused to give away details about their plans for the upcoming Test series. McDonald said the team management and captain Pat Cummins have been discussing the team composition, including Steve Smith's role as opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-dhruv-jurel-wicketkeeper-rishabh-pant-australia-deep-dasgupta-2597003-2024-09-10",
      "headline": "Dhruv Jurel is impressive, will be handy in Australian conditions: Deep DasguptaSpeaking to IndiaToday.in, former wicketkeeper Deep Dasgupta backed Dhruv Jurel's chances of making a mark in the upcoming Test season. Dhruv was one of the three wicketkeeper-batters picked in India's squad for their two-match Test series against Bangladesh, starting September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-dances-with-us-open-trophy-to-celebrate-3rd-major-triumph-2596999-2024-09-10",
      "headline": "Watch: Aryna Sabalenka dances with US Open Trophy to celebrate 3rd major triumphAryna Sabalenka was seen dancing with the US Open trophy after winning her third major title by beating Jessica Pegula in the final at flushing meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-greater-noida-test-facilities-poor-drainage-2596961-2024-09-10",
      "headline": "Afghanistan vs New Zealand Test in limbo due to poor facilities in Greater Noida Afghanistan vs New Zealand, one-off Test: Poor facilities and lack of proper planning have hampered the Shaheed Vijay Singh Pathik Sports Complex's Test debut. The Greater Noida stadium has come under the scanner after the opening day of the Test was washed out and the start of the second day was delayed due to a wet outfield. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/indian-paralympians-get-rousing-reception-upon-arrival-in-new-delhi-2596945-2024-09-10",
      "headline": "Watch: Indian Paralympians get rousing reception upon arrival in New DelhiThe Indian Paralympic contingent got a rousing reception upon their return from Paris. India recorded their best medal tally at the Paralympics with 29 medals to their name, including seven gold, nine silver and 13 bronze. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-announce-squad-for-womens-t20-world-cup-2024-rosemary-mair-returns-2596936-2024-09-10",
      "headline": "New Zealand announce squad for women's T20 World Cup 2024, Rosemary Mair returnsNew Zealand announced the squad for the women's T20 World Cup 2024 set to be played in UAE from October 3. Sophie Devine is set to lead the team for the final time in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-hits-back-at-trolls-for-belittling-her-2012-olympics-bronze-medal-2596907-2024-09-10",
      "headline": "Saina Nehwal hits back at trolls for belittling her 2012 Olympics bronze medalIndia badminton star Saina Nehwal has hit back at her trolls for questioning her bronze medal win during the 2012 London Olympics. Nehwal became the first Indian shuttle to win a bronze medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-vs-sachin-tendulkar-statistical-comparison-2596496-2024-09-10",
      "headline": "How realistic is Joe Root's threat to Sachin Tendulkar's record?England batter Joe Root is slowly closing in on Sachin Tendulkar in the list of leading run scorers in Test cricket. Here's a look at their numbers at different stages of their career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-gives-bizarre-coldplay-analogy-after-third-test-loss-vs-sri-lanka-eng-vs-sl-2596880-2024-09-10",
      "headline": "Joe Root gives bizarre Coldplay analogy after third test loss against Sri Lanka Star England batter Joe Root compared the England cricket team with the British band Coldplay following their loss against Sri Lanka in the third Test at Kennington Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayals-father-praises-sons-fighting-spirit-after-maiden-india-call-up-2596851-2024-09-10",
      "headline": "Yash Dayal's father praises son's fighting spirit after maiden India call upYash Dayal's father Chandrapal reflected on his son's struggles after his maiden call up to the Indian team for the Bangladesh series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowl-beat-ireland-out-for-45-275-run-victory-beaumont-150-2nd-odi-2596806-2024-09-09",
      "headline": "England bowl Ireland out for 45, register a record 275-run winEngland women romped to a record 275-run victory over Ireland in the second ODI in Belfast, bowling their hosts out for just 45 to clinch a series win with one game to play.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-hits-back-at-trolls-for-belittling-her-2012-olympics-bronze-medal-2596907-2024-09-10",
      "headline": "Saina Nehwal hits back at trolls for belittling her 2012 Olympics bronze medalIndia badminton star Saina Nehwal has hit back at her trolls for questioning her bronze medal win during the 2012 London Olympics. Nehwal became the first Indian shuttle to win a bronze medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-vs-sachin-tendulkar-statistical-comparison-2596496-2024-09-10",
      "headline": "How realistic is Joe Root's threat to Sachin Tendulkar's record?England batter Joe Root is slowly closing in on Sachin Tendulkar in the list of leading run scorers in Test cricket. Here's a look at their numbers at different stages of their career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-gives-bizarre-coldplay-analogy-after-third-test-loss-vs-sri-lanka-eng-vs-sl-2596880-2024-09-10",
      "headline": "Joe Root gives bizarre Coldplay analogy after third test loss against Sri Lanka Star England batter Joe Root compared the England cricket team with the British band Coldplay following their loss against Sri Lanka in the third Test at Kennington Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayals-father-praises-sons-fighting-spirit-after-maiden-india-call-up-2596851-2024-09-10",
      "headline": "Yash Dayal's father praises son's fighting spirit after maiden India call upYash Dayal's father Chandrapal reflected on his son's struggles after his maiden call up to the Indian team for the Bangladesh series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowl-beat-ireland-out-for-45-275-run-victory-beaumont-150-2nd-odi-2596806-2024-09-09",
      "headline": "England bowl Ireland out for 45, register a record 275-run winEngland women romped to a record 275-run victory over Ireland in the second ODI in Belfast, bowling their hosts out for just 45 to clinch a series win with one game to play.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-becomes-co-owner-of-kerala-super-league-club-malappuram-fc-2596807-2024-09-09",
      "headline": "Sanju Samson becomes co-owner of Kerala Super League club Malappuram FCIndia cricketer Sanju Samson has become the co-owner of the Kerala Super League club, Malappuram FC. The club made the announcement on Monday, September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/intercontinental-cup-2024-india-vs-syria-manolo-marquez-reaction-hyderabad-2596790-2024-09-09",
      "headline": "3-0 is not what happened: India boss Manolo Marquez happy despite Syria lossIndia boss Manolo Marquez said that he was happy with his side's performance despite their 3-0 loss to Syria in the Intercontinental Cup 2024 on Monday, September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/harry-kane-wants-to-match-cristiano-ronaldo-longevity-2596775-2024-09-09",
      "headline": "Kane inspired by Ronaldo's longevity: Want to play for as long as possibleHarry Kane has stated that he believes he is at his \"physical and mental peak\" and underlined his intention to emulate Cristiano Ronaldo by playing into his late thirties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/intercontinental-cup-2024-india-vs-syria-report-manolo-marquez-hyderabad-2596749-2024-09-09",
      "headline": "Intercontinental Cup 2024: Syria down hapless India 3-0 to win titleSyria downed a hapless India 3-0 to secure the Intercontinental Cup 2024 on Monday, September 2024 in Hyderabad. The Indian defence had a rough day at the office as Manolo Marquez' first assignment as coach ended on a sour note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bajrang-punia-takes-nada-to-court-to-compete-in-the-world-wrestling-championships-2596743-2024-09-09",
      "headline": "Bajrang takes NADA to court to compete in World Wrestling ChampionshipsOlympic bronze medallist Bajrang Punia has moved the Delhi High Court against NADA, seeking permission to compete in the World Wrestling Championships after being suspended. Bajrang alleged multiple violations by NADA during the doping test process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-rankings-us-open-champion-jannik-sinner-no-1-spot-taylor-fritz-top-10-2596723-2024-09-09",
      "headline": "Jannik Sinner tightens grip on No. 1 spot, Taylor Fritz returns to top 10US Open men's singles champion Jannik Sinner tightened his grip on the No. 1 spot while runner-up Taylor Fritz returned to the top 10 in the ATP rankings at No. 7 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-deepthi-jeevanji-interview-villagers-mocking-parents-sell-land-2596708-2024-09-09",
      "headline": "Mocked by neighbours, Deepthi fights social stigma to win Paralympic medalParalympics 2024: Speaking to India Today, track and field medalist Deepthi Jeevanji recalled her tough road to glory. Deepthi, 20, faced hostility from a bunch of superstitious neighbours, who ridiculed her intellectual impairment and suggested she be sent to an orphanage"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-start-sarfaraz-khan-test-vs-bangladesh-musheer-india-a-2596704-2024-09-09",
      "headline": "KL Rahul likely to start ahead of Sarfaraz Khan in Test series vs BangladeshKL Rahul's experience in Test cricket is expected to give him the edge over the fearless Sarfaraz Khan for India's Test series against Bangladesh. The team management is also focusing on the upcoming tour of Australia, where Rahul's past performances may prove crucial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bajrang-punia-takes-nada-to-court-to-compete-in-the-world-wrestling-championships-2596743-2024-09-09",
      "headline": "Bajrang takes NADA to court to compete in World Wrestling ChampionshipsOlympic bronze medallist Bajrang Punia has moved the Delhi High Court against NADA, seeking permission to compete in the World Wrestling Championships after being suspended. Bajrang alleged multiple violations by NADA during the doping test process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-rankings-us-open-champion-jannik-sinner-no-1-spot-taylor-fritz-top-10-2596723-2024-09-09",
      "headline": "Jannik Sinner tightens grip on No. 1 spot, Taylor Fritz returns to top 10US Open men's singles champion Jannik Sinner tightened his grip on the No. 1 spot while runner-up Taylor Fritz returned to the top 10 in the ATP rankings at No. 7 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-deepthi-jeevanji-interview-villagers-mocking-parents-sell-land-2596708-2024-09-09",
      "headline": "Mocked by neighbours, Deepthi fights social stigma to win Paralympic medalParalympics 2024: Speaking to India Today, track and field medalist Deepthi Jeevanji recalled her tough road to glory. Deepthi, 20, faced hostility from a bunch of superstitious neighbours, who ridiculed her intellectual impairment and suggested she be sent to an orphanage"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-start-sarfaraz-khan-test-vs-bangladesh-musheer-india-a-2596704-2024-09-09",
      "headline": "KL Rahul likely to start ahead of Sarfaraz Khan in Test series vs BangladeshKL Rahul's experience in Test cricket is expected to give him the edge over the fearless Sarfaraz Khan for India's Test series against Bangladesh. The team management is also focusing on the upcoming tour of Australia, where Rahul's past performances may prove crucial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-third-test-ollie-pope-reaction-oval-2596680-2024-09-09",
      "headline": "Credit to Sri Lanka but Oval Test loss not down to 'complacency': Ollie PopeEngland's stand-in captain Ollie Pope has claimed that complacency wasn't a reason behind his side's loss to Sri Lanka at the Oval on Monday, September 9. Sri Lanka prevented a clean sweep by the hosts on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paris-paralympics-deepthi-jeevanji-neighbours-parents-land-warangal-2596667-2024-09-09",
      "headline": "'Neighbours used to call me monkey': Deepthi Jeevanji recalls road to Paralympics gloryParis Paralympics: Deepthi Jeevanji, speaking to India Today, recalled her battle against the odds and support from family in her journey to Paralympic glory. The 20-year-old from Warangal, Telangana, won a bronze medal in the women's 400m T20 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/olly-stone-to-replace-rested-gus-atkinson-in-england-squad-for-australia-odis-2596660-2024-09-09",
      "headline": "Olly Stone to replace rested Gus Atkinson in England squad for Australia ODIsThe England and Wales Cricket Board (ECB) announced that fast bowler Gus Atkinson will be rested for this month's One-Day International series against Australia, with Olly Stone selected as his replacement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-england-oval-test-dhananjaya-de-silva-reaction-2596655-2024-09-09",
      "headline": "Sri Lanka's De Silva emotional after rare England win: Happiest moment Sri Lanka captain Dhananjaya de Silva was emotional after leading his team to a remarkable Test victory over England at The Oval. The eight-wicket win marked Sri Lanka's first Test triumph on English soil in a decade."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}