{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-gives-up-listing-gains-slides-4-after-weak-debut-hold-or-sell-2720209-2025-05-06",
      "headline": "Ather Energy gives up listing gains, slides 4% after weak debut. Hold or sell?Ather Energy's stock opened at Rs 328 on the NSE, up 2.2% over its issue price of Rs 321, but slipped over 4% to an intraday low of Rs 308.95 amid weak market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-today-know-why-sensex-nifty-falling-2720190-2025-05-06",
      "headline": "Sensex down over 200 points. Why is the stock market down today?As of 10:48 am, the BSE Sensex was down 213.43 points at 80,583.41, while the NSE Nifty50 slipped 72.40 points to 24,388.75. Broader indices saw sharper cuts, with the Nifty midcap and smallcap indices falling around 1% each, reflecting risk-off sentiment in domestic-focused sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-makes-lukewarm-market-debut-lists-just-2-percent-above-ipo-price-2720179-2025-05-06",
      "headline": "Ather Energy makes muted debut on Dalal Street, lists 2% above IPO priceAt the time of listing, the Bengaluru-based company was valued at around Rs 12,144 crore, slightly below its implied market capitalisation of Rs 12,300 crore at the upper end of the IPO price band (Rs 304–Rs 321)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/japans-smbc-likely-in-advanced-talks-to-buy-majority-stake-in-yes-bank-share-price-market-reaction-2720169-2025-05-06",
      "headline": "Explained: Why Yes Bank shares are rising todayYes Bank shares rose sharply as shareholders reacted positively to the news. At around 9:43 am, shares of the bank were trading 5.30% higher at Rs 18.69."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-80-points-nifty-above-24400-pharma-stocks-tumble-2720159-2025-05-06",
      "headline": "Sensex down over 80 points, Nifty above 24,400; pharma stocks tumbleThe BSE Sensex was down 28.27 points to trade at 80,768.57 around 9:24 am, while the NSE Nifty50 was down 10.85 points to 24,450.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-slips-snapping-9-day-rally-as-oil-prices-hit-4-year-low-2720098-2025-05-06",
      "headline": "Wall Street slips, snapping 9-day rally as oil prices hit 4-year lowWall Street's nine-day winning streak ended Monday as oil prices fell to a four-year low following an OPEC+ output boost. Tech stocks and Buffett's exit also weighed on markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-itr-forms-1-to-5-out-which-one-should-you-use-itr-sahaj-itr-sugam-2719911-2025-05-05",
      "headline": "ITR filing 2025: Forms 1 to 5 notified, which one should you use?ITR-1, or Sahaj, is for resident individuals whose total income is not more than Rs 50 lakh. If your income is from a salary or pension, one house property, bank deposit interest, or agricultural income not more than Rs 5,000, then this form is suitable for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/samsung-challenges-520-million-dollars-tax-notice-in-india-report-2719884-2025-05-05",
      "headline": "Samsung challenges $520 million tax notice in India: ReportThe case revolves around how the company imported telecom equipment between 2018 and 2021. According to tax officials, Samsung mislabelled these imports to pay lower customs duties of 10–20%, which has now triggered a hefty penalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mba-making-broke-adults-redditor-exposes-real-life-after-elite-placements-2719797-2025-05-05",
      "headline": "'Making broke adults': Redditor's viral post shreds MBA salary dreamsA viral Reddit post lists some real offers seen on LinkedIn and compares the shiny package (CTC or cost-to-company) with the actual in-hand salary after taxes and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/job-change-and-no-epf-transfer-you-might-be-losing-825-interest-earnings-2719834-2025-05-05",
      "headline": "Job change and no EPF transfer? You might be losing 8.25% interest earningsWhen you switch jobs, your Universal Account Number (UAN) stays the same, but your EPF account with your old employer doesn't automatically move to the new one. You have to transfer it yourself through the EPFO Member Sewa portal."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-instagram-post-about-met-gala-2025-with-turban-culture-mother-tongue-main-hoon-punjab-2720259-2025-05-06",
      "headline": "Main hoon Punjab: Diljit wraps Met Gala with 'turban, culture, mother tongue' For Diljit Dosanjh, heritage and culture came first and fashion later as he walked the blue carpet at the Met Gala 2025. The 41-year-old took a bit of Punjab's royal history in his Maharaja-inspired look at the fashion's biggest night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-tej-lavanya-tripathi-announce-pregnancy-2720246-2025-05-06",
      "headline": "Telugu actors Varun Tej, Lavanya Tripathi announce pregnancyTelugu actors Varun Tej and Lavanya Tripathi announced that they are expecting their first child. They shared the announcement on their social media pages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shakira-shares-car-with-diljit-dosanjh-says-hi-india-in-viral-met-gala-clip-2720238-2025-05-06",
      "headline": "Shakira shares car with Diljit Dosanjh, says 'Hi, India' in viral Met Gala clipDiljit Dosanjh reunited with Priyanka Chopra and Nick Jonas at the Met Gala. The singer even shared a car with Shakira while making his way to the prestigious event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-wins-hearts-as-he-supports-mother-to-be-kiara-advani-at-met-gala-2025-2720222-2025-05-06",
      "headline": "Sidharth Malhotra wins hearts as he supports mother-to-be Kiara at Met Gala 2025Sidharth Malhotra's support for pregnant wife Kiara Advani at Met Gala 2025 touched hearts, even without a red carpet appearance. A viral video and his heartfelt tribute online made their quiet moment the real showstopper."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-teaser-netflix-2720212-2025-05-06",
      "headline": "Squid Game 3 teaser: No dialogue, just dread as final game resumesNetflix's teaser for 'Squid Game' Season 3 hints at a darker, more dramatic finale as Seong Gi-hun awakens in a coffin, sparking theories about new game dynamics and unseen threats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-introduces-himself-at-met-gala-fans-say-foreign-media-failed-to-recognise-him-2720192-2025-05-06",
      "headline": "SRK introduces himself at Met Gala, fans say foreign media failed to recognise himShah Rukh Khan's Met Gala debut was nothing short of iconic. In one of the viral moments from the blue carpet, the actor was seen introducing himself to the foreign media and fans thought the media failed to recognise him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-on-owning-met-gala-2025-with-diamonds-legacy-and-grace-i-am-a-memory-from-home-2720185-2025-05-06",
      "headline": "I'm a memory from home: SRK on owning Met Gala 2025 with diamonds, legacy and graceShah Rukh Khan represented India at MET Gala 2025 in a black Sabyasachi suit teamed up with tons of diamonds. He later spoke to the media and, quite graciously, called himself a 'memory from home'.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-nervous-for-met-gala-sabyasachi-convinced-me-my-kids-suhana-khan-abram-khan-were-wowed-2720180-2025-05-06",
      "headline": "SRK says he was 'nervous' for Met Gala: Sabyasachi convinced me, my kids were wowedShah Rukh Khan was among the other prominent stars to attend the Met Gala 2025. During one of his interactions, the actor confessed feeling 'nervous' before the appearance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-5-detailed-report-ajay-devgn-film-en-route-to-rs-100-crore-2720165-2025-05-06",
      "headline": "Raid 2 box office Day 5: Ajay Devgn's film en route to Rs 100 croreThe benchmark of Rs 100 crore now seems like a cakewalk for 'Raid 2', which wrapped up a fantastic first weekend at the box office. The Monday collection for the film also looks decent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajaz-khan-nowhere-to-be-found-phone-switched-off-after-fir-in-rape-case-police-2720152-2025-05-06",
      "headline": "Ajaz Khan's phone switched off after FIR in rape case, searching for him: PoliceActor Ajaz Khan seems to have gone absconding after Mumbai Police registered an FIR against him in a rape case filed by a woman alleging that he raped her on the pretext of marriage and a role in his show 'House Arrest'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-carasses-baby-bump-in-black-gaurav-gupta-ensemble-2720126-2025-05-06",
      "headline": "Kiara Advani caresses baby bump in black Gaurav Gupta ensembleMother-to-be Kiara Advani made a stunning debut at the Met Gala as she flaunted her baby bump on the blue carpet. The actor wore an ensemble by Indian designer Gaurav Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-nick-jonas-adjusting-priyanka-chopra-gown-pure-husband-goals-2720117-2025-05-06",
      "headline": "Met Gala 2025: Nick Jonas adjusting Priyanka Chopra's gown is pure husband goalsPriyanka Chopra and Nick Jonas return to the Met Gala 2025 with their amazing outfits while following this year's theme, 'Superfine: Tailoring Black Style'. One of the viral moments featured Nick helping his wife fix her gown at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-pregnant-with-third-child-debuts-baby-bump-at-met-gala-2025-glbs-2720112-2025-05-06",
      "headline": "Rihanna pregnant with third child, debuts baby bump at Met Gala 2025Rihanna revealed her third pregnancy at the 2025 Met Gala, dazzling fans with a baby bump reveal. She and A$AP Rocky continue to charm the world with their growing family.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-strikes-iconic-pose-at-met-gala-2025-proves-hes-here-to-rule-2720111-2025-05-06",
      "headline": "Shah Rukh Khan strikes iconic pose at MET Gala 2025, proves he's here to ruleShah Rukh Khan's Met Gala debut was one of the highly anticipated appearances. Amid much craze and fanfare, the superstar stunned all with his signature pose at the annual fashion event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflix-star-millena-brandao-dies-at-11-after-mysterious-illness-in-brazil-glbs-2720095-2025-05-06",
      "headline": "Netflix star Millena Brandão dies at 11 after mysterious illness in BrazilMillena Brandão, 11-year-old actress from Netflix's Sintonia, died after a mysterious illness and multiple cardiac arrests. Her condition rapidly worsened after early symptoms were misdiagnosed as dengue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/thunderbolts-twist-revealed-marvel-confirms-team-is-the-new-avengers-glbs-2720093-2025-05-06",
      "headline": "Thunderbolts twist revealed: Marvel confirms team is the New AvengersMarvel reveals Thunderbolts' secret identity as the New Avengers just days after release, surprising fans. The post-credits twist echoes comic lore and reshapes the MCU's future lineup.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nyc-met-gala-2025-what-streets-are-closed-on-may-5-glbs-2720089-2025-05-06",
      "headline": "NYC Met Gala 2025: What streets are closed on May 5?The Met Gala 2025 will cause traffic delays in Manhattan's Upper East Side on May 5 due to road closures near the Met Museum. Red carpet arrivals are scheduled to begin at 5:30 p.m.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-thudarum-piracy-producer-renjith-takes-legal-action-2719967-2025-05-05",
      "headline": "Mohanlal's Thudarum falls prey to piracy, producer Renjith takes legal actionA video showing Mohanlal's 'Thudarum' being played illegally on a tourist bus, while the film is still in theatres, has gone viral. It prompted producer Renjith to file a cyber complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-netflix-stream-after-theatrical-release-2719970-2025-05-05",
      "headline": "Kamal Haasan's Thug Life to stream on Netflix after theatrical releaseKamal Haasan's 'Thug Life', directed by Mani Ratnam, will be released in theatres on June 5, 2025. It will later stream on Netflix. The film features a star-studded cast and marks the duo's reunion after 'Nayakan'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-nationwide-mock-defence-security-drills-cash-torch-medical-kits-electronic-failure-focus-check-details-2720252-2025-05-06",
      "headline": "Keep cash, torch, medical kits handy: What civil security drills will focus onCitizens will be trained in key civil defense measures, including how to respond to air raid sirens, conduct themselves during a blackout, and maintain basic emergency supplies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-mock-drills-defence-locations-up-delhi-bengal-mumbai-pahalgam-terror-attack-full-list-here-2720224-2025-05-06",
      "headline": "Security drills at 259 sites tomorrow, including Delhi, as tension with Pak mountsAmid rising India-Pakistan tensions after the April 22 Pahalgam terror attack, the Centre has announced a nationwide civil defence drill on May 7 across 259 locations. The mock drill will include air raid sirens, blackout protocols, and public training, with officials urging citizens to keep torches, candles, and cash ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-isolated-global-stage-allies-friends-china-gulf-nations-pahalgam-terror-attack-2720227-2025-05-06",
      "headline": "Left out in the cold, Pakistan struggling to find friends as terror bitesWhile tensions between India and Pakistan after terror attacks are not new, what has changed this time is the reaction of some of Islamabad's allies to the April 22 massacre in Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-lowdown-was-operation-blue-star-a-mistake-2720147-2025-05-06",
      "headline": "What was Operation Bluestar? Did Army walk into a trap?In response to a question on Operation Bluestar, Congress leader Rahul Gandhi acknowledged the historical wrongs committed by his party during the 1984 anti-Sikh riots. In this edition of The Lowdown, we take a look at the inside story of Operation Bluestar, the terrible fallout and its far-reaching ramifications.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-instagram-post-about-met-gala-2025-with-turban-culture-mother-tongue-main-hoon-punjab-2720259-2025-05-06",
      "headline": "Main hoon Punjab: Diljit wraps Met Gala with 'turban, culture, mother tongue' For Diljit Dosanjh, heritage and culture came first and fashion later as he walked the blue carpet at the Met Gala 2025. The 41-year-old took a bit of Punjab's royal history in his Maharaja-inspired look at the fashion's biggest night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-nations-security-council-meeting-pakistan-india-tension-grill-concerns-nuclear-talks-missile-tests-pahalgam-terror-attack-2720173-2025-05-06",
      "headline": "Pak fails to sway UN as members question LeT links, missile tests: SourcesIn an attempt to divert attention from the Pahalgam terror attack that killed 26 civilians, Pakistan brought up the Kashmir issue, accusing India of military buildup and making provocative statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-house-speaker-mike-johnson-support-india-pakistan-pahalgam-terror-attack-energy-resources-donald-trump-war-terrorism-2720194-2025-05-06",
      "headline": "Will help India with resources to fight terrorism: US Speaker after J&K attackUS House Speaker Mike Johnson on Tuesday pledged full support for India's fight against terrorism, promising energy and resources to aid its efforts amid heightened tensions with Pakistan following the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-un-security-council-india-pakistan-tensions-jk-attack-pm-modi-victims-air-force-army-navy-2720140-2025-05-06",
      "headline": "Live: NSA Ajit Doval meets PM, Home Ministry convenes crucial meetingPahalgam terror attack live updates: Amid rising India-Pakistan tensions in the wake of the Pahalgam terror attack in which 26 people were killed by terrorists, the United Nations Security Council has held closed-door consultations where envoys called for restraint and dialogue. Meanwhile, a parliamentary panel has sought details from two key ministries overseeing information flow on the action they have planned against social media platforms and influencers who \"seem to be working against national interest\", following the Pahalgam terror attack. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/india-at-met-gala-2025-srk-kiara-advani-diljit-dosanjh-isha-ambani-priyanka-chopra-2720208-2025-05-06",
      "headline": "India at the Met Gala 2025: The hits (and the misses)With a strong lineup of Indian celebrities in attendance, Met Gala 2025 gave us some memorable fashion moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-sirens-blackouts-and-bunker-drills-indias-mock-war-day-explained-2720168-2025-05-06",
      "headline": "India's first mock drill since 1971 war tomorrow: What will happen, why it mattersDuring the drills, air raid warning sirens will be activated, and civilians and students will be trained in civil defence to protect themselves in the event of a hostile attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/conclave-cardinals-vote-choosing-new-pope-secrecy-candidates-all-you-need-to-know-2720199-2025-05-06",
      "headline": "Secrecy and smoke signals: Vatican gears up for conclave to elect new popeThe Catholic Church will begin the secretive process of choosing a new pope on Wednesday. The cardinals eligible to vote will surrender their phones and be barred from outside contact during the conclave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/prince-louis-hair-flick-moment-with-big-brother-george-goes-viral-video-2720189-2025-05-06",
      "headline": "Prince Louis' hair-flick moment with big brother George goes viral. Watch videoA video of Prince Louis' hilarious hair-flick moment with Prince George went viral on social media for all the right reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/madhya-pradesh-class-10-12-results-declared-announced-direct-link-download-marksheet-scorecard-here-2720176-2025-05-06",
      "headline": "Madhya Pradesh Class10, 12 results declared. Direct link to check scorecardsHere's how to check and download the MPBSE Madhya Pradesh Classes 10 and 12 results 2025 on the official website. Students can check for more updates and information here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-california-san-diego-migrant-boat-indian-illegal-migrant-family-boat-capsizes-two-kids-missing-2720191-2025-05-06",
      "headline": "Two Indian children missing in US as boat capsizes during illegal entryTwo children from India are missing as a boat with illegal immigrants capsized off the coast of San Diego, California, killing three people. The parents of the children had a miraculous escape, and are receiving treatment in hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sc-sets-aside-kerala-hc-ruling-which-made-void-cpim-contestant-raja-2021-devikulam-mla-election-2720201-2025-05-06",
      "headline": "Supreme Court restores CPM MLA A Raja's post, overturns Kerala High Court rulingThe Supreme Court has set aside a Kerala High Court ruling that invalidated CPI(M) MLA A Raja's 2021 election, holding that his caste eligibility was wrongly assessed and dismissed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-wins-hearts-as-he-supports-mother-to-be-kiara-advani-at-met-gala-2025-2720222-2025-05-06",
      "headline": "Sidharth Malhotra wins hearts as he supports mother-to-be Kiara at Met Gala 2025Sidharth Malhotra's support for pregnant wife Kiara Advani at Met Gala 2025 touched hearts, even without a red carpet appearance. A viral video and his heartfelt tribute online made their quiet moment the real showstopper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cleric-maulana-abdul-aziz-ghazi-lal-masjid-india-pak-tensions-pahalgam-terror-attack-2719988-2025-05-06",
      "headline": "Would you support Pak if it fights India, Islamabad cleric asked, got no replyMaulana Abdul Aziz Ghazi, a controversial cleric of Islamabad's Lal Masjid, witnessed no people raising their hands when he asked the people whether they would support Pakistan in the event of a war with India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/maldives-president-muizzu-breaks-world-record-with-15-hour-press-conference-glbs-2720099-2025-05-06",
      "headline": "Maldives President Muizzu breaks world record with 15-hour press conferenceMaldives President Mohamed Muizzu set a world record with a nearly 15-hour press conference, answering public questions. He also softened his stance on India agreements, sparking criticism from the opposition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-real-story-behind-teenage-acne-pimples-mit-study-2719883-2025-05-06",
      "headline": "The real story behind teenage pimples and how it can change future acne treatmentMIT researchers found that the bacteria on our face play a big role in acne. They discovered that during teenage years, new strains of bacteria can appear. This may be the best time to use probiotics to prevent acne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-nick-jonas-adjusting-priyanka-chopra-gown-pure-husband-goals-2720117-2025-05-06",
      "headline": "Met Gala 2025: Nick Jonas adjusting Priyanka Chopra's gown is pure husband goalsPriyanka Chopra and Nick Jonas return to the Met Gala 2025 with their amazing outfits while following this year's theme, 'Superfine: Tailoring Black Style'. One of the viral moments featured Nick helping his wife fix her gown at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-puts-judges-assets-appointment-details-online-in-transparency-push-cash-row-2720136-2025-05-06",
      "headline": "Supreme Court makes its judges' assets public: FDs, PPF, houses, stocks and moreThe move comes in the wake of growing concerns over opacity in the judiciary, especially after a controversy surrounding the alleged discovery of burnt wads of cash at the residence of Delhi High Court judge Yashwant Varma following a fire incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/isha-ambani-at-met-gala-2025-anamika-khanna-diamond-necklace-2720124-2025-05-06",
      "headline": "Isha Ambani wows at Met Gala, again. This time in mom Nita Ambani's jewelleryIsha Ambani looked stunning at the 2025 Met Gala in an Anamika Khanna outfit. She styled it with striking jewels, including an unmissable diamond necklace from her mother Nita Ambani's collection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-scenarios-explained-rcb-top-2-worst-case-2720081-2025-05-06",
      "headline": "IPL playoffs race explained: RCB in pole position as 7 teams in top 4 battleIPL 2025: Seven teams are in the race for four spots in the playoffs. While former champions CSK, SRH and RR are out of the race, RCB are in pole position as they look to finish in the top two for the first time since 2016. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-hansi-flick-lamine-yamal-on-barcelona-vs-inter-milan-2720244-2025-05-06",
      "headline": "Barcelona's Hansi Flick praises Lamine Yamal's impact ahead of Inter clashBarcelona manager Hansi Flick has praised 17-year-old Lamine Yamal ahead of their UEFA Champions League semifinal second leg against Inter Milan in Italy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-virat-kohlis-strike-rate-critics-gives-new-nickname-to-batting-star-2720234-2025-05-06",
      "headline": "AB de Villiers slams Kohli's strike rate critics, gives new nickname to batterFormer South Africa cricketer AB de Villiers has slammed star India batter Virat Kohli's critics amid his prolific run in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-shubman-gill-gujarat-titans-captaincy-2720220-2025-05-06",
      "headline": "Shubman Gill is a very competitive captain: Sai Sudharsan praises GT skipperGujarat Titans opener Sai Sudharsan praised skipper Shubman Gill as a competitive captain while highlighting the strong chemistry behind their successful opening partnership.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-predicted-xi-team-news-head-to-head-mumbai-pitch-2720206-2025-05-06",
      "headline": "Will Gujarat be able to stop Mumbai's winning juggernaut and claim top spot?Mumbai Indians (MI) are set to take on Gujarat Titans (GT) in Match 56 of the Indian Premier League 2025 (IPL 2025) at Wankhede Stadium in Mumbai. MI are on a six-match winning streak while Gujarat are also in fine form with both their batting and bowling firing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-fans-burn-alexander-arnold-jersey-after-defender-announces-departure-2720181-2025-05-06",
      "headline": "Liverpool fans burn Alexander-Arnold's jersey after defender announces departureLiverpool fans burned Trent Alexander-Arnold's jersey in protest after the English defender announced his decision to leave the club at the end of the 2024–25 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-always-said-i-will-be-next-sachin-tendulkar-reveals-school-teacher-2720170-2025-05-06",
      "headline": "Virat Kohli always said I will be next Sachin Tendulkar, reveals school teacherStar India batter Virat Kohli's school teacher has recently revealed that he had the desire to be the next Sachin Tendulkar right from his childhood and worked hard to excel both in cricket and academics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-gujarat-titans-director-vikram-solanki-2720166-2025-05-06",
      "headline": "Shubman Gill not affected by weight of captaincy: GT director Vikram SolankiIPL 2025, MI vs GT: Gujarat Titans' Director of Cricket, Vikram Solanki, said Shubman Gill has thrived in his role as captain of the former champions this season. He also shed light on the secret behind the successful opening partnership between Gill and Sai Sudharsan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-to-lead-west-indies-squad-for-odi-series-against-ireland-and-england-2720163-2025-05-06",
      "headline": "Shai Hope to lead West Indies squad for ODI series against Ireland and EnglandShai Hope will lead West Indies's 15-member squad for six 50-over contests in Europe against Ireland and England, scheduled for later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-coach-daniel-vettori-press-conference-hyderabad-crash-out-2720148-2025-05-06",
      "headline": "IPL 2025: Conditions in Hyderabad weren't what we expected, says SRH coachSunrisers Hyderabad head coach Daniel Vettori said that the conditions in Hyderabad didn't match their expectations and proved tricky for batters. SRH's washout against Delhi Capitals knocked them out of contention for the IPL 2025 playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-watson-on-jasprit-bumrah-ahead-of-mi-vs-gt-clash-2720146-2025-05-06",
      "headline": "Put Jasprit Bumrah off his mark: Shane Watson's ultimate challenge for GT Shane Watson revealed that the ultimate challenge for the GT batters will be to put Jasprit Bumrah off his mark during their match at the Wankhede stadium on May 6. Bumrah has been in top form with the ball after his return from injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/need-3-more-wins-every-point-is-crucial-at-this-stage-dcs-ashutosh-sharma-2720143-2025-05-06",
      "headline": "Need 3 more wins, every point is crucial at this stage: DC's Ashutosh SharmaDelhi Capitals' Ashutosh Sharma said that their goal is to win the remaining three matches of the season after the washed-out fixture against Sunrisers Hyderabad (SRH). Delhi are ranked fifth on the points table with six wins from 11 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-gujarat-titans-director-vikram-solanki-2720166-2025-05-06",
      "headline": "Shubman Gill not affected by weight of captaincy: GT director Vikram SolankiIPL 2025, MI vs GT: Gujarat Titans' Director of Cricket, Vikram Solanki, said Shubman Gill has thrived in his role as captain of the former champions this season. He also shed light on the secret behind the successful opening partnership between Gill and Sai Sudharsan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-to-lead-west-indies-squad-for-odi-series-against-ireland-and-england-2720163-2025-05-06",
      "headline": "Shai Hope to lead West Indies squad for ODI series against Ireland and EnglandShai Hope will lead West Indies's 15-member squad for six 50-over contests in Europe against Ireland and England, scheduled for later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-coach-daniel-vettori-press-conference-hyderabad-crash-out-2720148-2025-05-06",
      "headline": "IPL 2025: Conditions in Hyderabad weren't what we expected, says SRH coachSunrisers Hyderabad head coach Daniel Vettori said that the conditions in Hyderabad didn't match their expectations and proved tricky for batters. SRH's washout against Delhi Capitals knocked them out of contention for the IPL 2025 playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-watson-on-jasprit-bumrah-ahead-of-mi-vs-gt-clash-2720146-2025-05-06",
      "headline": "Put Jasprit Bumrah off his mark: Shane Watson's ultimate challenge for GT Shane Watson revealed that the ultimate challenge for the GT batters will be to put Jasprit Bumrah off his mark during their match at the Wankhede stadium on May 6. Bumrah has been in top form with the ball after his return from injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/need-3-more-wins-every-point-is-crucial-at-this-stage-dcs-ashutosh-sharma-2720143-2025-05-06",
      "headline": "Need 3 more wins, every point is crucial at this stage: DC's Ashutosh SharmaDelhi Capitals' Ashutosh Sharma said that their goal is to win the remaining three matches of the season after the washed-out fixture against Sunrisers Hyderabad (SRH). Delhi are ranked fifth on the points table with six wins from 11 matches."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}