{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-wedding-insurance-is-becoming-the-next-big-trend-in-india-2826875-2025-11-27",
      "headline": "Why wedding insurance is becoming the next big trend in IndiaIndian weddings are getting grander, costlier and far more unpredictable. As families pour months of planning and significant savings into these celebrations, a single last-minute disruption can derail everything. This rising uncertainty is quietly driving a new trend—wedding insurance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crypto-futures-and-options-trade-hidden-tax-trap-young-investors-2826869-2025-11-27",
      "headline": "From crypto to F&O: The hidden tax trap young investors keep missingYoung investors are trading faster than ever, but many overlook how crypto and F&O profits are taxed. Strict rules, tougher scrutiny and poor record-keeping are turning quick gains into unexpected tax headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/psu-bank-merger-government-plan-finance-minister-nirmala-sitharaman-employee-problems-salary-promotion-hr-2826868-2025-11-27",
      "headline": "PSU bank mergers: Do bigger banks mean happier employees?India's tryst with PSB (public sector bank) consolidation dates back more than three decades. The first post-nationalisation merger took place in 1993, when Punjab National Bank (PNB) absorbed the New Bank of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-plans-to-update-credit-scores-every-7-days-what-is-means-for-borrowers-2826835-2025-11-27",
      "headline": "RBI plans to update credit scores every 7 days: What is means for borrowersWith credit scores updating every seven days, access to loans, credit cards, and better interest rates may become more immediate and more closely linked to a person's most recent financial behaviour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refunds-2025-do-salaried-individuals-receive-quicker-refunds-than-business-filers-income-tax-2826812-2025-11-27",
      "headline": "ITR refunds 2025: Do salaried individuals receive quicker refunds than business filers?As refund delays continue this year, many taxpayers are wondering whether salaried individuals truly get their money back faster than business filers. With processing moving more slowly for Assessment Year 2025–26, the question has become more relevant than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/whirlpool-share-price-plummets-10-percent-why-is-it-falling-today-2826803-2025-11-27",
      "headline": "Whirlpool share price plummets over 10%. Why is it falling today? The slump followed a large 1.5 crore share transaction that took place in early trade as part of a block deal, making it one of the biggest single-day deals for the consumer durables major in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fresh-record-high-14-month-stocks-to-watch-investing-tips-bse-nse-top-shares-2826761-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high: Check top stocks you can invest inThe S&P BSE Sensex climbed more than 400 points to move past 86,000, while the Nifty50 touched a record above 26,300. This is the first time in 14 months that both benchmarks have hit new peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/irdai-customer-first-grievance-redressal-claim-denied-impact-2826739-2025-11-27",
      "headline": "When in doubt, choose the customer: IRDAI chief on insurers' grievance handlingIRDAI has stepped in with a strong message to insurers, urging a clear shift toward faster, fairer grievance handling at a time when policyholders are increasingly frustrated with delays and opaque processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-nifty-all-time-high-after-14-months-what-next-for-domestic-equities-2826712-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high after 14 months. What next for stock markets? A fresh Sensex and Nifty record has reignited confidence across Dalal Street, lifting traders' moods and shifting market sentiment firmly to the upside. With bulls in control again, is another milestone already on the horizon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-150-points-higher-nifty-above-26200-mahindra-up-1-percent-2826691-2025-11-27",
      "headline": "Sensex, Nifty hit all-time high as bull run continues on D-StreetThe S&P BSE Sensex added 224.80 points to 85,836.74, while the NSE Nifty50 gained 60.85 points to 26,266.15 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-view-setup-record-high-on-cards-us-rate-cut-crude-oil-price-2826680-2025-11-27",
      "headline": "Sensex, Nifty today: Will the stock market hit a record high?Sensex, Nifty today: The upbeat mood in global and domestic markets, softer crude oil prices and steady foreign inflows are expected to support the market at the opening bell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-investment-tips-stock-market-investing-long-term-returns-wealth-personal-finance-compounding-money-2826670-2025-11-27",
      "headline": "Why relying only on SIPs may hurt your returns in the long runAMFI's October 2025 figures show just how deeply SIPs have entered the Indian investing culture. Monthly SIP contributions touched Rs 29,529.37 crore, the highest ever for the second month in a row and up 16.6% from a year earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cabinet-approves-rs-7280-crore-scheme-to-promote-manufacturing-of-rare-earth-magnets-2826354-2025-11-26",
      "headline": "Cabinet clears Rs 7,280 crore rare earths scheme amid China's export curbsThe government has cleared a financial outlay of Rs 7,280 crore to set up 6,000 metric tonnes per year of fully integrated REPM manufacturing capacity in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-take-home-pay-drop-new-labour-code-basic-salary-allowance-2826385-2025-11-26",
      "headline": "Will the new labour codes cut your in-hand salary? Here's the mathNow that the new labour codes are in force and wages are being recalculated, will your monthly take-home salary take a hit?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/most-rise-in-home-real-estate-prices-not-mumbai-bengaluru-pune-but-delhi-ncr-luxury-housing-affordable-flats-2826373-2025-11-26",
      "headline": "Not Mumbai, Bengaluru or Pune, this city has seen sharpest rise in home pricesNew data from ANAROCK shows that one city has pulled far ahead of Mumbai, Bengaluru and Pune to record the sharpest rise in home prices across almost every budget segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/newly-married-insurance-guide-life-health-for-couples-2826312-2025-11-26",
      "headline": "Newly married? Here's the insurance playbook every couple needsBig life changes often bring financial blind spots. For newlyweds, reviewing insurance early is a simple step that keeps their plans on track as they start their new chapter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1000-points-up-nifty-above-26200-ril-gains-2-percent-2826309-2025-11-26",
      "headline": "Sensex ends 1,000 points up, Nifty above 26,200; RIL gains 2%The S&P BSE Sensex jumped 1,022.50 points to close at 85,609.51, while the NSE Nifty50 gained 320.50 points to end at 26,205.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-are-gold-and-silver-prices-rising-again-this-week-2826268-2025-11-26",
      "headline": "Why are gold and silver prices rising again this week?Prices of gold and silver have moved up once more, with global economic signals and firmer market demand driving this renewed momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/air-pollution-health-insurance-costlier-premiums-risk-explained-2826252-2025-11-26",
      "headline": "Will worsening air quality make your health insurance premium costlier?As pollution worsens across Indian cities, are health insurers preparing to charge residents more for risks they cannot control? The big question now is how soon premiums will change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-accurately-calculate-your-pf-balance-without-logging-in-2826225-2025-11-26",
      "headline": "PF balance check: How to calculate it without logging inChecking your PF balance no longer requires a portal login. Several quick offline and mobile-based tools now let you check it instantly using just your phone."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaideep-ahlawat-witty-take-on-importance-of-manoj-bajpayee-films-id-recommend-die-2826880-2025-11-27",
      "headline": "Jaideep Ahlawat's jab if you didn't see a Manoj Bajpayee film in 25 years kills you! Manoj Bajpayee and Jaideep Ahlawat, known for their work in top Indian series, reflected on their collaborations and mutual respect as their characters face off in The Family Man season 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-mita-vasisht-unlocks-mani-kaul-world-in-her-directorial-vision-2826143-2025-11-27",
      "headline": "Exclusive: Mita Vasisht unlocks Mani Kaul's world in her directorial vision In her directorial, 'Mani Kaul And That Thing Called The Actor', Mita Vasisht weaves a young actor's journey through the late iconic filmmaker Mani Kaul's cinematic philosophy, drawing on Natyashastra and Rajasthan landscapes to redefine acting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-remembered-by-mumtaz-legendary-career-warm-personality-2826800-2025-11-27",
      "headline": "Mumtaz not allowed to see Dharmendra in hospital: Staff said he was on ventilator Veteran actor Mumtaz shared her experience of being unable to meet Dharmendra during his final days, reflecting on their professional relationship and expressing condolences to his family after the actor's death on November 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samyuktha-shanmuganathan-marries-anirudha-srikkanth-traditional-chennai-wedding-2826847-2025-11-27",
      "headline": "Actor-model Samyuktha marries former cricketer Anirudha Srikkanth. First pics Tamil actor-model Samyuktha Shanmuganathan and former cricketer Anirudha Srikkanth have married in a traditional Hindu ceremony in Chennai, following public speculation and previous high-profile relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-death-bollywood-mourns-he-man-legacy-final-days-2826826-2025-11-27",
      "headline": "He was trying to respond: Dharmendra had recovered, says Anil Sharma Veteran actor Dharmendra died at the age of 89, leaving the Indian film industry and his fans in deep sorrow. Close friend and director Anil Sharma shared memories of Dharmendra's final days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-shares-a-lifetime-of-love-and-memories-with-her-dharam-ji-in-new-pics-2826833-2025-11-27",
      "headline": "Hema Malini shares a lifetime of love and memories with her Dharam ji in new pics Hema Malini remembered her husband Dharmendra with heartfelt photos and an emotional tribute after the legendary actor's death. She reflects on their decades of togetherness, cherished memories, and the irreplaceable void left behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-audio-launch-malaysia-ticket-booking-2826814-2025-11-27",
      "headline": "Jana Nayagan Malayasia event: How to book tickets for Vijay's tribute concert? The audio launch of Thalapathy Vijay's Jana Nayagan is scheduled to take place in Malaysia on December 27. Here, we list you the ways to book tickets for a grand tribute event to Vijay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twice-first-k-pop-girl-group-platinum-certification-us-strategy-single-2826775-2025-11-27",
      "headline": "Twice becomes first K-pop girl group to go platinum in the US with solo track TWICE becomes the first K-pop girl group to receive RIAA platinum certification in the United States for a non-collaboration single, marking a significant milestone for the group and the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/120-bahadur-military-drama-praised-shabana-azmi-farhan-akhtar-transformation-2826772-2025-11-27",
      "headline": "So proud of you: Shabana Azmi praises Farhan Akhtar's performance in 120 Bahadur Actor Shabana Azmi has publicly praised Farhan Akhtar's performance in the upcoming film '120 Bahadur', highlighting his transformation from earlier roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-raat-akeli-hai-bansal-murders-nawazuddin-siddiqui-19-december-2826749-2025-11-27",
      "headline": "Raat Akeli Hai Bansal Murders: Nawazuddin back with darker case, check release date Netflix is all set to bring back the captivating Indian detective Inspector Jatil Yadav in Raat Akeli Hai: The Bansal Murders. The gripping crime thriller will stream globally from December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-surprise-romance-docuseries-end-of-an-era-2826733-2025-11-27",
      "headline": "Taylor Swift finally addresses surprise Travis Kelce romance in teaser Singer Taylor Swift has offered rare comments about her relationship with Travis Kelce as a new docuseries, The End of an Era, is set to premiere on JioHotstar on December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/loss-indescribable-left-with-myriad-memories-to-relive-hema-malinis-1st-post-after-dharmendras-death-2826755-2025-11-27",
      "headline": "Dharam ji was many things to me: Hema Malini pours her heart out in first post Veteran actor Hema Malini has shared her first emotional tribute on social media following the death of her husband, legendary actor Dharmendra. She fondly remembered him as her loving husband, father, friend, and guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/naagin-7-premiere-date-priyanka-chahar-choudhary-new-lead-colors-tv-2826736-2025-11-27",
      "headline": "Check December release date for Ektaa Kapoor's Naagin 7 starring Priyanka Chahar The premiere date of Naagin 7 is out. The popular supernatural franchise produced by Ektaa Kapoor will star Priyanka Chahar Choudhary as the new lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-nearly-directed-wicked-filmmaker-shares-why-he-walked-away-2826661-2025-11-27",
      "headline": "James Cameron nearly directed Wicked, filmmaker shares why he walked away James Cameron had plans to direct the Wicked musical film nearly 15 years ago but stepped away as he struggled to connect with its musical elements. The film finally debuted recently under Jon M. Chu, bringing the beloved Broadway hit to Indian cinema audiences with much acclaim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-outage-disrupts-streaming-us-india-stranger-things-season-5-premiere-2826710-2025-11-27",
      "headline": "Netflix crash: Stranger Things 5 mania to blame? Berserk fans believe so Thousands of Netflix users in the United States experienced streaming outages on November 26, coinciding with the release of the highly anticipated fifth season of Stranger Things."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jingle-bell-heist-review-festive-caper-barely-steals-our-attention-2826723-2025-11-27",
      "headline": "Jingle Bell Heist review: A festive caper that barely steals our attentionRelease Date:Wed Nov 26, 2025 Review of Netflix's Jingle Bell Heist, a London-set festive caper that rises slightly above the usual Christmas clutter but still falls short."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-stranger-things-millie-bobby-brown-noah-schnapp-the-duffer-brothers-on-wills-mvp-arc-and-india-2826729-2025-11-27",
      "headline": "Exclusive: Stranger Things' Millie Bobby Brown, Noah Schnapp, The Duffer Brothers on Will's MVP arc and India Stranger Things is ending, but not without one final emotional ride. In this India Today exclusive with Bhavna Agarwal, Millie Bobby Brown, Noah Schnapp and The Duffer Brothers [Matt and Ross] sit down to unpack the final season, the surreal feeling of saying goodbye, and how the cast has grown since 2016."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-final-season-millie-bobby-brown-noah-schnapp-india-visit-2826703-2025-11-27",
      "headline": "Exclusive: Stranger Things stars Millie Bobby Brown and Noah Schnapp talk India Stranger Things stars Millie Bobby Brown and Noah Schnapp share heartfelt thoughts on the show's final season. Their journey reflects growth, nostalgia, and hopes to connect with Indian fans soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-cynthia-erivo-affectionate-moments-social-media-debate-wicked-for-good-press-tour-2826688-2025-11-27",
      "headline": "Cynthia Erivo and Ariana Grande's Wicked press tour has the internet confused Clips of actors Ariana Grande and Cynthia Erivo's interactions during the 'Wicked: For Good' press tour have ignited discussion on social media, with users labelling their behaviour as unusually affectionate and prompting mixed reactions."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-siddaramaiah-g-parameshwara-backs-dk-shivakumar-as-cm-if-congress-decides-transition-2826743-2025-11-27",
      "headline": "Rift in Siddaramaiah camp? Aide says will accept Shivakumar for top post if… Live updatesKarnataka Home Minister G Parameshwara signalled a major endorsement by saying he would accept DK Shivakumar as Chief Minister if the Congress decides on a transition. Minister Zameer Ahmed Khan, however, said that the Chief Ministerial seat is not empty till 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sir-case-supreme-court-hearing-aadhaar-citizenship-proof-ec-surya-kant-poll-panel-2826753-2025-11-27",
      "headline": "Can foreigners with Aadhaar be allowed to vote? Supreme Court on plea against SIRThe Supreme Court held that Aadhaar is not absolute proof of citizenship as it began final hearings on pleas challenging the Election Commission's Special Intensive Revision (SIR) of electoral rolls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/where-is-imran-khan-pakistan-adiala-jail-reacts-death-rumours-2826725-2025-11-27",
      "headline": "Where is Imran Khan? Pak's Adiala jail responds amid death rumoursImran Khan: A day after violent protests were seen outside Pakistan's Adiala Jail amid rumours that Imran Khan had died in custody, the prison administration clarified on the former PM's health and his whereabouts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-bench-hunting-overturning-past-verdicts-article-141-judgments-2826811-2025-11-27",
      "headline": "Supreme Court flags 'growing trend' of own benches overturning past verdictsThe Supreme Court dismissed a murder accused's plea to modify bail conditions, warning that approaching a new bench to overturn earlier orders undermines Article 141 and the finality of its judgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-imran-khan-death-asim-munir-army-fielod-marshal-power-pathan-pashturn-power-punjab-tussle-2826851-2025-11-27",
      "headline": "Why Imran Khan the Pathan spooks Punjabi General MunirAsim Munir might have the entire Pakistani army under his command, but nothing scares him more than Imran Khan. Munir engineered a regime change and put Imran behind bars, but the cricketer-turned-politician's aura has only grown. This is why one Pathan scares Pakistan's Punjabi-led hybrid regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/loss-indescribable-left-with-myriad-memories-to-relive-hema-malinis-1st-post-after-dharmendras-death-2826755-2025-11-27",
      "headline": "Dharam ji was many things to me: Hema Malini pours her heart out in first postVeteran actor Hema Malini has shared her first emotional tribute on social media following the death of her husband, legendary actor Dharmendra. She fondly remembered him as her loving husband, father, friend, and guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-forms-bay-of-bengal-depression-intensifies-tamil-nadu-andhra-pradesh-alert-2826802-2025-11-27",
      "headline": "Cyclone Ditwah brewing in Bay of Bengal, Tamil Nadu, Andhra on alertCyclone Ditwah News: A new cyclone named Ditwah is likely to form in the Bay of Bengal, prompting alerts in parts of Tamil Nadu and Andhra Pradesh. Authorities urge caution as heavy rain and strong winds are expected along coastal areas later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-virat-kohli-fortress-gautam-gambhir-2826760-2025-11-27",
      "headline": "The Kohli fortress falls under Gambhir, its cracks far too deep for instant repairIndia vs South Africa: A team that once made visitors tremble now flinches at its own shadows. India's greatest threat wasn't South Africa or New Zealand — it's the uncertainty eating them from within."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/1400-quakes-in-30-days-whats-behind-the-rising-earthquakes-in-indonesia-2826863-2025-11-27",
      "headline": "1,400 quakes in 30 days: Why is Indonesia shaking so much?Sumatra has endured repeated tremors recently, including a 6.6-magnitude event nearby, linked to ongoing plate boundary strain and local faults like the Great Sumatra Fault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-xev-9s-launched-rs-1995-lakh-first-mass-market-seven-seater-electric-suv-2826732-2025-11-27",
      "headline": "Mahindra XEV 9S launched at Rs 19.95 lakh as first mass-market 7-seater electric SUVMahindra has launched the XEV 9S at Rs 19.95 lakh (ex-showroom), introducing India's first mass-market 7-seater electric SUV with a tech-rich cabin, versatile battery options and true family-oriented practicality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-word-power-post-karnataka-power-tussle-siddaramaiah-congress-leadership-2826872-2025-11-27",
      "headline": "It's fake: DK Shivakumar on viral 'word power' post amid Karnataka power riftDK Shivakumar has rejected a viral quote on his X account as 'fake', even as speculation over a 2023 Karnataka power-sharing pact resurfaced and the Congress leadership weighed its options at the government's halfway mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/sonia-rahul-gandhi-step-in-as-siddaramaiah-shivakumar-tussle-hits-flashpoint-2826862-2025-11-27",
      "headline": "Sonia, Rahul Gandhi step in as Siddaramaiah-Shivakumar tussle hits flashpointKarnataka is one of only three states where the Congress is currently in power and draws much of its political 'oxygen.' But the power struggle between the 'Shiva' and 'Sidda' factions, simmering for some time, has now burst into the open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-jemimah-rodrigues-brisbane-heat-wbbl-2826820-2025-11-27",
      "headline": "Jemimah stays back for Smriti Mandhana after wedding postponed, skips WBBLThe Brisbane Heat have announced that Jemimah Rodrigues will stay back in India to support Smriti Mandhana and will miss the remainder of the WBBL campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/safran-chairman-made-in-india-remark-pm-modi-laughs-video-viral-mro-facility-hyderabad-2826706-2025-11-27",
      "headline": "I'm 'Made in India' too: French executive's quip cracks up PM ModiAt the inauguration of Safran's new aircraft engine MRO unit in Hyderabad, a light moment unfolded as Chairman Ross McInnes joked he was \"Made in India\" too, prompting laughter from PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/how-a-tech-billionaire-pharma-netra-mantena-udaipur-wedding-took-over-everyones-feed-2826496-2025-11-26",
      "headline": "How a million dollar Udaipur wedding took over everyone's feedFrom Netra Mantena and Vamsi Gadiraju's wedding cake to the guest list, everything was up for discussion as this is being touted as 'India's most expensive wedding of 2025'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-congress-mla-delhi-visit-live-updates-dk-shivakumar-vs-siddaramaiah-2826646-2025-11-27",
      "headline": "Live: Huddle at Siddaramaiah's residence amid Karnataka leadership tussleKarnataka Political Crisis News Live Updates: As Karnataka's power tussle deepens, Chief Minister Siddaramaiah has sought clarity from the Congress high command, urging it to resolve the leadership question. Siddaramaiah and his deputy, DK Shivakumar, remain locked in a tight contest for the state's top post. Speculation over a possible change of guard has intensified since the government crossed the halfway mark of its five-year term on November 20, amid reports of a 2023 \"power-sharing\" pact between the two leaders. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/top-us-universities-hosting-international-students-in-us-open-doors-2025-rankings-2826796-2025-11-27",
      "headline": "NYU tops list of US universities hosting the most foreign students. Check top 10The Open Doors 2025 report ranks New York University as the top US host for international students with 27,532 enrolments, followed by Northeastern and Columbia. Large public universities also dominate the top ten, while the Ivy League makes a single appearance through Columbia University's strong international presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-supreme-court-threw-out-christian-army-officer-samuel-kamalesan-petition-2826611-2025-11-27",
      "headline": "Why Supreme Court threw out Christian Army officer's petitionLt Samuel Kamalesan, a troop leader (officer commanding 3 tanks) in the Indian Army's 3rd Cavalry Regiment was dismissed for refusing to participate in regimental religious rituals during weekly parades. He cited conflict with his Protestant Christian monotheistic beliefs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sundar-pichai-says-google-teams-need-sleep-after-gemini-3-launch-sends-company-soaring-2826784-2025-11-27",
      "headline": "Sundar Pichai says Google teams need sleep after Gemini 3 launchGoogle CEO Sundar Pichai says engineers need rest after intense Gemini 3 AI launch. The breakthrough model has boosted Google's stock and reaffirmed its lead in AI technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hong-kong-wang-fuk-court-fire-kills-nearly-300-missing-deadliest-blaze-six-decades-2826821-2025-11-27",
      "headline": "Nothing left: Devastated residents of Hong Kong buildings after huge fire kills 55The Wang Fuk Court estate, built in the 1980s and home to around 4,600 residents, is notable for its large elderly population, with nearly 40 per cent aged 65 or above, as per a 2021 census. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-vikram-i-indias-first-private-space-rocket-unveiled-by-pm-modi-2826793-2025-11-27",
      "headline": "What is Vikram-I? India's first private rocket unveiled by PM ModiThe first privately developed orbital launch vehicle is capable of placing multiple satellites into orbit in a single launch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/rahmanullah-lakanwal-national-guard-shooting-white-house-glbs-2826634-2025-11-27",
      "headline": "Who is Rahmanullah Lakanwal, suspect who shot 2 National Guards near White House?Rahmanullah Lakanwal is a 29-year-old Afghan national identified as the suspected gunman in the shooting of two West Virginia National Guard members near the White House in Washington DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aukaat-ke-bahar-trailer-elvish-yadav-debut-promises-romance-college-politics-2826882-2025-11-27",
      "headline": "Aukaat Ke Bahar trailer: Elvish Yadav's debut promises romance, college politicsElvish Yadav makes his lead acting debut in 'Aukaat Ke Bahar' as a fiery Haryana boy who challenges elite Delhi college norms, sparking an intense romance with his ambitious senior, Antara Shukla, amidst high-stakes campus politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaideep-ahlawat-witty-take-on-importance-of-manoj-bajpayee-films-id-recommend-die-2826880-2025-11-27",
      "headline": "Jaideep Ahlawat's jab if you didn't see a Manoj Bajpayee film in 25 years kills you!Manoj Bajpayee and Jaideep Ahlawat, known for their work in top Indian series, reflected on their collaborations and mutual respect as their characters face off in The Family Man season 3."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-return-ashes-test-australia-squad-update-brendan-doggett-khawaja-injury-2826893-2025-11-27",
      "headline": "Fit-again Australia captain Pat Cummins set to return for Brisbane Test Australian captain Pat Cummins is poised to make his comeback for the second Ashes Test in Brisbane, with selectors expected to name him in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-india-test-transition-strategy-home-defeats-2826617-2025-11-27",
      "headline": "Ashwin questions India's Test transition plan after home whitewash Ravichandran Ashwin has criticised India's unclear long-format transition strategy following successive home Test defeats. His remarks highlight urgent needs for better communication and knowledge transfer in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-rohan-kunnummal-record-opening-partnership-syed-mushtaq-ali-trophy-2826842-2025-11-27",
      "headline": "Sanju Samson, Rohan Kunnummal script SMAT history with record opening stand Sanju Samson and Rohan S. Kunnummal tore through Odisha's attack with a record 177-run unbeaten opening stand, steering Kerala to a resounding 10-wicket win in the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mega-auction-live-updates-sold-unsold-retained-players-list-womens-premier-league-2826830-2025-11-27",
      "headline": "WPL 2026 mega auction live: Will Delhi Capitals buy Alyssa Healy? WPL 2026 Auction Live Updates: A total of 277 players will go under the hammer as five Women's Premier League teams battle in the first mega auction of the tournament in New Delhi today. A total of 73 slots are set to be filled. UP Warriorz have the biggest purse of Rs 14.50 crore with 17 slots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-jemimah-rodrigues-brisbane-heat-wbbl-2826820-2025-11-27",
      "headline": "Jemimah stays back for Smriti Mandhana after wedding postponed, skips WBBL The Brisbane Heat have announced that Jemimah Rodrigues will stay back in India to support Smriti Mandhana and will miss the remainder of the WBBL campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-home-test-decline-kris-srikkanth-solution-2826804-2025-11-27",
      "headline": "Kris Srikkanth's cheeky solution to India's Test woes: Avoid playing home matches Speaking after India were whitewashed 0-2 by South Africa on Wednesday, Kris Srikkanth joked that India should stop playing at home to halt the slide. The sad part? In their current state, it doesn't sound entirely outrageous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sergio-lobera-appointed-mohun-bagan-head-coach-to-boost-indian-super-league-campaign-2826773-2025-11-27",
      "headline": "Mohun Bagan appoint ISL winner Sergio Lobera as new head coach Mohun Bagan has appointed Sergio Lobera as their new head coach replacing Jose Molina. Lobera brings with him experience finding success in Indian football as he won the ISL title in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-virat-kohli-fortress-gautam-gambhir-2826760-2025-11-27",
      "headline": "The Kohli fortress falls under Gambhir, its cracks far too deep for instant repair India vs South Africa: A team that once made visitors tremble now flinches at its own shadows. India's greatest threat wasn't South Africa or New Zealand — it's the uncertainty eating them from within."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-india-wtc-2027-final-miracle-qualification-analysis-2826754-2025-11-27",
      "headline": "If India qualifies for WTC final, it will be a miracle: Chopra after SA loss Former cricketer Aakash Chopra has said that India won't make it to the World Test Championship 2025-27 final after their home series loss to South Africa. India were blanked 0-2 in the series and slipped further down the WTC standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-botham-slams-bazball-england-perth-loss-warns-5-0-ashes-whitewash-2826721-2025-11-27",
      "headline": "Ian Botham slams Bazball, England: If that's the way you play, might as well go home England great Ian Botham has slammed Bazball and warned them of a 5-0 Ashes whitewash if they don't change their approach. England lost the Perth Test against Australia in two days after a Travis Head masterclass. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jess-jonassen-withdraws-wpl-2026-auction-injury-impact-2826716-2025-11-27",
      "headline": "Australia's Jess Jonassen pulls out of WPL auction: Report Australian allrounder Jess Jonassen has withdrawn from the WPL 2026 mega auction after suffering a shoulder injury, a development that could significantly impact franchise planning ahead of the new season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sergio-lobera-appointed-mohun-bagan-head-coach-to-boost-indian-super-league-campaign-2826773-2025-11-27",
      "headline": "Mohun Bagan appoint ISL winner Sergio Lobera as new head coach Mohun Bagan has appointed Sergio Lobera as their new head coach replacing Jose Molina. Lobera brings with him experience finding success in Indian football as he won the ISL title in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-virat-kohli-fortress-gautam-gambhir-2826760-2025-11-27",
      "headline": "The Kohli fortress falls under Gambhir, its cracks far too deep for instant repair India vs South Africa: A team that once made visitors tremble now flinches at its own shadows. India's greatest threat wasn't South Africa or New Zealand — it's the uncertainty eating them from within."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-india-wtc-2027-final-miracle-qualification-analysis-2826754-2025-11-27",
      "headline": "If India qualifies for WTC final, it will be a miracle: Chopra after SA loss Former cricketer Aakash Chopra has said that India won't make it to the World Test Championship 2025-27 final after their home series loss to South Africa. India were blanked 0-2 in the series and slipped further down the WTC standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-botham-slams-bazball-england-perth-loss-warns-5-0-ashes-whitewash-2826721-2025-11-27",
      "headline": "Ian Botham slams Bazball, England: If that's the way you play, might as well go home England great Ian Botham has slammed Bazball and warned them of a 5-0 Ashes whitewash if they don't change their approach. England lost the Perth Test against Australia in two days after a Travis Head masterclass. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jess-jonassen-withdraws-wpl-2026-auction-injury-impact-2826716-2025-11-27",
      "headline": "Australia's Jess Jonassen pulls out of WPL auction: Report Australian allrounder Jess Jonassen has withdrawn from the WPL 2026 mega auction after suffering a shoulder injury, a development that could significantly impact franchise planning ahead of the new season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-cricket-selectors-consider-t20-captaincy-changes-2025-home-world-cup-2826685-2025-11-27",
      "headline": "Just before T20 World Cup 2026, Sri Lanka considering Asalanka captaincy sackSri Lanka selectors are considering sacking Charith Asalanka as the captain of the T20I side, just a few months ahead of the T20 World Cup 2026. Asalanka has struggled for form and left for home ahead of the tri-series in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-perth-ashes-india-vs-west-indies-delhi-ahmedabad-test-pitch-rating-2826694-2025-11-27",
      "headline": "Indian pitches rated satisfactory, but Perth's 2-day Ashes opener rated very goodThe ICC has rated the Perth Stadium pitch as \"very good\" despite the Ashes opener finishing inside two days, a verdict that contrasts sharply with the \"satisfactory\" ratings handed to recent Test surfaces in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-liverpool-lose-vs-psg-arne-slot-reaction-2826672-2025-11-27",
      "headline": "Arne Slot responds to sack speculation after Liverpool's worst run in 70 yearsArne Slot said it was understandable that questions were being asked over his future as Liverpool head coach, but insisted he still retained the support of the club's hierarchy after another heavy defeat, this time a 4-1 loss to PSV Eindhoven at Anfield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-india-worst-spin-batting-reason-south-africa-series-whitewash-2826666-2025-11-27",
      "headline": "How did India become one of the poorest spin-playing nations? R Ashwin explainsR Ashwin explained why India's spin-playing skills have declined following their 0-2 series loss to South Africa. The Indian team were blanked by South Africa by a margin of 408 runs as the batters struggled to handle Simon Harmer and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mbappe-scores-four-real-madrid-champions-league-win-olympiacos-2826651-2025-11-27",
      "headline": "Mbappe hits four as Real Madrid edge past Olympiacos, Liverpool humbled againKylian Mbappé made Champions League history with four goals as Real Madrid edged Olympiacos 4-3 in Greece, while Liverpool suffered their first group-stage home loss in 14 matches after a 4-1 defeat to PSV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-auction-november-new-delhi-top-players-rtm-purse-2826600-2025-11-27",
      "headline": "WPL 2026 auction complete guide: Where to watch, FAQs and top players on listThe Women's Premier League 2026 auction is scheduled for November 27 in New Delhi. The event will feature 277 players and introduce RTM cards, impacting team strategies and player selections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-greatest-test-captain-unbeaten-record-india-vs-south-africa-2826649-2025-11-27",
      "headline": "Is Temba Bavuma the greatest Test captain in his era?IND vs SA: Temba Bavuma ended South Africa's long wait for winning a Test series on Indian soil after their 408-run triumph in Guwahati. Bavuma is unbeaten as Test captain, having won 11 games since 2023. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/mohammad-siraj-air-india-express-flight-delay-complaint-guwahati-hyderabad-2826648-2025-11-27",
      "headline": "Worst airline: Siraj hits out at Air India Express after hours-long flight delayMohammed Siraj publicly called out Air India Express for the 4-hour delay in departure from Guwahati to Hyderabad and the lack of communication regarding it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mbappe-scores-four-real-madrid-champions-league-win-olympiacos-2826651-2025-11-27",
      "headline": "Mbappe hits four as Real Madrid edge past Olympiacos, Liverpool humbled againKylian Mbappé made Champions League history with four goals as Real Madrid edged Olympiacos 4-3 in Greece, while Liverpool suffered their first group-stage home loss in 14 matches after a 4-1 defeat to PSV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-auction-november-new-delhi-top-players-rtm-purse-2826600-2025-11-27",
      "headline": "WPL 2026 auction complete guide: Where to watch, FAQs and top players on listThe Women's Premier League 2026 auction is scheduled for November 27 in New Delhi. The event will feature 277 players and introduce RTM cards, impacting team strategies and player selections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-greatest-test-captain-unbeaten-record-india-vs-south-africa-2826649-2025-11-27",
      "headline": "Is Temba Bavuma the greatest Test captain in his era?IND vs SA: Temba Bavuma ended South Africa's long wait for winning a Test series on Indian soil after their 408-run triumph in Guwahati. Bavuma is unbeaten as Test captain, having won 11 games since 2023. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/mohammad-siraj-air-india-express-flight-delay-complaint-guwahati-hyderabad-2826648-2025-11-27",
      "headline": "Worst airline: Siraj hits out at Air India Express after hours-long flight delayMohammed Siraj publicly called out Air India Express for the 4-hour delay in departure from Guwahati to Hyderabad and the lack of communication regarding it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/haryanas-sporting-tragedy-national-player-dies-after-rusted-pole-collapses-in-rohtak-ytvd-2826643-2025-11-27",
      "headline": "Twin Basketball tragedies rock Haryana, 2 teens die after rusted poles collapseThis special report covers the death of 16-year-old national-level basketball player in Lakhan Majra, Rohtak, after a corroded basketball pole fell on him during practice. The incident highlights the dilapidated state of sports infrastructure and alleged administrative negligence in Haryana, drawing attention to a similar death of another young player in Bahadurgarh just days prior. A person at the scene stated, 'No one has come to us from the sports department'. The report shows the hazardous conditions, including a crumbling gym building, where athletes train, raising questions about player safety and the accountability of the Haryana Sports Department. Locals claim complaints about the dangerous equipment were made to the administration previously without any action being taken."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-sunil-gavaskar-rajdeep-sardesai-scheduling-preparation-2826599-2025-11-26",
      "headline": "Poor preparation, tough scheduling hurt India's Test game, says Sunil GavaskarFormer India cricketer, Sunil Gavaskar, in an exclusive interview with Rajdeep Sardesai on India Today opened up on how the packed cricketing calendar for the Indian team may have hampered their preparations when playing Test cricket at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-gautam-gambhir-india-test-loss-south-africa-interview-2826593-2025-11-26",
      "headline": "Players have to deliver: Sunil Gavaskar hits out at Gautam Gambhir's criticsIn an exclusive interview with India Today, Sunil Gavaskar defended Gautam Gambhir amid rising calls for his removal, arguing that critics were silent when India won major tournaments under him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/sunil-gavaskar-backs-coach-gautam-gambhir-after-indias-record-408-run-test-defeat-to-south-africa-ytvd-2826587-2025-11-26",
      "headline": "Not India's lowest point: Sunil Gavaskar on India's 0-2 defeat vs South AfricaIn an interview with India Today, Sunil Gavaskar stated that India's 0-2 defeat against South Africa was not the lowest point in their Test history. He added that the 0-3 loss to New Zealand last year was a bigger setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-shubman-gill-rallying-call-after-test-whitewash-message-2826580-2025-11-26",
      "headline": "Gill makes rallying call after Test drubbing: It's the storm that forges steady handsShubman Gill issued a rallying message after India's 408-run loss to South Africa, urging belief and unity as the team looks to recover from a 2–0 home whitewash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-brother-in-law-jeet-pabari-dies-suicide-2826554-2025-11-26",
      "headline": "Cheteshwar Pujara's brother-in-law Jeet Pabari dies by suicideJeet Pabari, brother-in-law of former India cricketer Cheteshwar Pujara, died by suicide at his Rajkot home on Wednesday. Police have begun an investigation and are awaiting statements from family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-decline-south-africa-historic-series-win-guwahati-2826547-2025-11-26",
      "headline": "From WTC finalists to home punching bags: How India fell from grace in TestsFrom dominating visiting sides to being overpowered on their own pitches, India's Test decline has been as swift as it is shocking. With roles unclear and identity uncertain, the once-formidable home fortress has become just another venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sack-india-vs-south-africa-2826526-2025-11-26",
      "headline": "12 mahine me do baar: India's home Test problem is of their own makingThe Indian cricket team has lost their second home Test series under the coaching of Gautam Gambhir. Last year it was 12 saal me ek baar. But now under Gambhir's coaching, is this going to become the new normal?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}