{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/explained-why-tata-motors-share-price-fell-9-percent-today-q3-results-should-you-buy-jefferies-nuvama-2672241-2025-01-30",
      "headline": "Explained: Why Tata Motors share price fell 9% today Tata Motors share price: The stock hit the day's low of Rs 684.25. Jefferies downgraded Tata Motors from 'buy' to 'underperform'. The firm also reduced its price target to Rs 660 from Rs 930. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-flat-as-market-awaits-cues-from-budget-us-feds-next-move-2672223-2025-01-30",
      "headline": "Sensex, Nifty open flat as market awaits cues from Budget, US Fed's next moveThe S&P BSE Sensex was up by 33.36 points to 76,566.32, while the NSE Nifty50 gained 34.50 points to 23,197.60 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-agarwals-healthcare-ipo-day-2-should-you-subscribe-review-check-latest-gmp-2672219-2025-01-30",
      "headline": "Dr Agarwals Healthcare IPO: Should you subscribe? Check latest GMPDr Agarwals Healthcare IPO aims to raise Rs 3,027.26 crore through a combination of fresh issue of 75 lakh shares and an offer for sale of 6.78 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-share-price-adani-enterprises-adani-ports-q3-focus-today-heres-why-2672208-2025-01-30",
      "headline": "Shares of Adani Enterprises, Adani Ports to be in focus today. Here's whyAdani Enterprises reported a rise in profit in Q3 FY24. The company posted a 2.3 times year-on-year (YoY) jump in consolidated net profit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-bank-launches-devanagari-pin-for-safer-banking-how-it-works-details-2672202-2025-01-30",
      "headline": "Axis Bank launches Devanagari PIN for safer banking. Here's how it worksAxis Bank has unveiled the Devanagari PIN, blending technology and tradition to create a banking PIN that's as personal as your favourite memory, but much harder for cyber criminals to crack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niti-aayog-fiscal-health-report-bihar-ahead-of-andhra-pradesh-haryana-punjab-2671957-2025-01-29",
      "headline": "Even Bihar beats Punjab, Andhra, Haryana in fiscal health, shows Niti reportPunjab, Andhra Pradesh, West Bengal, Kerala and Haryana are at the bottom of the Niti Aayog's list on fiscal health. Bihar, an earlier Bimaru state, has managed to outpace its richer counterparts in fiscal discipline. Odisha tops the list among states with the best fiscal management, and is followed by Jharkhand and Chhattisgarh, two surprise states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-mahila-samman-savings-certificate-get-an-extension-women-empowerment-high-interest-rate-2671947-2025-01-29",
      "headline": "Budget 2025: Will Mahila Samman Savings Certificate get an extension?Union Budget 2025: Mahila Samman Savings Certificate has played a key role in encouraging savings among women from the lower-income group and promoting women's empowerment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-concert-economy-that-pm-modi-mentioned-after-coldplays-india-shows-2671911-2025-01-29",
      "headline": "What is 'concert economy' that PM Modi mentioned after Coldplay's India showsRock band Coldplay set a new record for the largest stadium concert of the 21st century on January 25-26, drawing over 2 lakh fans in Ahmedabad, surpassing George Strait's Texas record of 1,10,905 attendees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-gain-1-percent-as-it-stocks-lead-market-recovery-itc-hotels-fall-4-percent-2671901-2025-01-29",
      "headline": "Sensex, Nifty gain 1% as IT stocks lead market recovery; ITC Hotels fall 4%The S&P BSE Sensex surged 631.55 points to end at 76,532.96, while the NSE Nifty50 gained 205.85 points to close at 23,163.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-does-it-make-sense-to-have-a-unified-tax-slab-to-simplify-tax-structure-avoid-confusion-benefit-taxpayers-2671898-2025-01-29",
      "headline": "Budget 2025: Does it make sense to have a unified tax slab?Experts urge government to take the best of both the old and new tax regimes and introduce a unified tax regime that would benefit the taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-500-points-whats-behind-todays-bull-run-on-dalal-street-2671828-2025-01-29",
      "headline": "Sensex rises over 500 points: What's behind today's bull run on Dalal StreetShare Market Today: The S&P BSE Sensex was trading 508.25 points higher at 76,409.66 at 1:10 pm, while the NSE Nifty50 rose 170.15 points to trade at 23,127.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-will-taxpayers-get-relief-income-tax-changes-to-watch-out-for-2671823-2025-01-29",
      "headline": "Budget 2025: Will taxpayers get relief? Income tax changes to watch out forBudget 2025: The current income-tax law is complex for average taxpayers due to its technical jargon and numerous provisos, circulars, and notifications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-old-tax-regime-vs-new-tax-regime-which-is-better-tax-relief-finance-minister-nirmala-sitharaman-2671804-2025-01-29",
      "headline": "Budget 2025: Old tax regime vs new tax regime; which is better?Union Budget 2025: The new tax regime was first introduced in Union Budget 2020-21 by inserting a new section, 115BAC, in the Income Tax Act for individuals and Hindu Undivided Families (HUFs)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-share-price-rises-5-percent-after-q3-results-buy-hold-or-sell-2671798-2025-01-29",
      "headline": "Bajaj Auto share price rises 5% after Q3 results: Buy, hold or sell?Bajaj Auto stock price: The two-wheeler company's stock rose over 5% to hit a day's high of Rs 8,803.70 on the Bombay Stock Exchange (BSE). At around 12:27 pm, shares of the company were trading 3.70% higher at Rs 8,702.90.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepseek-low-cost-artificial-intelligence-models-benefit-indian-it-firms-explained-2671783-2025-01-29",
      "headline": "Will DeepSeek's low-cost AI models benefit Indian IT firms like TCS, Infosys? Analysts at Motilal Oswal Financial Services suggested that a shift from high-cost AI infrastructure to more affordable alternatives could open new opportunities for Indian IT services firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-sensex-nifty-gain-3-key-things-to-know-2671729-2025-01-29",
      "headline": "Why is the stock market rising today? 3 things to knowShare Market Today: The Sensex and Nifty50 gained in early trade and experts believe the conditions are favourable for more gains. However, it will depend on key developments, like the US Fed's policy decision and the Union Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-hotels-share-price-stock-lists-at-30-percent-discount-on-nse-rs-180-bse-listing-2671718-2025-01-29",
      "headline": "ITC Hotels share price: Stock lists at 30% discount on NSE ITC Hotels shares listing: ITC Hotels shares opened at Rs 188 on the Bombay Stock Exchange (BSE), listing at a discount of 31% to the discovered price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-opening-bell-sensex-nifty-open-in-green-as-it-and-auto-stocks-rise-bajaj-auto-gains-4-percent-2671699-2025-01-29",
      "headline": "Sensex, Nifty open in green as IT and auto stocks rise; Bajaj Auto gains 4%The S&P BSE Sensex added 221 points to 76,122.41, while the NSE Nifty50 gained 66.40 points to 23,023.65 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-tech-stocks-apple-meta-alphabet-oracle-recover-a-day-after-deepseek-selloff-hit-nvidia-2671681-2025-01-29",
      "headline": "Wall Street tech stocks recover a day after DeepSeek selloff hit NvidiaNvidia, which lost 17% in Monday's session, the biggest one-day loss in market history, rose 8.9% on Tuesday as investors looked for buying opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-intel-ceo-pat-gelsinger-bets-on-this-ai-stock-nvidia-amid-deepseek-rise-chinese-startup-check-here-2671670-2025-01-29",
      "headline": "Former Intel CEO Pat Gelsinger bets on this AI stock amid DeepSeek's riseThe rise of Chinese artificial intelligence (AI) startup DeepSeek caused a huge reaction in the stock market, leading to a $600 billion drop in Nvidia's market value. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-reloaded-version-on-ott-when-and-where-to-watch-allu-arjuns-film-in-hindi-stmp-2672238-2025-01-30",
      "headline": "Pushpa 2 Reloaded on OTT: When and where to watch Allu Arjun's film in HindiAllu Arjun and Rashmika Mandanna's Pushpa 2: The Rule (Reloaded Version) has made its way to the small screens. The film, with 24 minutes of additional footage, has finally been released on OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-on-ott-oscar-nominated-film-stream-globally-netflix-priyanka-chopra-2672227-2025-01-30",
      "headline": "Anuja on OTT: When and where to watch Priyanka Chopra-backed Oscar-nominated filmOscar-nominated film Anuja is set to premiere globally on Netflix. Backed by Priyanka Chopra and Guneet Monga among others, the movie will stream next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-house-in-kansas-city-amid-engagement-rumours-2672210-2025-01-30",
      "headline": "Taylor Swift, Travis Kelce plan to buy a house in Kansas City: ReportTaylor Swift and Travis Kelce are reportedly exploring an opportunity to buy a house in Kansas City. Recently, reports about their engagement have been doing the rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-16-samay-raina-jokes-amitabh-bachchan-sooryavansham-sneaking-into-jalsa-2672204-2025-01-30",
      "headline": "KBC 16: Samay Raina jokes about Big B's Sooryavansham, recalls sneaking into JalsaAmitabh Bachchan recently welcomed content creators Samay Raina, Tanmay Bhat, and Bhuvan Bam on Kaun Banega Crorepati 16. In a viral video from the show, Samay's hilarious banter with Amitabh Bachchan left fans in splits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-mahira-sharma-dating-cricketer-mohammed-siraj-2672085-2025-01-29",
      "headline": "Bigg Boss's Mahira Sharma dating cricketer Mohammed Siraj? Her mother reactsTV actor Mahira Sharma's mother denies rumours of her daughter dating cricketer Mohammed Siraj. The cricketer was previously rumoured to be dating Asha Bhosle's granddaughter Zanai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-docuseries-on-asaram-bapu-throws-spotlight-on-india-darkest-scandal-2672000-2025-01-29",
      "headline": "Watch: New docuseries on Asaram Bapu throws spotlight on India's 'darkest scandal'A new docuseries, Cult of Fear: Asaram Bapu, is currently streaming on Discovery +. The series explores the controversial case surrounding the self-proclaimed Godman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gabriel-macht-feels-sorry-for-those-who-go-to-law-school-after-watching-suits-2671907-2025-01-29",
      "headline": "Actor Gabriel Macht feels sorry for those who go to law school after watching SuitsSuits star Gabriel Macht said he always feels the need to apologise to people who decided to enroll in a law school after watching his hit TV series, Suits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sivarapalli-review-rag-mayurs-show-fails-to-pass-authenticity-test-panchayat-remake-2671869-2025-01-29",
      "headline": "Sivarapalli review: Rag Mayur's Panchayat remake fails to pass authenticity testReleased-Fri Jan 24, 2025Sivarapalli, the official Telugu remake of the popular series Panchayat, is currently streaming on Prime Video. While the show features strong performances from actors Rag Mayur, Sunny Palle and Muralidhar Goud, it gives a sense of déjà vu throughout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-storyteller-satyajit-ray-vintage-storytelling-at-its-most-beautiful-in-paresh-rawal-adil-hussain-film-2671785-2025-01-29",
      "headline": "The Storyteller review: Satyajit Ray's vintage storytelling at its most beautifulReleased-Tue Jan 28, 2025The Storyteller is derived from Satyajit Ray's short story. It features Paresh Rawal and Adil Hussain in the pivotal roles, but it's the stories told in the film and the essence of storytelling that elevate the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-veer-mehra-chum-darang-farah-khan-aditi-rao-hydari-siddharth-javed-akhtar-birthday-2671792-2025-01-29",
      "headline": "BB 18's Karan Veer, Chum Darang party with Farah Khan, Aditi-Siddharth and othersKaran Veer Mehra along with Chum Darang were among the other guests at Javed Akhtar's birthday bash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-mehta-boys-trailer-boman-irani-avinash-tiwary-explore-father-son-dynamics-prime-video-2671791-2025-01-29",
      "headline": "The Mehta Boys trailer: Boman Irani, Avinash Tiwary explore father-son dynamicsThe first full trailer of The Mehta Boys is here, and it promises a heartfelt and layered story about a father-son relationship. Directed by Irani, the film will premiere on Prime Video in February. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-squid-game-star-park-gyu-young-wants-to-play-a-happy-virus-in-bollywood-2671780-2025-01-29",
      "headline": "Exclusive: Squid Game star Park Gyu-young wants to play a 'happy virus' in BollywoodSouth Korean star Park Gyu-young opened up about her solitary experience filming Squid Game 2 and her interest in Bollywood roles. She also humorously addressed BTS' V cameo rumours for Season 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trauma-code-heroes-on-call-review-ju-ji-hoon-netflix-medical-show-cha-youngwoo-ha-young-2671430-2025-01-29",
      "headline": "The Trauma Code review: Ju Ji-hoon's medical show deserves more than just 8 episodesReleased-Fri Jan 24, 2025The Trauma Code Heroes on Call is Netflix's latest K-drama offering. Featuring a stellar starcast led by Ju Ji-hoon, read our review to find out if it is your cup of tea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jonas-brothers-kevin-jonas-joe-jonas-nick-jonas-announce-new-christmas-film-2671720-2025-01-29",
      "headline": "Jonas Brothers announce new Christmas film, to release later this yearThe Jonas Brothers have announced a new Christmas film. It is set to premiere on Disney+ Hotstar later this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-squid-game-2-actor-park-gyu-young-on-bollywood-her-role-bts-v-cameo-rumours-2671710-2025-01-29",
      "headline": "IT Exclusive: Squid Game actor Park Gyu-young on Bollywood, her role, BTS V Park Gyu-young, starring in Squid Game 2 as a North Korean defector, spoke to India Today's Bhavna Agarwal about filming solo, feeling lonely on set, and her interest in Bollywood. She also reacted to the viral BTS' V cameo rumor in Season 3, sparking excitement for the Netflix series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-yim-siwan-and-jo-yuri-want-to-star-in-bollywood-rom-com-squid-game-2-bts-v-cameo-2671698-2025-01-29",
      "headline": "Exclusive interview with Yim Siwan and Jo Yuri on India Today In an exclusive chat with India Today's Bhavna Agarwal, the Squid Game 2 stars Yim Siwan and Jo Yuri opened up about their roles, life lessons for their characters, thoughts on starring together in a non-toxic drama, and if they would like to star in a Bollywood film together."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/cigarettes-after-sex-cancels-bengaluru-concert-technical-issue-ahmedabad-2671666-2025-01-29",
      "headline": "Cigarettes After Sex cancels Bengaluru show at the last minute. Here's whyIndie-pop band Cigarettes After Sex cancelled their Bengaluru concert at the last minute, citing local production issues. This left fans agitated, with many expressing their frustration and disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-on-coldplay-ticket-chaos-first-time-we-tried-democratic-ticketing-2671564-2025-01-28",
      "headline": "BookMyShow CEO on Coldplay ticket chaos: First time we tried democratic ticketingAshish Hemrajani, CEO of BookMyShow, addressed the chaos surrounding Coldplay concert tickets in India, explaining that they employed a democratic ticketing system, which required everyone to join a queue and prevented individuals from using their privilege to gain unfair access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shinde-bigg-boss-makers-decide-winner-2671562-2025-01-28",
      "headline": "Actor Shilpa Shinde accuses Bigg Boss makers of rigging resultsTV actor Shilpa Shinde called out Bigg Boss makers for deciding the winner themselves, saying the audience has figured out their strategy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-malik-sad-musicians-have-keep-drilling-themselves-people-heads-exclusive-2671541-2025-01-28",
      "headline": "Armaan Malik: Sad that musicians have to keep drilling themselves in people's headsSinger Armaan Malik spoke to India Today Digital about the challenges musicians face to stay relevant in a competitive industry. He also spoke about the evolving concert culture in India and the rise of independent music."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/reagan-airport-small-plane-american-airlines-crash-helicopter-collide-washington-shut-down-united-states-potomac-river-2672206-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18 dead after passenger jet collides with Army chopper midair near WashingtonA passenger jet collided with the US Army's BlackHawk helicopter while trying to land at the Ronald Reagan National Airport near Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-fans-injured-delhi-vs-railways-2672236-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli's Ranji Trophy return: Crowd chaos at Kotla, few injuredRanji Trophy 2024-25: The situation outside the Arun Jaitley Stadium turned chaotic before Virat Kohli's return to the first-class tournament in the match against Railways. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mela-stampede-yogi-adityanath-guidelines-late-night-meeting-crowd-management-2672188-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No-vehicle zone, VVIP passes cancelled: Big changes after Kumbh stampedeMaha Kumbh stampede impact: Following a stampede at the Maha Kumbh that killed 30 people, Uttar Pradesh Chief Minister Yogi Adityanath issued several measures to manage crowd and traffic at the world's largest spiritual gathering on the planet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-coronavirus-china-virus-gift-from-china-wuhan-virology-institue-lab-leak-theory-opens-again-ratcliffe-2671821-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Covid originate in Wuhan lab? Calls for probe into 'China virus' grow in USIt was on January 30, 2020, that WHO declared Covid-19 a global public health emergency. The novel coronavirus would end up killing nearly seven million people. Five years on, and with Donald Trump back in the White House, there's a growing call to probe if the virus leaked from a lab in Wuhan, China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/asian-influencers-are-embracing-diy-skincare-again-but-there-is-a-catch-2672055-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Asian influencers are embracing DIY skincare again, but there is a catchDIY skincare and haircare trends might seem like the ultimate beauty hack—easy, affordable, and all-natural. But is it worth the hype?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/george-soros-son-alex-soros-bangladesh-chief-advisor-muhammad-yunus-meeting-sheikh-hasina-dhaka-2672192-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "George Soros's son meets Yunus after Trump halts funding to BangladeshThis is the second meeting between Alex Soros and Muhammad Yunus in three months. The duo had met in New York in October - weeks after Yunus took charge following the fall of the Sheikh Hasina regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/video-moment-american-airlines-jet-collided-with-army-chopper-midair-in-us-2672212-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Caught on camera: American Airlines plane collides with Army chopper midairA clip shows the lights of a PSA Airlines plane approaching to land at the Washington airport before it hit a US Army helicopter, which is not visible in the dark, and both burst into flames."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/explained-why-tata-motors-share-price-fell-9-percent-today-q3-results-should-you-buy-jefferies-nuvama-2672241-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why Tata Motors share price fell 9% today Tata Motors stock price: The stock hit the day's low of Rs 684.25. Jefferies downgraded Tata Motors from 'buy' to 'underperform'. The firm also reduced its price target to Rs 660 from Rs 930. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-naval-sailing-vessel-tarini-women-officers-point-nemo-isolated-place-on-earth-2672231-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 women officers aboard naval ship Tarini cross the most isolated place on EarthThe Indian Naval Sailing Vessel (INSV) Tarini, with two women Navy officers aboard, crossed Point Nemo during its global circumnavigation. The voyage is part of Navika Sagar Parikrama II, an expedition aiming to complete a double-handed circumnavigation via the three Great Capes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-in-ranji-tropy-live-score-updates-delhi-vs-railways-group-d-match-from-arum-jaitely-stadium-2672203-2025-01-30?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Virat Kohli in Ranji Trophy live score, updates: Railways lose 3 early wickets vs DelhiRanji Trophy 2024-25 Live: Star India batter Virat Kohli is all set to make a comeback to the Ranji Trophy after a long gap of 12 years as Delhi lock horns with Railways in their Round 7 clash of the tournament at Arun Jaitely Stadium in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-techie-selfie-perplexity-ai-ceo-aravind-srinivas-viral-green-card-banter-caption-2672237-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian techie's selfie with Aravind Srinivas goes viral for its Green Card banterIn a post on X, an Indian-origin techie shared a selfie with Perplexity AI CEO Aravind Srinivas. The selfie went viral because of its witty caption about the Green Card.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-government-employees-ultimatum-deferred-resignation-programme-work-in-person-2672189-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Return to office by February 6, or you're fired: Trump to US federal employeesPresident Donald Trump warned US federal employees to return to in-person work by February 6 or face termination. The government is offering buyouts, with departures permitted under a deferred resignation programme. Trump aims to reduce the federal workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-morgan-freeman-matthew-mcconaughey-joy-awards-riyadh-2672196-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hrithik Roshan features in new video alongside Morgan Freeman, Matthew McConaughey Bollywood actor Hrithik Roshan was honoured at the Joy Awards in Riyadh. He featured in a video alongside the legendary Morgan Freeman and Matthew McConaughey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-aap-manoeuvre-delhis-middle-class-concerns-turn-modi-govts-problem-2672010-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In AAP manoeuvre, Delhi's middle-class concerns turn Modi govt's problemArvind Kejriwal's party has sensed a big messaging gap in its poll campaign. Thus a list of demands to corner the BJP-led Centre ahead of the Union Budget"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-minister-sanjay-nishad-stampede-maha-kumbh-minor-incident-2672179-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Minor incidents do happen in such big event: UP minister on Maha Kumbh stampedeUttar Pradesh Minister Sanjay Nishad downplayed the stampede at Maha Kumbh, calling it a \"minor incident\" amid a large crowd. He also assured government vigilance and condoled the loss of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/mumbai-airport-t1-to-shut-for-renovation-10-million-flyers-shift-to-navi-mumbai-2671909-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai airport T1 to shut for renovation. 10 million flyers to shift to Navi MumbaiMumbai's Chhatrapati Shivaji Maharaj Airport Terminal 1 will close temporarily for a four-year renovation. Read more details below.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-house-in-kansas-city-amid-engagement-rumours-2672210-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Taylor Swift, Travis Kelce plan to buy a house in Kansas City: ReportTaylor Swift and Travis Kelce are reportedly exploring an opportunity to buy a house in Kansas City. Recently, reports about their engagement have been doing the rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/deferred-resignation-for-us-federal-employees-pay-without-work-but-with-a-catch-2672158-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pay without work, but with a catch: All about 'deferred resignation' in USThe Trump administration has introduced the \"Deferred Resignation Program\", designed to encourage federal employees to voluntarily resign. Employees who opt for it will receive continued pay and benefits till September 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/school-enrolment-up-but-not-learning-outcomes-aser-education-report-highlights-2672119-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "School enrolment up in India but not learning outcomes: Education report highlightsThe ASER 2024 annual education report reveals high enrolment but serious learning gaps in rural India, with basic reading and math skills still a challenge. Here are the highlights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-poll-panel-notice-reply-yamuna-poisoned-remark-delhi-haryana-2672072-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Remarks on Yamuna made in public interest, Arvind Kejriwal tells poll panelIn his reply to the Election Commission's notice, Arvind Kejriwal said the statements about the poor water quality of Yamuna water were made to \"highlight the severe toxicity and contamination of raw water received from Haryana.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/luo-fuli-genius-ai-gal-behind-chinas-sensational-deepseek-r1-beat-chatgpt-alibaba-xiaomi-damo-academy-2672038-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet coder Luo Fuli, the genius AI gal behind China's sensational DeepSeek R1Many credit the newfound success of China's DeepSeek R1 to its talented team member, Luo Fuli, a 29-year-old \"AI prodigy\". She was a researcher at Alibaba's DAMO Academy and also started working for DeepSeek when it was a quantitative hedge fund in 2022. Here's the story of the 'genius AI gal'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-white-house-podcasters-social-media-influencers-tiktokers-new-media-2672157-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Podcasters to rub shoulders with legacy media in Trump White HouseThe White House said that the press credentials would be extended to TikTok content creators, bloggers, podcasters, etc. \"If you are producing legitimate news content, no matter the medium, you will be allowed to apply for press credentials to this White House,\" Press Secretary Karoline Leavitt said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/honda-joins-hero-and-bajaj-in-calling-for-lower-gst-rate-on-two-wheelers-2672034-2025-01-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Honda joins Hero and Bajaj in calling for lower GST rate on two-wheelersHonda recently upgraded several models, including the Activa, Activa 125, Dio, Livo, SP125, SP160 and Unicorn, to comply with the stricter BS6 OBD2B norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-to-become-pubjab-cm-parvesh-verma-delhi-polls-bhagwant-mann-2672138-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parvesh Verma cautions Punjab Chief Minister: 'Arvind Kejriwal eyeing your post'Speaking to India Today TV, BJP candidate Parvesh Verma claimed that Arvind Kejriwal will face defeat in the upcoming Delhi elections and move to Punjab to take over as Chief Minister, replacing Bhagwant Mann. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-reloaded-version-on-ott-when-and-where-to-watch-allu-arjuns-film-in-hindi-stmp-2672238-2025-01-30",
      "headline": "Pushpa 2 Reloaded on OTT: When and where to watch Allu Arjun's film in HindiPushpa 2 OTT release: Allu Arjun and Rashmika Mandanna's Pushpa 2: The Rule (Reloaded Version) has made its way to the small screens. The film, with 24 minutes of additional footage, has finally been released on OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-wishes-priyadarshan-birthday-photo-bhooth-bangla-tabu-2672214-2025-01-30",
      "headline": "Akshay Kumar wishes Priyadarshan on birthday with a pic from Bhooth Bangla setsAkshay Kumar shared a heartfelt birthday wish for director Priyadarhan. The two have reunited again for their upcoming film, Bhooth Bangla. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-morgan-freeman-matthew-mcconaughey-joy-awards-riyadh-2672196-2025-01-30",
      "headline": "Hrithik Roshan features in new video alongside Morgan Freeman, Matthew McConaughey Bollywood actor Hrithik Roshan was honoured at the Joy Awards in Riyadh. He featured in a video alongside the legendary Morgan Freeman and Matthew McConaughey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-mother-birthday-with-ram-charan-upasana-watch-video-2672098-2025-01-29",
      "headline": "Watch: Chiranjeevi celebrates mother's birthday with Ram Charan, UpasanaChiranjeevi celebrated his mother Anjana Devi's birthday. He wrote an emotional wish for her and called her the 'heart of the family'. Ram Charan and wife Upasana also attended the celebration. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-david-warner-on-steve-smiths-work-ethic-he-has-cricket-ball-sandwiches-sl-vs-aus-1st-test-day-1-2672239-2025-01-30",
      "headline": "David Warner on Steve Smith's work ethic: He has cricket ball sandwichesFormer Australia cricketer David Warner praised Steve Smith for his sensational work ethic after his marvellous hundred against Sri Lanka during Day 1 of the first Test in Galle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-fans-injured-delhi-vs-railways-2672236-2025-01-30",
      "headline": "Virat Kohli's Ranji Trophy return: Crowd chaos at Kotla, few injuredRanji Trophy 2024-25: The situation outside the Arun Jaitley Stadium turned chaotic before Virat Kohli's return to the first-class tournament in the match against Railways. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-champions-league-manchester-city-advance-to-playoff-with-3-1-win-over-club-brugge-barcelona-2672220-2025-01-30",
      "headline": "Champions League: Manchester City advance to playoff with 3-1 win over Club BruggeManchester beat Club Brugge to advance to the playoffs of the Champions League 2024-25 while Liverpool and Barcelona were the only teams already guaranteed a place in the top eight and automatic progress to the round of 16 as they stayed first and second."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-rcb-chants-2672218-2025-01-30",
      "headline": "Watch: Virat Kohli welcomed with RCB chants on Ranji returnRanji Trophy 2024-25: Virat Kohli was welcomed with chants of 'RCB, RCB' as he got seat to represent Delhi in their clash against Railways at the Arun Jaitley Stadium in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-in-ranji-tropy-live-score-updates-delhi-vs-railways-group-d-match-from-arum-jaitely-stadium-2672203-2025-01-30",
      "headline": "Virat Kohli in Ranji Trophy live score, updates: Railways lose 3 early wickets vs DelhiRanji Trophy 2024-25 Live: Star India batter Virat Kohli is all set to make a comeback to the Ranji Trophy after a long gap of 12 years as Delhi lock horns with Railways in their Round 7 clash of the tournament at Arun Jaitely Stadium in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-denied-help-to-carry-cricket-gear-during-practice-reveals-delhi-manager-2672198-2025-01-30",
      "headline": "Kohli denied help to carry cricket gear during practice, reveals Delhi managerRanji Trophy: Star India batter Virat Kohli denied taking any help to carry his cricketing gear during practice session ahead of his much-awaited Ranji Trophy comeback, revealed Delhi's Team Manager Mahesh Bhati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-crashes-ferrari-during-day-2-of-test-in-barcelona-2672154-2025-01-29",
      "headline": "Formula 1: Lewis Hamilton crashes Ferrari during Day 2 of Test in BarcelonaLewis Hamilton suffered a minor crash in his second outing as a Ferrari driver on Wednesday, January 29. Hamilton was taking part in the testing session in Barcelona with his new team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/deepti-sharma-thanks-up-government-after-appointment-as-deputy-sp-2672153-2025-01-29",
      "headline": "Deepti Sharma thanks UP government after appointment as Deputy SPIndia women's cricketer Deepti Sharma thanked the Uttar Pradesh government after being appointed Deputy Superintendent of Police (DSP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/coldplays-biggest-show-in-ahmedabad-proud-moment-for-india-icc-chief-jay-shah-2672128-2025-01-29",
      "headline": "Coldplay's biggest show in Ahmedabad proud moment for India: ICC chief Jay ShahICC chairman Jay Shah on Wednesday called Coldplay's record-breaking concert in Ahmedabad a \"proud moment for India. 134,000 fans packed Narendra Modi Stadium, marking the biggest show of the English band's career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-in-ranji-tropy-live-score-updates-delhi-vs-railways-group-d-match-from-arum-jaitely-stadium-2672203-2025-01-30",
      "headline": "Virat Kohli in Ranji Trophy live score, updates: Railways lose 3 early wickets vs DelhiRanji Trophy 2024-25 Live: Star India batter Virat Kohli is all set to make a comeback to the Ranji Trophy after a long gap of 12 years as Delhi lock horns with Railways in their Round 7 clash of the tournament at Arun Jaitely Stadium in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-denied-help-to-carry-cricket-gear-during-practice-reveals-delhi-manager-2672198-2025-01-30",
      "headline": "Kohli denied help to carry cricket gear during practice, reveals Delhi managerRanji Trophy: Star India batter Virat Kohli denied taking any help to carry his cricketing gear during practice session ahead of his much-awaited Ranji Trophy comeback, revealed Delhi's Team Manager Mahesh Bhati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-crashes-ferrari-during-day-2-of-test-in-barcelona-2672154-2025-01-29",
      "headline": "Formula 1: Lewis Hamilton crashes Ferrari during Day 2 of Test in BarcelonaLewis Hamilton suffered a minor crash in his second outing as a Ferrari driver on Wednesday, January 29. Hamilton was taking part in the testing session in Barcelona with his new team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/deepti-sharma-thanks-up-government-after-appointment-as-deputy-sp-2672153-2025-01-29",
      "headline": "Deepti Sharma thanks UP government after appointment as Deputy SPIndia women's cricketer Deepti Sharma thanked the Uttar Pradesh government after being appointed Deputy Superintendent of Police (DSP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/coldplays-biggest-show-in-ahmedabad-proud-moment-for-india-icc-chief-jay-shah-2672128-2025-01-29",
      "headline": "Coldplay's biggest show in Ahmedabad proud moment for India: ICC chief Jay ShahICC chairman Jay Shah on Wednesday called Coldplay's record-breaking concert in Ahmedabad a \"proud moment for India. 134,000 fans packed Narendra Modi Stadium, marking the biggest show of the English band's career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-sri-lanka-josh-inglis-debut-usman-khawaja-galle-2672125-2025-01-29",
      "headline": "AUS vs SL: Usman Khawaja reveals how Josh Inglis was trolled after getting Test capUsman Khawaja revealed how he trolled Josh Inglis after the wicketkeeper-batter was given his Australia baggy green cap on Day 1 of the first Test against Sri Lanka. Khwaja poked fun at Inglis' heritage and didn't even spare his emotional dad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/karun-nair-reaction-champions-trophy-india-squad-2672110-2025-01-29",
      "headline": "Karun dreams of playing Tests again: Was not thinking about Champions TrophyAfter a record-breaking run with the bat in the Vijay Hazare Trophy, veteran batter Karun Nair said he dreams of playing Test cricket for India again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-virat-kohli-ranji-trophy-return-delhi-vs-railways-navdeep-saini-2672105-2025-01-29",
      "headline": "Sharing dressing room with Virat Kohli proud moment for Delhi team: Navdeep SainiDelhi pacer Navdeep Saini has said that sharing the dressing room with a legend like Virat Kohli is a proud moment for the team ahead of their clash against Railways on Thursday, January 30. Kohli is making his return to the Delhi team after a gap of 13 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tata-steel-masters-d-gukesh-beats-mendonca-to-jump-into-sole-lead-2672102-2025-01-29",
      "headline": "Tata Steel Masters: D Gukesh beats Mendonca to jump into sole leadD. Gukesh emerged as the sole leader at the Tata Steel Master after defeating Leon Luke Mendonca, while R Praggnanandhaa suffered his first loss to Anish Giri. The spotlight also shone on P Harikrishna who lost to Vladimir Fedoseev, highlighting a day of intense competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ranji-trophy-virat-koihli-delhi-vs-railways-ayush-badoni-2672090-2025-01-29",
      "headline": "Grateful for opportunity to captain Virat Kohli: Delhi's Ayush BadoniSpeaking to the press on the eve of Ranji Trophy match, Delhi captain Ayush Badoni shed light on the impact of Virat Kohli's return. Delhi will face Railways at the Arun Jaitley Stadium in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-vs-railways-navdeep-saini-2672089-2025-01-29",
      "headline": "Virat Kohli is in my team: Delhi's Navdeep Saini dodges 4th stump line questionNavdeep Saini decided to dodge the question about trying to trouble Virat Kohli on the 4th stump line ahead of the star batter's return to the Ranji Trophy on Thursday, January 30. Kohli is making his return to the tournament after 13 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-ayush-badoni-captain-virat-kohli-press-conference-2672088-2025-01-29",
      "headline": "Ready to tell Virat Kohli where to field? Captain Badoni dodges googlies at pressRanji Trophy 2024-25: Delhi captain Ayush Badoni said he is looking forward to leading Virat Kohli in Delhi's match against Railways, adding that the superstar's return has boosted the morale in the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kuldeep-yadav-named-in-up-ranji-trophy-squad-for-mp-clash-2672076-2025-01-29",
      "headline": "Kuldeep Yadav returns after surgery, named in UP's Ranji squad for MP clashRanji Trophy: Kuldeep Yadav was named in Uttar Pradesh's (UP) squad for their last match against Madhya Pradesh (MP) at the Holkar Cricket Stadium in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ranji-trophy-virat-koihli-delhi-vs-railways-ayush-badoni-2672090-2025-01-29",
      "headline": "Grateful for opportunity to captain Virat Kohli: Delhi's Ayush BadoniSpeaking to the press on the eve of Ranji Trophy match, Delhi captain Ayush Badoni shed light on the impact of Virat Kohli's return. Delhi will face Railways at the Arun Jaitley Stadium in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-vs-railways-navdeep-saini-2672089-2025-01-29",
      "headline": "Virat Kohli is in my team: Delhi's Navdeep Saini dodges 4th stump line questionNavdeep Saini decided to dodge the question about trying to trouble Virat Kohli on the 4th stump line ahead of the star batter's return to the Ranji Trophy on Thursday, January 30. Kohli is making his return to the tournament after 13 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-ayush-badoni-captain-virat-kohli-press-conference-2672088-2025-01-29",
      "headline": "Ready to tell Virat Kohli where to field? Captain Badoni dodges googlies at pressRanji Trophy 2024-25: Delhi captain Ayush Badoni said he is looking forward to leading Virat Kohli in Delhi's match against Railways, adding that the superstar's return has boosted the morale in the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kuldeep-yadav-named-in-up-ranji-trophy-squad-for-mp-clash-2672076-2025-01-29",
      "headline": "Kuldeep Yadav returns after surgery, named in UP's Ranji squad for MP clashRanji Trophy: Kuldeep Yadav was named in Uttar Pradesh's (UP) squad for their last match against Madhya Pradesh (MP) at the Holkar Cricket Stadium in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/usman-khawaja-explains-how-he-dealt-with-rough-patch-2672041-2025-01-29",
      "headline": "Khawaja explains how he dealt with rough patch: Don't let cricket dictate lifeAfter hitting a stunning hundred in the Galle Test against Sri Lanka, Usman Khawaja explained how he dealt with the rough patch in his cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-afghanistan-women-melbourne-exhibition-match-taliban-ban-2672042-2025-01-29",
      "headline": "Afghanistan's female cricketers reunite for exhibition match after 3 years in exileAn Afghanistan Women's XI will play a Cricket Without Borders XI in the match at Melbourne's Junction Oval. It will bring together 21 female players who were formerly contracted by the Afghanistan Cricket Board (ACB) before the Taliban regime re-took control in August 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-vs-railways-free-entry-aadhar-card-arun-jaitley-stadium-2672031-2025-01-29",
      "headline": "If you're in Delhi, you can watch Virat Kohli's Ranji Trophy return. Here's howFans of Virat Kohli can see their favourite star in action on Thursday, January 30 as he makes his much-awaited Ranji Trophy return. Here's what you need to do to get into the Arun Jaitley stadium in Delhi to watch the star batter in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-ranji-trophy-return-karnataka-vs-haryana-2672027-2025-01-29",
      "headline": "KL Rahul will bat at No. 3 on Ranji Trophy return, confirms Karnataka coachRanji Trophy 2024-25: KL Rahul will return to play Ranji Trophy after a gap of five years when Karnataka take on Haryana in Bengaluru in an Elite Group C contest, starting Thursday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}