{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-more-insurance-claims-get-rejected-during-the-festive-season-2816566-2025-11-10",
      "headline": "Why more insurance claims get rejected during the festive seasonMany policyholders face claim rejections during the festive season due to confusion over policy terms, missing documents, and tighter insurer scrutiny. Experts say better awareness and clear communication can prevent disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-safe-returns-5-small-savings-schemes-offering-up-to-82-2816563-2025-11-10",
      "headline": "Looking for safe returns? 5 small savings schemes offering up to 8.2%Not everyone wants to gamble with their savings. If you lean towards stable and assured earnings, a few government-run schemes now offer returns of up to 8.2%, combining safety with decent interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-to-relax-lending-rethink-quality-checks-to-boost-exporters-2816521-2025-11-10",
      "headline": "Government to relax lending, rethink quality checks to boost exportersA senior government source said that the new support could include relaxed bank lending rules, better working capital access, and a review of strict quality checks that have been slowing down supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-mistakes-to-be-fixed-faster-heres-how-cbdts-new-rules-can-speed-up-income-tax-refunds-2816492-2025-11-10",
      "headline": "ITR mistakes to be fixed faster? Here's how CBDT's new rules can speed up refundsTaxpayers who've faced delays due to errors in their income tax returns may soon breathe easier. The CBDT has introduced new rules aimed at correcting ITR mistakes faster and speeding up refunds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-shares-listing-below-expectation-market-debut-3-percent-discount-review-hold-or-sell-2816488-2025-11-10",
      "headline": "Lenskart shares list at 3% discount: Should you sell or hold?The stock opened at Rs 395 on the National Stock Exchange (NSE), lower than the issue price of Rs 402. On the BSE, it listed at Rs 390, marking a discount of 2.98%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sebi-warns-investors-about-digital-gold-how-it-differs-from-gold-etfs-2816463-2025-11-10",
      "headline": "Why Sebi is warning investors about digital gold and what makes Gold ETFs saferSebi has warned investors about digital gold sold by fintech apps, calling it unregulated and risky. Experts say investors should move to Gold ETFs and other Sebi-regulated options for safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lenskart-shares-market-debut-3-percent-discount-rs-390-bse-nse-muted-listing-below-expectations-2816449-2025-11-10",
      "headline": "Lenskart shares make dull market debut, lists at 3% below IPO priceLenskart shares made a quiet market debut on Dalal Street today, opening at Rs 390 on the BSE, down 2.98% from the issue price. On the NSE, the stock began trading at Rs 395 per share, slightly below its issue price of Rs 402."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sebi-digital-gold-regulation-investment-safety-risky-should-you-invest-2816444-2025-11-10",
      "headline": "Sebi warns against digital gold: How risky is it and should you invest?Digital gold, often marketed as a convenient way to buy small amounts of gold online, allows users to purchase, store, and sell gold through apps without ever holding it physically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-ipo-allotment-status-check-online-latest-gmp-listing-date-2816438-2025-11-10",
      "headline": "Groww IPO allotment out today: Check status, latest GMP and listing detailsThe Groww IPO allotment is out today with investors checking status online. Strong demand met with moderate grey market premium as listing gains expected to stay limited amid market volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/goldman-sachs-india-rating-overweight-nifty50-target-29000-economy-growth-fii-returns-2816424-2025-11-10",
      "headline": "Goldman Sachs upgrades India to overweight, expects Nifty to rally to 29,000The brokerage has now set a Nifty50 target of 29,000 by December 2026, suggesting a potential upside of about 14% from Friday's closing levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-179-points-higher-nifty-above-25500-infosys-up-1-percent-2816412-2025-11-10",
      "headline": "Sensex, Nifty rise in choppy trade as investors pin hopes on strong Q2 earningsAt 9:30 am, the Sensex was up 136 points or 0.16% at 83,352.68, while the Nifty gained 37.7 points or 0.15% to 25,530.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sebi-digital-gold-investment-warning-safe-risk-review-what-can-investors-do-2816401-2025-11-10",
      "headline": "Are all digital gold investments at risk after Sebi's warning?Sebi made it clear that while some gold investment options are covered under its rules, many digital gold products operate outside its supervision and can expose investors to serious risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-shares-nse-bse-debut-listing-today-november-10-ipo-gmp-listing-gains-profit-loss-investors-2816392-2025-11-10",
      "headline": "Lenskart IPO listing today: Will the shares make a strong market debut?Lenskart's IPO opened on October 31 and closed on November 4, receiving an overwhelming response from investors. The issue was subscribed 28.27 times overall. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-gold-continue-to-glitter-this-wedding-season-should-you-buy-gold-prices-silver-prices-2816081-2025-11-09",
      "headline": "Will gold continue to glitter this wedding season?Gold has always been the heart of Indian wedding traditions, but surging prices and evolving tastes are forcing families to rethink their buying strategy. As the wedding season peaks, one question rings loud — will gold still shine bright, and should you buy now or wait?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-warns-people-against-investing-in-digital-gold-products-2815949-2025-11-08",
      "headline": "Thinking of buying digital gold? Sebi warns it's not a regulated productSebi further clarified that investor protection mechanisms applicable to regulated securities will not extend to such unregulated digital gold schemes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-1-trillion-salary-pay-package-how-will-he-spend-money-cars-jet-collection-2815748-2025-11-08",
      "headline": "Musk to pocket $1,000,000,000,000. What will he do with all the money?Elon Musk has been one of the world's richest people for several years now. And a $1 trillion pay package, which comes with conditions, will only make him richer. It has led social media to wonder how Musk, who is known not to live an extravagant life, will spend his money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-write-will-young-people-not-only-old-why-money-planning-estate-plan-inheritance-family-dispute-avoid-2815719-2025-11-08",
      "headline": "Wills aren't just for the old. Here's why you should have one tooFor most Indians, a will is something you think about when your hair turns grey, or you are on their deathbeds, but making a will early can be one of the most responsible things you do for your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/gold-vs-real-estate-where-should-you-invest-2815480-2025-11-07",
      "headline": "Gold vs real estate: Where should you invest?Safe glitter or solid bricks? Investors have always loved gold and property, but choosing between the two can be tricky. With inflation, demand, and prices on the rise, it's time to ask—where you should put your money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-quoted-tariffs-lower-than-torrent-jsw-to-win-bihar-2400-mw-bhagalpur-project-tender-2815474-2025-11-07",
      "headline": "Adani Power bags Bhagalpur's 2,400 MW project tenderFour qualified bidders participated in the tender, with Adani Power quoting the lowest electricity tariff of Rs 6.075 per kWh (or per unit), sources with direct knowledge of the bidding process said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-today-rs-1-21-lakh-outlook-buy-or-hold-2815326-2025-11-07",
      "headline": "Gold trades at around Rs 1.21 lakh per 10 grams: Should you buy or wait?Gold's shine shows no sign of fading as global uncertainty, a weak dollar, and festive demand keep prices high. But should investors buy now or wait for the next dip?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-dayanand-shetty-on-shedding-his-daya-image-exploring-grey-shades-2816569-2025-11-10",
      "headline": "People can't see me as negative: Dayanand Shetty on breaking CID image Actor Dayanand Shetty returned to the big screen with his latest release, 'Hello! Knock Knock Kon Hai'. In an interview with India Today, the actor spoke about exploring grey shades in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-mourns-longtime-make-up-artist-ashok-sawant-passing-2816544-2025-11-10",
      "headline": "Abhishek Bachchan mourns his longtime make-up artist Ashok Sawant: He was family Actor Abhishek Bachchan has shared a detailed note and pictures mourning the death of his make-up artist Ashok Sawant, reflecting on their nearly three-decade-long professional and personal relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-to-head-back-to-college-after-saiyaara-success-2816555-2025-11-10",
      "headline": "After Saiyaara's success, Aneet Padda to head back to college? After her noted debut in 'Saiyaara', Aneet Padda has been roped in for the horror-comedy film 'Shakti Shalini'. Before the film goes on the floor, she would have to head back to college. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/abhinay-death-tamil-actor-thulluvadho-ilamai-liver-disease-2816549-2025-11-10",
      "headline": "Tamil actor Abhinay dies at 44 after long battle with liver disease Abhinay, known for his role in the 2002 film 'Thulluvadho Ilamai', died at 44 following complications from liver disease. The actor's struggle with his health and appeals for assistance drew support from colleagues and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kiara-advani-shakti-shalini-rumours-because-of-paid-pr-amar-kaushik-breaks-silence-2816554-2025-11-10",
      "headline": "Paid PR behind Kiara Advani's Shakti Shalini rumours? Amar Kaushik breaks silence Amar Kaushik clarified speculation over casting choices for the upcoming film 'Shakti Shalini', underlining that Kiara Advani was never even approached for the character as Aneet Padda begins work on the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rukmini-vasanth-warns-fans-about-impersonator-police-issue-cyber-alert-2816560-2025-11-10",
      "headline": "Actor Rukmini Vasanth warns fans about impersonator, police issue cyber alert Actor Rukmini Vasanth issued a public warning after discovering someone impersonating her and contacting people under false pretences. She clarified that the number used by the impersonator was fake, while the Bengaluru City Police advised the public to stay alert and report such incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/inside-rent-a-girlfriend-where-modern-love-comes-with-price-tag-2816495-2025-11-10",
      "headline": "Inside Rent-A-Girlfriend, where modern love comes with a price tag In this week's Animania, we discuss how 'Rent-A-Girlfriend' dives into Japan's modern dating culture, exploring how love, loneliness, and emotional connection are being monetised in a society where romance can be rented by the hour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-63-sai-srinivas-evicted-thanuja-emmanuel-top-contenders-2816540-2025-11-10",
      "headline": "Bigg Boss Telugu 9 Day 63: Sai evicted, Thanuja-Emmanuel emerge as top contenders From Divya's secret task to Sai Srinivas's exit, the Sunday episode of 'Bigg Boss Telugu 9' balanced drama and emotion, revealing shifting loyalties in the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dude-on-ott-pradeep-ranganathan-mamitha-baiju-netflix-2816522-2025-11-10",
      "headline": "Dude on OTT: When and where to watch Pradeep Ranganathan's romantic-comedy After a highly successful theatrical release, Tamil film 'Dude', starring Pradeep Ranganathan and Mamitha Baiju, is set for its digital premiere on Netflix in multiple languages, expanding its reach to a wider audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-dances-her-heart-out-at-friends-udaipur-wedding-video-goes-viral-2816543-2025-11-10",
      "headline": "Ananya Panday dances her heart out at friend's Udaipur wedding, video goes viral Ananya Panday lit up her friend Deeya Shroff's Udaipur wedding with her energetic dance moves, as a video of her grooving to 'Woh Lamhe' went viral. Her photo dump from the festivities also grabbed attention after Janhvi Kapoor's playful comment on a picture of Ananya twinning with Shikhar Pahariya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/would-robert-pattinson-ever-return-as-edward-cullen-in-twilight-actor-responds-2816511-2025-11-10",
      "headline": "Would Robert Pattinson ever return as Edward Cullen in Twilight? Actor responds Actor Robert Pattinson has signalled a willingness to reprise his iconic Edward Cullen role from 'The Twilight Saga'. During a recent interview, the actor jokingly said he wants to be 17 again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-body-shaming-after-motherhood-renuka-shahane-criticises-unfair-public-scrutiny-2816516-2025-11-10",
      "headline": "Renuka Shahane has three words for Aishwarya Rai's body-shamers: Shut your mouth Renuka Shahane stood up against the body-shaming faced by Aishwarya Rai following her post-pregnancy appearances at events, highlighting ongoing pressures on female actors in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-son-jason-sanjay-sigma-first-look-poster-sundeep-kishan-shooting-completion-2816510-2025-11-10",
      "headline": "Vijay's son Jason Sanjay's Sigma first-look poster out, shooting nears completion The first-look poster of Thalapathy Vijay's son, Jason Sanjay's debut directorial, 'Sigma', was launched on November 10. Nearly 95 per cent of the shooting has been completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-screening-new-york-martin-scorsese-india-oscar-entry-2816491-2025-11-10",
      "headline": "Bummed to be missing out: KJo regrets not being at Scorsese's Homebound screening Karan Johar shared his excitement after the screening of India's Oscar entry 'Homebound' in New York, an event hosted by celebrated filmmaker Martin Scorsese. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lee-tamahori-dies-75-new-zealand-director-once-were-warriors-die-another-day-2816497-2025-11-10",
      "headline": "Lee Tamahori, director of Once Were Warriors and Die Another Day, dies at 75 Lee Tamahori, acclaimed for his films spanning both Hollywood and New Zealand cinema, has died at 75 following a struggle with Parkinson's disease. His legacy includes a commitment to promoting Maori talent and a significant impact on filmmakers worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/damian-hardung-maxton-hall-season-2-emotional-journey-india-visit-2816489-2025-11-10",
      "headline": "I've heard beautiful stories: Maxton Hall 2's Damian Hardung on visiting India Actor Damian Hardung discusses his role in 'Maxton Hall Season 2' and his memories of India. He reflects on his character's vulnerability and shares his spiritual ties to the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-her-fault-review-parenthood-paranoia-and-pain-collide-in-this-tense-thriller-sarah-snook-dakota-fanning-2816432-2025-11-10",
      "headline": "All Her Fault review: Parenthood, paranoia and pain collide in this tense thrillerRelease Date:Fri Nov 07, 2025 'All Her Fault' is a haunting domestic thriller that explores the fears, guilt and fragility of modern motherhood through a child's mysterious disappearance. Anchored by powerful performances, it's a slow-burn story that exposes the emotional cost of being a working mother."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-7-praveen-raj-evicted-sandra-secret-task-revealed-2816448-2025-11-10",
      "headline": "Bigg Boss Tamil 7 highlights: Praveen Raj evicted, Sandra's secret task revealed Praveen Raj was evicted unexpectedly from Bigg Boss Tamil 7 on Sunday. Sandra's secret task success sparked praise and stirred emotions among contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-box-office-collection-8-85-crore-opening-weekend-strong-audience-response-2816433-2025-11-10",
      "headline": "HAQ box office Day 3: Yami Gautam's film steady after 1st weekend Yami Gautam and Emraan Hashmi's courtroom drama 'HAQ', based on the landmark Shah Bano Begum case, earned Rs 8.85 crore in India during its first weekend. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/isis-terrorists-arrested-gujarat-ats-doctor-preparing-ricin-poison-surveyed-food-markets-2816487-2025-11-10",
      "headline": "Doctor arrested in Gujarat was preparing ricin poison, had surveyed food marketsThe Gujarat Anti-Terrorism Squad (ATS) has arrested three ISIS terrorists, including a doctor, accused of plotting a large-scale terror attack using weapons and toxic chemical agents."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arrested-jk-doctors-tip-leads-cops-to-300-kg-rdx-ak-47-ammunition-in-faridabad-near-delhi-2816429-2025-11-10",
      "headline": "360 kg of chemical used in bombs, rifle seized from medical college near DelhiJammu and Kashmir Police have recovered 360 kg of ammonium nitrate and an assault rifle from Faridabad based on disclosures by arrested doctor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-delhi-visit-no-high-command-meeting-sources-dk-shivakumar-november-2816439-2025-11-10",
      "headline": "Congress top brass denies time to Siddaramaiah during Delhi visit, say sourcesKarnataka Chief Minister Siddaramaiah's planned Delhi visit will not include a meeting with the Congress high command, sources said. The leadership has told Karnataka leaders no audience will be given. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/singing-vande-mataram-compulsory-up-schools-colleges-yogi-adityanath-2816572-2025-11-10",
      "headline": "Vande Mataram to be compulsory in all UP schools, colleges: Yogi AdityanathThe Uttar Pradesh government will mandate the singing of Vande Mataram in all schools and colleges, days after Prime Minister Narendra Modi launched a nationwide commemoration marking 150 years of the national song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-her-fault-review-parenthood-paranoia-and-pain-collide-in-this-tense-thriller-sarah-snook-dakota-fanning-2816432-2025-11-10",
      "headline": "All Her Fault review: Parenthood, paranoia and pain collide in this tense thrillerRelease Date:Fri Nov 07, 2025'All Her Fault' is a haunting domestic thriller that explores the fears, guilt and fragility of modern motherhood through a child's mysterious disappearance. Anchored by powerful performances, it's a slow-burn story that exposes the emotional cost of being a working mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sebi-warns-investors-about-digital-gold-how-it-differs-from-gold-etfs-2816463-2025-11-10",
      "headline": "Why Sebi is warning investors about digital gold and what makes Gold ETFs saferSebi has warned investors about digital gold sold by fintech apps, calling it unregulated and risky. Experts say investors should move to Gold ETFs and other Sebi-regulated options for safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaya-jayahe-telangana-poet-ande-sri-dies-andeshri-andhra-pradesh-bifurcation-telugu-film-industry-dalit-writer-lyricist-2816513-2025-11-10",
      "headline": "Ande Sri, heartbeat of Telangana statehood movement, state's anthem, diesRenowned Telugu poet Ande Sri, who penned Telangana's state anthem Jaya Jayahe Telangana, passed away in Hyderabad, aged 64. A self-taught orphan, his powerful, socially conscious verses fuelled the Telangana movement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-instagram-deactivated-csk-rr-trade-rumours-2816515-2025-11-10",
      "headline": "Ravindra Jadeja's Instagram account vanishes as CSK exit rumours growRavindra Jadeja's Instagram account has vanished as the rumours of his exit from CSK continue to gather steam. Jadeja is being linked with a swap deal with Sanju Samson that will see him return to RR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ironman-70-3-goa-tejasvi-surya-annamalai-complete-triathlon-2816421-2025-11-10",
      "headline": "Ironman: PM Modi cheers Annamalai, Tejasvi Surya for conquering Goa endurance raceTejasvi Surya and Annamalai successfully completed the Ironman 70.3 triathlon in Goa on Sunday. Prime Minister Narendra Modi praised the two young leaders for their commitment to fitness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-bjp-slams-namaz-bengaluru-airport-demands-action-from-state-government-2816376-2025-11-10",
      "headline": "BJP slams namaz at Bengaluru airport, demands action from SiddaramaiahKarnataka BJP spokesperson Vijay Prasad also sought clarification from Chief Minister Siddaramaiah and IT Minister Priyank Kharge over the alleged approval of such an act inside the high-security Bengaluru airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariff-dividend-2000-americans-economic-growth-national-debt-glbs-2816342-2025-11-10",
      "headline": "People against tariffs are fools: Trump announces $2,000 dividend for AmericansTrump claimed the country is taking in trillions of dollars from tariffs, with the money set to be used to reduce the $37 trillion national debt. He said the administration would soon begin paying it down while issuing a dividend of at least $2,000 per person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-hyderabad-bus-driver-watches-bigg-boss-while-driving-sacked-after-viral-video-2816477-2025-11-10",
      "headline": "Mumbai-Hyderabad bus driver watches Bigg Boss while driving, sacked after viral videoThe short clip of the driver, shared by content creator Nagesh Mane with the text \"One of the reasons for accidents,\" seemingly suggested that the man was watching Bigg Boss while driving the bus.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/school-girl-suicide-amayra-phone-call-parents-neerja-modi-school-jaipur-police-2816383-2025-11-10",
      "headline": "Can't do this mumma: Phone call reveals Jaipur girl's fear before fatal fallDespite repeated complaints by Amayra and her parents about bullying, the teacher allegedly took no action -- even on the day the nine-year-old approached her multiple times before jumping to death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-comment-on-husband-money-vs-looks-viral-video-sparks-debate-2816214-2025-11-09",
      "headline": "Woman's comment on husband in viral 'money vs looks' video sparks debateA video of a woman saying that she doesn't think she and her husband \"look good together\" but values him for being a good provider went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-virat-kohli-not-invited-koffee-with-karan-after-2019-cricket-controversy-2816393-2025-11-10",
      "headline": "KJo on why Virat Kohli hasn't appeared on Koffee With Karan: No cricketers nowFilmmaker Karan Johar recently discussed why cricketer Virat Kohli has never appeared on his popular talk show 'Koffee with Karan'. He reflected on the aftermath of a previous controversy involving Hardik Pandya and KL Rahul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-gig-economy-youth-unemployment-is-artificial-intelligence-ai-coming-for-12-million-gig-economy-workforce-2815846-2025-11-09",
      "headline": "The next wave of layoffs might not be in offices but on the streetsDrones are being used for deliveries in Gurgaon and Bengaluru. Amazon is trying out AI automation at its warehouses. But the 12 million people in India's gig economy are oblivious of that. From millions of additions to the workforce to automation, India's gig economy is set for an upheaval. Will that be the end of the road for the millions who are always on the move but never move up?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-senate-votes-key-measure-end-40-day-government-shutdown-amid-democrat-rift-healthcare-subsidies-2816483-2025-11-10",
      "headline": "US Senate advances bill to end 40-day shutdown, Democrats call it betrayalOn Sunday night, the Senate voted 60-40 on the key procedural measure following an agreement between a group of moderate Democrats, Republican leaders, and the White House to advance the plan, even without a guaranteed extension of health care subsidies -- a decision that has sparked a rift among some Democrats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-shares-listing-below-expectation-market-debut-3-percent-discount-review-hold-or-sell-2816488-2025-11-10",
      "headline": "Lenskart shares list at 3% discount: Should you sell or hold?The stock opened at Rs 395 on the National Stock Exchange (NSE), lower than the issue price of Rs 402. On the BSE, it listed at Rs 390, marking a discount of 2.98%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/five-indians-kidnapped-in-mali-government-coordinating-with-local-authorities-for-their-safe-release-2816459-2025-11-10",
      "headline": "5 Indians kidnapped in Mali, embassy in touch with authorities for safe releaseFive Indian nationals have been kidnapped in Mali, leading to urgent diplomatic efforts by India to ensure their safe return. The Ministry of External Affairs is actively coordinating with Malian authorities and international partners to resolve the situation swiftly.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/toyota-unveils-new-hilux-with-electric-hybrid-ice-and-hydrogen-options-2816496-2025-11-10",
      "headline": "Toyota unveils new Hilux with electric, hybrid, ICE and hydrogen optionsToyota has unveiled the ninth-generation Hilux, introducing electric, hybrid, ICE and future hydrogen options as the iconic pick-up enters a new phase of global, market-specific powertrain diversification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/would-robert-pattinson-ever-return-as-edward-cullen-in-twilight-actor-responds-2816511-2025-11-10",
      "headline": "Would Robert Pattinson ever return as Edward Cullen in Twilight? Actor respondsActor Robert Pattinson has signalled a willingness to reprise his iconic Edward Cullen role from 'The Twilight Saga'. During a recent interview, the actor jokingly said he wants to be 17 again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohan-bhagwat-says-muslims-christians-can-come-to-rss-as-sons-of-bharat-2816246-2025-11-09",
      "headline": "Mohan Bhagwat says Muslims, Christians can come to RSS but on one conditionRSS chief Mohan Bhagwat clarified that followers of all faiths are welcome to participate in the Sangh as long as they come \"as sons of Bharat Mata\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/surge-muslim-couples-registration-under-special-marriage-act-bengal-sir-voter-roll-revision-fear-2815819-2025-11-08",
      "headline": "Muslim couples in Bengal opt for Special Marriage Act amid wariness over SIRThe spike was witnessed in the same period when a similar Special Intensive Revision (SIR) of electoral rolls took place in neighboring Bihar. Bengal's own SIR process began this November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-mourns-longtime-make-up-artist-ashok-sawant-passing-2816544-2025-11-10",
      "headline": "Abhishek Bachchan mourns his longtime make-up artist Ashok Sawant: He was familyActor Abhishek Bachchan has shared a detailed note and pictures mourning the death of his make-up artist Ashok Sawant, reflecting on their nearly three-decade-long professional and personal relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-to-head-back-to-college-after-saiyaara-success-2816555-2025-11-10",
      "headline": "After Saiyaara's success, Aneet Padda to head back to college?After her noted debut in 'Saiyaara', Aneet Padda has been roped in for the horror-comedy film 'Shakti Shalini'. Before the film goes on the floor, she would have to head back to college. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-full-squad-bavuma-kolkata-eden-gardens-india-test-series-2816575-2025-11-10",
      "headline": "Captain Temba Bavuma joins South Africa squad in Kolkata ahead of 1st Test South Africa captain Temba Bavuma was the final player to join the senior squad on Monday morning as the visitors assembled in full strength in Kolkata ahead of the opening Test against India, scheduled to begin at Eden Gardens on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-crisis-bcci-blueprint-can-save-isl-2816547-2025-11-10",
      "headline": "Can BCCI help Indian football recover from its ISL fiasco? With the Indian Super League hanging by a thread and clubs struggling to survive, calls have grown for the BCCI to step in. But can cricket's financial powerhouse really rescue Indian football, or just inspire it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-instagram-deactivated-csk-rr-trade-rumours-2816515-2025-11-10",
      "headline": "Ravindra Jadeja's Instagram account vanishes as CSK exit rumours grow Ravindra Jadeja's Instagram account has vanished as the rumours of his exit from CSK continue to gather steam. Jadeja is being linked with a swap deal with Sanju Samson that will see him return to RR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-trade-jadeja-for-sanju-samson-csk-mohammed-kaif-2816494-2025-11-10",
      "headline": "MS Dhoni will sacrifice Ravindra Jadeja to get Sanju Samson for CSK's good: Kaif Mohammed Kaif has claimed that MS Dhoni will be ready to sacrifice Ravindra Jadeja to get Sanju Samson for CSK's good. Kaif feels that Dhoni will want to make Chennai champions again and he will allow the trade to happen. ,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-lewandowski-hat-trick-secures-4-2-win-celta-vigo-laliga-title-race-2816425-2025-11-10",
      "headline": "Robert Lewandowski hat-trick powers Barcelona to thumping win over Celta Vigo Barcelona secured a vital 4–2 win away at Celta Vigo, with Robert Lewandowski scoring a hat-trick, as the team moved within three points of league leaders Real Madrid ahead of the international break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-thakur-himachal-emotional-welcome-womens-world-cup-win-2816447-2025-11-10",
      "headline": "Renuka Singh overwhelmed by villagers' tribute after India's World Cup triumph Indian pacer Renuka Thakur was overwhelmed after receiving a hero's welcome on Sunday upon her return to her ancestral village, Parsa, in the Rohru subdivision of Shimla district, following India's historic triumph at the 2025 ICC Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-man-city-ready-for-title-after-3-0-win-vs-liverpool-2816443-2025-11-10",
      "headline": "Manchester City boss Pep Guardiola sends Premier League title warning to rivals Pep Guardiola has sent a warning to the title rivals, saying that his side are all set to have a real go for the Premier League crown this season. City thrashed Liverpool 3-0 to move to second spot on the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ironman-70-3-goa-tejasvi-surya-annamalai-complete-triathlon-2816421-2025-11-10",
      "headline": "Ironman: PM Modi cheers Annamalai, Tejasvi Surya for conquering Goa endurance race Tejasvi Surya and Annamalai successfully completed the Ironman 70.3 triathlon in Goa on Sunday. Prime Minister Narendra Modi praised the two young leaders for their commitment to fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-bumrah-arrive-at-kolkata-coach-gautam-gambhir-1st-south-africa-test-2816398-2025-11-10",
      "headline": "No rest for Team India: Gill, Gambhir fly from Australia to Kolkata for SA Tests India's Test captain Shubman Gill arrived in Kolkata from Brisbane on Monday ahead of the upcoming two-match Test series against South Africa, accompanied by senior pacer Jasprit Bumrah, all-rounders Nitish Kumar Reddy and Washington Sundar, along with head coach Gautam Gambhir and members of the support staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jonty-rhodes-concerned-delhi-air-quality-pollution-hard-to-digest-2816391-2025-11-10",
      "headline": "Hard to digest: Jonty Rhodes worried about Delhi's deteriorating air quality South African cricket legend Jonty Rhodes has joined a growing list of voices expressing alarm over Delhi's poor air quality, calling the capital's pollution levels \"hard to digest.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lenny-wilkens-hall-of-fame-legendary-nba-coach-dies-at-88-2816384-2025-11-10",
      "headline": "Lenny Wilkens, Hall of Famer and legendary NBA coach, dies at 88 Lenny Wilkens, the only person enshrined three times in the Naismith Memorial Basketball Hall of Fame and the NBA's all-time wins leader for a generation, has died at the age of 88, leaving behind a transformative legacy in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-man-city-ready-for-title-after-3-0-win-vs-liverpool-2816443-2025-11-10",
      "headline": "Manchester City boss Pep Guardiola sends Premier League title warning to rivals Pep Guardiola has sent a warning to the title rivals, saying that his side are all set to have a real go for the Premier League crown this season. City thrashed Liverpool 3-0 to move to second spot on the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ironman-70-3-goa-tejasvi-surya-annamalai-complete-triathlon-2816421-2025-11-10",
      "headline": "Ironman: PM Modi cheers Annamalai, Tejasvi Surya for conquering Goa endurance race Tejasvi Surya and Annamalai successfully completed the Ironman 70.3 triathlon in Goa on Sunday. Prime Minister Narendra Modi praised the two young leaders for their commitment to fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-bumrah-arrive-at-kolkata-coach-gautam-gambhir-1st-south-africa-test-2816398-2025-11-10",
      "headline": "No rest for Team India: Gill, Gambhir fly from Australia to Kolkata for SA Tests India's Test captain Shubman Gill arrived in Kolkata from Brisbane on Monday ahead of the upcoming two-match Test series against South Africa, accompanied by senior pacer Jasprit Bumrah, all-rounders Nitish Kumar Reddy and Washington Sundar, along with head coach Gautam Gambhir and members of the support staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jonty-rhodes-concerned-delhi-air-quality-pollution-hard-to-digest-2816391-2025-11-10",
      "headline": "Hard to digest: Jonty Rhodes worried about Delhi's deteriorating air quality South African cricket legend Jonty Rhodes has joined a growing list of voices expressing alarm over Delhi's poor air quality, calling the capital's pollution levels \"hard to digest.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lenny-wilkens-hall-of-fame-legendary-nba-coach-dies-at-88-2816384-2025-11-10",
      "headline": "Lenny Wilkens, Hall of Famer and legendary NBA coach, dies at 88 Lenny Wilkens, the only person enshrined three times in the Naismith Memorial Basketball Hall of Fame and the NBA's all-time wins leader for a generation, has died at the age of 88, leaving behind a transformative legacy in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-focus-on-results-premier-league-title-race-slot-man-city-loss-2816371-2025-11-10",
      "headline": "Liverpool must focus on results instead of title race: Arne Slot after City lossLiverpool manager Arne Slot admitted that any talk of a Premier League title challenge was premature given his team's current form, as he candidly reflected on their 3–0 defeat to rivals Manchester City at the Etihad Stadium on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-mark-woods-pace-will-surprise-australian-batters-in-ashes-greg-chappell-2816335-2025-11-09",
      "headline": "Archer, Wood's pace will surprise ageing Australian batters in Ashes: Greg ChappellFormer Australian captain Greg Chappell has cautioned Australia about England's formidable fast bowling lineup as the home side prepares to field its oldest Test team in over 90 years. The Ashes 2025-26 is set to begin on November 21 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-chennai-super-kings-ravindra-jadeja-trade-rajasthan-royals-ipl-2026-reports-2816334-2025-11-09",
      "headline": "CSK hopeful of Sanju Samson trade, RR still weighing options: ReportChennai Super Kings are reportedly set to land Rajasthan Royals captain Sanju Samson in a blockbuster IPL 2026 trade. The deal could see CSK stalwart Ravindra Jadeja and England all-rounder Sam Curran move to Rajasthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/radha-yadav-exclusive-interview-on-womens-world-cup-win-2816330-2025-11-09",
      "headline": "Prayed to God to win World Cup for fans and aspiring girls in India: Radha YadavIndia spinner Radha Yadav has revealed that she was praying to god to help them win the Women's World Cup for their fans and aspiring young girls of India. India beat South Africa by 52 runs to clinch their maiden Women's World Cup in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beth-mooney-jemimah-rodrigues-comeback-wbbl-australia-cross-borders-watch-video-2816314-2025-11-09",
      "headline": "Watch: Beth Mooney's witty comeback to Jemimah Rodrigues' World Cup semi-final jokeBeth Mooney responded with a witty comeback to Jemimah Rodrigues' World Cup semi-final joke during Perth Scorchers' WBBL 2025 opener. The playful exchange had fans laughing. what came as an aftermath of India's World Cup winning campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-on-abhishek-sharma-t20i-rise-no-1-batter-aus-vs-ind-2816310-2025-11-09",
      "headline": "Kevin Pietersen 'not surprised' by fearless Abhishek Sharma's rise in T20IsKevin Pietersen praised Abhishek Sharma as the most complete T20 batter in the world following his second successive Player of the Series award against Australia after India's 2-1 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asadullah-khan-slams-australia-for-politicising-afghanistan-cricket-womens-rights-ban-2816304-2025-11-09",
      "headline": "Australia linking cricket with politics not good for game: Afghanistan selectorFormer Afghanistan cricketer Asadullah Khan has criticised Australia for mixing politics with cricket due to women's rights issues in the country. Australia haven't kept any bilateral cricketing relations ever since Taliban's takeover of the country in September 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/radha-yadav-exclusive-interview-on-womens-world-cup-win-2816330-2025-11-09",
      "headline": "Prayed to God to win World Cup for fans and aspiring girls in India: Radha YadavIndia spinner Radha Yadav has revealed that she was praying to god to help them win the Women's World Cup for their fans and aspiring young girls of India. India beat South Africa by 52 runs to clinch their maiden Women's World Cup in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beth-mooney-jemimah-rodrigues-comeback-wbbl-australia-cross-borders-watch-video-2816314-2025-11-09",
      "headline": "Watch: Beth Mooney's witty comeback to Jemimah Rodrigues' World Cup semi-final jokeBeth Mooney responded with a witty comeback to Jemimah Rodrigues' World Cup semi-final joke during Perth Scorchers' WBBL 2025 opener. The playful exchange had fans laughing. what came as an aftermath of India's World Cup winning campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-on-abhishek-sharma-t20i-rise-no-1-batter-aus-vs-ind-2816310-2025-11-09",
      "headline": "Kevin Pietersen 'not surprised' by fearless Abhishek Sharma's rise in T20IsKevin Pietersen praised Abhishek Sharma as the most complete T20 batter in the world following his second successive Player of the Series award against Australia after India's 2-1 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asadullah-khan-slams-australia-for-politicising-afghanistan-cricket-womens-rights-ban-2816304-2025-11-09",
      "headline": "Australia linking cricket with politics not good for game: Afghanistan selectorFormer Afghanistan cricketer Asadullah Khan has criticised Australia for mixing politics with cricket due to women's rights issues in the country. Australia haven't kept any bilateral cricketing relations ever since Taliban's takeover of the country in September 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-clinches-sixth-hong-kong-sixes-title-dominant-win-kuwait-2816273-2025-11-09",
      "headline": "Pakistan clinch record sixth Hong Kong sixes title with 43-run win over KuwaitPakistan secured their sixth Hong Kong Sixes crown on Sunday, defeating Kuwait by 43 runs in a high-scoring final at Tin Kwong Road Recreation Ground. Captain Abbas Afridi starred with a rapid half-century, while Kuwait impressed in their maiden tournament appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-aiff-supreme-court-no-bidders-commercial-rights-tender-2816272-2025-11-09",
      "headline": "AIFF moves to Supreme Court again after ISL tender receives no biddersIndian football faces fresh turmoil as the AIFF informed the Supreme Court that the ISL commercial rights tender received zero bids. With the league suspended, the sport's immediate future is now hanging by a thread."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hockey-player-julie-yadav-national-athlete-dies-road-accident-lucknow-2816270-2025-11-09",
      "headline": "Hockey player Julie Yadav dies after road accident in LucknowA young national-level athlete's life was cut short in a tragic road accident in Lucknow on Sunday. The death of 23-year-old sports teacher Julie Yadav has left her family and local sporting circles devastated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kranti-gaud-world-cup-heroics-help-father-regain-police-job-madhya-pradesh-2816268-2025-11-09",
      "headline": "Kranti Gaud's World Cup heroics help father reclaim Police job after 2012 setbackKranti Gaud's outstanding performance in the ICC Women's World Cup 2025 has led to her father's reinstatement in the police force. Kranti's father, Munna Singh Gaud, served as a constable in the police force before being dismissed in 2012, which pushed the family into financial turmoil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-womens-world-cup-year-long-struggle-god-rewarded-efforts-2816252-2025-11-09",
      "headline": "Shafali Verma on year-long battle to claim World Cup glory: God rewarded my effortsShafali Verma's late call-up turned into a World Cup-defining masterclass as she powered India's historic title win. Her year of struggle, rebuilding and belief came together on the biggest night of her young career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-jordan-hermann-heroic-knock-indias-test-bowlers-ind-a-vs-sa-a-2816216-2025-11-09",
      "headline": "R Ashwin hails Jordan Hermann for heroic knock against India's Test bowlersRavichandran Ashwin took to social media to acknowledge South Africa A opener Jordan Hermann's composed 94-run knock against India A bowling attack consisting of senior Test stars namely Mohammed Siraj, Prasidh Krishna, Kuldeep Yadav and Akash Deep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-misses-jurgen-klopp-premier-league-rivalry-ends-premier-league-2816240-2025-11-09",
      "headline": "I miss Jurgen Klopp: Pep Guardiola pays tribute to former Liverpool managerPep Guardiola has openly stated he misses Jürgen Klopp, his long-standing rival, ahead of Manchester City's latest Premier League fixture against Liverpool. Guardiola and Klopp shared a rivalry that was deep-rooted in mutual respect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-a-chase-417-beat-india-a-unofficial-test-bengaluru-rishabh-pant-2816239-2025-11-09",
      "headline": "South Africa A stuns India's Test stars, chase down 417 to level seriesSouth Africa A achieved a remarkable victory by chasing 417 in the second unofficial Test in Bengaluru against a star-studded bowling attack of India A to level the series 1-1."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}