{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: How much salary will central government employees get?With the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-homecoming-after-embracing-motherhood-pic-2700663-2025-03-28",
      "headline": "Athiya Shetty shares glimpse of homecoming after embracing motherhoodAthiya Shetty and KL Rahul became parents of their first child, a daughter, on March 24. Athiya has shared a glimpse of their welcome ceremony on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/where-megan-fox-and-machine-gun-kelly-stand-after-welcoming-their-baby-girl-glbs-2700641-2025-03-28",
      "headline": "Where Megan Fox and Machine Gun Kelly stand after welcoming their baby girlMegan Fox and Machine Gun Kelly welcome their baby girl on March 27, 2025, months after ending their engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-new-song-hum-aapke-bina-brings-out-salman-khan-rashmika-mandanna-chemistry-watch-song-by-arijit-singh-2700623-2025-03-28",
      "headline": "Sikandar new song Hum Aapke Bina brings out Salman-Rashmika's chemistry. WatchThe team of 'Sikandar' released a romantic track from the film on Friday. Titled 'Hum Aapke Bina', it is sung by Arijit Singh, and highlights Salman Khan-Rashmika Mandanna's chemistry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-creator-jack-thorne-disagrees-with-race-swapping-criticism-of-show-2700599-2025-03-28",
      "headline": "Adolescence creator Jack Thorne disagrees with 'race-swapping' criticism of show'Adolescence' has triggered an argument about 'race-swapping', with several users claiming that the character of Jamie Miller was based on black teens allegedly committing knife crime in the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avengers-doomsday-brings-back-x-men-favourites-james-marsden-ian-mckellen-glbs-2700578-2025-03-28",
      "headline": "Avengers Doomsday brings back X-Men favourites James Marsden, Ian McKellenAvengers: Doomsday brings back X-Men legends James Marsden, Ian McKellen, and more! Marvel fans can expect a nostalgic reunion as the MCU expands its multiverse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-ai-generated-bibbo-ghibli-jaan-is-the-cutest-thing-on-the-internet-2700541-2025-03-28",
      "headline": "Aditi Rao's AI-generated 'Bibbo Ghibli Jaan' is the cutest thing on the InternetActor Aditi Rao Hydari joined the growing list of celebrities experimenting with ChatGPT's new AI feature, which transforms images into Ghibli-style versions. She used it to give her Heeramandi character, Bibbojaan, a whimsical makeover, much to the delight of her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-plants-a-kiss-prithviraj-sukumaran-mother-l2-empuraan-screening-2700519-2025-03-28",
      "headline": "Mohanlal plants a kiss on Prithviraj's mother at L2 Empuraan screening. WatchMohanlal recently attended the L2 Empuraan screening in Kerala. A viral video showed the veteran actor planting a kiss on Prithviraj Sukumaran's mother at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-reaction-walker-blanco-instagram-post-has-fans-talking-2700513-2025-03-28",
      "headline": "Ananya Panday's reaction to 'Mr World Wide' Walker Blanco's post has fans talkingActor Ananya Panday has once again got the internet talking with her comment on rumoured boyfriend Walker Blanco's post. The two have reportedly been dating after Anant Ambani's Jamnagar bash. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-hyderabad-live-concert-in-march-postponed-2700514-2025-03-28",
      "headline": "Actor Shruti Haasan's Hyderabad live concert postponed. Here's whyActor Shruti Haasan was supposed to perform a live concert in Hyderabad on March 28. However, the event was postponed hours before the scheduled time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-birthday-secret-staying-relevant-bollywood-decoded-2700485-2025-03-28",
      "headline": "Decoding Akshaye Khanna's secret to staying relevant in BollywoodDespite his absence from the public eye, actor Akshaye Khanna has managed to stay relevant through his iconic film choices and powerful performances. On his 50th birthday today, we take a look at his illustrious filmography and how he has redefined versatility and excellence in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-hindu-muslim-was-not-the-issue-in-parents-marriage-2700505-2025-03-28",
      "headline": "Salman Khan says 'Hindu-Muslim wasn't the issue' in parents' marriageSalman Khan revealed that the biggest hurdle in his parents' marriage wasn't religion but Salim Khan's career in Bollywood. Salim and Salma Khan got married in 1964. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-shruthi-narayanan-statement-alleged-casting-couch-video-leakre-2700488-2025-03-28",
      "headline": "Tamil actor Shruthi Narayanan reacts after alleged casting couch video leakTamil actor Shruthi Narayanan addressed the controversy after her alleged casting couch video surfaced online, urging people not to circulate it further. She described the situation as challenging for her family and herself, appealing for sensitivity and respect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-cant-take-his-eyes-off-zindagi-sreeleela-in-new-pic-check-kartik-sreeleela-romantic-viral-photo-2700444-2025-03-28",
      "headline": "Kartik Aaryan can't take his eyes off 'zindagi' Sreeleela in new picKartik Aaryan and Sreeleela shared a new romantic photo on social media. The image featured the two sitting in what seemed like a tea garden. The photo spoke volumes of their chemistry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-auto-ride-after-veera-dheera-sooran-part-2-screening-chennai-sivakarthikeyan-2700441-2025-03-28",
      "headline": "Actor Vikram takes auto to avoid crowd after meeting Sivakarthikeyan at screeningActor Vikram, fondly called Chiyaan by fans, attended the screening of his film, Veera Dheera Sooran's Part 2, in Chennai. After the screening, the actor left for his home in an auto to avoid the crowd at the theatre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cid-acp-pradyuman-shivaji-satam-on-the-show-return-netflix-debut-cult-following-2700436-2025-03-28",
      "headline": "Shivaji Satam on CID's success: We seem like real heroes, we don't fly or jumpShivaji Satam talked about CID's animated version, the show's enduring legacy, and its return to TV. He reflected on its cult status, meme culture, and why it never glorified violence or crime."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/honey-bunny-shruti-narayann-concerned-after-confusion-with-tamil-actor-shruthi-narayanan-2700420-2025-03-28",
      "headline": "Honey Bunny actor reacts after being mistaken for Tamil star Shruthi Narayanan'Citadel: Honey Bunny' actor Shruti Narayann has faced personal and professional challenges due to being mistaken for Tamil actor Shruthi Narayanan. The mix-up has led to harassment and work-related setbacks for Narayann."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-husband-rohanpreet-singh-defends-her-after-melbourne-concert-backlash-2700417-2025-03-28",
      "headline": "Neha Kakkar's husband defends her after Melbourne concert backlashSinger Neha Kakkar defended herself after facing backlash in Melbourne, revealing organisers fled with funds. Husband Rohanpreet Singh supported her, urging people not to judge without knowing both sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-tu-meri-main-tera-main-tera-tu-meri-to-release-on-valentine-2026-2700401-2025-03-28",
      "headline": "Kartik Aaryan's Tu Meri Main Tera, Main Tera Tu Meri eyes Valentine's Day 2026Kartik Aaryan's upcoming film Tu Meri Main Tera, Main Tera Tu Meri is scheduled to hit theatres on Valentine's Day 2026. As per reports, Ananya Panday is set to star alongside Aaryan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-advance-booking-latest-udpate-2-days-to-go-salman-khan-film-beats-kisi-ka-bhai-kisi-ki-jaan-pre-sales-2700386-2025-03-28",
      "headline": "Sikandar advance booking: Salman's film beats Kisi Ka Bhai pre-sales before releaseSalman Khan's 'Sikandar' is heading for a good opening day at the box office. The film has grossed decent numbers in its advance booking so far with two more days to go for release. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-strong-tremors-felt-in-thailand-capital-bangkok-visuals-epicentre-2700419-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Huge earthquake topples buildings in Myanmar, Thailand; several killed Live UpdatesMyanmar Earthquake News: Such was the impact of the earthquake that a high-rise collapsed in Bangkok, around 900 km away, killing two labourers and trapping over 40 others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-pre-arrest-bail-comedian-kunal-kamra-eknath-shinde-joke-row-mumbai-tamil-nadu-2700647-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra gets interim pre-arrest bail amid row over Eknath Shinde parodyKunal Kamra's counsel claimed that the comedian received 500 threatening calls after his 'traitor' jab at Eknath Shinde during a stand-up performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/centre-approves-justice-yashwant-varma-transfer-allahabad-high-court-cash-row-2700592-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cash row: Government approves Justice Varma's transfer to Allahabad High CourtFollowing the recovery of the cash pile from his residence during a fire incident last week, Justice Varma was repatriated from the Delhi High Court to the Allahabad High Court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-clashes-kathmandu-pro-monarchy-activist-arson-vehicles-houses-torched-police-hindu-kingdom-2700582-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vehicles torched as pro-monarchists clash with cops in Nepal, curfew in 3 areasPro-monarchy activists in Nepal clashed with police in Kathmandu on Friday as they demanded the restoration of the monarchy and Hindu Kingdom status. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/lost-grave-of-dara-shikoh-murdered-by-brother-aurangzeb-mystery-humayuns-tomb-chhaava-maratha-film-2700142-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The lost grave of Dara Shikoh, murdered by brother AurangzebMughal emperor Aurangzeb got his brother Dara Shikoh beheaded in Delhi and presented his head to their father, Shah Jahan, whom he had imprisoned in Agra. Experts believe India's history would have been different had a scholarly and secular Dara become the emperor. Amid the controversy over Aurangzeb's grave, a look at the life of Dara, who translated the Upanishads into Persian, and the mystery around his tomb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rcb-live-score-updates-ipl-2025-virat-kohli-ms-dhoni-noor-ahmad-2700645-2025-03-28#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "CSK vs RCB Live: Unbreachable Chepauk awaits Kohli-Patidar challengeChennai Super Kings (CSK) vs Royal Challengers Bengaluru (RCB) Live Updates: Rajat Patidar's RCB are set to take on Ruturaj Gaikwad's CSK in their second match of the season. Can RCB's reamed batting order take on Chennai's spin trap?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-first-big-strikes-beirut-suburbs-november-truce-hezbollah-2700676-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel's first big strikes on Beirut suburbs since truce with HezbollahIsrael on Friday launched a major attack on the Lebanese capital, Beirut, for the first time since a ceasefire ended the latest Israel-Hezbollah war in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/myanmar-earthquake-thailand-why-this-region-is-vulnerable-deadly-seismic-events-explained-2700493-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar earthquake: Why this region is vulnerable to deadly seismic eventsThe seismic event highlights Myanmar's vulnerability to earthquakes, largely due to its location along the Sagaing Fault, a major tectonic boundary between the Indian Plate and the Burma microplate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/videos-building-collapses-in-bangkok-bridge-falls-in-myanmar-after-major-earthquake-2700438-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Videos: Building collapses in Bangkok, bridge falls in Myanmar after major quakesTwo powerful earthquakes, measuring 7.7 and 6.4 in magnitude, hit Myanmar on Friday. The tremors were so strong that they were felt in Thailand's capital, Bangkok. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/myanmar-earthquake-panic-bangkok-strong-earthquake-hits-2700497-2025-03-28#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Infinity pool turns waterfall as tremors jolt Bangkok after Myanmar quakeA video of the earthquake captured the impact, showing water spilling from rooftop pools of a high-rise building in Bangkok due to the intense shaking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/yashu-yashu-pastor-bajinder-singh-found-guilty-in-2018-sexual-harassment-case-2700562-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Yashu Yashu' pastor found guilty in 2018 sexual harassment case, jailedThe self-styled godman was arrested in connection to the same case in July 2018 at the Delhi airport while attempting to board a flight to London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/are-banks-secretly-charging-you-list-of-hidden-fees-every-indian-must-know-2700533-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are banks secretly charging you? List of hidden fees every Indian must knowThink your bank services are free? Think again, hidden fees could be draining your money.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/uttarakhand-health-advisory-char-dham-yatra-yamunotri-gangotri-kedarnath-badrinath-walking-yoga-breathing-exercises-2700620-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand's health advisory for Char Dham yatris: Dos and Don'tsPlanning to go on Char Dham Yatra? Prepare with walking, yoga, and a health check-up, according to the health advisory issued by the Uttarakhand government. Read on to know more about the challenges and how to prepare for the sacred journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-free-speech-case-congress-rajya-sabha-mp-imran-pratapgarhi-poem-gujarat-police-integral-society-part-2700373-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Free speech can't be judged per standards of weak minds: Top court's big remarksThe Supreme Court's remarks came as it quashed an FIR filed against Congress MP Imran Pratapgarhi over a poem uploaded by him on social media. It holds importance in the backdrop of the Kunal Kamra row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-restaurants-service-charge-tips-cannot-levy-them-upholds-ccpa-consumer-body-2022-order-2700547-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Service charge not mandatory, restaurants can't levy it: Delhi High CourtThe Delhi High Court ruled that service charges on food bills are voluntary and dismissed petitions challenging the CCPA's guidelines prohibiting mandatory imposition by hotels and restaurants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rakesh-roshan-confirms-hrithik-roshan-to-direct-krrish-4-yrf-to-produce-2700383-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hrithik Roshan to turn director with Krrish 4, father Rakesh Roshan announces'Krrish 4', which is India's biggest superhero franchise, is now being directed by the 'superhero' himself, Hrithik Roshan. The film will be produced by YRF. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-thalapathy-vijay-on-mk-stalin-pm-modi-delimitation-at-tvk-first-general-body-meeting-2700558-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vijay says 2026 Tamil Nadu Assembly Election to be direct fight between DMK, TVKAt the TVK general body meeting, Vijay declared the 2026 Tamil Nadu elections as a direct fight between the TVK and DMK, attacking both Chief Minister MK Stalin and Prime Minister Narendra Modi. Vijay accused DMK of corruption and the BJP of neglecting Tamil Nadu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/father-says-son-called-after-killing-wife-in-bengaluru-stuffing-body-in-suitcase-threatened-suicide-2700412-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tell everyone I killed her: Bengaluru techie phoned father after murdering wifeIn an exclusive conversation with India Today, Rajendra, father of the man who confessed to have killed his wife in Bengaluru, detailed his conversation with his son after the murder. Rajendra also revealed how the couple, first cousins, had frequent fights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amid-ai-job-threats-microsoft-founder-bill-gates-lists-3-professions-that-are-safe-2700381-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid AI job threats, Bill Gates lists 3 professions that are safeMicrosoft founder Bill Gates has recently stated that while the AI job threat is real, there are a few careers that will not be affected. In an interview, he highlighted that energy professionals, biologists, and coders will be irreplaceable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/new-mpv-suv-models-can-strengthen-nissans-position-in-india-but-2700560-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New MPV, SUV models can strengthen Nissan's position in India, but...Nissan aims to reach 1,00,000 units in both annual domestic sales and exports from India with the new and existing models."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/italian-police-shut-down-meth-lab-run-by-breaking-bad-fan-2700539-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Italian police shut down meth lab run by 'Breaking Bad' fanThe show chronicles the downward spiral of a high-school chemistry teacher who uses his knowledge to make and sell methamphetamine, also known as crystal meth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-virat-kohli-six-hitting-nets-session-watch-2700657-2025-03-28",
      "headline": "Watch: Kohli pulls off six after six in nets session ahead of CSK vs RCBVirat Kohli's explosive form in the nets has set the stage for a blockbuster clash between Royal Challengers Bengaluru and Chennai Super Kings. With Kohli and Dhoni locking horns, fans anticipate fireworks at Chepauk in this high-stakes IPL battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rcb-live-score-updates-ipl-2025-virat-kohli-ms-dhoni-noor-ahmad-2700645-2025-03-28",
      "headline": "CSK vs RCB Live: Unbreachable Chepauk awaits Kohli-Patidar challengeChennai Super Kings (CSK) vs Royal Challengers Bengaluru (RCB) Live Updates: Rajat Patidar's RCB are set to take on Ruturaj Gaikwad's CSK in their second match of the season. Can RCB's reamed batting order take on Chennai's spin trap?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/former-barcelona-star-dani-alves-rape-conviction-appeal-overturned-2700634-2025-03-28",
      "headline": "Former Barcelona star Dani Alves' rape conviction appeal overturnedFormer Barcelona star defender Dani Alves' rape conviction appeal has been overturned by a Spanish court on Friday, March 28. Alves was found guilty of sexually assaulting a woman in 2022 in a nightclub in Barcelona. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-discharged-from-hospital-after-heart-attack-returns-home-2700615-2025-03-28",
      "headline": "Tamim Iqbal discharged from hospital after heart attackBangladesh cricketer Tamim Iqbal has been discharged from the hospital following treatment after suffering a heart attack before participating in a Dhaka Premier League (DPL) match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-cooper-flagg-shines-as-duke-outlasts-arizona-in-sweet-16-thriller-glbs-2700586-2025-03-28",
      "headline": "NCAA Tournament: Cooper Flagg shines as Duke outlasts Arizona in sweet 16 thrillerCooper Flagg's epic buzzer-beater stuns Arizona, ignites March Madness chaos, and cements his rising stardom, fans erupt in shock, disbelief, and pure joy after witnessing the tournament's most electrifying moment yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-odi-series-squads-streaming-babar-azam-2700573-2025-03-28",
      "headline": "New Zealand vs Pakistan ODI series: Squads, all you need to knowAfter losing the T20I series 1-4, Pakistan will face New Zealand in a three-match ODI series. Napier, Hamilton and  Mount Maunganui will host the matches in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-delhi-capitals-power-hitting-2700561-2025-03-28",
      "headline": "Just want to hit every ball: Ashutosh reveals mantra to power-hittingIPL 2025: Ashutosh Sharma spoke about his power-hitting skills after playing a match-winning knock of 66 for the Delhi Capitals in their match against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-shardul-thakur-unsold-robin-uthappa-2700512-2025-03-28",
      "headline": "Shardul Thakur going unsold in IPL 2025 auction still baffling: Robin UthappaRobin Uthappa said that he finds it baffling that Shardul Thakur went unsold during the IPL 2025 auction. Shardul was the star of the show with the ball as LSG defeated SRH on Thursday, March 27 in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-invites-applications-fo-spin-bowling-coach-at-centre-of-excellence-2700440-2025-03-28",
      "headline": "BCCI invites applications for spin bowling coach at Centre Of ExcellenceThe BCCI on Frdiay, March 23 announced that they are inviting applications for the role of spin bowling coach at the Centre Of Excellence in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-heartbreak-wounds-feature-2700385-2025-03-28",
      "headline": "MS Dhoni looks to heal past wounds after 2024 heartbreakIPL 2025: MS Dhoni couldn't help Chennai Super Kings qualify for the playoffs after the five-time champions lost to Royal Challengers Bengaluru at the Chinnaswamy last year. Dhoni will be looking to make amends when the two teams meet on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-virat-kohli-chepauk-chennai-2700416-2025-03-28",
      "headline": "Handshake derby: CSK, RCB meet again after infamous Chinnaswamy encounterChennai Super Kings and Royal Challengers Bangalore (RCB) face off for the first time this season in the Indian Premier League. This marks the first meeting between the two teams since the infamous fixture at Chinnaswamy, where RCB fans heckled CSK supporters after qualifying for the playoffs last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-delhi-capitals-power-hitting-2700561-2025-03-28",
      "headline": "Just want to hit every ball: Ashutosh reveals mantra to power-hittingIPL 2025: Ashutosh Sharma spoke about his power-hitting skills after playing a match-winning knock of 66 for the Delhi Capitals in their match against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-shardul-thakur-unsold-robin-uthappa-2700512-2025-03-28",
      "headline": "Shardul Thakur going unsold in IPL 2025 auction still baffling: Robin UthappaRobin Uthappa said that he finds it baffling that Shardul Thakur went unsold during the IPL 2025 auction. Shardul was the star of the show with the ball as LSG defeated SRH on Thursday, March 27 in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-invites-applications-fo-spin-bowling-coach-at-centre-of-excellence-2700440-2025-03-28",
      "headline": "BCCI invites applications for spin bowling coach at Centre Of ExcellenceThe BCCI on Frdiay, March 23 announced that they are inviting applications for the role of spin bowling coach at the Centre Of Excellence in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-heartbreak-wounds-feature-2700385-2025-03-28",
      "headline": "MS Dhoni looks to heal past wounds after 2024 heartbreakIPL 2025: MS Dhoni couldn't help Chennai Super Kings qualify for the playoffs after the five-time champions lost to Royal Challengers Bengaluru at the Chinnaswamy last year. Dhoni will be looking to make amends when the two teams meet on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-virat-kohli-chepauk-chennai-2700416-2025-03-28",
      "headline": "Handshake derby: CSK, RCB meet again after infamous Chinnaswamy encounterChennai Super Kings and Royal Challengers Bangalore (RCB) face off for the first time this season in the Indian Premier League. This marks the first meeting between the two teams since the infamous fixture at Chinnaswamy, where RCB fans heckled CSK supporters after qualifying for the playoffs last season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}