{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-files-counter-lawsuit-against-cognizant-over-anti-competitive-practices-2663283-2025-01-11",
      "headline": "Explained: Why Infosys has filed counter lawsuit against CognizantInfosys vs Cognizant legal battle: The Bengaluru-based firm accused its US-based rival of contractually restricting clients from awarding IT services to competitors and withholding software training, which Infosys claims hindered its ability to compete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-return-fd-offers-in-2025-sbi-idbi-indian-bank-punjab-and-sind-bank-2662959-2025-01-10",
      "headline": "High-return FD offers in 2025: SBI, IDBI, Indian Bank, and moreEnhance your savings in 2025 with FD schemes offering up to 8.05% interest, valid until March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gives-big-relief-for-online-gaming-sector-details-here-2662919-2025-01-10",
      "headline": "Supreme Court gives big relief for online gaming sector. Details hereThe Supreme Court has stayed Rs 1.12 lakh crore GST notices against online gaming firms, with a final hearing scheduled for March 18, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/industry-leaders-lt-chairman-sn-subrahmanyan-infosys-narayana-murthy-90-hour-workweek-more-pay-labour-laws-2662833-2025-01-10",
      "headline": "Industry leaders call for up to 90-hour workweek. Are they willing to pay more? L&T Chairman SN Subrahmanyan made waves by suggesting employees should work on Sundays. Last year, Infosys co-founder Narayana Murthy proposed that millennials work 70-hour weeks to improve India's productivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-do-not-expect-these-tax-changes-no-rise-in-standard-deduction-no-major-change-in-old-tax-regime-2662877-2025-01-10",
      "headline": "Budget 2025: Don't expect these tax changesBudget 2025 is likely to prioritise fiscal discipline, minor tax tweaks, and cautious consumption boosts over bold reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-of-nearly-86-against-us-dollar-key-reasons-explained-2662866-2025-01-10",
      "headline": "Rupee hits all-time low, nears 86 mark against US dollarRupee hits all-time: Closing at 85.9650, the rupee marked its tenth consecutive weekly loss, slipping 0.2% this week amid a strong dollar and persistent capital outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-lower-amid-earnings-concerns-tcs-gains-6-percent-it-stocks-rise-2662858-2025-01-10",
      "headline": "Sensex, Nifty close lower amid earnings concerns; TCS gains 6% The S&P BSE Sensex lost 241.30 points to end at 77,378.91, while the NSE Nifty50 was down 95 points to end at 23,431.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-irctc-share-price-jumped-up-to-5-today-2662834-2025-01-10",
      "headline": "Explained: Why IRCTC share price jumped up to 5% todayIRCTC share price: The stock rose nearly 5% to hit a day's high of Rs 800.65 on the Bombay Stock Exchange (BSE), compared to the previous close of Rs 763.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-launches-bistro-app-for-10-minute-food-delivery-2662816-2025-01-10",
      "headline": "Blinkit launches Bistro app for 10-minute food deliveryBlinkit's Bistro delivers canteen-style food in 10 minutes, rivalling Swiggy's Snacc and Zepto Cafe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-sees-strong-institutional-growth-mutual-fund-stake-surges-by-33-total-holdings-up-4-2662792-2025-01-10",
      "headline": "Paytm sees strong institutional growth: Mutual fund stake surges by 3.3%, total holdings up 4%Paytm's progress toward achieving EBITDA before ESOP breakeven by Q4 FY2025 further reinforces its strong fundamentals and appeal to institutional investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-looking-back-at-tax-relief-measures-for-senior-citizens-in-2024-2662787-2025-01-10",
      "headline": "Budget 2025: Looking back at tax relief measures for senior citizens in 2024Senior citizens seek tax relief and reforms in Budget 2025 to tackle inflation, income challenges and enhance their qulity of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-filing-delayed-as-portal-glitches-persist-deadline-extension-expected-stmp-2662757-2025-01-10",
      "headline": "GST return filing delayed. Deadline extension expectedGST return filing faces delays due to GSTN portal glitches, with a potential deadline extension expected to ease compliance challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-chairman-sn-subrahmanyan-salary-rs-51-crore-fy24-53457-times-median-salary-of-peers-2662743-2025-01-10",
      "headline": "L&T chairman earned 534.57 times median salary of peers in FY24. Check detailsLarsen & Toubro (L&T) Chairman SN Subrahmanyan's remarks on the 90-hour workweek have been a topic of debate. Amid all this, his salary for FY24 has attracted eyeballs, which is 534.57 times the median salary of peers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-link-and-use-your-credit-card-for-upi-transactions-a-simple-guide-2662736-2025-01-10",
      "headline": "How to link and use your credit card for UPI transactions. A simple guideUPI integration with credit cards simplifies payments offering instant, secure, and contactless transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rebound-what-should-stock-market-investors-do-in-volatile-setup-trading-strategy-experts-2662718-2025-01-10",
      "headline": "Sensex, Nifty in volatile territory: What should stock market investors do? Stock market today: Sensex and Nifty rebounded on IT gains, but volatility persists amid FII outflows and global uncertainty. Here's what's driving the market and how investors should tackle it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-is-joint-taxation-for-married-couples-how-this-works-everything-explained-stmp-2662702-2025-01-10",
      "headline": "Budget 2025: What is joint taxation for married couples?The ICAI's Budget 2025 proposal for joint taxation of married couples aims to ease financial stress, boost compliance, and modernise India's tax system with higher exemptions and flexible slabs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-elxsi-share-price-falls-8-percent-why-did-it-hit-52-week-low-after-q3-results-stmp-2662686-2025-01-10",
      "headline": "Tata Elxsi share price down 8%. Why did it hit 52-week low after Q3 results?Tata Elxsi stock price: At 10:40 a.m., Tata Elxsi's share price was down 7% at Rs 5992.95. In early trade, the stock hit a 52-week low of Rs 5,924."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-infosys-hcltech-share-price-rise-up-to-4-percent-why-it-stocks-are-rising-today-sensex-falls-2662681-2025-01-10",
      "headline": "TCS, Infosys, HCLTech rise up to 4%. Why IT stocks are rising today?All the sectoral indices were in red but the IT sectoral index stood tall amid the bearish sentiment in the market and was the reason behind Sensex and Nifty opening higher today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-tumbles-500-points-again-why-is-the-stock-market-falling-today-stmp-2662677-2025-01-10",
      "headline": "Sensex tumbles 500 points again. Why is the stock market down today?Sensex and Nifty tumbled in early trade amid rising volatility despite strong IT gains. What's pulling the markets down further?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-wilmar-share-price-falls-reason-why-stock-fell-over-9-percent-today-ofs-2662670-2025-01-10",
      "headline": "Explained: Why Adani Wilmar share price fell over 9% today Adani Wilmar share price: The stock has been under pressure recently, falling nearly 10% over the past five trading sessions and losing 12.28% over the last six months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-liquor-policy-cag-report-rs-2000-crore-loss-lapses-aap-kickbacks-2663268-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi's scrapped liquor policy led to Rs 2,026 crore loss, shows CAG reportThe leaked CAG report on the Delhi liquor policy, exclusively accessed by India Today, highlights significant lapses, policy deviations, and violations in issuing licences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-dalit-girl-sexually-abused-64-people-five-years-pathanamthitta-2663245-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dalit girl claims she was sexually abused by 64 people over 5 years in KeralaThe girl told the Child Welfare Committee that the abuse began when she was just 13 years old at the hands of her neighbour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pune-techie-quits-infosys-job-6-reasons-toxic-work-culture-viral-linkedin-post-2663243-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pune techie quits Infosys without backup offer, cites 6 reasons in viral postIn a now-viral post on LinkedIn, a Pune-based techie called out systemic flaws within Infosys, shedding light on challenges several employees might silently endure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/literacy-sanitation-toilet-cash-mudra-yojna-pradhan-mantri-awas-yojana-scheme-boosts-women-vote-participation-2663016-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How toilets at home, cash in hand and literacy added 1.8 crore women votersA report by SBI Research reveals how sanitation schemes, Mudra loans and housing initiatives provided between 2019 and 2014 have helped at least 1.8 crore additional women exercise their franchise. A 1% rise in literacy contributed 45 lakh more female voters, while house ownership added 20 lakh women to the turnout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/india-music-concerts-growth-economy-diljit-dosanjh-codplay-rs-1000-crore-business-2663167-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sold out! How India's live-music scene hit high note of Rs 1,000 croreIndia's live music scene is booming, with concert revenues projected to hit Rs 1,000 crore by 2025. Fuelled by rising disposable incomes and a growing 'experience economy,' the industry is attracting global and Indian artists alike. Challenges persist, but the future looks vibrant and inclusive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-body-found-in-rented-house-in-madhya-pradesh-2662916-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Married man kills live-in partner, keeps body in fridge for nearly a yearAfter killing his live-in partner, Sanjay said that he left her saree-clad body in the refrigerator, locked the room and left the house last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-zuckerberg-orders-removal-tampons-men-bathrooms-meta-office-diversity-lgbtq-trump-administration-2663217-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mark Zuckerberg orders removal of tampons from men's bathrooms at Meta: ReportFacilities managers across Meta's Silicon Valley, Texas, and New York offices were instructed to remove tampons, which had been provided for non-binary and transgender employees who might require them, reports the New York Times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ghaziabad-suicide-husband-wife-jyoti-nagar-loni-fight-couple-police-2663242-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman dies by suicide in Delhi after fight with husband, he kills himself in UPA 30-year-old woman, who had left her house in Ghaziabad after an argument, was found hanging from a pole in Delhi's Jyoti Nagar. Her husband, meanwhile, died by suicide at their home in Ghaziabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/what-the-indian-passport-can-learn-from-singapore-the-worlds-most-powerful-2663026-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What the Indian passport can learn from Singapore's, the world's most powerfulOver the past eight years, Singapore has consistently ranked in the top two and has remained amongst the top ten for over two decades, according to data from the Henley Passport Index. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-news-jhansi-city-court-mall-money-attacks-woman-head-chaos-viral-video-2663255-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Mayhem in UP mall as monkey attacks woman, shoppers record videoA monkey caused a commotion at the City Kart Mall in Jhansi, jumping around before climbing onto a woman's head and refusing to let go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-barack-obama-viral-video-jimmy-carter-funeral-it-did-look-very-friendly-2663197-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'It did look very friendly': Trump opens up about viral moment with Barack ObamaUS President-elect Donald Trump did not disclose what he discussed with former President Barack Obama, but admitted their rapport was unexpected, given their differing political ideologies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/honey-singh-millionaire-india-tour-2025-check-dates-ticket-prices-and-more-2663252-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Honey Singh's Millionaire India Tour 2025: Check dates, how to book tickets and more Honey Singh's highly anticipated India Tour has been officially announced. Tickets for the singer's Millionaire India Tour will be available starting January 11 on the Zomato app.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-announces-additional-tickets-for-mumbai-shows-to-go-live-on-january-11-2663275-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Coldplay announces additional tickets for Mumbai shows, to go live today at 4 pmColdplay announced additional tickets for their upcoming Mumbai concerts. The tickets will go live on January 11 from 4 pm onwards on BookMyShow app. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-stock-market-recover-next-week-sensex-nifty-under-pressure-fii-selling-it-shares-trade-strategy-explained-2663291-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will the stock market recover next week? 4 things you should knowGlobal headwinds and FII outflows weigh on the Sensex and Nifty. Will Dalal Street see a recovery next week after the turbulent run? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-on-viral-melodi-memes-featuring-italys-pm-giorgia-meloni-nikhil-kamath-podcast-video-2663160-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi asked about viral 'Melodi' memes featuring Italy's Meloni. His reactionPrime Minister Narendra Modi addressed the viral \"Melodi memes\" during his podcast debut on 'People by WTF', hosted by Nikhil Kamath. He reflected on his simple eating habits, reliance on the late Arun Jaitley for food choices, and personal anecdotes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-donald-trump-us-president-inauguration-kamala-harris-democratic-party-2663194-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Would have beaten Trump: Biden's bold remark on US presidential pollsJoe Biden asserted that he would have defeated Donald Trump in the November elections but chose to step aside to preserve Democratic Party unity, expressing no regrets about his decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/maha-kumbh-mela-2025-shankar-mahadevan-shaan-mohit-chauhan-perform-amitabh-bachchan-alia-bhatt-ranbir-kapoor-2663235-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh 2025: Shankar Mahadevan, Shaan, Mohit Chauhan, and others to performSeveral artists, including Shankar Mahadevan, Shaan, and Mohit Chauhan, among others, are expected to perform at Maha Kumbh Mela 2025. Other than these, various Bollywood stars are also likely to attend the grand devotional event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-business-sports-442-10-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-umrangso-mine-workers-trapped-dead-rescue-special-equipment-dewatering-himanta-sarma-2663276-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bodies of 2 workers recovered from flooded Assam mine, clock ticks for trappedNine workers were trapped inside the mine in Umrangso, a remote industrial town near the Assam-Meghalaya border, on Monday when it was flooded by a sudden gush of water."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-wildfires-dead-injured-homes-damaged-fire-raging-firefighting-operations-underway-2663073-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "11 killed, 10,000 homes destroyed in Los Angeles amid threat of new wildfires Los Angeles County Sheriff Robert Luna said the wildfires, which killed 11 people, and ravaged neighbourhoods resembled a situation where someone 'dropped an atomic bomb in those areas'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/vegan-vegetarian-omnivore-how-different-diets-affect-your-gut-2663004-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vegan, vegetarian, omnivore: How different diets affect your gutA recent study reveals how different diets—omnivorous, vegetarian, and vegan—affect gut bacteria and overall health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympic-swimmer-gary-hall-jr-loses-10-medals-house-los-angeles-wild-fire-2663208-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gary Hall Jr loses 10 Olympic swimming medals in California wildfireFormer US Olympic swimmer Gary Hall Jr. described the \"apocalyptic\" devastation and personal losses he suffered in the ongoing wildfires ravaging Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-aap-bjp-poster-war-gaalibaaz-cm-dig-aapda-2663237-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New day, new poster: AAP's 'gaalibaaz CM' dig at BJP gets 'AAP-da-e-azam' replyThe BJP and AAP have engaged in a poster war ahead of the Delhi Assembly elections, with each party launching sharp attacks on the other's leaders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/male-sex-toys-attitude-india-2662924-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The male attitude towards sex toys is changing in IndiaHesitation, social taboo, judgment, and the shame associated with using sex toys often prevents men from exploring sex toys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-says-he-is-a-very-romantic-man-please-ask-both-my-wives-kiran-rao-reena-datta-2663269-2025-01-11",
      "headline": "Aamir Khan says he is a very romantic man: Please ask both my wivesBollywood superstar Aamir Khan recently shared insights into his romantic side, revealing what love truly means to him. In a candid conversation, he spoke about his experiences and understanding of love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tiku-talsania-suffers-heart-attack-condition-critical-shikha-talsania-2663280-2025-01-11",
      "headline": "Veteran actor Tiku Talsania suffers heart attack, condition critical Veteran actor Tiku Talsania has been hospitalised after a cardiac arrest. The actor's condition is currently critical. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-announces-additional-tickets-for-mumbai-shows-to-go-live-on-january-11-2663275-2025-01-11",
      "headline": "Coldplay announces additional tickets for Mumbai shows, to go live today at 4 pmColdplay announced additional tickets for their upcoming Mumbai concerts. The tickets will go live on January 11 from 4 pm onwards on BookMyShow app. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-shrutika-arjun-evicted-ahead-of-grand-finale-salman-khan-chaahat-pandey-2663265-2025-01-11",
      "headline": "Bigg Boss 18 Day 95: Shrutika Arjun evicted from the show ahead of finaleIn the latest episode of Bigg Boss 18, Shrutika Arjun was eliminated from the show. Her eviction came a week before this season's grand finale. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devdutt-padikkal-smashes-hundred-in-vijay-hazare-quartefinal-karnataka-vs-baroda-2663288-2025-01-11",
      "headline": "Devdutt Padikkal smashes hundred in Vijay Hazare quartefinal vs BarodaDevdutt Padikkal marked his return with a stunning 102 off 99 balls in the Vijay Hazare Trophy quarterfinal against Baroda. His ninth List A century helped Karnataka post a strong 282-run total, showcasing his brilliance in domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-set-to-resume-wicketkeeping-duties-ahead-of-ashes-2025-opener-2663278-2025-01-11",
      "headline": "Alyssa Healy set to resume wicketkeeping duties ahead of Ashes 2025 openerAlyssa Healy returns as Australia's wicketkeeper for the Ashes opener after recovering from a knee injury. With a tight seven-game schedule ahead, Healy's fitness and England's bowling options, including Kate Cross, set the stage for a thrilling clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-sydney-vs-perth-steve-smith-t20-hundred-2663277-2025-01-11",
      "headline": "Steve Smith lights up SCG with 58-ball hundred on Big Bash returnSydney Cricket Ground witnessed an incredible hitting spectacle on Saturday, January 11. On his Big Bash League return, Sydney Sixers' Steve Smith hit an incredible hundred guiding Sydney to a massive total of 222 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cpl-2025-to-be-played-from-august-14-to-september-21-2663270-2025-01-11",
      "headline": "CPL 2025 to be played from August 14 to September 21The 13th edition of the Caribbean Premier League (CPL) will take place from August 14 to September 21, 2025, as announced by Cricket West Indies (CWI) and the CPL on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brooks-batting-approach-like-sachin-tendulkar-greg-chappell-2663262-2025-01-11",
      "headline": "Harry Brook's batting approach like Sachin Tendulkar: Greg Chappell Greg Chappell has compared Harry Brook's performances to Sachin Tendulkar, calling him a batting sensation. Highlighting Brook's impressive early career stats, Chappell believes the England star has the potential to become a key player for his team's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-india-squad-announcement-live-updates-rohit-bumrah-shami-pant-2663246-2025-01-11",
      "headline": "India Squad Announcement Live: Will selectors announce squad today?Champions Trophy 2025 India Squad Announcement Live Updates: Although the ICC set January 12 as the deadline for teams participating in the Champions Trophy to announce their provisional squads, the BCCI is expected to make its announcement a week later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-arshdeep-singh-champions-trophy-squad-punjab-vs-maharashtra-2663244-2025-01-11",
      "headline": "Arshdeep auditions for Champions Trophy with terrific spell vs MaharashtraPunjab pacer Arshdeep Singh gave a terrific audition for the Champions Trophy on Saturday, January 11. Arshdeep picked up early wickets vs Maharashtra in the Vijay Hazare Trophy quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cricket-committee-looking-to-give-leeway-to-bowlers-on-wides-shaun-pollock-2663236-2025-01-11",
      "headline": "ICC Cricket Committee looking to give leeway to bowlers on wides: Shaun PollockSouth African cricket legend Shaun Pollock has revealed that the ICC Cricket Committee is deliberating on revising the wide-ball rule to offer bowlers more flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-age-birthday-2663226-2025-01-11",
      "headline": "Happy Birthday Rahul Dravid: Indian cricket's Mr. Dependable turns 52Rahul Dravid, one of the most revered figures in Indian cricket, celebrates his 52nd birthday on January 11, Saturday. Wishes poured in for the superstar from the cricketing circles all across the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/us-women-training-camp-moved-from-los-angeles-to-miami-due-to-la-wildfires-2663224-2025-01-11",
      "headline": "US women's training camp moved from Los Angeles to Miami due to LA wildfiresA training camp for the U.S. women's national team has been relocated from Los Angeles to Miami due to the wildfires devastating Southern California, U.S. Soccer announced on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-amanda-ribas-says-repeating-amanda-nunes-feat-will-be-a-challenge-2663222-2025-01-11",
      "headline": "'One of a kind' Amanda Ribas says repeating Amanda Nunes feat will be a challengeIn an exclusive interview with Indiatoday.in, Amanda Ribas talks about the challenges of being a double division champion and how she aims to use her fight bonuses to help youngsters struggling with substance abuse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-arshdeep-singh-champions-trophy-squad-punjab-vs-maharashtra-2663244-2025-01-11",
      "headline": "Arshdeep auditions for Champions Trophy with terrific spell vs MaharashtraPunjab pacer Arshdeep Singh gave a terrific audition for the Champions Trophy on Saturday, January 11. Arshdeep picked up early wickets vs Maharashtra in the Vijay Hazare Trophy quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cricket-committee-looking-to-give-leeway-to-bowlers-on-wides-shaun-pollock-2663236-2025-01-11",
      "headline": "ICC Cricket Committee looking to give leeway to bowlers on wides: Shaun PollockSouth African cricket legend Shaun Pollock has revealed that the ICC Cricket Committee is deliberating on revising the wide-ball rule to offer bowlers more flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-age-birthday-2663226-2025-01-11",
      "headline": "Happy Birthday Rahul Dravid: Indian cricket's Mr. Dependable turns 52Rahul Dravid, one of the most revered figures in Indian cricket, celebrates his 52nd birthday on January 11, Saturday. Wishes poured in for the superstar from the cricketing circles all across the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/us-women-training-camp-moved-from-los-angeles-to-miami-due-to-la-wildfires-2663224-2025-01-11",
      "headline": "US women's training camp moved from Los Angeles to Miami due to LA wildfiresA training camp for the U.S. women's national team has been relocated from Los Angeles to Miami due to the wildfires devastating Southern California, U.S. Soccer announced on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-amanda-ribas-says-repeating-amanda-nunes-feat-will-be-a-challenge-2663222-2025-01-11",
      "headline": "'One of a kind' Amanda Ribas says repeating Amanda Nunes feat will be a challengeIn an exclusive interview with Indiatoday.in, Amanda Ribas talks about the challenges of being a double division champion and how she aims to use her fight bonuses to help youngsters struggling with substance abuse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-instagram-story-speculation-india-cricketer-future-2663218-2025-01-11",
      "headline": "Fans speculate about retirement after Ravindra Jadeja's latest Instagram storyIndian all-rounder Ravindra Jadeja recently shared a picture on his Instagram story that has sparked widespread speculation. The image, featuring his Test jersey, quickly gained traction and is now being widely shared on X (formerly Twitter)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-rohit-sharma-virat-kohli-generational-slump-test-cricket-2663211-2025-01-11",
      "headline": "Hero-worshipping reason behind India's generational slump in Tests: ManjrekarFormer India cricketer Sanjay Manjrekar has reacted to India's ongoing slump in Test cricket. Manjrekar has blamed hero-worshipping culture behind India's issues.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympic-swimmer-gary-hall-jr-loses-10-medals-house-los-angeles-wild-fire-2663208-2025-01-11",
      "headline": "Gary Hall Jr loses 10 Olympic swimming medals in California wildfireFormer US Olympic swimmer Gary Hall Jr. described the \"apocalyptic\" devastation and personal losses he suffered in the ongoing wildfires ravaging Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-doping-case-hearing-fixed-for-april-cas-2663193-2025-01-11",
      "headline": "Jannik Sinner's CAS hearing to start on April 16World number one Jannik Sinner will face the Court of Arbitration for Sport (CAS) in April following the World Anti-Doping Agency's (WADA) appeal seeking a minimum one-year ban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-durban-super-giants-beat-pretoria-capitals-by-2-runs-in-final-ball-thriller-2663192-2025-01-11",
      "headline": "Durban Super Giants beat Pretoria Capitals by 2 runs in final ball thrillerSA20: After a terrific bowling performance in the opener, the second match in SA20 turned out to be a final-ball thriller. Durban Super Giants beat Pretoria Capitals in a match that saw an aggregate of 416 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-manager-mikel-arteta-ruben-amorim-manchester-united-fa-cup-2663188-2025-01-11",
      "headline": "Arsenal's Arteta impressed by Amorim's Man United before FA Cup clashArsenal manager Mikel Arteta expects Manchester United to pose a tougher challenge in Sunday's FA Cup third-round clash, crediting the extra training time Ruben Amorim has had with his squad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-mcsweeny-aims-comeback-in-australian-test-side-with-sri-lanka-series-2663140-2025-01-10",
      "headline": "Nathan McSweeney aims comeback in Australian Test side with Sri Lanka seriesNathan McSweeney, after a challenging start to his Test career, returns to Australia's squad for the Sri Lanka series. Determined to adapt to spin-friendly conditions, the 25-year-old aims to turn his learnings into impactful performances on the subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-durban-super-giants-beat-pretoria-capitals-by-2-runs-in-final-ball-thriller-2663192-2025-01-11",
      "headline": "Durban Super Giants beat Pretoria Capitals by 2 runs in final ball thrillerSA20: After a terrific bowling performance in the opener, the second match in SA20 turned out to be a final-ball thriller. Durban Super Giants beat Pretoria Capitals in a match that saw an aggregate of 416 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-manager-mikel-arteta-ruben-amorim-manchester-united-fa-cup-2663188-2025-01-11",
      "headline": "Arsenal's Arteta impressed by Amorim's Man United before FA Cup clashArsenal manager Mikel Arteta expects Manchester United to pose a tougher challenge in Sunday's FA Cup third-round clash, crediting the extra training time Ruben Amorim has had with his squad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-mcsweeny-aims-comeback-in-australian-test-side-with-sri-lanka-series-2663140-2025-01-10",
      "headline": "Nathan McSweeney aims comeback in Australian Test side with Sri Lanka seriesNathan McSweeney, after a challenging start to his Test career, returns to Australia's squad for the Sri Lanka series. Determined to adapt to spin-friendly conditions, the 25-year-old aims to turn his learnings into impactful performances on the subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-bangladesh-captain-tamim-iqbal-announces-international-retirement-2663135-2025-01-10",
      "headline": "Former Bangladesh captain Tamim Iqbal announces international retirementFormer Bangladesh captain Tamim Iqbal has decided to bring down the curtains on his international career on Friday, January 10. Tamim had initially decided to retire from international cricket in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-spotted-on-bigg-boss-18-sets-with-shreyas-iyer-and-shashank-singh-2663118-2025-01-10",
      "headline": "Yuzvendra Chahal on Bigg Boss 18 sets with Shreyas Iyer and Shashank SinghYuzvendra Chahal, alongside Punjab Kings teammates Shreyas Iyer and Shashank Singh, appeared on Bigg Boss 18 amid personal turmoil. Their camaraderie sparked fan excitement, while Chahal addressed divorce rumours, urging fans to avoid speculation that deeply impacted his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-premier-league-alex-hales-tamim-iqbal-confrontation-reaction-2663116-2025-01-10",
      "headline": "Very, very rude: Alex Hales slams Tamim Iqbal for confrontation during BPLAlex Hales opened up on his fiery confrontation with Tamim Iqbal during the Bangladesh Premier League match between Rangpur Riders and Fortune Barishal. Hales claimed that Tamim was being very rude and personal during the altercation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-how-rishabh-pant-can-score-hundreds-in-every-game-2663099-2025-01-10",
      "headline": "R Ashwin reveals how Rishabh Pant can score hundreds in every gameAshwin hails Rishabh Pant's unmatched defensive skills, calling him a rare talent in Test cricket. With proper guidance, Pant has the potential to consistently score centuries and become a dominant force in modern cricket, says the veteran off-spinner."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}