{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-likely-to-caution-imf-against-fresh-financial-support-to-pakistan-report-2721981-2025-05-09",
      "headline": "India likely to caution IMF against fresh financial support to Pakistan: ReportIndia seems to be sending a message that simply handing out money to Pakistan won't solve the deeper issues, especially when terrorism and poor handling of previous funds remain concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-dynamics-defence-stocks-in-focus-rally-india-pakistan-tension-conflict-2721987-2025-05-09",
      "headline": "HAL, BEL, Bharat Dynamics: Defence stocks rally up to 7% amid Indo-Pak tensionsShares of Hindustan Aeronautics (HAL), Bharat Dynamics (BDL), Bharat Electronics Ltd (BEL), and Paras Defence jumped between 2 and 7% in Friday's trade, outperforming a jittery broader market shaken by geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-india-pakistan-tension-what-should-investors-do-sensex-nifty-red-2721974-2025-05-09",
      "headline": "India-Pakistan tension: What should investors do as Sensex, Nifty trade in red?At 9:43 am, the S&P BSE Sensex had fallen by 507.64 points to 79,827.17, while the NSE Nifty50 dropped 160 points to 24,113.80. Most shares and sectors were trading lower, with only a few managing to stay in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-volatility-rising-india-pakistan-conflict-tension-no-dalal-street-crash-explained-2721969-2025-05-09",
      "headline": "Markets volatile but no crash on D-Street amid Indo-Pak tensions. 3 things to knowThe Sensex dropped over 500 points within minutes, and the Nifty wasn't far behind. But despite the panic-inducing headlines, the market didn't spiral into chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-falls-as-indo-pak-tensions-spook-dalal-street-2721949-2025-05-09",
      "headline": "Market opens volatile amid India-Pakistan tension; Sensex down over 500 pointsSensex falls 500 points, Nifty falls as Indo-Pak tensions spook Dalal Street"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-live-updates-bse-sensex-nifty-share-market-today-pakistan-stock-exchange-india-pak-tension-conflict-war-situation-operation-sindoor-2721947-2025-05-09",
      "headline": "Stock market LIVE: Experts say not to panic amid Indo-Pak tensionShare market LIVE: Investor sentiment has been dampened by rising border tensions between India and Pakistan as Dalal Street has taken a hit. However, experts have cautioned against panic selling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-may-9-sensex-nifty-crash-today-indo-pak-tension-war-like-trading-bse-nse-2721928-2025-05-09",
      "headline": "Stock market opening: Will Sensex, Nifty crash today amid Indo-Pak tension?Gift Nifty futures were trading at 23,987 as of 6:46 am, which suggests that the Nifty50 could open nearly 1.2% below Thursday's close of 24,273.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-9-hal-swiggy-titan-zee-mcx-bharat-forge-lt-india-pakistan-war-2721914-2025-05-09",
      "headline": "Stocks to watch today: HAL, Swiggy, Titan, Zee, MCX, Bharat Forge, L&TDefence sector stocks such as Hindustan Aeronautics Ltd (HAL), Bharat Forge, and Bharat Dynamics Ltd (BDL) are likely to remain in focus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-blasts-fawad-khan-for-his-post-on-operation-sindoor-shameful-2721989-2025-05-09",
      "headline": "Shameful: Rupali Ganguly blasts Fawad Khan for his post on Operation SindoorRupali Ganguly got the support of Indian social media users as she slammed Pakistani actor Fawad Khan for his working association with India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-to-vir-das-celebs-salute-indian-armys-valour-you-are-our-heroes-2721958-2025-05-09",
      "headline": "Kangana Ranaut to Vir Das, celebs salute Indian army's valour: You are our heroesAmid rising tensions between India and Pakistan and a series of missile attacks in the past 24 hours, several celebrities have praised the bravery of the Indian Army and offered prayers for those living near the border.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayam-ravi-kenishaa-francis-rumoured-girlfriend-divorce-with-aarti-ravi-2721952-2025-05-09",
      "headline": "Actor Ravi Mohan makes an appearance with singer Kenishaa amid his divorceActor Ravi Mohan made an appearance with singer Kenishaa Francis, his rumoured girlfriend, at producer Ishari Ganesh's daughter's wedding in Chennai. This came amid his divorce with ex-wife Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-foley-dies-of-brain-cancer-at-71-2721941-2025-05-09",
      "headline": "Fifty Shades, House of Cards director James Foley dies of brain cancer at 71American filmmaker James Foley, best known for the Fifty Shades films, died earlier this week. He was battling brain cancer. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-makers-junior-artiste-dies-by-drowning-not-on-film-set-2721936-2025-05-09",
      "headline": "Kantara makers say junior artiste did not die on film set, offer condolencesThe makers of Rishab Shetty's 'Kantara: Chapter 1' cleared the air surrounding the death of junior artiste MF Kapil. In a statement, they offered condolences to his family and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-salutes-indian-armed-forces-late-night-call-from-his-father-in-jammu-2721910-2025-05-09",
      "headline": "Samay Raina salutes armed forces as he recalls call from his father in JammuStand-up comedian Samay Raina described his late-night call with his father in Jammu as 'calm'. He also expressed his admiration and respect for the Indian Armed Forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/country-star-cody-johnson-announces-baby-no-3-at-2025-acm-awards-glbs-2721905-2025-05-09",
      "headline": "Country star Cody Johnson announces Baby No. 3 at 2025 ACM AwardsCountry singer Cody Johnson announced at the 2025 ACM Awards that he and wife Brandi are expecting their third child — a boy — sharing the news during a gender reveal onstage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/doja-cat-sabrina-carpenter-and-luke-combs-to-perform-at-acl-festival-2025-glbs-2721900-2025-05-09",
      "headline": "Doja Cat, Sabrina Carpenter and Luke Combs to perform at ACL Festival 2025Austin City Limits Festival 2025 returns to Zilker Park with a stellar lineup including Doja Cat and Hozier. Three-day GA passes sold out fast; premium ticket options remain available.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/acm-awards-2025-how-to-stream-the-show-live-on-amazon-prime-video-and-twitch-glbs-2721896-2025-05-09",
      "headline": "ACM Awards 2025: How to stream the show live on Amazon Prime Video and TwitchThe ACM Awards 2025, hosted by Reba McEntire, will feature star-studded performances, including Rascal Flatts with Backstreet Boys and Chris Stapleton. Stream it live for free on Amazon Prime Video and Twitch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-stalker-ordered-to-undergo-mental-evaluation-after-gate-crash-glbs-2721887-2025-05-09",
      "headline": "Jennifer Aniston stalker ordered to undergo mental evaluation after gate crashA man accused of stalking Jennifer Aniston and ramming his car into her Bel Air gate has been ordered to undergo a mental evaluation after years of alleged harassment and felony charges.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/from-austin-to-stockholm-full-schedule-for-2025-ultrasound-world-tour-glbs-2721879-2025-05-09",
      "headline": "From Austin to Stockholm: Full schedule for 2025 Ultrasound world tourPop star Lorde returns with her album Virgin on June 27, 2025, followed by the Ultrasound Tour across North America, the UK, and Europe. Tickets go on sale May 16.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-review-tvf-series-rural-doctor-trust-local-quack-jharkhand-healthcare-challenges-2721716-2025-05-09",
      "headline": "Gram Chikitsalay review: Amol Parashar adds life to this tale of healing and hopeReleased-Fri May 09, 2025Gram Chikitsalay series review: The TVF series set in rural Jharkhand, features a young doctor's earnest struggle to win the trust of villagers who prefer a local quack. With sincere performances and authentic storytelling, the show beautifully captures the challenges and hope. It also highlights the real need for a change in the neglected healthcare sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-and-arijit-singh-to-recreate-song-sandese-aate-hai-for-border-2-2721779-2025-05-08",
      "headline": "Sonu Nigam, Arijit Singh to recreate Sandese Aate Hai song  for Border 2: ReportSonu Nigam and Arijit Singh will recreate the patriotic song 'Sandese Aate Hai' for 'Border 2.' T-Series has acquired the rights of the iconic song for Rs 10 crore, making it the most expensive Bollywood song remake to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-calls-pay-disparity-justified-but-wants-less-gap-exclusive-2721778-2025-05-08",
      "headline": "Ameesha Patel: Pay disparity is justified, but there shouldn't be a wide gapAmeesha Patel candidly addresses key issues in Bollywood, including pay disparity, ageism, and rising film budgets, emphasising the need for balance and fairness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-rays-aranyer-din-ratri-to-be-screened-at-cannes-film-festival-2025-2721731-2025-05-08",
      "headline": "Satyajit Ray's Aranyer Din Ratri to be screened at Cannes Film Festival 2025Satyajit Ray's classic 'Aranyer Din Ratri' will be screened at the Cannes Film Festival 2025 in the classic section. The film's screening will be attended by veteran actor Sharmila Tagore and filmmaker Wes Anderson, among other presenters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/virat-kohli-brother-vikas-kohli-slams-rahul-vaidyas-comments-avneet-kaur-2721720-2025-05-08",
      "headline": "Virat Kohli's brother slams Rahul Vaidya's comments: What a loserCricketer Virat Kohli's brother, Vikas Kohli, has reacted to Rahul Vaidya's comments where he called him a 'joker'. Vikas, in his note, emphasised the nation's current situation and mentioned how Rahul is using the cricketer's name to gain followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-director-k-ramnarayan-on-replacing-sonu-nigam-songs-saying-sorry-will-not-cut-it-2721650-2025-05-08",
      "headline": "Kannada director on replacing Sonu Nigam's songs: He must pay a priceKannada director, who replaced two Sonu Nigam songs in his upcoming film 'Kuladalli Keelyavudo' following the singer's concert controversy, said that his apology is not enough. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/1-film-every-3-years-why-are-young-telugu-directors-delaying-film-productions-2721616-2025-05-08",
      "headline": "1 film every 3 years: Why are young Telugu directors delaying film productions?Once celebrated for rapid, inventive filmmaking, new directors of the Telugu cinema now take two-three years between projects. Rising budgets, cautious OTT deals and a shrinking writing pool have forced even proven talents into lengthy pauses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reveals-training-ranveer-singh-for-his-debut-film-2721577-2025-05-08",
      "headline": "Was Nawazuddin Siddiqui Ranveer Singh's acting coach? Costao actor revealsNawazuddin Siddiqui revealed he trained Ranveer Singh ahead of his debut in Band Baaja Baaraat, during his days as an acting workshop mentor. While he guided many aspiring actors, Siddiqui credited Ranveer's success to his own talent."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-live-update-operation-sindoor-blackout-india-pak-war-missile-drone-attack-pahalgam-terror-attack-air-strike-2721927-2025-05-09",
      "headline": "Live: Sirens sounded in Chandigarh after warning of possible attack by Pak Operation Sindoor, India Pakistan Tension News Live Updates: On Thursday, Pakistan launched a series of missiles and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India's defence forces, preventing large-scale damage and loss of life.\r\nThe provocation came just a day after India carried out precision strikes on terror camps located in Pakistan and Pakistan-occupied Kashmir, in retaliation to the Pahalgam terror attack. As tensions flared, Pakistan attempted to strike back by launching a barrage of missiles and deploying drones across the Line of Control and international borders.\r\nIndia's response was swift and effective. The country's air defence systems intercepted at least eight incoming missiles, while fighter jets shot down a Pakistani F-16 and possibly two JF-17 aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-pakistan-drone-missile-attacks-jammu-kashmir-rajasthan-punjab-s-400-shot-down-indian-army-operation-sindoor-2721911-2025-05-09",
      "headline": "Fitting reply: Army shares 1st visual of destroying Pak military post along LoCThe Indian Army neutralised over 50 swarm drones launched by Pakistan during a large-scale counter-drone operation in the areas of Udhampur, Samba, Jammu, Akhnoor, Nagrota (all in Jammu and Kashmir) and Pathankot (Punjab)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistans-economic-affairs-ministry-x-account-hacked-india-tensions-pahalgam-terror-attack-2721983-2025-05-09",
      "headline": "Pak ministry says X account hacked after post seeking global help for more loansPakistan's Economic Affairs Ministry said its X account had been hacked after a post, appealing to international partners for more loans and helping to de-escalate rising tensions with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-attack-india-missile-drone-strike-operation-sindoor-army-kashmir-2721926-2025-05-09",
      "headline": "India repels Pak's overnight missile barrage, hits hard in pre-dawn responseIndia's coordinated counterstrikes and air defence neutralised Pakistan's second wave of drone and missile attacks in 24 hours, targeting over 15 cities. Blackouts were enforced across multiple states amid heightened alert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-says-us-will-not-intervene-in-india-pak-dispute-none-of-our-business-glbs-2721892-2025-05-09",
      "headline": "JD Vance says US won't intervene in India-Pakistan dispute: None of our businessUS Vice President JD Vance has ruled out American intervention in the India-Pakistan conflict, calling it \"none of our business\" and urging both sides to pursue de-escalation through diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/x-blocks-8000-accounts-in-india-under-government-order-glbs-2721846-2025-05-08",
      "headline": "X blocks over 8,000 accounts in India, says 'following government orders'X has blocked over 8,000 accounts in India following government orders, citing threats of fines and jail. The platform criticizes the move as censorship and urges legal action by users.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-tensions-pakistan-supreme-court-strengthens-power-army-chief-asim-munir-civial-tried-in-military-court-imran-khan-pti-2721543-2025-05-09",
      "headline": "Pakistan Supreme Court strengthens army chief Asim Munir's handsEven as Pakistan reels after India's Operation Sindoor and the counterstrike after its aerial attack, its Supreme Court handed the Army, led by the unpopular General Asim Munir, a potent new weapon. Now, civilians can be tried in military courts in Pakistan. The judiciary has effectively approved a military crackdown on dissent, just when Munir needed it the most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pakistan-escalates-with-drone-missile-strikes-india-retaliates-lahore-attack-war-2721845-2025-05-08",
      "headline": "Pakistan escalates, India retaliatesPakistan escalated the tensed situation to a dangerous level by firing a swarm of drones and missiles into India. Areas in Jammu and Kashmir, Punjab and Rajasthan saw attacks and blackouts. Pakistan has lost fighter jets and an AWACS as India activated its air defence system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-shoots-down-pakistan-air-forces-awac-all-about-the-surveillance-jet-2721855-2025-05-08",
      "headline": "India shoots down Pakistan Air Force's AWAC: All about the surveillance jetA Pakistan AWACS was shot down inside Punjab province and three Pakistani fighter jets, F-16 fighter jet and two JF-17 fighter jets, were downed on Thursday night, sources told India Today.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistans-islamist-army-chief-asim-munir-is-such-a-dangerous-foe-2721637-2025-05-08",
      "headline": "Why Pakistan's Islamist army chief Asim Munir is such a dangerous foeMunir emerged as one of the most powerful army chiefs of Pakistan without having to topple the civilian dispensation but overplayed his hand with the Pahalgam attack\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-falls-as-indo-pak-tensions-spook-dalal-street-2721949-2025-05-09",
      "headline": "Market opens volatile amid India-Pakistan tension; Sensex down over 500 pointsSensex falls 500 points, Nifty falls as Indo-Pak tensions spook Dalal Street"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/airports-closed-alert-security-check-pakistan-attack-india-jammu-rajasthan-punjab-2721854-2025-05-08",
      "headline": "24 airports closed, security heightened as India-Pak tension escalatesIndia has temporarily closed at least 24 airports near its western border and heightened nationwide airport security. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-secretary-devajit-saikia-issues-statement-on-dc-vs-pbks-cancellation-2721834-2025-05-08",
      "headline": "BCCI issues statement on DC vs PBKS cancellation: Everyone's safety is our priorityThe Board of Control for Cricket in India (BCCI) secretary Devajit Saikia has issued a statement following the cancellation of Delhi Capitals vs Punjab Kings Match 58 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-government-employees-leave-cancelled-as-conflict-with-pak-intensifies-2721860-2025-05-08",
      "headline": "Delhi on high alert, government employees' leave cancelled amid tensions with PakDistrict magistrates in the national capital are holding meetings with their subordinates to review health and disaster management preparedness in case of any emergency, officials said.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-border-force-bsf-foils-major-infiltration-bid-in-jk-samba-amid-india-pak-tensions-2721955-2025-05-09",
      "headline": "Security forces kill 7 suspected Jaish terrorists in J&K's Samba: SourcesThe infiltration bid came on a day when India neutralised Pakistan military's attempt to hit military stations in Jammu, Pathankot, Udhampur and some other locations with missiles and drones as tensions soared between the two countries amid fears of a wider military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-ministry-to-brief-media-today-as-india-foils-pak-missile-drone-attacks-2721917-2025-05-09",
      "headline": "Foreign Ministry briefing shortly as Pak's missile, drone attacks foiled: SourcesOn Thursday, Pakistan launched a series of missiles and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India's defence forces, preventing large-scale damage and loss of life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-robert-francis-prevost-first-american-pope-to-lead-the-catholic-church-glbs-2721865-2025-05-09",
      "headline": "Who is Robert Francis Prevost, first American pope to lead the Catholic ChurchRobert Prevost, a missionary who spent his career ministering in Peru and leads the Vatican's powerful office of bishops, was elected the first American pope in the 2,000-year history of the Catholic Church."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-swarm-of-pak-drones-neutralised-by-army-air-defence-unit-jammu-akhnoor-pathankot-operation-sindoor-2721929-2025-05-09",
      "headline": "Video: Swarm of Pak drones populating Indian skies neutralised by armed forcesIn a large-scale counter-drone operation last night, the Indian Army neutralised over 50 swarm drones launched from Pakistan across various locations along the Line of Control (LoC) and International Borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-match-called-off-stadium-evacuation-dharamshala-2721864-2025-05-09",
      "headline": "Evacuation without panic: How fans exited Dharamsala stadium after IPL match called offThe security officials did a splendid job during the evacuation process at the Himachal Pradesh Cricket Association Stadium after the PBKS vs DC game was called off on Thursday, May 7 after the attacks from Pakistan in various parts of India. A fan present at the game spoke to India Today about the evacuation process and how the incidents transpired on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-review-tvf-series-rural-doctor-trust-local-quack-jharkhand-healthcare-challenges-2721716-2025-05-09",
      "headline": "Gram Chikitsalay review: Amol Parashar adds life to this tale of healing and hopeReleased-Fri May 09, 2025Gram Chikitsalay series review: The TVF series set in rural Jharkhand, features a young doctor's earnest struggle to win the trust of villagers who prefer a local quack. With sincere performances and authentic storytelling, the show beautifully captures the challenges and hope. It also highlights the real need for a change in the neglected healthcare sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-downs-pakistan-f-16-jammu-attacks-drone-missiles-pahalgam-op-sindoor-2721810-2025-05-08",
      "headline": "Pakistani F-16 jet, 2 JF-17s downed by Indian air defence: SourcesIn a major escalation, Pakistan launched missile and drone attacks at multiple locations in India which were swiftly intercepted by the air defence system. India shot down Pakistan's F-16 and JF-17 aircrafts, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-bans-visitor-entry-mandates-checks-for-all-flyers-amid-pak-attack-sources-2721841-2025-05-08",
      "headline": "Arrive 3 hours early: Airlines as Centre steps up security amid Pak attackAccording to sources in the Ministry of Civil Aviation, every passenger at all airports will now be subjected to a Secondary Ladder Point Check (SLPC) before boarding."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/we-are-at-war-with-terrorists-indian-envoy-to-us-vinay-kwatra-amid-india-pakistan-tensions-2721953-2025-05-09",
      "headline": "We are at war with terrorists: Indian envoy to US on India-Pak tensionsIndia's envoy to the US, Vinay Kwatra, said the April 22 Pahalgam attack was the original escalation when four Pak-backed terrorists carried out brutal killings of 26 civilians. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-manchester-united-vs-athletic-bilbao-mason-mount-positive-brace-2721975-2025-05-09",
      "headline": "Mason Mount's positive route to United brace vs Bilbao: Knew good would comeMason Mount credited his return to form to a positive mindset and hard work after his match-winning brace helped Manchester United cruise past Athletic Bilbao and into the Europa League final with a 7-1 aggregate win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-statement-ipl-india-pakistan-tensions-2721959-2025-05-09",
      "headline": "Cricket Australia awaits call on IPL 2025 amid India, Pakistan tensionCricket Australia was closely monitoring the escalating tensions in the region on Friday, with several of its players and coaches currently participating in the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-injury-replacements-future-srh-csk-mi-kkr-dc-rcb-lsg-gt-pbks-rr-2721944-2025-05-09",
      "headline": "With a replacement spree, are teams looking to build for next season?IPL 2025: Teams like Chennai Super Kings and Sunrisers Hyderabad have gone for replacement players to modify their squad and be better prepared for the next season of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-never-under-pressuer-mayank-yadav-backs-skipper-lsg-vs-rcb-2721940-2025-05-09",
      "headline": "Rishabh Pant never under pressure: Mayank Yadav on struggling LSG skipperLSG pace sensation Mayank Yadav backed skipper Rishabh Pant amid widespread criticism, insisting the under-fire wicketkeeper-batter never shows signs of pressure despite enduring a tough run with the bat in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-pacer-yash-dayal-press-conference-lsg-clash-2721935-2025-05-09",
      "headline": "RCB pacer Yash Dayal follows his process to reap rewards as death bowlerRoyal Challengers Bengaluru (RCB) medium pacer Yash Dayal has established himself as one of the top death-over bowlers in the Indian Premier League (IPL). Dayal owes his achievement in death-over to sticking to his approach and avoiding thoughts about circumstances beyond his control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-lsg-mayank-yadav-injur-return-no-change-in-strategy-2721932-2025-05-09",
      "headline": "LSG's Mayank Yadav explains injury return : No changes in my strategyLSG pace sensation Mayank Yadav says he's stuck to his strengths in IPL 2025 after returning from a long injury layoff that sidelined him since the 2024 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-moved-to-the-uae-amid-india-pakistan-tensions-2721922-2025-05-09",
      "headline": "Pakistan Super League moved to UAE amid India-Pakistan tensionsThe remainder of the tenth edition of the Pakistan Super League has been moved to the UAE amid rising tensions between Pakistan and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-gujarat-titans-interview-india-call-up-rashid-khan-2721735-2025-05-09",
      "headline": "With a scientist's mind and tricks up his sleeve, Sai Kishore eyes India call-upIPL 2025: Speaking to the press, Gujarat Titans spinner Sai Kishore reflected on his successful season, offering insights into his variations and mindset when it comes to outfoxing batters as a finger spinner in Twenty20 cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-lsg-yash-dayal-virat-kohli-advice-2023-horror-2721909-2025-05-09",
      "headline": "Virat Kohli advice, RCB backing: How Yash Dayal recovered from IPL 2023 horrorYash Dayal revealed how Virat Kohli's advice, RCB's backing and sticking to his own process has helped him bounce back from the IPL 2023 horror. Dayal has enjoyed a sensational turnaround after being hit for 5 sixes by Rinku Singh in IPL 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-to-compete-at-ostrava-golden-spike-2025-2719187-2025-05-09",
      "headline": "Neeraj Chopra to compete at Ostrava Golden Spike 2025Neeraj Chopra is set to finally compete at the prestigious Ostrava Golden Spike 2025 in the Czech Republic on June 24, after missing the last two editions due to injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-results-manchester-united-tottenham-hotspur-final-2721891-2025-05-09",
      "headline": "Manchester United set up Europa League final with Tottenham after thumping BilbaoManchester United thumped Athletic Bilbao 4-1 at Old Trafford to secure their spot in the final of the UEFA Europa League on Thursday, May 8. Tottenham Hotspur will face United in the final as they overcame Bodo/Glimt in the other semi-final clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-moved-to-the-uae-amid-india-pakistan-tensions-2721922-2025-05-09",
      "headline": "Pakistan Super League moved to UAE amid India-Pakistan tensionsThe remainder of the tenth edition of the Pakistan Super League has been moved to the UAE amid rising tensions between Pakistan and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-gujarat-titans-interview-india-call-up-rashid-khan-2721735-2025-05-09",
      "headline": "With a scientist's mind and tricks up his sleeve, Sai Kishore eyes India call-upIPL 2025: Speaking to the press, Gujarat Titans spinner Sai Kishore reflected on his successful season, offering insights into his variations and mindset when it comes to outfoxing batters as a finger spinner in Twenty20 cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-lsg-yash-dayal-virat-kohli-advice-2023-horror-2721909-2025-05-09",
      "headline": "Virat Kohli advice, RCB backing: How Yash Dayal recovered from IPL 2023 horrorYash Dayal revealed how Virat Kohli's advice, RCB's backing and sticking to his own process has helped him bounce back from the IPL 2023 horror. Dayal has enjoyed a sensational turnaround after being hit for 5 sixes by Rinku Singh in IPL 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-to-compete-at-ostrava-golden-spike-2025-2719187-2025-05-09",
      "headline": "Neeraj Chopra to compete at Ostrava Golden Spike 2025Neeraj Chopra is set to finally compete at the prestigious Ostrava Golden Spike 2025 in the Czech Republic on June 24, after missing the last two editions due to injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-results-manchester-united-tottenham-hotspur-final-2721891-2025-05-09",
      "headline": "Manchester United set up Europa League final with Tottenham after thumping BilbaoManchester United thumped Athletic Bilbao 4-1 at Old Trafford to secure their spot in the final of the UEFA Europa League on Thursday, May 8. Tottenham Hotspur will face United in the final as they overcame Bodo/Glimt in the other semi-final clash. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}