{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-hit-record-highs-safe-haven-demand-us-tariff-tensions-greenland-eu-india-rates-2854073-2026-01-19",
      "headline": "Bullion at a new peak: Why gold and silver prices may continue to riseSilver prices climbed to Rs 299,390 per kg, rising by Rs 11,100 or 3.850%. During the day, silver touched close to the Rs 3 lakh per kg mark, highlighting the strong momentum in the metal. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-340-points-lower-nifty-below-25600-ril-down-2-2854068-2026-01-19",
      "headline": "Sensex opens 340 points lower, Nifty below 25,600; RIL down 2%Sensex opens 340 points lower, Nifty below 25,600; RIL down 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-listing-today-gmp-expected-profit-share-price-market-debut-2854055-2026-01-19",
      "headline": "BCCL listing today: Will stock make strong debut on BSE, NSE? Check GMPBy the end of bidding, the Bharat Coking Coal IPO was subscribed 143.85 times overall, reflecting very strong investor interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-different-types-taxation-explained-2853704-2026-01-18",
      "headline": "Jewellery, coins, SGBs, ETFs: Why gold taxes differ so muchJewellery, coins, Sovereign Gold Bonds, gold ETFs, gold mutual funds, and digital gold may all mirror the same metal, yet each one produces a very different tax outcome. Read on to understand how gold taxation really works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ltcg-tax-confusion-property-gold-investors-capital-gains-tax-after-indexation-removal-budget-2026-2853404-2026-01-17",
      "headline": "Capital gains tax was meant to be simpler. Here's why it feels harder nowSelling a long-held asset used to be a fairly predictable exercise. Inflation was factored in through indexation, the tax rate was known, and the final bill rarely came as a shock. That sense of certainty has faded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/what-education-sector-wants-from-budget-2026-skills-quality-and-jobs-2853181-2026-01-16",
      "headline": "What education sector wants from Budget 2026: Skills, quality and jobsWith India's youth population at the centre of its growth story, the education sector sees Budget 2026 as a chance to invest in better teachers, relevant skills and stronger pathways to jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-technologies-q3-profit-plunges-96-on-one-time-labour-code-charge-2853126-2026-01-16",
      "headline": "Tata Technologies' Q3 profit plunges 96% on one-time labour code chargeThe new labour rules, which came into effect in November, require employee wages to make up at least 50% of the total cost to company. Benefits such as provident fund and gratuity must now be calculated based on wages, raising costs for employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-and-silver-etfs-at-record-highs-should-you-sell-now-or-buy-more-2853089-2026-01-16",
      "headline": "Gold and silver ETFs at record highs: Should you sell now or buy more?Gold and silver prices have climbed to record highs, pulling their ETFs up sharply as well. With returns looking attractive, investors are now facing a key question, i.e., is this the right time to book profits or stay invested? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/will-gold-prices-stay-near-record-highs-despite-easing-safe-haven-demand-2853057-2026-01-16",
      "headline": "Will gold prices stay near record highs despite easing safe-haven demand?Gold prices are hovering near record highs even as some safe-haven demand fades, raising questions about whether support from interest rate cut expectations and global uncertainty will be enough to keep prices elevated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-ends-188-points-higher-nifty-above-25700-infosys-gains-6-percent-2853036-2026-01-16",
      "headline": "Sensex, Nifty end higher driven by IT stocks; Infosys gains 6%The S&P BSE Sensex added 187.74 points to settle at 83,570.35, while the NSE Nifty50 was up 28.75 points to close at 25,694.35​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-indias-middle-class-is-really-asking-for-2852977-2026-01-16",
      "headline": "Budget 2026: What India's middle class is really asking forWith Budget 2026 around the corner, India's middle class is hoping for relief that actually touches daily life, from jobs and inflation to housing and healthcare, so what is it really asking the government to deliver?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/how-market-holidays-affect-india-global-investors-mumbai-bmc-election-nithin-kamath-2852997-2026-01-16",
      "headline": "Are frequent market holidays holding India back as a global investment hub?In a post on X, Kamath said that shutting stock exchanges for a local municipal election shows poor planning, especially at a time when Indian markets have strong international linkages and global investor participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-listing-date-changed-new-debut-date-january-19-expected-profit-share-price-2852929-2026-01-16",
      "headline": "BCCL IPO listing date changed: Check new debut date, GMP and expected profitBCCL share price: Expectations around listing gains remain strong, as the grey market premium, or GMP, has moved higher. However, the stock's listing has been delayed, pushing the debut to a later date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-a-key-growth-engine-for-the-global-economy-imf-spokesperson-2852926-2026-01-16",
      "headline": "IMF likely to upgrade India's GDP forecast after Q3 growth exceeds expectationsIndia's third-quarter growth turned out to be better than expected. This has increased the chances of an upward revision in the IMF's outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-address-tax-talent-and-cost-pressures-in-tourism-and-hospitality-2852871-2026-01-16",
      "headline": "Can Budget 2026 address tax, talent and cost pressures in tourism and hospitality?Industry voices highlight the need for skilling reforms, tax incentives, and policy support to drive growth and innovation in India's tourism and hospitality sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amagi-media-labs-ipo-should-investors-apply-2852839-2026-01-16",
      "headline": "Amagi Media Labs IPO: Should investors apply?Amagi Media Labs has stepped into the IPO market, drawing attention from investors keen on the fast-growing connected TV and streaming space. With positive brokerage views and steady grey market signals, the key question is whether the issue is worth subscribing to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-rises-q3-fy26-results-guidance-upgrade-should-you-buy-2852803-2026-01-16",
      "headline": "Infosys shares rally after Q3 FY26 results: Should you buy now?Infosys stock: The stock opened at Rs 1,670.30, touched an intraday high of Rs 1,683.45 and a low of Rs 1,654.55. The 52-week high of the stock stands at Rs 1,967.75, while the 52-week low is Rs 1,307.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-600-points-today-infosys-q3-fy26-it-stocks-rally-corporate-earnings-nifty-up-tech-mahindra-hcl-2852784-2026-01-16",
      "headline": "Sensex jumps 700 points: Why is the stock market rising todayAt around 10:09 am, the S&P BSE Sensex was up 410.60 points at 83,793.31. The NSE Nifty50 also moved higher and was trading up 99.80 points at 25,765.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-jumps-q3-fy26-results-revenue-guidance-hike-explainer-2852767-2026-01-16",
      "headline": "Infosys share price jumps 5%: Why is the IT stock rising todayInfosys reported deal wins worth $4.8 billion in the third quarter, a sharp jump from $3.1 billion in the previous quarter. Around 57% of these deals were classified as net new, indicating fresh business additions rather than renewals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-150-points-nifty-above-25700-infosys-tech-mahindra-up-2852757-2026-01-16",
      "headline": "Sensex, Nifty rally as IT stocks jump in early trade; Infosys gains 5%The S&P BSE Sensex added 358.23 points to 83,740.94, while the NSE Nifty50 was up 87.55 points to 25,753.25 as of 9:54 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-receives-overwhelming-fan-support-japan-brief-visit-2854052-2026-01-19",
      "headline": "Rashmika Mandanna moved by fan letters during brief Japan visit, promises return Actor Rashmika Mandanna reflected on the overwhelming support from Japanese fans after sharing a photo of the letters and gifts she received during a one-day visit to Japan for 'Pushpa 2' release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-sshura-khan-celebrate-milestones-heartfelt-posts-family-moments-2854061-2026-01-19",
      "headline": "Arbaaz Khan celebrates wife Sshura's birthday with rare first-date throwback pic Actor Arbaaz Khan posted a birthday message for his wife Sshura Khan, reflecting on their relationship and family milestones since meeting on the set of Patna Shukla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/eddington-review-joaquin-phoenix-leads-a-tense-tale-of-division-and-delusion-2853962-2026-01-19",
      "headline": "Eddington review: Joaquin Phoenix leads a tense tale of division and delusionRelease Date:Sun Jan 18, 2026 Ari Aster's 'Eddington' is a gripping neo-Western set against 2020's chaos, where personal wounds fuel explosive conflict. Joaquin Phoenix delivers a powerhouse performance in this unflinching satire on division, trauma and the cost of unchecked anger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/divya-ganesan-wins-bigg-boss-tamil-season-9-finale-2854050-2026-01-19",
      "headline": "Meet Divya Ganesan, the wildcard contestant who clinched Bigg Boss Tamil 9 title Television actor Divya Ganesan has emerged as the winner of Bigg Boss Tamil Season 9, rising from wildcard entrant to claim the top spot in the reality show's finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-paresh-rawal-express-bond-india-music-culture-bollywood-controversy-2854032-2026-01-19",
      "headline": "Paresh Rawal backs AR Rahman amid backlash for communal remarks Actor Paresh Rawal showed public support for AR Rahman after backlash over his recent remarks on Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-teaser-release-with-border-2-on-january-23-excites-cinema-fans-2854031-2026-01-19",
      "headline": "Dhurandhar 2 teaser to be added to Border 2 credits? Fans express excitement The teaser for Aditya Dhar's Dhurandhar 2, starring Ranveer Singh, is expected to release alongside the release of Border 2 in theatres on January 23, sparking enthusiastic reactions from audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/inside-prabhas-pan-india-slump-and-why-his-comeback-still-looks-likely-2853822-2026-01-19",
      "headline": "Decoding Prabhas' pan-India slump and why he can still make a solid comeback Prabhas, hailed as India's first true pan-India action star after Baahubali 2, is now in a tricky phase of experimentation and changing audience tastes. Yet with Spirit and Salaar 2 on the way, a strong action-driven comeback could be likely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-joy-awards-2026-riyadh-global-stars-2854028-2026-01-19",
      "headline": "Joy Awards 2026: SRK joins Katy Perry, Millie Bobby Brown; turns presenter The 2026 Joy Awards in Riyadh featured global celebrities, with Shah Rukh Khan walking the lavender carpet and standing out among international entertainment figures including Millie Bobby Brown and Katy Perry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/keith-urban-denies-dating-karley-scott-collins-amid-divorce-rumours-2854026-2026-01-19",
      "headline": "Singer Karley Scott Collins shuts down dating rumours with Keith Urban amid buzz Singer Karley Scott Collins has denied online reports suggesting she is dating Keith Urban following his recent divorce from Nicole Kidman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-bonus-scheme-cast-crew-ben-affleck-matt-damon-the-rip-fair-pay-2854024-2026-01-19",
      "headline": "Ben Affleck, Matt Damon secure Netflix bonus deal for The Rip cast and crew Ben Affleck and Matt Damon secured a first-of-its-kind deal with Netflix, offering performance-based bonuses to all 1,200 cast and crew members of the action thriller 'The Rip'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-season-12-winner-gilli-nata-2854010-2026-01-18",
      "headline": "Bigg Boss Kannada 12 Grand Finale: Gilli Nata lifts the trophy Popular comedian Gilli Nata was crowned the winner of Bigg Boss Kannada Season 12, with Rakshitha Shetty and Ashwini Gowda finishing as the first and second runners-up, respectively.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/finn-wolfhards-stranger-things-co-stars-crash-his-saturday-night-live-monologue-2854008-2026-01-18",
      "headline": "Finn Wolfhard's Stranger Things co-stars crash his Saturday Night Live monologue Finn Wolfhard's Saturday Night Live debut marked a shift from his Stranger Things persona to music and adulthood. He was joined by Gaten Matarazzo and Caleb McLaughlin, who joked about their journey from child stars to young adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-winner-divya-ganesan-rs-32-lakh-prize-2853972-2026-01-18",
      "headline": "Bigg Boss Tamil 9: Divya Ganesan wins trophy, takes home Rs 50 lakh cash prize Divya Ganesan won Bigg Boss Tamil 9, taking home Rs 50 lakh and a car. Her outspoken gameplay and wildcard entry made the finale highly engaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/author-taslima-nasreen-reacts-amid-ar-rahman-row-the-rich-dont-face-difficulties-2853982-2026-01-18",
      "headline": "Taslima Nasreen reacts to AR Rahman's bias claim: Rich don't face difficulties The debate around AR Rahman's comments on facing communal bias in Bollywood has now drawn a response from writer Taslima Nasreen, who contrasted the struggles of the famous with those of ordinary people. Following backlash, Rahman has clarified his music is meant to unite and reiterated his love for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-ms-gori-reacts-to-parul-gulatis-video-defending-karan-aujla-amid-affair-row-2853968-2026-01-18",
      "headline": "Rapper Ms Gori reacts to Parul Gulati's video defending Karan Aujla amid affair row Singer Karan Aujla has been drawn into controversy after Ms Gori claimed to have had a secret relationship with him while he was married, leading to public statements from Parul Gulati and Aujla's wife, Palak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-will-be-biggest-multi-starrer-in-the-history-of-cinema-ram-gopal-varma-2853943-2026-01-18",
      "headline": "Dhurandhar 2 will be biggest multi-starrer in the history of cinema: Ram Gopal Varma Director Aditya Dhar's Dhurandhar 2, inspired by major real-life events, is set for a March 19 release. Ahead of that, filmmaker Ram Gopal Varma praised the film, stating it would be a great milestone for Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshaye-khanna-set-to-return-in-race-4-producer-ramesh-taurani-addresses-rumour-2853939-2026-01-18",
      "headline": "Akshaye Khanna set to return in Race 4? Producer Ramesh Taurani addresses rumour Producer Ramesh Taurani has clarified that Akshaye Khanna will not be returning for the upcoming fourth instalment of the Race franchise, putting an end to ongoing speculation about the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aasif-sheikh-ravi-kishan-escape-near-fatal-accident-on-bhabiji-ghar-par-hain-set-2853922-2026-01-18",
      "headline": "Aasif Sheikh, Ravi Kishan escape near-fatal accident on Bhabiji Ghar Par Hain set Aasif Sheikh and Ravi Kishan recount a close call on set when a large tree fell between them on the first day of shooting, leaving cast and crew shaken but unharmed. The incident occurred during the filming of Bhabiji Ghar Par Hain! – Fun on the Run, set to release in cinemas on February 6, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/japanese-fan-cries-uncontrollably-after-meeting-allu-arjun-in-tokyo-video-2853904-2026-01-18",
      "headline": "Japanese fan breaks down as Allu Arjun recognises her in Tokyo. Video Actor Allu Arjun is in Tokyo with his family to promote the Japan release of Pushpa 2: The Rule, where a touching moment with a Japanese fan drew attention online."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/eu-deploy-trade-bazooka-response-us-tariffs-greenland-supporters-2854029-2026-01-19",
      "headline": "In a first, EU loads 'trade bazooka' to counter Trump's Greenland tariff threatThe European Union is preparing to deploy its Anti-Coercion Instrument for the first time in response to President Donald Trump's planned tariffs on goods from countries supporting Greenland, escalating transatlantic trade tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-warns-attack-khamenei-would-be-all-out-war-blames-us-sanctions-economic-hardship-glbs-2854022-2026-01-19",
      "headline": "Attack on Khamenei would mean all-out war: Iran warns US as toll crosses 5,000Iranian President Pezeshkian, in a post on X, said Iran's response \"to any unjust aggression will be harsh and regrettable\", adding that any strike on Supreme Leader Ayatollah Ali Khamenei would be \"tantamount to an all-out war against the Iranian nation\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-receives-invitation-to-join-trumps-board-of-peace-on-gaza-reports-2853976-2026-01-18",
      "headline": "India receives invitation to join Trump's Board of Peace for GazaAccording to the plan announced by the US President, the board would oversee a technocratic committee responsible for managing Gaza's day-to-day affairs as part of a broader ceasefire framework."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-techie-yuvraj-drowned-father-alleges-bystanders-made-video-administration-failure-2853979-2026-01-18",
      "headline": "He shouted 'help, help', people made videos: Father of techie who drowned in NoidaRajkumar Mehta, father of Yuvraj Mehta who drowned in water-filled pit in Greater Noida, said that had necessary support been extended in time, his son would have survived."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greenland-news-europe-vows-to-defend-itself-from-donald-trump-united-kingdom-sends-one-soldier-finland-two-norway-two-2853632-2026-01-19",
      "headline": "Europe vows to defend Greenland. UK sends 1 soldier, Finland 2, Norway 2US President Donald Trump's constant threats of annexing Greenland have finally moved Europe to send a military team to the island. Though termed a reconnaissance mission, the commitment of just 37 personnel amid Trump threats might reveal Europe's military seriousness.  Is Europe capable of resisting armed aggression without help from the US? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-future-career-killers-new-zealand-strike-again-2854049-2026-01-19",
      "headline": "Rohit-Kohli in Tests, Jadeja in ODIs: Career-killers New Zealand strike againIND vs NZ: New Zealand have once again humbled India in a bilateral series. Last time, they triggered the exit of Virat Kohli and Rohit Sharma from the Test team. Will this series loss fast-track another set of changes in the Indian team?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/two-high-speed-trains-derail-in-spain-five-killed-several-trapped-as-rescue-operation-underway-glbs-2854021-2026-01-19",
      "headline": "21 killed, 100 injured as high-speed train derails, rams another in SpainThe crash occurred in Córdoba province and involved an Iryo high-speed train travelling from Mlaga to Madrid and a Renfe-operated service heading from Madrid to Huelva. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-air-quality-severe-dense-fog-poor-dispersion-conditions-2854034-2026-01-19",
      "headline": "Delhi's AQI improves slightly but still severe, rain expected later this weekA thin layer of fog blanketed Delhi on Monday morning as the Air Quality Index recorded a marginal dip to 418, offering little relief from the 'severe' category. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-teaser-release-with-border-2-on-january-23-excites-cinema-fans-2854031-2026-01-19",
      "headline": "Dhurandhar 2 teaser to be added to Border 2 credits? Fans express excitementThe teaser for Aditya Dhar's Dhurandhar 2, starring Ranveer Singh, is expected to release alongside the release of Border 2 in theatres on January 23, sparking enthusiastic reactions from audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/ireland-education-ireland-visa-sponsorship-indian-students-study-abroad-us-uk-australia-education-courses-career-options-2853641-2026-01-18",
      "headline": "Thinking of studying in Ireland? Indian students share brutal realityHandcrafted ByOur Editors Thousands of Indian students arrived in Ireland chasing a dream, but what they found was nothing like they expected. Every step forward seems to come with a new, unseen hurdle. Why does the Irish dream feel more like a nightmare? Students share the harsh truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-dehradun-greenfield-expressway-travel-time-reduction-connectivity-2854006-2026-01-18",
      "headline": "Delhi to Dehradun in 2.5 hours: Greenfield expressway in final stageThe Delhi–Dehradun Greenfield Expressway is almost complete and will reduce travel time significantly. This new corridor promises safer travel and environmental sustainability while boosting regional trade and tourism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/eddington-review-joaquin-phoenix-leads-a-tense-tale-of-division-and-delusion-2853962-2026-01-19",
      "headline": "Eddington review: Joaquin Phoenix leads a tense tale of division and delusionRelease Date:Sun Jan 18, 2026Ari Aster's 'Eddington' is a gripping neo-Western set against 2020's chaos, where personal wounds fuel explosive conflict. Joaquin Phoenix delivers a powerhouse performance in this unflinching satire on division, trauma and the cost of unchecked anger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-an-se-young-korea-rafael-nadal-analsysis-2854043-2026-01-19",
      "headline": "Like Nadal on clay: Meet An Se Young, the badminton star impossible to beatWith a win rate touching 95 per cent and a trophy cabinet that has barely shut in 14 months, 23-year-old South Korean An Se-young is breaking her rivals' spirits. After her ruthless defence of the India Open title, the question confronting the sport is simple: how do you stop a player who shows no weaknesses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-kuki-zo-woman-dies-alleged-assault-manipur-ethnic-violence-2023-2853995-2026-01-18",
      "headline": "20-year-old Manipur woman gang-raped during unrest dies after years-long fightA Kuki-Zo woman who alleged abduction and gang rape during the Manipur ethnic violence died in Guwahati after nearly three years of battling severe physical injuries and psychological trauma. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/miami-club-plays-heil-hitler-song-for-nick-fuentes-andrew-tate-sparks-outrage-glbs-2854027-2026-01-19",
      "headline": "Video: Andrew Tate, other influencers party as 'Heil Hitler' plays at Miami clubA Miami Beach nightclub faced severe criticism after far-right influencers sang a Nazi-themed song inside the venue. The incident has sparked widespread outrage and prompted an internal review by the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/turkiye-zeynep-sonmez-aids-ball-girl-advances-australian-open-second-round-2853926-2026-01-18",
      "headline": "Australian Open: Turkish player's quick response to fainting ball girl wins heartsTurkish qualifier Zeynep Sonmez paused her opening-round match at the Australian Open to help a fainting ball girl, before securing a three-set win on Sunday, January 18. Sonmez created history with her win, but it was her selfless act that won hearts of the fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-harshit-rana-no-7-india-odi-loss-new-zealand-analysis-2854014-2026-01-19",
      "headline": "Already Gambhir's favourite, is it time for India to trust Harshit Rana at No.7?Harshit Rana shone with the bat once again, scoring his maiden fifty against New Zealand during the 3rd ODI in Indore on Sunday, January 18. Can India finally groom Harshit to be their No.7 batter with the ODI World Cup on the horizon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dy-chandrachud-on-umar-khalid-case-and-why-bail-should-be-the-rule-2853920-2026-01-18",
      "headline": "Umar Khalid has right to speedy trial, bail should be the rule: DY ChandrachudAt the Jaipur Literature Festival, former CJI DY Chandrachud addressed concerns around Umar Khalid's prolonged detention, stressing that the right to a speedy trial is part of Article 21. He argued that unless strict exceptions apply, bail must remain the constitutional norm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jhansi-man-with-2-wives-kills-live-in-partner-burns-body-inside-metal-trunk-2853895-2026-01-18",
      "headline": "Jhansi man with 2 wives kills live-in partner, burns body in metal trunkThe accused killed his live-in partner, placed her body in a metal trunk and burnt it. He is currently absconding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/air-india-cabin-turns-into-concert-hall-after-pianist-plays-zara-zara-for-crew-2854003-2026-01-18",
      "headline": "Air India cabin turns into concert hall after pianist plays Zara Zara for crewA video of pianist Sasmit Rudra performing the song Zara Zara for Air India flight crew has gained widespread attention on social media, with over 7.6 million views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/a-day-in-the-life-of-a-bharat-taxi-rider-what-its-actually-like-to-ride-with-the-cooperative-uber-and-ola-challenger-2853908-2026-01-18",
      "headline": "A day in the life of Bharat Taxi rider, what it's like in a cooperative cabWith 296% growth in two weeks, the government-backed service is booming on paper—but what is it like on the road?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-odi-series-gautam-gambhir-twitter-2854002-2026-01-18",
      "headline": "Gambhir brutally trolled after India lose historic series against New ZealandIndia vs New Zealand: India head coach Gautam Gambhir was heavily criticised on social media after India lost their first ever home ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/author-taslima-nasreen-reacts-amid-ar-rahman-row-the-rich-dont-face-difficulties-2853982-2026-01-18",
      "headline": "Taslima Nasreen reacts to AR Rahman's bias claim: Rich don't face difficultiesThe debate around AR Rahman's comments on facing communal bias in Bollywood has now drawn a response from writer Taslima Nasreen, who contrasted the struggles of the famous with those of ordinary people. Following backlash, Rahman has clarified his music is meant to unite and reiterated his love for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chabahar-post-iran-india-withdrawal-sanctions-us-donald-trump-strategic-route-mumbai-central-asia-afghanistan-2853633-2026-01-18",
      "headline": "Did US force India to pull out of Iran's Chabahar port? How big is the loss?A report about India's strategic withdrawal from Iran's Chabahar port triggered a political slugfest between the Congress and the BJP. Experts suggest the Chabahar story is less about an exit and more about managing strategic ambition under Trump sanctions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-future-career-killers-new-zealand-strike-again-2854049-2026-01-19",
      "headline": "Rohit-Kohli in Tests, Jadeja in ODIs: Career-killers New Zealand strike again IND vs NZ: New Zealand have once again humbled India in a bilateral series. Last time, they triggered the exit of Virat Kohli and Rohit Sharma from the Test team. Will this series loss fast-track another set of changes in the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-an-se-young-korea-rafael-nadal-analsysis-2854043-2026-01-19",
      "headline": "Like Nadal on clay: Meet An Se Young, the badminton star impossible to beat With a win rate touching 95 per cent and a trophy cabinet that has barely shut in 14 months, 23-year-old South Korean An Se-young is breaking her rivals' spirits. After her ruthless defence of the India Open title, the question confronting the sport is simple: how do you stop a player who shows no weaknesses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afcon-final-chaos-senegal-walkout-morocco-extra-time-win-2854035-2026-01-19",
      "headline": "Walkout, 94th-minute winner: Senegal snatch AFCON title from Morocco In one of the most dramatic finals in recent memory, Senegal staged a walkout and then returned to the field to bear Morocco with a 94th-minute winner to "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-poor-form-shubman-gill-defends-india-odi-series-new-zealand-2854033-2026-01-19",
      "headline": "Shubman Gill defends Rohit's low returns vs NZ: You won't always convert starts IND vs NZ: India captain Shubman Gill defended Rohit Sharma's poor form in the New Zealand ODI series, as India lost by 1-2. Rohit scored 61 runs from three innings and failed to convert his starts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-harshit-rana-no-7-india-odi-loss-new-zealand-analysis-2854014-2026-01-19",
      "headline": "Already Gambhir's favourite, is it time for India to trust Harshit Rana at No.7? Harshit Rana shone with the bat once again, scoring his maiden fifty against New Zealand during the 3rd ODI in Indore on Sunday, January 18. Can India finally groom Harshit to be their No.7 batter with the ODI World Cup on the horizon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-day-2-live-updates-coco-gauff-novak-djokovic-iga-swiatek-2854013-2026-01-18",
      "headline": "Day 2 Live Updates: Gauff, Medvedev advance to Round 2, Pegula in action Australian Open Day 2 live updates: Coco Gauff has qualified for Round 2 of the Australian Open, beating Kamilla Rakhimova 6-2, 6-3 at the Rod Laver Arena. Daniil Medvedev has also beaten Jesper de Jong to progress ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinners-adil-rashid-rehan-ahmed-receive-indian-visas-t20-world-cup-2026-2854009-2026-01-18",
      "headline": "Relief for England as Adil Rashid, Rehan Ahmed get India visas for T20 World Cup England received a boost ahead of the ICC Men's T20 World Cup 2026 as spinners Adil Rashid and Rehan Ahmed secured Indian visas, ending uncertainty over their participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-backs-jadeja-kuldeep-after-new-zealand-odi-series-loss-2854004-2026-01-18",
      "headline": "IND vs NZ: Shubman Gill backs Kuldeep, Jadeja despite reality check against New Zealand India captain Shubman Gill jumped to the defence of Ravindra Jadeja and Kuldeep Yadav after their below-par performance during the series loss to New Zealand. Jadeja and Kuldeep failed with the ball and the former's batting form came under the scanner during the three matches against the Blackcaps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-odi-series-gautam-gambhir-twitter-2854002-2026-01-18",
      "headline": "Gambhir brutally trolled after India lose historic series against New Zealand India vs New Zealand: India head coach Gautam Gambhir was heavily criticised on social media after India lost their first ever home ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-reviews-t20-world-cup-2026-participation-bangladesh-security-concerns-2854001-2026-01-18",
      "headline": "T20 World Cup fresh twist: Pakistan to review participation amid Bangladesh issue Pakistan are set to review their participation in the Men's T20 World Cup 2026 as Bangladesh's security concerns escalate, with BCB seeking ICC intervention to move its matches out of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vidarbha-win-maiden-vijay-hazare-trophy-2026-atharva-taide-century-2853981-2026-01-18",
      "headline": "Vidarbha exorcise 2025 final demons to clinch maiden Vijay Hazare Trophy title Vidarbha rose from last year's final heartbreak by defeating Saurashtra by 38 runs to win their maiden Vijay Hazare Trophy. Atharva Taide's century and a disciplined bowling effort sealed a historic title triumph in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-odi-match-report-indore-historic-series-loss-2853975-2026-01-18",
      "headline": "Virat Kohli 124 in vain as India hit new low, lose ODI series to second-string NZVirat Kohli's 54th ODI hundred went in vain as New Zealand scripted a historic series win in Indore on Sunday, January 18. Daryl Mitchell and Glenn Phillips' hundreds and a disciplined bowling effort helped the visitors to secure the win and give India a new low. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-most-odi-centuries-against-new-zealand-record-indore-2853970-2026-01-18",
      "headline": "Unstoppable Virat Kohli storms past Ricky Ponting with gutsy Indore centuryIND vs NZ, 3rd ODI: Virat Kohli scored his 54th ODI century in India's third ODI against New Zealand on Sunday in Indore. With the knock, he also surpassed Ricky Ponting and Virender Sehwag in the list of batters with the most ODI hundreds against the Kiwis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-technique-analysis-ashwin-critiques-batting-flaw-nz-series-indore-2853945-2026-01-18",
      "headline": "What went wrong? R Ashwin analyses Shubman Gill's technical flaw after Indore failureIND vs NZ: Shubman Gill's early exit in the Indore decider put the spotlight on his technique, with Ravichandran Ashwin explaining how a brief loss of alignment between bat and pad proved costly against Kyle Jamieson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/turkiye-zeynep-sonmez-aids-ball-girl-advances-australian-open-second-round-2853926-2026-01-18",
      "headline": "Australian Open: Turkish player's quick response to fainting ball girl wins heartsTurkish qualifier Zeynep Sonmez paused her opening-round match at the Australian Open to help a fainting ball girl, before securing a three-set win on Sunday, January 18. Sonmez created history with her win, but it was her selfless act that won hearts of the fans. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-2-djokovic-swiatek-gauff-medvedev-schedule-2853924-2026-01-18",
      "headline": "Day 2 Schedule: Novak Djokovic, Coco Gauff, Iga Swiatek begin campaignDay 2 of the 2026 Australian Open features top stars like Novak Djokovic, Iga Swiatek, and Coco Gauff beginning their campaigns, with rising challengers ready to make an impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-struggles-new-zealand-odi-series-2853930-2026-01-18",
      "headline": "Has Rohit Sharma played his last for India? Fans upset after Indore ODI failureIndia vs New Zealand: Star Indian opener Rohit Sharma struggled throughout the ODI series against New Zealand, failing to score a half-century. Rohit was dismissed for 11 in the series decider in Indore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-slapped-curfew-t20-world-cup-2026-sri-lanka-tour-ashes-alcohol-incident-noosa-trip-2853929-2026-01-18",
      "headline": "England face curfews for T20 World Cup, Sri Lanka tour after Ashes incident: ReportEngland have imposed a midnight curfew on players after the Ashes and New Zealand tour controversies, tightening discipline ahead of the Sri Lanka series and T20 World Cup following several alcohol-related incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-emma-raducanu-win-first-round-2026-australian-open-2853919-2026-01-18",
      "headline": "Carlos Alcaraz crushes Adam Walton, Emma Raducanu makes dominating startCarlos Alcaraz and Emma Raducanu both made strong starts at the 2026 Australian Open, advancing to the second round with dominant performances at Melbourne Park"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/25-second-rule-badminton-indonesia-masters-tactical-delays-standardise-play-2853900-2026-01-18",
      "headline": "25-second timer to continue at Indonesia Masters amid mixed player viewsAs the Badminton World Federation continues trials of its 25-second shot clock, players and coaches are divided over its impact on match flow and fairness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/daryl-mitchell-glenn-phillips-record-partnership-indore-india-vs-new-zealand-3rd-odi-2853892-2026-01-18",
      "headline": "Mitchell–Phillips mayhem: Record partnership leaves India stunned in 3rd ODIDaryl Mitchell and Glenn Phillips tormented India with a record stand to stun the hosts at the Holkar stadium during the 3rd ODI on Sunday, January 18. Mitchell and Phillips scored hundreds to save the Blackcaps innings and lay the foundation for a strong total. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-3rd-odi-glenn-phillips-no-5-punishes-explosive-india-century-indore-2853878-2026-01-18",
      "headline": "Back at No.5, Glenn Phillips punishes India with 83-ball hundred in IndoreIND vs NZ, 3rd ODI: Glenn Phillips thrived at No.5 with a superb 83-ball hundred in Indore, combining patience and power to punish India as his 219-run stand with Daryl Mitchell swung the ODI decisively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-loses-australian-open-match-olga-danilovic-stunning-comeback-2853866-2026-01-18",
      "headline": "Venus Williams left heartbroken as Olga Danilovic scripts unreal comeback in Round 1Venus Williams was close to making history as the oldest player to win at the Australian Open. But Olga Danilovic's remarkable comeback denied her the record on Sunday at the John Cain Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/an-se-young-wins-india-open-2026-beats-wang-zhi-yi-2853854-2026-01-18",
      "headline": "An Se Young, the queen of badminton, retains her Delhi throneRetaining her title in a mere 43 minutes, An Se-young turned the India Open final into a showcase of invincibility. By handing Wang Zhi-yi a 10th straight defeat, the South Korean star secured her sixth title on the trot, proving once again that the gap between the World No. 1 and the rest is a chasm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/daryl-mitchell-back-to-back-centuries-against-india-new-zealand-3rd-odi-2853834-2026-01-18",
      "headline": "Daryl Mitchell boosts No.1 ODI hopes with back-to-back centuries vs IndiaIndia vs New Zealand: Star New Zealand batter Daryl Mitchell once again came to New Zealand's rescue, slamming his second successive and fourth overall ODI hundred against the Shubman Gill-led India in Raipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-fangirl-selfie-federer-laver-australian-open-2026-2853840-2026-01-18",
      "headline": "Fangirl Sabalenka clicks selfie with Federer, Laver after gritty Aus Open openerAryna Sabalenka had a fangirl moment with Roger Federer and Rod Laver as she clicked a selfie with the tennis legends after her gritty first round win on Sunday, January 18. Sabalenka defeated Tiantsoa Rakotomanga Rajaonah to make it to the second round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-harshit-rana-handling-failure-rohit-sharma-virat-kohli-2853810-2026-01-18",
      "headline": "I would cry every day in front of my dad: Harshit Rana on overcoming failureHarshit Rana shared how he used to handle failure and the role his father played in helping him overcome adversity during his early days. Harshit has found himself to be a favourite of India coach Gautam Gambhir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-reaction-babar-azam-fallout-rumours-bbl-2853795-2026-01-18",
      "headline": "Steve Smith breaks silence on Babar Azam fallout rumours in BBL | WatchAustralia batter Steve Smith on Sunday played down reports of a rift with Pakistan's Babar Azam following their on-field exchange in the Sixers' BBL game against Sydney Thunder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-leads-tata-steel-chess-masters-with-win-gukesh-draws-opening-round-2853786-2026-01-18",
      "headline": "Tata Steel Chess: Erigaisi beats Praggnanandhaa, Gukesh draws in opening roundArjun Erigaisi secured a swift victory over Praggnanandhaa while D Gukesh settled for a lengthy draw against Javokhir Sindarov as the Tata Steel Masters opened with upsets and strong performances. Keymer and Niemann also emerged victorious, sharing the early lead as the first round featured decisive play and high-profile draws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-visa-clearance-pakistan-origin-players-t20-world-cup-india-2853784-2026-01-18",
      "headline": "T20 World Cup: England's Pakistan-origin players receive visas, others to get soonThe International Cricket Council (ICC) is facilitating visa formalities for 42 players and officials of Pakistani origin ahead of the T20 World Cup in India. The move is aimed at ensuring their smooth participation in the tournament, despite the additional scrutiny typically faced by visa applicants of Pakistani origin travelling to India."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}