{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Know who can file, new changes and other detailsThis year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/travel-insurance-scam-entrepreneur-startup-founder-experience-flight-delay-linkedin-post-2757539-2025-07-18",
      "headline": "Startup founder calls flight travel insurance a scam, shares experienceWhat should have been a straightforward process turned into a weeks-long battle across multiple platforms and customer service calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-below-25100-wipro-jumps-3-2757536-2025-07-18",
      "headline": "Sensex opens 100 points lower, Nifty below 25,100; Wipro jumps 3%The S&P BSE Sensex lost 199 points to 82,060.24, while the NSE Nifty50 was down by 40.50 points to 25,070.95, as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-july-18-opening-sensex-nifty-today-wall-street-record-high-us-stock-market-bse-nse-trading-setup-2757520-2025-07-18",
      "headline": "Will Sensex, Nifty rally today after Wall Street closed at a record high?The US market closed at a record high as fresh data from the United States eased concerns about an economic slowdown in the world's largest economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starbucks-ceo-brian-niccol-new-home-seattle-fly-1600-km-no-more-return-to-office-policy-2757513-2025-07-18",
      "headline": "Starbucks CEO ditches 1,600 km commute, buys house near workWhen Niccol was appointed as Starbucks CEO in August last year, the company agreed to a special travel plan. He was allowed to commute between California and Seattle using a corporate jet, as long as he worked from the Seattle office at least three days a week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-layoffs-hundreds-of-roles-to-streamline-operations-report-2757225-2025-07-17",
      "headline": "Walmart cuts hundreds of roles to streamline operations: ReportEarlier this year, Walmart announced about 1,500 job cuts, which hit teams in its global tech division, online order fulfilment in US stores and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-375-points-lower-nifty-below-25200-infosys-tech-mahindra-down-2-percent-2757205-2025-07-17",
      "headline": "Sensex ends 375 points lower, Nifty below 25,200; Infosys down 2%The S&P BSE Sensex was down by 375.24 points to close at 82,259.24, while the NSE Nifty50 lost 100.60 points to end at 25,111.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-rank-number-4-asia-pacific-region-bofa-survey-dalal-street-insights-2757200-2025-07-17",
      "headline": "Dalal Street not Asia's darling anymore, says BofA surveyThe latest survey by Bank of America (BofA), shows that investor interest in Indian stock market has dropped in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-safe-are-indias-instant-loan-apps-2757170-2025-07-17",
      "headline": "How safe are India's instant loan appsFrom students low on fees to families with sudden hospital bills, many use instant loan apps for fast cash, some promise money in 10–30 minutes using just a phone and a few documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-looks-to-extend-tenure-of-derivatives-contracts-says-official-2757179-2025-07-17",
      "headline": "Sebi looks to extend tenure of derivatives contracts, says officialSebi is signalling a shift toward deeper, more stable markets by discouraging speculative short-term trades and pushing for longer-tenure contracts, amid growing retail losses and extreme derivatives dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-thane-outshining-mumbai-real-estate-with-cheaper-housing-2757131-2025-07-17",
      "headline": "Is Thane outshining Mumbai real estate with cheaper housing?Most new homes coming up in Thane are either 1BHK or 2BHK units. About 45% of new supply from 2020 to 2025 was 2BHKs, while 42% was 1BHKs. Larger homes like 3BHKs and 4BHKs together make up only around 13% of the new supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-rates-2025-how-much-are-sbi-icici-and-others-charging-2757089-2025-07-17",
      "headline": "Personal loan rates 2025: How much are SBI, ICICI and others charging?Many banks in India have updated their personal loan interest rates for 2025. Most banks are offering rates starting from about 9.50% per year and going up to 10.50% for some customers, depending on their credit score and repayment ability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-benching-policy-fear-among-employees-after-first-cycle-outrage-reddit-it-sector-news-report-2757088-2025-07-17",
      "headline": "TCS benching policy sparks fear among employees after first cycle: ReportThe policy, introduced on June 12, limits the time employees can remain without project work to just 35 days. After this, they face the risk of losing out on promotions or even losing their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-upi-rules-from-july-15-npci-what-happens-if-payments-fail-now-2757044-2025-07-17",
      "headline": "New UPI rules: What happens if payments fail now?Earlier, if someone raised a chargeback, say, when money was deducted, but they did not get what they paid for, and it got declined, the bank had to go through an extra step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/parliament-panel-proposes-revival-of-key-tax-relief-for-companies-report-2757016-2025-07-17",
      "headline": "Parliament panel proposes revival of key tax relief for companies: ReportThe government is set to restore Section 80M in the new Income Tax Bill, easing dividend tax burdens for companies. The bill is likely to pass in the Monsoon Session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ecommerce-negative-review-not-published-consumer-rights-online-shopping-2757011-2025-07-17",
      "headline": "Are e-commerce firms hiding your rating? New survey reveals the truthThe survey asked consumers about their experience when posting negative reviews on e-commerce and quick commerce apps. Out of 16,519 responses, only 11% said their negative reviews were \"published as is.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25200-sbi-shares-up-1-percent-2756990-2025-07-17",
      "headline": "Sensex opens flat, Nifty above 25,200; SBI shares up 1%The S&P BSE Sensex was down 41.02 points to 82,593.46, while the NSE Nifty50 lost 13.30 points to 25,198.75 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-listing-share-price-strong-market-debut-today-july-17-2756976-2025-07-17",
      "headline": "Smartworks Coworking Spaces to list today. Will it make strong market debut?The company had set a price band of Rs 407 per share for the IPO. The total issue size was Rs 582.56 crore, which included a fresh issue of 1.09 crore shares worth Rs 445 crore and an offer for sale (OFS) of 34 lakh shares valued at Rs 137.56 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-allotment-status-today-online-guide-listing-details-share-price-bse-kfin-2756970-2025-07-17",
      "headline": "Anthem Biosciences IPO: Allotment status live. GMP, listing details hereInvestors who applied for the Anthem Biosciences IPO can check their allotment status online through two platforms: the BSE website and the website of the IPO registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-43-points-higher-nifty-above-25200-sbi-gains-2-percent-2756659-2025-07-16",
      "headline": "Sensex closes 64 points higher, Nifty above 25,200; SBI gains 2%The S&P BSE Sensex added 63.57 points to end at 82.634.48, while the NSE Nifty50 gained just 16.25 points to close at 25,212.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Gurugram's luxury flats, flooded streets: Is real estate bubble about to burst?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-upcoming-meeting-august-expectation-simplification-slab-structure-rate-rationalisation-2756556-2025-07-16",
      "headline": "Fewer slabs, simpler rules? Next GST Council meet may trigger overhaulThe upcoming GST Council meeting, likely to be held in August 2025 after the monsoon session of Parliament, could bring key reforms in the way GST is structured and collected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-residential-housing-home-sales-drop-affordability-concerns-proptiger-report-2756552-2025-07-16",
      "headline": "Housing sales slide 14% as affordability pressures mount across cities: ReportThe PropTiger report, which tracks sales and launches across major cities, found that the most significant annual drop was recorded in Mumbai Metropolitan Region (MMR) and Pune, where sales fell by 32% and 27% respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/saiyaara-movie-review-ahaan-panday-starry-debut-for-hearts-that-loved-lost-and-healed-2757783-2025-07-18",
      "headline": "Saiyaara review: Ahaan Panday's starry debut for hearts that loved, lost and healedRelease Date:Fri Jul 18, 2025Saiyaara movie review: With Ahaan Panday making a starry, emotionally grounded debut, 'Saiyaara' becomes a soft place for bruised hearts to land, especially for today's generation. It's a reminder that perhaps both heartbreak and healing can be beautiful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kothapallilo-okapudu-movie-review-ambitious-attempt-stumbles-despite-thoughtful-themes-2757773-2025-07-18",
      "headline": "Kothapallilo Okappudu review: Ambitious attempt stumbles despite thoughtful themesRelease Date:Fri Jul 18, 2025Kothapallilo Okappudu movie review: Director Praveena Paruchuri's 'Kothapallilo Okappudu' is a thought-provoking film on faith and belief. While there's a lot to ponder, the film goes through a bumpy ride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-prediction-records-highest-ticket-sales-since-chhaava-ahaan-pandey-aneet-padda-2757652-2025-07-18",
      "headline": "Saiyaara box office prediction: Film records highest ticket sales since ChhaavaDirector Mohit Suri's 'Saiyaara' released in theatres on July 18, 2025. Recent advance booking reports suggest the Ahaan Panday-Aneet Padda starrer is set to have a Rs 25 crore opening at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-comeback-on-tv-actor-in-talks-for-new-show-with-vivian-dsena-2757759-2025-07-18",
      "headline": "Dipika Kakar set for TV comeback? In talks for new show with Vivian DsenaActor Dipika Kakar may return to television in a new show opposite Vivian Dsena, though nothing is confirmed yet. She recently spoke about wanting to work again after recovering from stage 2 liver cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-x-reviews-ahaan-pandey-debut-gets-thumbs-up-aashiqui-2-vibes-aneet-padda-bollywood-2757718-2025-07-18",
      "headline": "Saiyaara X reviews: Ahaan Pandey's debut gets a thumbs up for Aashiqui 2 vibesActor Ahaan Panday's debut 'Saiyaara' received accolades from fans. The movie's X reviews praised it for its music, cinematography, story and emotional depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-tacker-special-ops-season-2-tanvi-the-great-dual-release-2757707-2025-07-18",
      "headline": "Karan Tacker on Special Ops 2, Tanvi releasing togetherKaran Tacker celebrates a milestone with two simultaneous releases today. His roles in 'Special Ops 2' and 'Tanvi The Great' show his versatility, while he shares his feelings about this unique career moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ravi-dubey-picture-ramayana-director-nitesh-tiwari-ranbir-kapoor-legends-2757730-2025-07-18",
      "headline": "Ram-Lakshman in one frame: Ravi Dubey, Ranbir Kapoor join Nitesh Tiwari for a momentRavi Dubey is living his best life as he gears up to play Lakshman in Nitesh Tiwari's 'Ramayana'. On Friday, he shared a photo with the director and his on-screen brother, Ranbir Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jennifer-lopez-is-done-with-marriage-after-split-with-ben-affleck-2757696-2025-07-18",
      "headline": "Jennifer Lopez is done with marriage after split with Ben AffleckJennifer Lopez hinted she may be done with marriage after multiple attempts, including her recent divorce from Ben Affleck. Her response to a fan's proposal has sparked widespread discussion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-opens-up-on-how-his-fathers-cancer-battle-united-the-family-2757691-2025-07-18",
      "headline": "Nick Jonas opens up on how his father's cancer battle united the familySinger and actor Nick Jonas shared how his father's cancer battle in 2017 brought the Jonas family closer and made them stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-know-what-you-did-last-summer-review-2025-reboot-gen-z-horror-2757657-2025-07-18",
      "headline": "I Know What You Did Last Summer review: Gen Z-fication of slasher film is oddly funnyRelease Date:Fri Jul 18, 2025I Know What You Did Last Summer movie review: The 2025 reboot of 'I Know What You Did Last Summer' brings a Gen Z twist to the classic slasher. It mixes nostalgia with campy humour but falls short of being a genre-defining hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-fool-volume-review-netflix-experimental-comedy-2757596-2025-07-18",
      "headline": "Vir Das Fool Volume review: Most experimental special yetRelease Date:Fri Jul 18, 2025Vir Das Fool Volume review: Vir Das returns with 'Fool Volume', his most experimental special yet, streaming on Netflix. The show blends diverse venues and tones, highlighting his mature comedic style and global outlook, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kill-bill-actor-michael-madsen-death-linked-to-multiple-health-issues-alcoholism-2757658-2025-07-18",
      "headline": "Kill Bill actor Michael Madsen's death linked to multiple health issues, alcoholismVeteran actor Michael Madsen died due to complications from cardiac arrest and chronic health issues. The latest reports revealed additional contributing factors, including coronary artery disease and chronic alcoholism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-drums-live-with-ed-sheeran-in-bucharest-for-new-docuseries-limitless-2757609-2025-07-18",
      "headline": "Chris Hemsworth drums live with Ed Sheeran in Bucharest for new docuseries LimitlessChris Hemsworth took an unexpected leap from acting to drumming as he joined Ed Sheeran on stage before 70,000 fans in Bucharest. The clip resurfaced after the trailer for the docuseries 'Limitless: Live Better Now' released on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anand-l-rai-opposes-ai-generated-raanjhanaa-re-release-unhappy-with-altered-climax-2757583-2025-07-18",
      "headline": "Aanand L Rai slams re-release of Raanjhanaa with AI-powered climaxDirector Aanand L Rai has strongly opposed the AI-generated happy ending in the re-release of 'Raanjhanaa'. He stated that he was not informed or consulted by Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb-29-story-leaked-tanzania-shooting-mahesh-babu-priyanka-chopra-rajamouli-telugu-cinema-2757549-2025-07-18",
      "headline": "Mahesh Babu, Priyanka Chopra's SSMB 29 based on African classics: ReportsDirector SS Rajamouli is about to begin shooting for a new schedule of his upcoming film, tentatively titled - 'SSMB 29' in Tanzania's Serengeti. The action-adventure features Mahesh Babu and Priyanka Chopra in the lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-gives-her-greece-vacation-lungi-dance-twist-2757556-2025-07-18",
      "headline": "Kareena Kapoor gives her Greece vacation a lungi dance twist. PicsKareena Kapoor Khan is enjoying a sunny vacation in Greece with her family. She shared a fun 'lungi dance' post, giving a playful nod to Shah Rukh Khan's popular song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-teases-couple-after-coldplay-outs-ceo-affair-2757545-2025-07-18",
      "headline": "Are you legitimate: Chris Martin teases couple after Coldplay outs CEO's affairChris Martin jokingly asked another couple in the crowd if they were 'legitimate' after teasing a pair he suspected might be having an affair. The witty moment went viral, with fans loving his playful humour on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra43-birthday-with-fun-beach-vacation-with-family-2757519-2025-07-18",
      "headline": "Priyanka Chopra steps into 43 with fun beach vacation with family. Watch videoPriyanka Chopra Jonas celebrated her 43rd birthday with a beach holiday along with Nick Jonas, daughter Malti and her family. She shared a sweet video on Instagram showing happy family moments from the trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/tanvi-the-great-review-anupam-kher-soulful-acting-shubhangi-dutt-debut-soulful-bad-execution-2757301-2025-07-18",
      "headline": "Tanvi The Great review: Soulful acting bogged down by uneven pacing, flat executionRelease Date:Fri Jul 18, 2025Tanvi The Great Review: 'Tanvi: The Great' marks the acting debut of Shubhangi Dutt. Despite its ambitious emotional arc, the Anupam Kher-directorial drifts from its promising premise. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaish-e-mohammed-chief-masood-azhar-spotted-gilgit-baltistan-intel-bahawalpur-2757749-2025-07-18",
      "headline": "Masood Azhar seen in POK, 1,000 km away from Bahawalpur bastion, shows intelJaish chief Masood Azhar is the mastermind of several terror activities in India, including the 2016 Pathankot airbase attack and the 2019 Pulwama attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-extends-closure-rahim-yar-khan-air-base-runway-operation-sindoor-2757775-2025-07-18",
      "headline": "Pak again extends closure of key air base struck during Operation SindoorThe latest NOTAM issued by Pakistan says the runway at the Rahim Yar Khan air base will remain closed for flight operations till August 5."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/missing-woman-russian-child-father-custody-case-supreme-court-case-embassy-diplomat-passport-seizure-2757740-2025-07-18",
      "headline": "Mystery of missing Russian woman, child, and a backdoor embassy entry in DelhiA Russian woman married to an Indian and their 4-year-old son have been missing since July 7 amid a custody battle. The woman, who is allegedly in a relationship with a diplomat, and the child, the husband told the Supreme Court, were last seen entering the Russian Embassy in New Delhi on July 4. The SC has sought a probe, and asked the embassy to cooperate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/udaipur-files-kanhaiya-lal-tailor-release-murder-rangeela-rasool-rajpal-mahashe-blasphemy-jinnah-iqbal-gandhi-history-2757456-2025-07-18",
      "headline": "When Urdu book on Prophet got publisher killed, earned India blasphemy lawA movie on Kanhaiya Lal Teli, a tailor in Udaipur who was beheaded by two Muslim men for sharing a post supporting a BJP leader's comments on Prophet Muhammad, is caught in a storm of controversy. In 1929, publisher Mahashe Rajpal was stabbed to death by a 19-year-old Muslim carpenter for the book Rangeela Rasool. Massive protests over the book resulted in the British introducing the blasphemy law in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/saiyaara-movie-review-ahaan-panday-starry-debut-for-hearts-that-loved-lost-and-healed-2757783-2025-07-18",
      "headline": "Saiyaara review: Ahaan Panday's starry debut for hearts that loved, lost and healedRelease Date:Fri Jul 18, 2025Saiyaara movie review: With Ahaan Panday making a starry, emotionally grounded debut, 'Saiyaara' becomes a soft place for bruised hearts to land, especially for today's generation. It's a reminder that perhaps both heartbreak and healing can be beautiful."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mangaluru-conman-rohan-saldanha-held-after-rs-500-crore-fraud-secret-mansion-with-chambers-found-2757627-2025-07-18",
      "headline": "Secret chambers, hidden exits: Mansion of conman arrested in Rs 500-crore scamMangaluru Police arrested Rohan Saldanha, accused of defrauding crores through fake loan schemes. His mansion, filled with secret rooms and luxury items, exposed the scale of his Rs 500 crore operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-student-self-immolation-letter-principal-suspension-friend-blames-bjd-congress-2757672-2025-07-18",
      "headline": "Letter seeking Odisha victim's suspension emerges, friend says bid to silenceThe letter, accessed by India Today, was written on July 1 by a group of 71 students. The fresh revelations hint at a coordinated attempt to shield the accused professor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-air-india-can-give-its-revival-plan-wing-2757247-2025-07-17",
      "headline": "How Air India can give wings to its revival planThe Ahmedabad crash has cast a long shadow over the airline, exposing cracks in safety, staffing and systems and posing the challenge of rebuilding trust\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/felix-baumgartner-dead-relive-the-moment-he-jumped-from-the-edge-of-space-2757732-2025-07-18",
      "headline": "Felix Baumgartner dead: Relive how he jumped from the edge of spaceJust hours before the accident, Baumgartner posted to Instagram about \"too much wind,\" hinting at the challenging flying conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-review-ai-driven-cyber-warfare-espionage-himmat-singh-kay-kay-menon-2757428-2025-07-18",
      "headline": "Special Ops 2 review: Kay Kay Menon anchors ambitious but uneven spy thrillerRelease Date:Fri Jul 18, 2025Special Ops 2 series review: The second season of 'Special Ops' delves into AI-driven cyber warfare intertwined with classic spy drama. The season raises questions about technology's role in future conflicts and personal sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fine-pratika-rawal-on-field-conduct-england-slow-over-rate-2757765-2025-07-18",
      "headline": "ICC penalises Pratika Rawal for conduct, England fall short on over-rateThe ICC has penalised both Pratika Rawal and the England women's cricket team for their respective violations in the recently-concluded ODI that was held in Southampton earlier. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/astronomer-ceo-wife-megan-kerrigan-drop-his-surname-byron-deactivate-facebook-account-2757618-2025-07-18",
      "headline": "Did CEO's wife drop his surname from Facebook after 'kiss cam at concert' moment?Social media users claim Megan deleted \"Byron\" from her name before deactivating her account altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-moves-supreme-court-in-burnt-cash-case-plea-impeachment-2757785-2025-07-18",
      "headline": "No proof, report leaked: Details of Justice Varma's plea against burnt cash caseUnder fire over burnt cash allegations, Justice Yashwant Varma claimed the in-house probe lacked a formal complaint, seized no evidence, leaked findings to the media, and violated his constitutional rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-fool-volume-review-netflix-experimental-comedy-2757596-2025-07-18",
      "headline": "Vir Das Fool Volume review: Most experimental special yetRelease Date:Fri Jul 18, 2025Vir Das Fool Volume review: Vir Das returns with 'Fool Volume', his most experimental special yet, streaming on Netflix. The show blends diverse venues and tones, highlighting his mature comedic style and global outlook, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-woman-alvani-detained-illinois-shoplifting-us-embassy-in-india-visa-warning-american-rules-mea-deportation-2757655-2025-07-18",
      "headline": "Indian woman held for 7-hour shoplifting in Illinois; then a US visa warningAn Indian woman visiting the US was detained in Illinois for trying to steal goods worth over $1,300 from a store after spending 7 hours there. Even as a video from the May incident went viral, the US Embassy in India issued a stern warning to visa holders that involvement in crimes, including theft, could lead to visa-revocation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-review-controversy-lords-test-edgbaston-gill-2757701-2025-07-18",
      "headline": "ENG vs IND: Manufacturer to review Dukes ball after rising quality concernsENG vs IND: The Dukes' ball manufacturers have confirmed that they will have a look at the match balls from the first three Tests to identify why the ball has been getting softer fairly quickly in the ongoing series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-hc-man-jailed-3-days-for-facebook-posts-on-judges-sangh-parivar-links-2757770-2025-07-18",
      "headline": "Kerala man gets 3-day jail for Facebook posts accusing judges of Sangh Parivar linksThe Kerala High Court sentenced a man to three days' jail and fined him Rs 2,000 for making Facebook posts that accused its judges of appeasing the Sangh Parivar and external influences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chaitanya-baghel-son-of-ex-chhattisgarh-chief-minister-bhupesh-baghel-arrested-by-ed-in-liquor-scam-2757681-2025-07-18",
      "headline": "Bhupesh Baghel's son arrested on his birthday by ED in liquor 'scam'Chaitanya Baghel, son of Congress leader and former Chhattisgarh Chief Minister Bhupesh Baghel, bas been arrested by ED in connection with a money laundering case related to an alleged liquor scam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-know-what-you-did-last-summer-review-2025-reboot-gen-z-horror-2757657-2025-07-18",
      "headline": "I Know What You Did Last Summer review: Gen Z-fication of slasher film is oddly funnyRelease Date:Fri Jul 18, 2025I Know What You Did Last Summer movie review: The 2025 reboot of 'I Know What You Did Last Summer' brings a Gen Z twist to the classic slasher. It mixes nostalgia with campy humour but falls short of being a genre-defining hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-cm-siddaramaiah-approves-rs-50-crore-mla-funds-amid-pressure-development-works-grants-shortage-2757786-2025-07-18",
      "headline": "Siddaramaiah releases Rs 50 crore to each MLA amid pressure over fund shortageAfter weeks of discontent and pressure from Congress MLAs and allies over delays in constituency funds, Karnataka Chief Minister Siddaramaiah has cleared Rs 50 crore per MLA for development projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patna-hospital-firing-gangster-chandan-mishras-killers-knew-paras-hospital-layout-faulty-lock-helped-2757540-2025-07-18",
      "headline": "Last-minute huddle, man on watch, faulty lock: How Patna hospital murder unfoldedA six-member gang that killed murder convict Chandan Mishra inside a Patna hospital had mapped entry points, exploited a faulty door lock, and evaded security checks before shooting him dead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-two-friends-allege-assault-using-knuckleduster-by-bouncers-at-bengaluru-bar-on-brigade-road-2757687-2025-07-18",
      "headline": "Bouncers follow, beat up woman and her boyfriend after fight in Bengaluru barA 21-year-old woman has alleged that she and her two male friends were physically assaulted by bouncers during a visit to a popular resto-bar on Brigade Road in central Bengaluru. The bouncers were arrested and later released on bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/saiyaara-movie-review-ahaan-panday-starry-debut-for-hearts-that-loved-lost-and-healed-2757783-2025-07-18",
      "headline": "Saiyaara review: Ahaan Panday's starry debut for hearts that loved, lost and healedRelease Date:Fri Jul 18, 2025Saiyaara movie review: With Ahaan Panday making a starry, emotionally grounded debut, 'Saiyaara' becomes a soft place for bruised hearts to land, especially for today's generation. It's a reminder that perhaps both heartbreak and healing can be beautiful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kothapallilo-okapudu-movie-review-ambitious-attempt-stumbles-despite-thoughtful-themes-2757773-2025-07-18",
      "headline": "Kothapallilo Okappudu review: Ambitious attempt stumbles despite thoughtful themesRelease Date:Fri Jul 18, 2025Kothapallilo Okappudu movie review: Director Praveena Paruchuri's 'Kothapallilo Okappudu' is a thought-provoking film on faith and belief. While there's a lot to ponder, the film goes through a bumpy ride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-prediction-records-highest-ticket-sales-since-chhaava-ahaan-pandey-aneet-padda-2757652-2025-07-18",
      "headline": "Saiyaara box office prediction: Film records highest ticket sales since ChhaavaDirector Mohit Suri's 'Saiyaara' released in theatres on July 18, 2025. Recent advance booking reports suggest the Ahaan Panday-Aneet Padda starrer is set to have a Rs 25 crore opening at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/video/kirron-kher-makes-rare-public-appearance-with-anupam-kher-at-tanvi-the-great-premiere-2757752-2025-07-18",
      "headline": "Kirron Kher makes rare public appearance with Anupam Kher at Tanvi the Great premiereKirron Kher made a rare public appearance with Anupam Kher at the screening of 'Tanvi the Great'. The veteran couple walked the red carpet hand-in-hand, with Kirron dressed in a red salwar suit. Their son Sikander Kher also joined them for the special evening."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-monty-panesar-on-arshdeep-singh-jasprit-bumrah-2757794-2025-07-18",
      "headline": "ENG vs IND: Monty Panesar surprised by India's major blunder in first 3 TestsFormer India spinner Monty Panesar has been left surprised by the non-selection of Arshdeep Singh in the first three Tests of the series against England. The left-arm spinner earned his maiden Test call-up for the ongoing England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-shouldnt-play-in-manchester-if-he-cant-keep-wickets-ravi-shastri-2757766-2025-07-18",
      "headline": "Rishabh Pant shouldn't play in Manchester if he can't keep wickets: Ravi ShastriFormer India cricketer and head coach Ravi Shastri feels Rishabh Pant shouldn't play the fourth Test against Englandt at Old Trafford, Manchester if he can't keep wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fine-pratika-rawal-on-field-conduct-england-slow-over-rate-2757765-2025-07-18",
      "headline": "ICC penalises Pratika Rawal for conduct, England fall short on over-rateThe ICC has penalised both Pratika Rawal and the England women's cricket team for their respective violations in the recently-concluded ODI that was held in Southampton earlier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-review-controversy-lords-test-edgbaston-gill-2757701-2025-07-18",
      "headline": "ENG vs IND: Manufacturer to review Dukes ball after rising quality concernsENG vs IND: The Dukes' ball manufacturers have confirmed that they will have a look at the match balls from the first three Tests to identify why the ball has been getting softer fairly quickly in the ongoing series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bevon-jacobs-relishes-dream-debut-for-new-zealand-on-south-africa-return-2757680-2025-07-18",
      "headline": "Bevon Jacobs relishes dream debut for New Zealand on South Africa returnBevon Jacobs relished a dream debut for New Zealand in the country of his birth, South Africa, as they defeated the Proteas in the opening game of the T20 Tri-Series in Harare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-batting-form-affected-by-heated-exchange-zak-crawley-lords-test-2757628-2025-07-18",
      "headline": "Manjrekar questions Shubman Gill's sledging battle after Lord's lossSanjay Manjrekar has suggested that Shubman Gill's fiery on-field spat with Zak Crawley during the Lord's Test may have thrown the young Indian skipper off his game and affected his performance with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-in-limbo-vision-2047-aiff-fsdl-2757613-2025-07-18",
      "headline": "India's Vision 2047 can wait as football's leaky boat needs fixing firstIndia's Vision 2047 wants to take football to the stars — but right now, the engine's sputtering. With ISL stalled and the national team coachless, Indian football needs repair, not just ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-must-curb-aggressive-instinct-dilip-vengsarkar-2757617-2025-07-18",
      "headline": "Yashasvi Jaiswal must curb aggressive instinct after Lord's blunder: Dilip VengsarkarFormer India batter Dilip Vengsarkar has asked Yashasvi Jaiswal to curb his aggressive instinct after his twin failures in the Lord's Test which eventually led to India's 22-run loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-fight-praised-gautam-gambhir-lords-test-india-lose-2757585-2025-07-18",
      "headline": "Ravindra Jadeja's resilience in Lord's Test earns him MVP praise from Team IndiaIndia head coach Gautam Gambhir was full of praise for seasoned all-rounder Ravindra Jadeja, hailing his battling knock in the Lord's Test against England as a display of \"incredible fight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-in-limbo-vision-2047-aiff-fsdl-2757613-2025-07-18",
      "headline": "India's Vision 2047 can wait as football's leaky boat needs fixing firstIndia's Vision 2047 wants to take football to the stars — but right now, the engine's sputtering. With ISL stalled and the national team coachless, Indian football needs repair, not just ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-must-curb-aggressive-instinct-dilip-vengsarkar-2757617-2025-07-18",
      "headline": "Yashasvi Jaiswal must curb aggressive instinct after Lord's blunder: Dilip VengsarkarFormer India batter Dilip Vengsarkar has asked Yashasvi Jaiswal to curb his aggressive instinct after his twin failures in the Lord's Test which eventually led to India's 22-run loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-fight-praised-gautam-gambhir-lords-test-india-lose-2757585-2025-07-18",
      "headline": "Ravindra Jadeja's resilience in Lord's Test earns him MVP praise from Team IndiaIndia head coach Gautam Gambhir was full of praise for seasoned all-rounder Ravindra Jadeja, hailing his battling knock in the Lord's Test against England as a display of \"incredible fight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}