{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-pay-income-tax-with-credit-card-all-you-need-to-know-2785649-2025-09-11",
      "headline": "Should you pay income tax with credit card? All you need to knowAs the tax filing deadline approaches, many taxpayers scramble to pay their dues. While net banking and UPI are common, using a credit card is also an option, but it comes with costs and benefits you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-even-small-income-slips-can-trigger-big-tax-notices-explains-tax-advisor-2785585-2025-09-11",
      "headline": "Why even small income slips can trigger big tax notices, explains tax advisorThink a small slip in your tax return won't matter? Think again. Even missing Rs 5,000 bank interest has invited income tax notices. A tax advisor breaks down why AIS mismatches are a growing headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF in limbo: Why so many employees struggle to access their savingsFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-in-it-stocks-here-are-the-top-picks-2785577-2025-09-11",
      "headline": "Looking to invest in IT stocks? Here are the top picksDespite recent concerns around tariffs announced by US President Donald Trump in April, experts remain positive on the IT sector's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-world-richest-larry-elisson-oracle-open-ai-partnership-2785501-2025-09-11",
      "headline": "World's richest race: Elon Musk reclaims No.1 spot from Larry EllisonElon Musk has largely remained at the top of the global wealth chart since first claiming the position in 2021. Though he was overtaken briefly by LVMH's Bernard Arnault in 2021 and by Amazon founder Jeff Bezos in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20s-to-retirement-how-bonds-strengthen-your-finances-2785155-2025-09-10",
      "headline": "From 20s to retirement: How bonds strengthen your financesBonds don't grab headlines like stocks, but they quietly strengthen your finances across life stages. From building discipline in your 20s to ensuring stability in retirement, they remain a steady anchor for wealth creation. Here's how they work for you."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-release-delayed-after-lokah-chapter-1-box-office-success-2785673-2025-09-11",
      "headline": "Dulquer Salmaan's Kaantha postponed due to Lokah's success, new date to be outDulquer Salmaan and Rana Daggubati announced the postponement of 'Kaantha' to allow 'Lokah' to continue its successful run. New release date will be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-says-bollywood-star-was-fired-from-south-film-due-to-high-entourage-2785663-2025-09-11",
      "headline": "Sanjay Gupta says a Bollywood star was fired from South film due to high entourageDirector Sanjay Gupta revealed a Bollywood star was fired from a South film due to costly entourage demands. The producer scrapped the project after discovering hidden expenses from multiple vans brought from Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-summer-i-turned-pretty-why-millennial-women-are-bingeing-belly-jeremiah-conrad-love-story-like-teenagers-2785631-2025-09-11",
      "headline": "Why millennial women are bingeing The Summer I Turned Pretty like teenagersMillennial women can't get enough of 'The Summer I Turned Pretty'. Between Belly's endless love triangle, Conrad vs Jeremiah debates, and the nostalgia of teenage summers, the Prime Video hit has become the ultimate guilty pleasure - bills and burnout be damned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-shoots-rajinikanth-jailer-2-poses-pictures-with-fans-2785658-2025-09-11",
      "headline": "Shiva Rajkumar shoots for Rajinikanth's Jailer 2, poses for pics with fansKannada actor Shiva Rajkumar, whose cameo in Rajinikanth's 2023 blockbuster 'Jailer' had gone viral, will be reprising his role in the sequel. He has started shooting for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-to-record-a-song-for-rishab-shetty-kantara-chapter-1-2785598-2025-09-11",
      "headline": "Diljit Dosanjh to record a song for Rishab Shetty's Kantara Chapter 1Singer Diljit Dosanjh is set to sing a song for director-actor Rishab Shetty's 'Kantara: Chapter 1'. The collaboration between Diljit and Hombale Films adds to the cultural diversity and pan India appeal of the upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/zombie-reddy-2-will-be-made-for-global-audiences-says-teja-sajja-2785276-2025-09-11",
      "headline": "Exclusive: Zombie Reddy 2 will be made for global audiences, says Teja SajjaActor Teja Sajja confirmed that 'Zombie Reddy 2' is on the cards, with the team planning to scale up their experiment into a pan-India spectacle aimed at global audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-18-mridul-tiwari-shehbaz-badesha-farrhana-bhatt-ashnoor-kaur-2785610-2025-09-11",
      "headline": "Bigg Boss 19 episode 18: Mridul- Shehbaz clash, Farrhana-Ashnoor rivalry heats upMridul Tiwari and Shehbaz Badesha came close to a physical fight in the latest episode of 'Bigg Boss 19.' What led to the huge clash? Find out in the written update for the latest episode of the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/after-death-hoax-kajal-aggarwal-makes-first-public-appearance-2785629-2025-09-11",
      "headline": "After death hoax, Kajal Aggarwal makes first public appearanceActor Kajal Aggarwal, after dismissing false reports claiming she died in a road accident, made her first public appearance in Mumbai days after the rumours surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/britney-spears-fires-back-at-trolls-over-messy-home-shame-on-those-who-judged-me-2785607-2025-09-11",
      "headline": "Britney Spears fires back at trolls over messy home: Shame on those who judged mePop icon Britney Spears faced renewed criticism over her home's condition, prompting her to defend her personal space and lifestyle on social media. She hit back at trolls in a new latest post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-launches-solaire-restaurant-mumbai-grand-hyatt-2785573-2025-09-11",
      "headline": "Sanjay Dutt launches his first restaurant Solaire in MumbaiActor Sanjay Dutt unveils his inaugural restaurant venture, Solaire, at Mumbai's Grand Hyatt. The restaurant offers a diverse global menu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-recalls-school-memories-shares-fun-story-of-impressing-girls-2785602-2025-09-11",
      "headline": "KBC 17: Big B recalls school memories, shares fun story of impressing girlsIn the latest episode of 'Kaun Banega Crorepati 17', Amitabh Bachchan recalled his school life and spoke about impressing girls during assembly every Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-warns-film-industry-box-office-obsession-harms-independent-cinema-2785571-2025-09-11",
      "headline": "Manoj Bajpayee warns box office glory isn't everything, calls it a monsterActor Manoj Bajpayee has voiced concerns over the film industry's obsession with box office success, warning it sidelines smaller, meaningful films. He called it \"a self-destructive monster\" that will soon eat the industry's acclaimed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-ram-charan-varun-tej-lavanya-baby-boy-2785547-2025-09-11",
      "headline": "Allu Arjun, Ram Charan shower love on Varun Tej, Lavanya after baby boy's birthActors Allu Arjun, Ram Charan, and his entrepreneur wife, Upasana Kamineni Konidela, extended heartfelt congratulations to Varun Tej and Lavanya Tripathi. The couple recently became parents to a baby boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saiyaara-ott-release-confirmed-ahaan-panday-aneet-padda-love-story-stream-netflix-2785550-2025-09-11",
      "headline": "Saiyaara OTT release confirmed: Ahaan-Aneet's love story to stream on NetflixThe cat is out of the box, and the moment is here that some of us have been waiting for. Mohit Suri's 'Saiyaara' is ready to stream on OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-dismisses-social-media-ban-fears-india-nepal-protests-2785521-2025-09-11",
      "headline": "Ram Gopal Varma rejects social media ban fears in IndiaRam Gopal Varma asserts that a social media ban like Nepal's is improbable in India. He cites government hesitance as a major deterrent against such actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kishwer-merchant-calls-bigg-boss-19-boring-fans-react-2785488-2025-09-11",
      "headline": "Kishwer Merchant calls Bigg Boss 19 boring, fans hit backKishwer Merchant has called Bigg Boss 19 boring, sparking a fierce debate among fans who defend the current season as better than her own. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-greets-bows-elderly-fan-us-concert-dedicates-saturday-saturday-chilvary-fans-praise-viral-video-2785490-2025-09-11",
      "headline": "Badshah wins hearts after bowing to elderly fan, dedicating song at US concertSinger-rapper Badshah's adorable gesture for an elderly fan at the US concert has left fans praising him. A video from the concert has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanishaa-mukerji-recalls-memory-loss-near-fatal-accident-debut-film-shoot-ssssshhh-2785457-2025-09-11",
      "headline": "Tanishaa Mukerji recalls memory loss after near-fatal accident on debut film shootActor Tanishaa Mukerji recalled her near-fatal accident on debut film 'Ssssshhh....' shoot. She revealed suffering from a concussion and memory loss. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/selena-gomez-wedding-plans-benny-blanco-reveals-her-ring-bearer-2785444-2025-09-11",
      "headline": "Selena Gomez blushes talking about wedding with Benny Blanco, reveals ring bearerActor Selena Gomez recently revealed details about her wedding plans with fiance Benny Blanco, teasing that the preparations were going well. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/gen-z-picks-kulman-ghising-to-lead-nepal-interim-government-after-sushila-karki-steps-aside-2785671-2025-09-11",
      "headline": "Nepal's ex-electricity board chief Kulman Ghising enters race for top jobGen Z protesters proposed former Nepal Electricity Authority chief Kulman Ghising to lead Nepal's interim government after Bolendra Sah opted out and Sushila Karki was disqualified. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/e20-fuel-criticism-was-paid-political-campaign-against-me-supreme-court-gave-clarity-nitin-gadkari-2785584-2025-09-11",
      "headline": "Paid campaign against me: Nitin Gadkari on E20 petrol furore onlineNitin Gadkari blamed a \"paid social media campaign\" against E20 blending on political motives, and urged people to stop paying attention to misinformed claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-moment-of-gun-attack-video-viral-screams-panic-utah-manhunt-shooter-2785458-2025-09-11",
      "headline": "Gunshot, screams, panic: Video captures moment Charlie Kirk was shot deadCharlie Kirk, founder of Turning Point USA, was answering a question about gun violence when a single gunshot rang out. As he abruptly slumped in his seat, chaos broke out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-updates-social-media-ban-news-youth-clash-new-prime-minister-army-2785515-2025-09-11",
      "headline": "Live: Toll rises to 34 in Nepal protests; Gen Z groups fight outside Army headquartersNepal Protest Live Updates: As Nepal slowly returns to normalcy, days after violent demonstrations led by Gen Z protesters forced Prime Minister KP Sharma Oli to resign, intensive discussions are underway among various stakeholders regarding the country's future. With the Nepal Army having imposed nationwide restrictions, names such as former Chief Justice Sushila Karki, Kathmandu Mayor Balendra Shah, and former electricity board CEO Kulman Ghising are reportedly being considered by the Gen Z protesters to lead an interim government. As soon as the curfew was lifted, people rushed to markets, shops, and grocery stores to stock up on essentials. Roads, still bearing the scars of recent violence, saw only a few vehicles. Stay Tuned to IndiaToday.in as we bring latest updates from Nepal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-obesity-doctor-and-i-know-weight-loss-management-tricks-beyond-calories-gym-sleep-2785112-2025-09-11",
      "headline": "I'm an obesity doctor and here's my realistic, guilt-free guide to weight lossIn this DocYard column, renowned bariatric surgeon Dr. Muffazal Ladkawala explains the actual reason behind obesity and how small habits and the right mindset can help one manage weight amid a busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-government-warns-against-joining-russian-military-ukraine-conflict-2785510-2025-09-11",
      "headline": "Avoid joining Russian army, fraught with danger: India amid recruitment reportsThe government warned citizens against joining the Russian military, amid fresh reports of Indians being recruited to fight in the conflict. This follows ongoing diplomatic efforts to address the issue between New Delhi and Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-donald-trump-us-president-charlie-kirk-said-op-sindoor-pahalgam-terror-attack-india-immigration-visas-trade-2785604-2025-09-11",
      "headline": "Not our war, Charlie Kirk said on Op Sindoor; was against visa for IndiansPresident Trump's supporter and conservative influencer Charlie Kirk was shot dead at a Utah rally. With millions of followers online, Kirk had courted both praise and criticism for urging only \"moral support\" in India's Operation Sindoor and for claiming that Indian workers were displacing the American workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/openai-founder-sam-altman-interview-tucker-carlson-suchir-balajis-death-chatgpt-copyright-2785633-2025-09-11",
      "headline": "Definitely a murder: Tucker Carlson grills Sam Altman over whistleblower's deathOpenAI founder Sam Altman, confronted by Tucker Carlson over whistle-blower Suchir Balaji's death, rejected claims of murder by citing police findings of suicide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-in-flames-a-revolution-promise-or-another-cycle-of-betrayal-2785645-2025-09-11",
      "headline": "Nepal in Flames: A revolution's promise or another cycle of betrayal?Kathmandu burns and the cry of Nepal's youth reverberates across Asia. Power has toppled, streets are alive, and the world watches. Is this rebirth or the beginning of another false spring?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/is-this-asian-spring-arab-awakening-nepal-gen-z-protests-bangladesh-agitation-explained-2785513-2025-09-11",
      "headline": "Is this the Asian Spring?In the 2010s, mass protests in African and West Asian countries resulted in the Arab Spring. Nepal is among the South Asian countries, like Bangladesh, Indonesia, Sri Lanka, Thailand and Pakistan, that has witnessed large-scale, youth-led agitations. The issues are similar. Is this an Asian Spring?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-summer-i-turned-pretty-why-millennial-women-are-bingeing-belly-jeremiah-conrad-love-story-like-teenagers-2785631-2025-09-11",
      "headline": "Why millennial women are bingeing The Summer I Turned Pretty like teenagersMillennial women can't get enough of 'The Summer I Turned Pretty'. Between Belly's endless love triangle, Conrad vs Jeremiah debates, and the nostalgia of teenage summers, the Prime Video hit has become the ultimate guilty pleasure - bills and burnout be damned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/qatar-backstab-hamas-israel-trump-theories-coordinated-strike-gaza-war-2785596-2025-09-11",
      "headline": "Did Qatar backstab Hamas? 3 theories behind the brazen Israeli attackIsrael targeting Hamas's political leadership in Qatar was brazen as well as unprecedented. There are three major theories on why the strike could have possibly been a coordinated plot. We explain the different perspectives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/not-wise-trump-rebukes-netanyahu-over-hamas-operation-in-doha-wsj-reports-glbs-2785424-2025-09-11",
      "headline": "Not wise: Trump blasts Netanyahu on heated call over strikes on Hamas in DohaTrump rebuked Netanyahu for Israel's strike on Hamas leaders in Qatar, calling it \"not wise,\" amid fears it undermined US-backed ceasefire efforts and regional stability, WSJ reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-moves-family-greece-serbian-protests-political-tensions-2785413-2025-09-11",
      "headline": "Novak Djokovic shifts family to Greece as Serbian protests intensify: ReportsNovak Djokovic has quietly relocated his family to Greece amid growing political pressure in Serbia. This move follows his open support for student protests and signals increasing tensions with the Serbian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/handcuffed-inmate-seen-pleading-for-help-from-moving-prison-van-on-us-highway-viral-video-2785611-2025-09-11",
      "headline": "Video: Handcuffed inmate seen pleading for help from moving prison van on US highwayThe video shows the man, wearing a prison uniform and visibly handcuffed, leaning out of a broken back window."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-opium-capital-poppy-cultivation-balochistan-afghan-farmers-taliban-ban-2022-terror-funding-global-heroin-market-2785171-2025-09-11",
      "headline": "How Pakistan has become opium capital of the world with Afghan expertiseSprawling poppy fields in Pakistan's Balochistan have overtaken those in Afghanistan, which produced 80% of the world's opium. The Taliban's 2022 ban on poppy farming in Afghanistan pushed cultivators into Pakistan. With Afghan expertise and share-croppers, Pakistan has become the world's new opium hub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spicejet-delhi-kathmandu-flight-faulty-ac-flyers-disembark-air-india-2785617-2025-09-11",
      "headline": "Chaos on SpiceJet Kathmandu flight over faulty AC, flyers disembarkThis was the second such incident within 12 hours. Earlier, 200 Air India passengers were deplaned after being seated for nearly two hours without any AC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF in limbo: Why so many employees struggle to access their savingsFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-motherhood-off-limits-for-women-facing-mental-health-problems-depression-anxiety-2785178-2025-09-11",
      "headline": "Is motherhood off-limits for women facing mental health issues?Is your mental health condition casting a major question mark over your desire to become a mother? Perhaps this article will help you come to a conclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-murder-jharkhand-domestic-workers-accused-of-murdering-woman-in-kukatpally-apartment-2785640-2025-09-11",
      "headline": "Hyderabad woman, 50, murdered by domestic workers; CCTV shows suspects fleeingA 50-year-old Hyderabad woman was allegedly murdered by domestic helpers at her home in Kukatpally area. Police are investigating all angles, reviewing CCTV footage, and searching for the absconding suspects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-hm-g-parameshwara-controversy-inaugurating-rss-bjp-abvp-rath-yatra-tiptur-tumakuru-2785477-2025-09-11",
      "headline": "Didn't inaugurate or attend: G Parameshwara on row over RSS student wing eventKarnataka Home Minister G Parameshwara clarified he did not attend or inaugurate the ABVP event in Tiptur, saying he merely paid tribute to freedom fighter Rani Abbakka during his visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-perseverance-rover-life-on-mars-water-on-mars-2785566-2025-09-11",
      "headline": "Life on Mars: Why the discovery is exciting, but not conclusiveNASA's Perseverance rover has revealed life on Mars by examining a rock named Sapphire Canyon. But scientists emphasise more testing. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/lleyton-hewitt-appeals-suspension-fine-push-incident-davis-cup-2785676-2025-09-11",
      "headline": "Lleyton Hewitt to contest ban over clash with anti-doping officialAustralia's Davis Cup captain Lleyton Hewitt will appeal a two-week suspension and fine of 30,000 Australian dollars for allegedly pushing an anti-doping official during last year's Davis Cup semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/charlie-kirk-shot-dead-utah-valley-university-debate-athletes-mourn-2785435-2025-09-11",
      "headline": "Faf du Plessis mourns Charlie Kirk, questions USA's gun culture after tragedyFaf du Plessis, along with other athletes, took to social media to mourn the death of Charlie Kirk, who was shot while addressing nearly 3,000 people at Utah Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-all-female-umpiring-panel-womens-cricket-world-cup-2025-india-sri-lanka-2785643-2025-09-11",
      "headline": "ICC announces historic all-female umpires panel for Women's World CupICC has announced the first ever all-female panel of umpires and match officials for the Women's Cricket World Cup 2025, set to be co-hosted by India and Sri Lanka from September 30 to November 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-minor-injury-asia-cup-2025-2785590-2025-09-11",
      "headline": "Salman Agha unfit? Pakistan face injury scare before Asia CupPakistan captain Salman Agha faced a mild neck spasm during training ahead of the Asia Cup 2025. The team management remains confident he will be fit to lead in the upcoming high-stakes matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-new-rule-excludes-missed-half-court-shots-from-stats-final-seconds-2785402-2025-09-11",
      "headline": "NBA to scrap missed half-court shots from stats in end-of-quarter heaves: ReportThe NBA has introduced a rule excluding missed half-court shots in the last three seconds of quarters from player statistics. This change aims to protect player shooting percentages while encouraging more exciting buzzer-beater attempts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-nxt-homecoming-full-sail-carmelo-hayes-tyler-breeze-dream-matches-2785425-2025-09-11",
      "headline": "WWE NXT Homecoming returns to Full Sail with iconic stars and dream matches: ReportWWE NXT returns to Full Sail University for a special Homecoming episode featuring top stars. The event promises nostalgic dream matches and intense title battles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wrestlemania-43-saudi-arabia-2027-first-event-outside-us-2785419-2025-09-11",
      "headline": "WrestleMania may debut outside USA, Saudi Arabia tipped as 2027 hosts: ReportWrestleMania 43 is reportedly confirmed to be held in Saudi Arabia in 2027, marking the first time the event moves outside the United States. This move highlights Saudi Arabia's growing influence in global sports and entertainment but raises questions on WWE's fanbase balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/games-against-top-teams-like-india-help-build-confidence-uae-coach-lalchand-rajput-2785553-2025-09-11",
      "headline": "Games against top teams like India help build confidence: UAE coach Lalchand RajputUAE head coach Lalchand Rajput believes that games against top teams like India will help in raising their own standards. This comes after India secured a crushing win over the UAE in their opening game at the Asia Cup 2025 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-rally-hong-kong-open-quarterfinals-2785527-2025-09-11",
      "headline": "Satwik-Chirag survives another scare, advances to quarterfinal of Hong Kong OpenSatwiksairaj Rankireddy and Chirag Shetty overcame a tough challenge from Thailand to enter the Hong Kong Open quarterfinals. They took an hour and three minutes to win the match 18-21, 21-15, 21-11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-omar-marmoush-injury-manchester-derby-knee-injury-2785518-2025-09-11",
      "headline": "Premier League: Man City's Omar Marmoush ruled out of Manchester derbyOmar Marmoush will miss the Manchester derby due to a knee injury sustained on international duty. This setback deepens Manchester City's injury woes ahead of a crucial Premier League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-lalchand-rajput-uae-overawed-india-star-players-2785505-2025-09-11",
      "headline": "Asia Cup 2025: UAE head coach admits batters were overawed by India starsUAE head coach Lalchand Rajput admitted his batters were overawed by India's stars after a nine-wicket defeat in the Asia Cup 2025 opener. He said the experience against world-class spinners will be a key learning step for his young side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wrestlemania-43-saudi-arabia-2027-first-event-outside-us-2785419-2025-09-11",
      "headline": "WrestleMania may debut outside USA, Saudi Arabia tipped as 2027 hosts: ReportWrestleMania 43 is reportedly confirmed to be held in Saudi Arabia in 2027, marking the first time the event moves outside the United States. This move highlights Saudi Arabia's growing influence in global sports and entertainment but raises questions on WWE's fanbase balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/games-against-top-teams-like-india-help-build-confidence-uae-coach-lalchand-rajput-2785553-2025-09-11",
      "headline": "Games against top teams like India help build confidence: UAE coach Lalchand RajputUAE head coach Lalchand Rajput believes that games against top teams like India will help in raising their own standards. This comes after India secured a crushing win over the UAE in their opening game at the Asia Cup 2025 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-rally-hong-kong-open-quarterfinals-2785527-2025-09-11",
      "headline": "Satwik-Chirag survives another scare, advances to quarterfinal of Hong Kong OpenSatwiksairaj Rankireddy and Chirag Shetty overcame a tough challenge from Thailand to enter the Hong Kong Open quarterfinals. They took an hour and three minutes to win the match 18-21, 21-15, 21-11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-omar-marmoush-injury-manchester-derby-knee-injury-2785518-2025-09-11",
      "headline": "Premier League: Man City's Omar Marmoush ruled out of Manchester derbyOmar Marmoush will miss the Manchester derby due to a knee injury sustained on international duty. This setback deepens Manchester City's injury woes ahead of a crucial Premier League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-lalchand-rajput-uae-overawed-india-star-players-2785505-2025-09-11",
      "headline": "Asia Cup 2025: UAE head coach admits batters were overawed by India starsUAE head coach Lalchand Rajput admitted his batters were overawed by India's stars after a nine-wicket defeat in the Asia Cup 2025 opener. He said the experience against world-class spinners will be a key learning step for his young side."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}