{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-samvat-2081-stock-market-sensex-nifty-key-stocks-strategies-2626541-2024-11-01",
      "headline": "Muhurat Trading 2024: Markets end on strong note; all sectoral indices in greenMuhurat Trading 2024 has concluded, marking the arrival of Samvat 2081. The session, which took place from 6:00 PM to 7:00 PM, ended on a strong note, with the Sensex surging 335 points and the Nifty closing at 24,300. Investors actively participated, reflecting the festive spirit of the Hindu New Year through token investments aimed at attracting prosperity. All the sectoral indices ended the session in green, with M&M, ONGC, Adani Ports and BEL emerging as the top gainers. On the other hand, the top losers were Dr Reddy's, HCLTech, Britannia, Tech Mahindra and Adani Enterprises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-timings-strategies-tips-stock-picks-and-key-details-2626384-2024-11-01",
      "headline": "Muhurat Trading 2024: Check timings, stock recommendations, all key detailsMuhurat Trading today: The pre-opening session will begin at 5:45 PM, and all intraday positions will be automatically squared off 15 minutes before the session's close, necessitating careful planning for same-day trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-top-stock-picks-trading-strategies-expert-insights-key-levels-timing-2626371-2024-11-01",
      "headline": "Muhurat trading 2024: Check stock picks, trading strategy and expert insightsMuhurat trading is not just a unique market session; it's a cherished tradition where investors make token investments to invoke the blessings of Goddess Lakshmi, the goddess of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bibek-debroy-dies-aged-69-visionary-economist-policy-reformer-author-2626283-2024-11-01",
      "headline": "Bibek Debroy dies at 69: A visionary economist and policy reformer Bibek Debroy's life was marked by significant contributions to economic policy and classical literature, shaping India's intellectual landscape and leaving a lasting impact on future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/19-kg-lpg-commercial-gas-cylinder-price-hike-delhi-mumbai-chennai-kolkata-new-rate-2626197-2024-11-01",
      "headline": "19 kg LPG commercial cylinders to get costlier from today. Check pricesThe prices of 19-kg commercial LPG cylinders have been revised across the country, including in metro cities like Delhi, Mumbai, Kolkata, and Chennai, effective November 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-550-points-lower-nifty-dips-as-it-stocks-slide-2626082-2024-10-31",
      "headline": "Sensex ends over 550 points lower, Nifty dips as IT stocks slideThe S&P BSE Sensex dropped by 553.12 points to close at 79,389.06, while the NSE Nifty50 fell 135.50 points, settling at 24,205.35. Broader market indices also declined as volatility weighed on investor sentiment across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-share-price-gain-10-percent-today-usfda-approval-goa-facility-stock-benefit-explained-2625958-2024-10-31",
      "headline": "Explained: Why Cipla share price surged up to 10% todayCipla share price: The stock rose by 9.88% to reach a day high of Rs 1,557.45 on the Bombay Stock Exchange (BSE).  At 10:41 am, shares of Cipla were up 8.24% at Rs 1,534.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-nbfc-hdfc-bank-arm-files-for-rs-12500-crore-ipo-check-details-2625953-2024-10-31",
      "headline": "HDFC Bank's HDB Financial files Rs 12,500 crore IPO. Check detailsHDFC Bank, holding a 94.6% stake in HDB Financial, will sell shares worth up to Rs 10,000 crore, while HDB Financial plans to issue fresh shares totalling Rs 2,500 crore, as outlined in the filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-openig-dalal-street-sensex-nifty-fall-fii-outflow-weak-q2-results-overvaluation-2625947-2024-10-31",
      "headline": "Diwali fireworks missing from Dalal Street as Sensex, Nifty fall The S&P BSE Sensex was down 199.13 points to 79,743.05 at 10:07 am, while the NSE Nifty50 fell 126 points to 24,340.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2625408-2024-10-30",
      "headline": "Afcons Infrastructure IPO allotment: Step-by-step guide to check status Afcons Infrastructure allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-day-3-check-latest-subscription-gmp-sees-dip-2625226-2024-10-29",
      "headline": "Afcons Infrastructure Day 3: Check latest subscription, GMP sees dip  The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-budgam-non-local-labourers-shot-by-terrorists-dead-injured-2626651-2024-11-01",
      "headline": "2 migrant workers shot by terrorists in J&K, second targeted attack in 12 daysThe injured migrant workers have been identified as Sofiyan and Usman, both residents of Uttar Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bal-dies-celebrated-fashion-designer-john-galliano-indian-version-kashmiri-embroidery-2626838-2024-11-02",
      "headline": "Remembering Rohit Bal, the maverick who was Indian fashion's John GallianoRohit Bal was Indian fashion's OG haute couturier, whose signature design around the lotus and peacock motifs remained essentially unchanged throughout his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-congress-diwali-video-release-nephew-raihan-rajiv-vadra-priyanka-robert-wayanad-nomination-2626633-2024-11-01",
      "headline": "Rahul Gandhi showcases nephew Raihan in Diwali video; soft launch?Congress leader Rahul Gandhi posted a Diwali video in which he is seen showcasing his nephew Raihan Rajiv Vadra. People saw the video, which comes soon after Priyanka Gandhi Vadra took the electoral plunge, as Raihan's \"soft launch\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cheap-pr-stunt-mallikarjun-kharge-pm-modi-poll-promises-jibe-2626705-2024-11-01",
      "headline": "Cheap PR stunt: Mallikarjun Kharge hits back at PM Modi over poll promises jibeResponding to Prime Minister Narendra Modi's poll-promises dig, Congress President Mallikarjun Kharge called NDA's 100-day plan a \"cheap PR stunt\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bal-dies-unwell-lakme-fashion-week-last-fashion-show-appearance-dance-ananya-panday-celebrities-2626833-2024-11-02",
      "headline": "Video: Unwell Rohit Bal lights up ramp with spirited dance at final fashion showRohit Bal, who died at 63 on Friday, appeared at the Lakme Fashion Week, his last fashion show, on October 14, and danced with full vigour and joy, despite being visibly unwell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/white-house-joe-biden-garbage-remark-trump-rally-comedian-transcript-stenographers-concerns-2626834-2024-11-02",
      "headline": "White House altered Joe Biden's 'garbage' remark in transcript: ReportWhite House press officials altered US President Joe Biden's \"garbage\" remark apparently targeting Donald Trump's supporters in the transcript and released it despite objections from the stenography team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fashion-designer-rohit-bal-dead-prolonged-illness-2626717-2024-11-01",
      "headline": "Renowned fashion designer Rohit Bal dies after prolonged illnessRohit Bal was suffering from a heart ailment since last year. He was even admitted to the intensive care unit of the Medanta Hospital in Gurugram in November 2023 but returned to work earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-man-dies-after-bwm-driven-by-bjp-leader-son-runs-over-him-in-basti-up-police-2626722-2024-11-01",
      "headline": "UP man dies after BMW allegedly driven by BJP leader's son runs over himThe family of Ram Lal Gupta, outraged and dissatisfied with the police's initial response, protested on the streets, demanding swift action against the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rest-in-style-gudda-bollywood-celebs-line-up-to-bid-farewell-to-rohit-bal-2626780-2024-11-01",
      "headline": "Rest in style, Gudda: Bollywood celebs line up to bid farewell to Rohit BalKareena Kapoor Khan, Ananya Panday, Aditi Rao Hydari and Sonam Kapoor, among others posted emotional tributes for the late designer Rohit Bal after he died battling heart issues on Friday, November 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/taliban-bans-woman-hearing-each-other-voices-while-praying-restricted-rights-2626842-2024-11-02",
      "headline": "Taliban's bizarre rule: Afghan women can't hear each other while prayingThe Taliban claimed that a woman's voice is considered \"awrah\", or that which must be covered, and should not be heard in public, not even by other women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/shaina-nc-arvind-sawants-imported-maal-remark-maha-vinaash-aghadi-mva-2626691-2024-11-01",
      "headline": "Shaina NC responds to Uddhav Sena MP's sexist jibe: Maha Vinash AghadiAfter an uproar over Shiv Sena (UBT) MP Arvind Sawant calling Shiv Sena (Eknath Shinde) leader Shaina NC an \"imported maal\", the latter calling the MVA \"Maha Vinash Aghadi\" and questioned party leaders for maintaining silence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dua-padukone-singh-deepika-padukone-reveals-name-of-her-ranveer-singhs-daughter-2626656-2024-11-01",
      "headline": "Dua Padukone Singh: Deepika Padukone, Ranveer Singh reveal daughter's nameDeepika Padukone and Ranveer Singh shared the first picture of their daughter and also revealed her name on the auspicious occasion of Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/majarashtra-assembly-polls-eknath-shinde-responds-on-rebels-nawab-malik-sameer-bhujbal-2626718-2024-11-01",
      "headline": "Eknath Shinde responds to rebels contesting Maharashtra polls: Will find a wayAddressing questions about rebels of the Mahayuti alliance contesting the Assembly polls, Maharashtra Chief Minister Eknath Shinde said that senior leaders of the alliance would sit and find a way in connection with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/akbar-padamsee-arrest-fn-souza-nude-painitings-bombay-high-court-india-first-nude-art-scandal-1954-lovers-naked-trail-case-2626317-2024-11-01",
      "headline": "Nude Lovers spring back, remind India of first 'obscene' art controversyThe Bombay High Court in October prevented the customs department from destroying paintings of Akbar Padamsee over \"obscenity\". It was Padamsee's nude paintings, Lovers 1 and 2, which was Independent India's first major art controversy. Seventy years on, the nude Lovers have returned to public consciousness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/selena-gomez-reacts-to-indian-fan-request-to-chant-jai-shri-ram-2626721-2024-11-01",
      "headline": "Watch: Selena Gomez reacts to Indian fan's request to chant 'Jai Shri Ram'A video of Selena Gomez with an Indian fan asking her to chant \"Jai Shri Ram\" is going viral. It has garnered negative reactions online. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-form-mumbai-test-dinesh-karthik-2626843-2024-11-02",
      "headline": "Rohit Sharma not out of form, but choosing poor shots: Dinesh KarthikIndia vs. New Zealand, 3rd Test: Former India batter Dinesh Karthik has claimed that Rohit Sharma's issue is not form but the nature of his shot selection. Rohit, on Day 1, got out for 18 runs, edging Matt Henry behind the stumps.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/designer-rohit-bal-dies-heart-ailments-tributes-gudda-kashmiri-pandit-ivanka-trump-wore-his-dress-in-rashtrapati-bhavan-2626759-2024-11-01",
      "headline": "In Rohit Bal's work, history met folklore and melded with fantasyRohit Bal returned to the runway two weeks ago, to tears and applause, after a heart ailment sent him to the hospital earlier this year. He died at the age of 63 this evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-polls-update-bjp-congress-mva-mahayuti-mumbai-konkan-vidarbha-marathwada-2626841-2024-11-02",
      "headline": "Can Congress put up a strong show against BJP in Maharashtra polls?The Congress is hoping to put up a strong show against the BJP in 75 of the 288 seats in the upcoming Maharashtra Assembly polls after a dismal performance in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-elections-bjp-age-mismatch-hemant-soren-affidavit-barhait-constituency-2626694-2024-11-02",
      "headline": "BJP demands Hemant Soren's candidature cancelled over age mismatch chargeBJP's Barhait nominee Gamliyel Hembrom alleged on October 30, that the Jharkhand Chief Minister mentioned 42 years as his age in the affidavit filed in 2019, but 49 years in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/alia-bhatt-ranbir-kapoor-kiara-advani-sidharth-malhotra-janhvi-kapoor-diwali-photos-2626728-2024-11-01",
      "headline": "How Alia-Ranbir, Kiara-Sidharth, Janhvi-Shikhar and celebs celebrated DiwaliCelebrities including Alia Bhatt, Ranbir Kapoor, Janhvi Kapoor, and Kiara Advani, among others celebrated Diwali with family and friends. They shared pictures from their celebration on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-2024-live-donald-trump-kamala-harris-republican-democratic-america-united-states-2626461-2024-11-01",
      "headline": "Trump, Harris travel to swing states again in final push to woo votersDemocratic presidential candidate Kamala Harris, who is in the final leg of her campaign for the US presidential election, on Friday warned voters that her Republican opponent Donald Trump and his allies would scale back healthcare programs if he wins the White House and said his comments at a rally were offensive to women. Trump responded, asserting that he never intended to eliminate the program. \"I never mentioned doing that, never even thought about such a thing,\" he wrote on his Truth Social platform. Opinion polls indicate an unusually tight race between Harris and Trump, with Tuesday's US presidential election likely to be determined by results in seven key battleground states of the country. Follow indiatoday.in for more updates to the US presidential election."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bomb-like-devices-found-exploded-kolkata-trinamool-congress-councillor-kolkata-police-cases-2626840-2024-11-02",
      "headline": "Boy injured after 'bomb' explodes near Trinamool councillor's home in KolkataCases were registered against unknown persons after two bomb-like objects were discovered near a Trinamool Congress's councillor home in Kolkata, one of which exploded and injured a minor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-nawab-malik-ncp-ajit-pawar-sue-defamation-linked-him-dawood-ibrahim-2626821-2024-11-02",
      "headline": "Nawab Malik vows to sue those who linked him to Dawood IbrahimArrested by the Enforcement Directorate for his alleged links with underworld don Dawood Ibrahim in 2022, Nawab Malik was granted bail on medical grounds in July last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/designer-rocky-s-remembers-mentor-rohit-bal-kashmir-was-his-artistic-inspiration-2626829-2024-11-02",
      "headline": "Designer Rocky S remembers 'mentor' Rohit Bal: Kashmir was his artistic inspirationDesigner Rocky S talked to us in an exclusive interview and recalled the creative brilliance of the late designer Rohit Bal. He also called him an 'icon' and remembered his inspiring contribution to the fashion industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-madhur-bhandarkar-remembers-rohit-bal-fashion-will-never-be-the-same-2626813-2024-11-01",
      "headline": "Director Madhur Bhandarkar remembers Rohit Bal: Fashion will never be the sameFilmmaker Madhur Bhandarkar spoke to us in an exclusive interview, and remembered his friend, the late designer Rohit Bal, who died on Friday, November 1, after battling heart issues. He called him a visionary and remarked that the fashion industry would never be the same without him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rest-in-style-gudda-bollywood-celebs-line-up-to-bid-farewell-to-rohit-bal-2626780-2024-11-01",
      "headline": "Rest in style, Gudda: Bollywood celebs line up to bid farewell to Rohit BalKareena Kapoor Khan, Ananya Panday, Aditi Rao Hydari and Sonam Kapoor, among others posted emotional tributes for the late designer Rohit Bal after he died battling heart issues on Friday, November 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohit-bal-death-sonam-kapoor-shares-emotional-tribute-for-gudda-celebrating-diwali-in-your-creation-2626765-2024-11-01",
      "headline": "Sonam Kapoor's tribute to 'Gudda' Rohit Bal: Celebrating Diwali in your creationFashion designer Rohit Bal died on Friday after suffering from a heart issue. His friend and actor Sonam Kapoor shared an emotional tribute on social media, wearing one of his creations to celebrate Diwali. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-a-vs-india-a-sai-sudharsan-hundred-unofficial-test-2626849-2024-11-02",
      "headline": "Sai Sudharsan continues golden form, hits hundred in Australia Australia vs India A, 1st unofficial Test: Sai Sudharsan continued his dream run in first-class cricket, scoring his maiden hundred on Australian soil on Saturday, November 2. Sai has hit three hundreds in three different countries in the last three months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-form-mumbai-test-dinesh-karthik-2626843-2024-11-02",
      "headline": "Rohit Sharma not out of form, but choosing poor shots: Dinesh KarthikIndia vs. New Zealand, 3rd Test: Former India batter Dinesh Karthik has claimed that Rohit Sharma's issue is not form but the nature of his shot selection. Rohit, on Day 1, got out for 18 runs, edging Matt Henry behind the stumps.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-were-lucky-to-build-some-pressure-on-india-daryl-mitchell-2626811-2024-11-01",
      "headline": "New Zealand were lucky to build some pressure on India: Mitchell IND vs NZ, 3rd Test: Daryl Mitchell said that New Zealand were lucky to build some pressure on India late on Day 1 of the third Test at the Wankhede Stadium in Mumbai. India are still trailing by 149 runs with six wickets in hand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elena-rybakina-coach-novak-djokovic-wta-finals-2626803-2024-11-01",
      "headline": "Rybakina hires Djokovic's former coach Goran IvanisevicWorld No.5 Elena Rybakina has hired Novak Djokovic's former coach Goran Ivanisevic, who won the Wimbledon 2001 as a wildcard. With Ivanisevic as coach, Djokovic won nine out of his 24 Grand Slam singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/upbeat-mitchell-aiming-cleansweep-vs-india-bunch-of-kiwis-taking-on-the-world-2626773-2024-11-01",
      "headline": "Upbeat Mitchell aiming cleansweep vs India: Bunch of Kiwis taking on the worldNew Zealand batter Daryl Mitchell was upbeat after New Zealand managed to pull back the control of the Test match late on Day 1. Mitchell said nonchalantly that they were a bunch of Kiwis trying to take on the world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wta-finals-2024-schedule-format-live-streaming-aryna-sabalenka-iga-swiatek-2626736-2024-11-01",
      "headline": "WTA Finals 2024: Groups, schedule, format and all you need to know WTA Finals 2024: Iga Swiatek, Aryna Sabalenka, Coco Gauff, Jasmine Paolini, Elena Rybakina and other stars will light up the tournament which is scheduled to take place from November 2 to 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/football-in-spain-postponed-after-deadly-floods-devastate-southern-parts-2626738-2024-11-01",
      "headline": "Football in Spain postponed after deadly floods devastate southern partsThe Copa del Rey matches involving Valencia and Levante have been postponed due to devastating floods in southern Spain, which have resulted in at least 95 fatalities and significant disruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-tears-into-virat-kohli-after-terrible-run-out-in-mumbai-2626733-2024-11-01",
      "headline": "Mohammed Kaif tears into Virat Kohli after terrible run-out in MumbaiFormer India player Mohammed Kaif tore into Virat Kohli for his needless run-out on Day 1 of the Mumbai Test match. Kaif said that if India are to reach the WTC Final, Kohli has to minimise his errors.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-ricky-ponting-entertaining-franchise-2626727-2024-11-01",
      "headline": "Want PBKS to be the 'most entertaining franchise' in IPL 2025: PontingIPL 2025: Ricky Ponting has set his goals clear as he wants Punjab Kings to be the most exciting team in the upcoming season. PBKS have not played in the playoffs since finishing as the runners-up in 2014. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/former-india-para-athlete-and-activist-suvarna-raj-wins-un-sdg-action-award-2626713-2024-11-01",
      "headline": "India para-athlete and activist Suvarna Raj wins UN SDG action awardSuvarna Raj, a celebrated para-athlete and passionate disability rights activist, has won the 2024 United Nations SDG Action Award. Suvarna has been honoured as a Changemaker Finalist for her relentless work in championing accessibility, empowerment, and social inclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odis-shakib-al-hasan-najmul-shanto-2626687-2024-11-01",
      "headline": "No Shakib in Bangladesh squad for Afghanistan ODIs, Shanto stays captain AFG vs BAN: Bangladesh named a strong squad for their upcoming ODI series against Afghanistan to be held in November in Sharjah. Veteran all-rounder Shakib Al Hasan isn't a part of the squad. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/football-in-spain-postponed-after-deadly-floods-devastate-southern-parts-2626738-2024-11-01",
      "headline": "Football in Spain postponed after deadly floods devastate southern partsThe Copa del Rey matches involving Valencia and Levante have been postponed due to devastating floods in southern Spain, which have resulted in at least 95 fatalities and significant disruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-tears-into-virat-kohli-after-terrible-run-out-in-mumbai-2626733-2024-11-01",
      "headline": "Mohammed Kaif tears into Virat Kohli after terrible run-out in MumbaiFormer India player Mohammed Kaif tore into Virat Kohli for his needless run-out on Day 1 of the Mumbai Test match. Kaif said that if India are to reach the WTC Final, Kohli has to minimise his errors.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-ricky-ponting-entertaining-franchise-2626727-2024-11-01",
      "headline": "Want PBKS to be the 'most entertaining franchise' in IPL 2025: PontingIPL 2025: Ricky Ponting has set his goals clear as he wants Punjab Kings to be the most exciting team in the upcoming season. PBKS have not played in the playoffs since finishing as the runners-up in 2014. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/former-india-para-athlete-and-activist-suvarna-raj-wins-un-sdg-action-award-2626713-2024-11-01",
      "headline": "India para-athlete and activist Suvarna Raj wins UN SDG action awardSuvarna Raj, a celebrated para-athlete and passionate disability rights activist, has won the 2024 United Nations SDG Action Award. Suvarna has been honoured as a Changemaker Finalist for her relentless work in championing accessibility, empowerment, and social inclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odis-shakib-al-hasan-najmul-shanto-2626687-2024-11-01",
      "headline": "No Shakib in Bangladesh squad for Afghanistan ODIs, Shanto stays captain AFG vs BAN: Bangladesh named a strong squad for their upcoming ODI series against Afghanistan to be held in November in Sharjah. Veteran all-rounder Shakib Al Hasan isn't a part of the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pcb-assures-visa-issuance-indian-fans-pakistan-2626659-2024-11-01",
      "headline": "Champions Trophy: PCB assures visa issuance to Indian fans if they travel Pakistan PCB Chairman Mohsin Naqvi, who also serves as the Federal Interior Minister, announced on Friday that there will be an efficient visa issuance policy for Indian fans planning to visit Pakistan for the ICC Champions Trophy early next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kolkatas-3-year-old-anish-sarkar-becomes-youngest-rated-chess-player-in-history-2626657-2024-11-01",
      "headline": "3-year-old Anish Sarkar becomes youngest rated chess player in historyAt just three years, eight months, and 19 days, Anish Sarkar from north Kolkata became the youngest rated chess player in history. Born on January 26, 2021, Anish made his debut in competitive chess with the West Bengal state Under-9 Open.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-shocked-at-indias-late-collapse-on-day-1-happened-in-10-minutes-2626652-2024-11-01",
      "headline": "Jadeja shocked at India's late collapse: Happened in 10 minutesIndia all-rounder Ravindra Jadeja was shocked at the team's collapse late on Day 1 of the 3rd Test match. Jadeja said that things happened very fast and the dressing room did not even get time to react as India suffered a mini-collapse in 10 minutes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-3rd-test-match-day-1-ravindra-jadeja-press-conference-2626637-2024-11-01",
      "headline": "Did not want to lose a home Test series in my career: Ravindra JadejaIndia all-rounder Ravindra Jadeja has said that he did not want to lose a home Test series in his entire career, but his worst fears came true when India surrendered the series against New Zealand in the first two Tests. Jadeja spoke about India's mini-collapse and how the team can return back to a strong position in this game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retentions-shreyas-iyer-kkr-venky-mysore-2626635-2024-11-01",
      "headline": "KKR wanted Shreyas as team's 1st retention: Venky MysoreVenky Mysore, the KKR CEO, opened up on why Shreyas Iyer wasn't retained in the IPL 2025 Retentions. Last season, the Knight Riders won the title after beating Sunrisers Hyderabad in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-big-technical-flaw-a-real-concern-for-india-anil-kumble-2626623-2024-11-01",
      "headline": "Rohit's big technical flaw a real concern for India: Anil KumbleFormer cricketers Anil Kumble and Simon Doull pointed at Rohit Sharma's glaring technical issue with the bat. Sharma continued his poor form on Day 1 of the Mumbai Test, falling to Matt Henry for 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-doull-ravichandran-ashwin-washington-sundar-ind-vs-nz-mumbai-virat-kohli-2626597-2024-11-01",
      "headline": "Simon Doull highlights R Ashwin's inconsistency amid Washington Sundar's riseFormer New Zealand cricketer Simon Doull has highlighted star India spinner Ravichandran Ashwin's glaring inconsistency amid Washington Sundar's rise as premier wicket-taking bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-r-ashwin-washington-sundar-mumbai-tests-2626592-2024-11-01",
      "headline": "Don't play four seamers: Doull backs Sundar over Ashwin in Australia IND vs NZ: Simon Doull said that Washington Sundar should be a part of the Indian playing XI for the upcoming Border-Gavaskar Trophy in Australia. Sundar is the top wicket-taker in the New Zealand Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retentions-shreyas-iyer-kkr-venky-mysore-2626635-2024-11-01",
      "headline": "KKR wanted Shreyas as team's 1st retention: Venky MysoreVenky Mysore, the KKR CEO, opened up on why Shreyas Iyer wasn't retained in the IPL 2025 Retentions. Last season, the Knight Riders won the title after beating Sunrisers Hyderabad in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-big-technical-flaw-a-real-concern-for-india-anil-kumble-2626623-2024-11-01",
      "headline": "Rohit's big technical flaw a real concern for India: Anil KumbleFormer cricketers Anil Kumble and Simon Doull pointed at Rohit Sharma's glaring technical issue with the bat. Sharma continued his poor form on Day 1 of the Mumbai Test, falling to Matt Henry for 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-doull-ravichandran-ashwin-washington-sundar-ind-vs-nz-mumbai-virat-kohli-2626597-2024-11-01",
      "headline": "Simon Doull highlights R Ashwin's inconsistency amid Washington Sundar's riseFormer New Zealand cricketer Simon Doull has highlighted star India spinner Ravichandran Ashwin's glaring inconsistency amid Washington Sundar's rise as premier wicket-taking bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-r-ashwin-washington-sundar-mumbai-tests-2626592-2024-11-01",
      "headline": "Don't play four seamers: Doull backs Sundar over Ashwin in Australia IND vs NZ: Simon Doull said that Washington Sundar should be a part of the Indian playing XI for the upcoming Border-Gavaskar Trophy in Australia. Sundar is the top wicket-taker in the New Zealand Test series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-india-vs-new-zealand-3rd-test-2626576-2024-11-01",
      "headline": "Sometimes what you fear, comes true: Jadeja on losing home Test seriesIndia all-rounder Ravindra Jadeja reacted to India's meltdown on Day 1 of the Mumbai Test match and said that the worst nightmares have come true. Jadeja said that India of course did not want to lose the Test series at home but they would take the learnings and move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-simon-doull-mohammed-siraj-virat-kohli-mumbai-test-2626573-2024-11-01",
      "headline": "IND vs NZ: Simon Doull slams India for sending Mohammed Siraj as nightwatchmanFormer New Zealand cricketer Simon Doull has slammed the Indian team management for sending Mohammed Siraj as night watchman on Day 1 of the first Test against New Zealand in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-confirm-ruben-amorim-as-new-manager-to-replace-erik-ten-hag-2626548-2024-11-01",
      "headline": "Manchester United confirm Ruben Amorim as new manager to replace Erik ten HagManchester United confirmed on November 1, Friday that they have made Ruben Amorim their new manager. Amorim will be taking over as United manager after they sacked Erik ten Hag after a poor start to the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-virat-kohli-run-out-mumbai-anil-kumble-2626543-2024-11-01",
      "headline": "Virat Kohli run-out suicidal, India cannot afford such collapses: Anil KumbleAnil Kumble has termed Virat Kohli's run-out on Day 1 of the Mumbai Test against New Zealand as 'suicidal'. India lost control after Kohli's dismissal, ending the day at 86 for 4, trailing by 149 runs."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}