{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-group-says-ed-attached-assets-belong-to-rcom-not-part-of-group-since-2019-2823468-2025-11-20",
      "headline": "Reliance Group says ED-attached assets belong to RCom, not part of group since 2019The ED, meanwhile, detailed its searches across Tamil Nadu in a land-forgery and inflated compensation scam involving forged deeds, dummy buyers and layered transactions, seizing and freezing assets worth Rs 18.10 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-you-get-itr-refund-december-2025-cbdt-chairman-ravi-agrawal-delay-reason-2823254-2025-11-20",
      "headline": "Waiting for your tax refund? Here's why it's delayed and when it may arriveAccording to the Income Tax Department, more than 7.57 crore returns were filed by September 23, yet refunds for many taxpayers remain pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-nearly-450-points-higher-nifty-nears-life-time-high-2823139-2025-11-20",
      "headline": "Sensex ends nearly 450 points higher, Nifty nears life-time highThe S&P BSE Sensex rose 446.21 points to close at 85,632.68, while the NSE Nifty50 climbed 139.50 points to finish at 26,192.15. Broader indices were mixed, but the tone across frontline stocks remained firmly positive, led by gains in heavyweight financial counters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-500-points-nifty-nears-life-time-high-whats-driving-the-rally-2823064-2025-11-20",
      "headline": "Sensex surges 500 points, Nifty nears life-time high. What's driving the rally?At 1.58 am, the S&P BSE Sensex was up 526.63 points to 85,713.10, while the NSE Nifty50 hit a fresh 52-week high and was nearing an all-time high of 26,277. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-falls-for-second-day-tumbles-10-post-listing-rally-over-2823020-2025-11-20",
      "headline": "Groww share price falls 10% again: Is the post-listing rally over?Around 1:12 pm, shares of the company were trading 9.18% lower at Rs 154.30. Over the last two sessions, the stock has slipped nearly 18%, a sharp reversal that has investors wondering whether the post-listing rally has already run its course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/leading-e-commerce-platforms-say-they-now-comply-with-anti-dark-pattern-rules-2823001-2025-11-20",
      "headline": "Leading e-commerce platforms say they now comply with anti–dark pattern rulesAmong the 26 companies listed by the CCPA are well-known names such as Flipkart, Myntra, Zomato, Swiggy, Meesho, BigBasket, JioMart and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/the-new-trade-playbook-why-the-world-needs-a-more-distributed-system-2822970-2025-11-20",
      "headline": "The new trade playbook: Why the world needs a more distributed systemThese shifts are not driven by a single factor but by the combined influence of policy changes, supply chain lessons from recent years, and the evolving priorities of businesses and governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-for-beginners-rs-5000-monthly-investment-tips-how-to-make-1-crore-stock-market-investing-2822963-2025-11-20",
      "headline": "Investing Rs 5,000 every month in SIPs? This is when you can hit Rs 1 crorePeople know SIPs are useful, they hear stories of long-term gains, and they see friends investing every month, but when it comes to choosing where to put a small amount like Rs 5,000, most feel lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ed-attaches-anil-ambani-linked-assets-worth-rs-1400-crore-total-nears-rs-9000-crore-2822929-2025-11-20",
      "headline": "ED attaches Anil Ambani-linked assets worth Rs 1,400 crore; total nears Rs 9,000 croreThe latest attachment has been made under the Prevention of Money Laundering Act (PMLA). The properties are located across Navi Mumbai, Chennai, Pune and Bhubaneswar, the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/considering-personal-loan-for-holiday-travel-ask-these-5-questions-first-2822904-2025-11-20",
      "headline": "Considering a personal loan for holiday travel? Ask these 5 questions firstFunding that year-end getaway through an instant personal loan might seem like a savvy move, but it is important to assess the need thoroughly. An impulsive decision may be overshadowing some important financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-powers-share-price-zooms-10-today-why-is-it-rising-today-2822883-2025-11-20",
      "headline": "JP Power share price zooms 10%. Why is it rising today?JP Power, which was trading at Rs 22.37, gained over 10% in early trade as investors reacted to clarity on the future of the JP Group's stressed assets. JAL, the former promoter entity, holds close to 24% stake in JP Power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-falling-today-why-reason-down-8-percent-two-day-slide-billionbrains-stock-lower-circuit-2822879-2025-11-20",
      "headline": "Groww shares down 8% again: Why Billionbrains stock is falling todayGroww has been under pressure for two consecutive days. On Wednesday, the stock had already slipped around 10%. This comes after the company made a strong market debut, listing at Rs 112, about 12% higher than its issue price of Rs 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-150-points-nifty-crosses-26000-adani-enterprises-gains-1-2822865-2025-11-20",
      "headline": "Sensex rises over 150 points, Nifty crosses 26,000; Groww shares tumble 7%The S&P BSE Sensex climbed over 150 points in early trade, while the NSE Nifty50 moved past the 26,000 mark, signalling a mildly bullish undertone across the market. Broader indices also edged higher, mirroring gains in frontline stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-emi-loan-harassment-digital-lending-expert-panel-india-2822580-2025-11-19",
      "headline": "When missed EMIs become a nightmare: Inside India's loan harassment trapBehind India's digital lending rise is a quieter story of calls, pressure and fear. Data suggests that loan recovery harassment is growing at a pace the system can no longer keep up with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/stock-market-closing-bell-sensex-ends-500-points-higher-nifty-above-26000-it-shares-rise-hcltech-gains-4-percent-2822531-2025-11-19",
      "headline": "Sensex ends 500 points higher, Nifty above 26,000; HCLTech gains 4%The S&P BSE Sensex jumped 513.45 points to close at 85,186.47, while the NSE Nifty50 gained 142.60 points to end at 26,052.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indian-wedding-insurance-how-to-get-when-premium-middle-class-luxury-shadi-destination-2822529-2025-11-19",
      "headline": "Big fat Indian weddings can now be insured. Should you get one?India is gearing up for one of its busiest wedding seasons ever. In 2025 alone, nearly 46 lakh weddings are expected, generating close to Rs 6.5 lakh crore in spending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/he-lost-rs-40000-expert-explains-how-online-gaming-apps-trap-users-2822483-2025-11-19",
      "headline": "He lost Rs 40,000: Expert explains how online gaming apps trap usersExpert says insiders from gaming firms have revealed how these apps operate. They label heavy spenders as \"whales\" and have teams calling them daily to push more deposits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-open-bidding-subscribe-skip-expert-review-what-gmp-signals-2822438-2025-11-19",
      "headline": "Excelsoft Technologies IPO open for bidding: Should you subscribe? Check GMPExcelsoft Technologies aims to raise Rs 500 crore through the IPO, which includes a fresh issue of 1.50 crore shares worth Rs 180 crore and an offer for sale (OFS) of 2.67 crore shares worth Rs 320 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wrong-member-id-linked-to-your-uan-here-how-epfo-lets-you-fix-it-2822407-2025-11-19",
      "headline": "Wrong member ID linked to your UAN? Here's how EPFO lets you fix itMany employees discover that their UAN has been linked to a wrong member ID, often due to job changes or data errors. EPFO has introduced an easy online method to fix this, without visiting any office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-every-day-micro-payments-eat-into-your-savings-2822376-2025-11-19",
      "headline": "How every day micro-payments eat into your savingsWelcome to India's new spending reality, the age of micro-payments that silently seep into your accounts and cause invisible leaks. By the end of the month, many people find their digital wallets, likePaytm, PhonePe, Google Pay, have quietly leaked hundreds and thousands of rupees."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-title-capital-l-choice-explained-director-ss-rajamouli-clarity-audience-impact-2823453-2025-11-20",
      "headline": "Why Baahubali has a capital L, producer finally explains The unique capitalisation in the 'Baahubali' film title, with only the final 'L' capitalised, has drawn widespread curiosity and sparked online discussion, highlighting SS Rajamouli's attention to detail and the film's substantial influence on Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-artificial-intelligence-recreates-mohammed-rafi-voice-kashmir-concert-2823396-2025-11-20",
      "headline": "Sonu Nigam sings AI-powered duet with Mohammed Rafi, winning fan praise Singer Sonu Nigam integrates artificial intelligence in a live tribute to Mohammed Rafi at the Sher-i-Kashmir International Convocation Complex, marking the first major event in the Valley since the Pahalgam attack and drawing enthusiastic reactions both at the venue and online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-pothineni-praises-upendras-popularity-in-telugu-states-andhra-king-taluka-trailer-2823369-2025-11-20",
      "headline": "Ram Pothineni on casting Upendra in Andhra King Taluka: He's a Telugu star Telugu actor Ram Pothineni, while promoting his next film 'Andhra King Taluka' in Bengaluru revealed why they chose to cast Kannada star Upendra to play a Telugu superstar in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/enhypen-belift-lab-donate-philippines-flood-recovery-2823371-2025-11-20",
      "headline": "ENHYPEN donates $68,200 to support Philippines flood relief K-pop group ENHYPEN and their label BELIFT LAB have pledged PHP 4 million to aid recovery efforts in the Philippines following severe flooding, working with disaster relief organisations to ensure the donation reaches affected communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-armaan-malik-claims-tanya-mittal-tried-to-instigate-amaal-against-him-2823336-2025-11-20",
      "headline": "Bigg Boss 19: Armaan Malik claims Tanya Mittal tried to instigate Amaal against him During Family Week on 'Bigg Boss 19', Amaal Mallik was moved by his brother Armaan Malik's entry. The brothers confronted Tanya Mittal's attempts to create a family rift, sparking controversy inside the house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-tamil-drama-dulquer-salmaan-rana-daggubati-positive-reviews-steady-box-office-2823308-2025-11-20",
      "headline": "Bhagyashri Borse recalls being hesitant to slap Dulquer Salmaan in Kaantha Actor Bhagyashri Borse and director Selvamani Selvaraj reflect on filming a demanding scene for Kaantha, highlighting the pursuit of authenticity and the film's ongoing box office performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keerthy-suresh-reflects-mahanati-role-shaping-career-upcoming-revolver-rita-release-2823240-2025-11-20",
      "headline": "Keerthy Suresh says Mahanati still defines her identity as an actor Keerthy Suresh discussed her iconic role in 'Mahanati', its influence on her career, and how it has become a standard for comparison for other actor's performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-in-sunny-deol-gabru-reports-of-extended-special-appearance-emerge-2823324-2025-11-20",
      "headline": "Salman Khan in Sunny Deol's Gabru? Reports of extended special appearance emerge Salman Khan will appear in an extended special role across three scenes in Sunny Deol's film 'Gabru', directed by Shashank Udapurkar. A source confirmed Salman quietly shot the entertaining part over a year ago, motivated by his close relationship with Sunny, whom he last starred with in 1996's 'Jeet'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-kriti-sanon-calls-dhanush-incredible-actor-recalls-magical-moments-2823307-2025-11-20",
      "headline": "Tere Ishk Mein: Kriti Sanon calls Dhanush incredible actor, recalls magical moments Kriti Sanon shares her experience working with Dhanush in the film 'Tere Ishk Mein', highlighting the collaborative process and the chemistry that shaped their performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-padda-viral-video-dating-rumours-fan-frenzy-karan-johar-2823197-2025-11-20",
      "headline": "They are yet not official: Did KJo just confirm Ahaan-Aneet's relationship? Filmmaker Karan Johar recently spoke about the on-screen chemistry between Ahaan Panday and Aneet Padda in Mohit Suri's new film 'Saiyaara'. The director also hinted at their dating speculation among fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-gaurav-khanna-wife-dismisses-astrologer-prediction-on-having-child-2823262-2025-11-20",
      "headline": "Bigg Boss 19: Gaurav Khanna's wife dismisses astrologer prediction on having child During 'Bigg Boss 19' Family Week, Gaurav Khanna's wife Akanksha Chamola dismissed rumours about starting a family. Her candid response sparked conversations on responsibility and personal choices in motherhood among housemates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-nc24-myth-rooted-thriller-high-budget-intense-action-2823285-2025-11-20",
      "headline": "Naga Chaitanya's NC24 gets behind-the-scenes reveal in new video. Watch A behind-the-scenes video offers a rare glimpse into the making of 'NC24', the upcoming film starring Naga Chaitanya and Meenakshi Chaudary. The video highlights the production's ambition, technical expertise, and the extensive preparations underway in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emotional-or-physical-cheating-govinda-wife-sunita-ahuja-takes-her-pick-after-twinkle-khanna-remark-2823263-2025-11-20",
      "headline": "Emotional or physical cheating? Sunita Ahuja takes her pick after Twinkle's remark Sunita Ahuja breaks her silence on emotional vs physical cheating, calling emotional betrayal the most painful as she reflects on 38 years of marriage with Govinda, rumours of divorce, and the pressures of being a star's wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoj-bajpayee-family-man-3-funeral-moment-fans-await-season-4-2823243-2025-11-20",
      "headline": "Manoj Bajpayee was asked about The Family Man 3 while heading to father's funeral Actor Manoj Bajpayee shared a bizarre incident of being asked about 'The Family Man 3' while travelling to his father's funeral. The actor also expressed optimism about the arrival of Season 4 amid fan excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-set-to-team-up-with-adoor-gopalakrishnan-after-30-years-report-2823211-2025-11-20",
      "headline": "Mammootty set to team up with Adoor Gopalakrishnan after 30 years: Report The legendary Mammootty-Adoor Gopalakrishnan duo, behind classics like 'Mathilukal' and 'Vidheyan', are reportedly set to reunite after three decades for a screen adaptation of 'Randidangazhi', marking Adoor's return to direction after eight years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-warned-sao-paulo-nazi-references-interlagos-concert-2823251-2025-11-20",
      "headline": "Kanye West told Nazi remarks at upcoming show could lead to immediate arrest Rapper Kanye West faces legal action if he mentions Nazis or displays Nazi-related imagery during his upcoming Sao Paulo performance, following the outcry over his recent song and repeated anti-semitic remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadu-center-basketball-teenage-struggles-substance-abuse-jiohotstar-2823182-2025-11-20",
      "headline": "Nadu Center first impression: A slow start to a basketball-themed series 'Nadu Center' is a slow-paced basketball drama focusing on teenage challenges. The series highlights substance abuse and mental health issues among adolescents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/full-meals-kannada-romantic-drama-review-vinayaka-n-likith-shetty-khushee-ravi-2823125-2025-11-20",
      "headline": "Full Meals review: A decent love triangle tale that delivers in bits and piecesRelease Date:Thu Nov 20, 2025 Full Meals film review: The Kannada romantic drama written and directed by Vinayaka N, presents a love triangle between Likith Shetty, Khushee Ravi and Thejaswini Sharma, where the ladies battle it out to get Lucky (Likith)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-mighty-nein-chaotic-charming-surprisingly-emotional-2823117-2025-11-20",
      "headline": "The Mighty Nein review: Chaotic, charming, and surprisingly emotionalRelease Date:Wed Nov 19, 2025 'The Mighty Nein' on Prime Video delivers a dark, character-driven fantasy packed with emotional depth, sharp humour, stunning animation and rich world-building.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ten-dk-shivakumar-camp-mlas-rush-to-delhi-as-congress-hits-25-year-mark-in-karnataka-2823195-2025-11-20",
      "headline": "Crisis in Karnataka Congress? Shivakumar MLAs rush to Delhi to seek power-sharingAfter the 2023 Karnataka Assembly elections, intense negotiations between Siddaramaiah and Shivakumar culminated in the latter accepting the Deputy CM post. At the time, multiple reports suggested a 2.5-year rotational chief minister arrangement, though the Congress never confirmed it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/two-teachers-headmistress-among-four-suspended-after-fir-registered-for-suicide-abetment-2823424-2025-11-20",
      "headline": "Teachers, headmistress among 4 suspended for abetting Delhi student's suicideThe class 10 student jumped in front of a metro train at the Rajendra Place station on Wednesday afternoon. He was rushed to the nearby BLK Hospital, where he was declared dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kashmir-times-jammu-office-raided-ak-rifle-cartridges-rounds-of-pistols-recovered-2823164-2025-11-20",
      "headline": "Kashmir Times office raided, AK rifle cartridges recovered; editors slam actionThe editors condemned the raid as a \"coordinated attempt to silence independent journalism,\" insisting that criticising the government is not inimical to the state and calling on authorities to withdraw the charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/police-show-sharjeel-imams-inflammatory-videos-ahead-of-2020-delhi-riots-to-supreme-court-2823188-2025-11-20",
      "headline": "India Today accesses Sharjeel Imam videos played before court to oppose bail pleaThe Delhi Police showed the video to the court while opposing Sharjeel Imam's bail plea, calling him one of the chief conspirators of the Delhi riots which were orchestrated to topple the government and were not spontaneous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/doctor-going-through-perimenopause-exactly-how-i-am-managing-it-dr-jaishree-sharad-2822465-2025-11-20",
      "headline": "I'm a doctor going through perimenopause, and here's exactly how I'm managing itA dermatologist's first-hand journey through the science, skin, and soul of hormonal change - perimenopause."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ludhiana-gunfight-pakistan-isi-backed-terrorists-punjab-encounter-lawrence-bishnoi-ties-found-2823393-2025-11-20",
      "headline": "2 ISI-backed terrorists injured in Punjab encounter; Lawrence Bishnoi ties foundFollowing the encounter, Ludhiana Police Commissioner Swapan Sharma rushed to the site and said this was a terror module operating with the support of Pakistan's ISI and was planning a major attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-receives-sweeping-us-peace-proposal-as-zelenskyy-faces-mounting-pressures-glbs-2823474-2025-11-21",
      "headline": "Ukraine receives sweeping US peace proposal as Zelenskyy faces mounting pressuresThe US has delivered a major peace plan urging Ukrainian concessions, prompting tensions with Europe as Kyiv faces battlefield setbacks and political turmoil. Zelenskyy and Washington will now negotiate the proposal's contentious points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-7-crore-cash-van-robbery-cctv-suspected-recce-identified-suspect-police-2823021-2025-11-20",
      "headline": "Recce before Money Heist in Bengaluru: Men posing as tax officials rob ATM van of croresPolice probing the Rs 7 crore cash van robbery in Bengaluru have identified a suspect by matching CCTV footage with past records. Investigators believe the same gang is linked to earlier ATM robbery cases. A citywide manhunt is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-rules-out-deadlines-for-president-governor-assent-on-bills-whats-next-2823471-2025-11-21",
      "headline": "Court rules out deadlines for President, Governor assent on bills: What's next?The Supreme Court's opinion contradicted a two-judge bench ruling mandating governors and the President decide on state bills within three months. Experts say the two-judge bench judgment remains binding until a larger bench overturns it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-1st-test-preview-australia-vs-england-pitch-team-news-perth-2823329-2025-11-20",
      "headline": "Let the Ashes begin: Ben Stokes leads a fearless England into the furnaceAshes 1st Test preview: Bazball meets its fiercest examination as England storm into Australia with swagger, scars, and something to prove. The rivalry is crackling, the barbs are flying, and the stage in Perth is primed for a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/republican-nikki-haley-son-nalin-calls-to-for-limit-on-international-students-in-american-university-h1b-visa-us-visa-trump-2823335-2025-11-20",
      "headline": "Nikki Haley's son wants US to cap foreign students, says some are spiesNalin Haley, son of Indian-American Republican leader Nikki Haley, doubled down on his anti-immigration stance, saying naturalised citizens should not hold public office days after calling to end H-1B visas and legal immigration. He also urged the US government to limit foreign students, alleging some are \"spies\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/honeymoon-travel-trends-top-destinations-india-international-2823249-2025-11-20",
      "headline": "Honeymoon diaries: What's on Indian newlyweds' bucketlist?Today's newlyweds are splitting their honeymoon into two chapters: a quick minimoon and a grand, big-moon. Here's how much they're investing in love, and the destinations winning their hearts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-prime-minister-smriti-mandhana-palash-muchhal-engagement-congratulations-2823318-2025-11-20",
      "headline": "PM Modi congratulates Smriti Mandhana and Palash Mucchal, wedding on November 23PM Narendra Modi wished Smriti Mandhana and Palash Muchhal on their engagement. The letter from PM Modi also stated that the couple are set to get married on November 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nia-arrests-four-more-prime-accused-in-red-fort-blast-total-six-held-2823180-2025-11-20",
      "headline": "Delhi blast: Bomber's aide, woman doctor among 4 arrested by NIA; total arrests 6NIA has identified the accused as Dr Muzammil Shakeel Ganai of Pulwama (Jammu and Kashmir), Dr Adeel Ahmed Rather of Anantnag (Jammu and Kashmir), Dr Shaheen Saeed of Lucknow (UP), and Mufti Irfan Ahmad Wagay of Shopian (Jammu and Kashmir)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-seafood-industry-exporters-benefit-surge-china-japan-dispute-taiwan-japanese-pm-sanae-takaichi-row-senkaku-islands-2822985-2025-11-20",
      "headline": "Indian seafood a great hit in China as Beijing takes on TokyoIndian seafood exports to China have been rising amid Beijing's clampdown on imports from Japan. Beijing on Wednesday imposed a complete ban on Japanese seafood imports amid a diplomatic battle over Taiwan. Shares of Indian seafood exporters surged soon after, pointing towards potential gains for the sector, which was hit by steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-woman-gives-caffeine-to-11-year-old-boy-sexually-assaults-him-multiple-times-2823440-2025-11-20",
      "headline": "US woman gives caffeine to 11-year-old boy, sexually assaults him multiple timesThe 44-year-old woman further confessed to the police that she lured the boy by offering him to buy Apple AirPods and a gun that fired plastic pellets, convinced him to sneak out of his home, gave him caffeinated drinks to keep him awake, and sexually exploited him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-bride-dances-with-groom-after-jaimala-disappears-by-morning-before-vidaai-2823260-2025-11-20",
      "headline": "UP bride dances with groom after jaimala, disappears by morning before vidaaiThe groom's family has now filed a complaint against the bride's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-immigration-fees-set-to-increase-in-2026-fiscal-year-how-will-it-impact-indians-parole-esta-visa-waiver-dhs-obbba-2823143-2025-11-20",
      "headline": "US immigration fees set to increase in 2026. Will it impact Indians?The US Department of Homeland Security has announced inflation-adjusted visa and border fees, effective January 1, 2026, under the One Big Beautiful Bill Act. Parole fees will increase from $1,000 to $1,020. Here's how the new changes to immigration-related fees will affect Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/nuremberg-trials-at-80-the-nazi-trial-that-reshaped-human-rights-2823286-2025-11-20",
      "headline": "Nuremberg, the 80-year-old Nazi trial that defined genocide, reshaped human rightsEighty years after the Nuremberg Trials, the world revisits the historic moment when the Allies gathered in a ruined German city to hold the architects of the Holocaust -- the top Nazi leaders and organisations — accountable for genocide, mass murder and crimes against humanity, reshaping international law forever. The trials built the legal frameworks that still guide human rights today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-student-assaulted-speaking-hindi-kalyan-dies-by-suicide-2823118-2025-11-20",
      "headline": "Thrashed for speaking Hindi, 19-year-old student dies by suicide in MaharashtraA 19-year-old Kalyan student died by suicide after allegedly being assaulted in a local train for speaking Hindi. Police have begun investigating the incident, which has sparked debate over rising language-related tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/industry-less-bihar-drops-industries-minister-uproar-as-nitish-mishra-benched-by-nitish-kumar-nda-government-2823295-2025-11-20",
      "headline": "Industry-less Bihar drops industrious minister, uproar as Nitish Mishra is benchedNitish Kumar, who took oath as the CM of Bihar for the 10th time, dropped former industry minister Nitish Mishra from his ministry. This sparked outrage as people called Nitish Mishra a meritorious minister who worked hard to get industries to the industry-less state in his last stint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-assembly-elections-opposition-cries-foul-sir-numbers-different-story-2823461-2025-11-20",
      "headline": "As Opposition cries foul over Bihar SIR, numbers tell a different story. Here's howIndia Today carried out a detailed analysis and revealed that the relationship between SIR-linked changes and electoral outcomes in Bihar was anything but straightforward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/remove-all-non-compliant-ors-products-immediately-food-regulator-fssai-to-states-2823378-2025-11-20",
      "headline": "Remove all non-compliant ORS products immediately: Food regulator FSSAI to statesThe order came after the body learnt that several fruit-based beverages, ready-to-serve drinks, electrolyte drinks, and similar ORS-related products were marketed and were sold under brand names or descriptions, carrying the term 'ORS.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-title-capital-l-choice-explained-director-ss-rajamouli-clarity-audience-impact-2823453-2025-11-20",
      "headline": "Why Baahubali has a capital L, producer finally explainsThe unique capitalisation in the 'Baahubali' film title, with only the final 'L' capitalised, has drawn widespread curiosity and sparked online discussion, highlighting SS Rajamouli's attention to detail and the film's substantial influence on Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-artificial-intelligence-recreates-mohammed-rafi-voice-kashmir-concert-2823396-2025-11-20",
      "headline": "Sonu Nigam sings AI-powered duet with Mohammed Rafi, winning fan praiseSinger Sonu Nigam integrates artificial intelligence in a live tribute to Mohammed Rafi at the Sher-i-Kashmir International Convocation Complex, marking the first major event in the Valley since the Pahalgam attack and drawing enthusiastic reactions both at the venue and online."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-fc-pm-narendra-modi-letter-isl-crisis-aiff-tender-india-fifa-ranking-2823456-2025-11-20",
      "headline": "East Bengal urges PM Modi to intervene as ISL crisis grips Indian football East Bengal has urged Prime Minister Narendra Modi to step in as uncertainty grips the ISL. With the national team also slipping rapidly, the club's message reflects just how serious Indian football's crisis has become."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-all-round-show-zimbabwe-thrash-sri-lanka-by-67-runs-t20i-tri-series-2823449-2025-11-20",
      "headline": "Sikandar Raza's all-round show help Zimbabwe stun Sri Lanka by 67 runs Sikandar Raza led Zimbabwe with an all-round performance to defeat Sri Lanka by 67 runs in Match 2 of the T20I Tri Series at Rawalpindi Cricket Stadium. The victory helped Zimbabwe climb to the top of the tri-series points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-hits-back-steve-smith-2018-ball-tampering-ashes-test-2823430-2025-11-20",
      "headline": "Panesar hits back at Smith: My mistakes were on TV, his were on cricket field Monty Panesar has responded to Steve Smith's mocking remarks ahead of the first Ashes Test in Perth. Smith had recalled Panesar's embarrassing appearance on the British quiz show Mastermind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ryan-williams-india-football-fifa-approval-citizenship-elgible-aiff-2823399-2025-11-20",
      "headline": "Ryan Willaims officially eligible for India selection after FIFA approval Ryan Williams has finally received FIFA clearance to represent India, ending the long wait for his international eligibility. The Bengaluru FC forward is now officially available for selection for the Blue Tigers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-prediction-ponting-backs-england-two-test-wins-aus-vs-eng-2823368-2025-11-20",
      "headline": "Ponting makes bold prediction for England in Ashes 2025 despite poor past record Ricky Ponting expects a fiercely competitive Ashes 2025-26 series, backing England to win two Tests in Australia but ultimately tipping the hosts for a narrow 3-2 victory with no drawn matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-australia-vs-england-first-test-perth-squad-live-streaming-session-timings-2823334-2025-11-20",
      "headline": "Ashes live streaming in India: When and where to watch AUS vs ENG 1st Test The Ashes 2025-26 series kicks off with Australia hosting England at Perth's Optus Stadium for the first Test. England haven't won a Test in Australia since 2011 while Australia are holding the Ashes since 2017-18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikhat-zareen-world-boxing-cup-gold-medal-5th-51-kg-category-paris-olympics-ghosts-2823337-2025-11-20",
      "headline": "Nikhat Zareen wins 5th World Boxing Gold for India: Buries ghosts from Paris games Nikhat Zareen clinched gold in the 51 kg category at the World Boxing Cup Finals, sealing India's fifth gold medal from the women's boxing contingent at the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-1st-test-preview-australia-vs-england-pitch-team-news-perth-2823329-2025-11-20",
      "headline": "Let the Ashes begin: Ben Stokes leads a fearless England into the furnace Ashes 1st Test preview: Bazball meets its fiercest examination as England storm into Australia with swagger, scars, and something to prove. The rivalry is crackling, the barbs are flying, and the stage in Perth is primed for a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-prime-minister-smriti-mandhana-palash-muchhal-engagement-congratulations-2823318-2025-11-20",
      "headline": "PM Modi congratulates Smriti Mandhana and Palash Mucchal, wedding on November 23 PM Narendra Modi wished Smriti Mandhana and Palash Muchhal on their engagement. The letter from PM Modi also stated that the couple are set to get married on November 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-kagiso-rabada-injury-update-guwahati-test-piet-botha-south-africa-2823293-2025-11-20",
      "headline": "IND vs SA: South Africa to decide on Rabada, Harmer cleared for 2nd Test in Guwahati South Africa bowling coach Piet Botha has said that a final call on Kagiso Rabada's participation in the Guwahati Test will be made on the eve of the match. Rabada missed the first Test due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-fiery-reply-to-virat-kohli-shoulder-charge-boxing-day-test-mcg-2823245-2025-11-20",
      "headline": "Sam Konstas' fiery reply to Kohli after shoulder charge revealed by Oliver Peake Sam Konstas' debut in the Boxing Day Test featured a notable exchange with India star Virat Kohli who shoulder charged him. Oliver Peake has finally lifted the lid on what transpired between the two during the heated incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikhat-zareen-world-boxing-cup-gold-medal-5th-51-kg-category-paris-olympics-ghosts-2823337-2025-11-20",
      "headline": "Nikhat Zareen wins 5th World Boxing Gold for India: Buries ghosts from Paris games Nikhat Zareen clinched gold in the 51 kg category at the World Boxing Cup Finals, sealing India's fifth gold medal from the women's boxing contingent at the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-1st-test-preview-australia-vs-england-pitch-team-news-perth-2823329-2025-11-20",
      "headline": "Let the Ashes begin: Ben Stokes leads a fearless England into the furnace Ashes 1st Test preview: Bazball meets its fiercest examination as England storm into Australia with swagger, scars, and something to prove. The rivalry is crackling, the barbs are flying, and the stage in Perth is primed for a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-prime-minister-smriti-mandhana-palash-muchhal-engagement-congratulations-2823318-2025-11-20",
      "headline": "PM Modi congratulates Smriti Mandhana and Palash Mucchal, wedding on November 23 PM Narendra Modi wished Smriti Mandhana and Palash Muchhal on their engagement. The letter from PM Modi also stated that the couple are set to get married on November 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-kagiso-rabada-injury-update-guwahati-test-piet-botha-south-africa-2823293-2025-11-20",
      "headline": "IND vs SA: South Africa to decide on Rabada, Harmer cleared for 2nd Test in Guwahati South Africa bowling coach Piet Botha has said that a final call on Kagiso Rabada's participation in the Guwahati Test will be made on the eve of the match. Rabada missed the first Test due to an injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-fiery-reply-to-virat-kohli-shoulder-charge-boxing-day-test-mcg-2823245-2025-11-20",
      "headline": "Sam Konstas' fiery reply to Kohli after shoulder charge revealed by Oliver Peake Sam Konstas' debut in the Boxing Day Test featured a notable exchange with India star Virat Kohli who shoulder charged him. Oliver Peake has finally lifted the lid on what transpired between the two during the heated incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-washington-sundar-number-three-sitanshu-kothak-2823276-2025-11-20",
      "headline": "Washington Sundar at No.3: India batting coach defends decision for Kolkata TestIndia batting coach Sitanshu Kothak has defended the decision to use Washington Sundar as the No.3 batter during the Kolkata Test. Sundar scored 29 and 31 during the match and looked India's best batter during the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/russell-crowe-ashes-australian-roots-cricket-connection-joe-rogan-commentary-shane-warne-2823265-2025-11-20",
      "headline": "The Ashes and Russell Crowe: A cricketing connection few know aboutRussell Crowe's Ashes excitement highlights a lesser-known cricket connection shaped by heritage, family ties and moments that link the actor closely to the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchal-engagement-funny-video-jememah-rodrigues-2823261-2025-11-20",
      "headline": "Watch: Smriti Mandhana confirms engagement with Palash Muchhal in hilarious reelIn a fun and light-hearted moment, Smriti Mandhana confirmed her engagement by flashing her ring in a playful dance video with her teammates. The video featuring many of the India World Cup winners, has gone viral on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-withholds-ashes-test-xi-announcement-australia-names-two-debutants-perth-opener-2823247-2025-11-20",
      "headline": "England break away from usual tradition for Perth Test against AustraliaEngland break with their usual practice by postponing their playing XI for the opening Ashes Test against Australia. England are set to make a call on choosing Mark Wood or Shoaib Bashir in the lineup for the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-rishabh-pant-captaincy-can-handle-ricky-ponting-2823242-2025-11-20",
      "headline": "Rishabh Pant can handle India captaincy in 2nd Test vs South Africa: Ricky PontingRicky Ponting has backed Rishabh Pant to handle India's Test captaincy if needed, citing his calmness, experience as a wicketkeeper, and proven leadership during their years together at Delhi Capitals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/india-fifa-ranking-drop-lowest-afc-asian-cup-bangladesh-loss-isl-chaos-2823239-2025-11-20",
      "headline": "India drops to worst FIFA ranking in almost a decade after Bangladesh lossIndia's latest rankings drop is not just about lost matches, but lost direction. With defeats piling up and uncertainty off the pitch, the Blue Tigers face a defining moment that demands urgent clarity and change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-gautam-gambhir-advice-shubman-gill-workload-management-2823214-2025-11-20",
      "headline": "Asked Gambhir about Gill's workload, he suggested to skip IPL: Aakash ChopraAakash Chopra reveals Gautam Gambhir's advice on managing Shubman Gill's heavy workload amid injury concerns. Gill injured his neck during first Test against South Africa at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-withholds-ashes-test-xi-announcement-australia-names-two-debutants-perth-opener-2823247-2025-11-20",
      "headline": "England break away from usual tradition for Perth Test against AustraliaEngland break with their usual practice by postponing their playing XI for the opening Ashes Test against Australia. England are set to make a call on choosing Mark Wood or Shoaib Bashir in the lineup for the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-rishabh-pant-captaincy-can-handle-ricky-ponting-2823242-2025-11-20",
      "headline": "Rishabh Pant can handle India captaincy in 2nd Test vs South Africa: Ricky PontingRicky Ponting has backed Rishabh Pant to handle India's Test captaincy if needed, citing his calmness, experience as a wicketkeeper, and proven leadership during their years together at Delhi Capitals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/india-fifa-ranking-drop-lowest-afc-asian-cup-bangladesh-loss-isl-chaos-2823239-2025-11-20",
      "headline": "India drops to worst FIFA ranking in almost a decade after Bangladesh lossIndia's latest rankings drop is not just about lost matches, but lost direction. With defeats piling up and uncertainty off the pitch, the Blue Tigers face a defining moment that demands urgent clarity and change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-gautam-gambhir-advice-shubman-gill-workload-management-2823214-2025-11-20",
      "headline": "Asked Gambhir about Gill's workload, he suggested to skip IPL: Aakash ChopraAakash Chopra reveals Gautam Gambhir's advice on managing Shubman Gill's heavy workload amid injury concerns. Gill injured his neck during first Test against South Africa at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-score-476-three-century-partnerships-andy-mcbrine-six-wickets-dhaka-test-2823190-2025-11-20",
      "headline": "BAN vs IRE: Bangladesh in control after Litton, Mushfiqur hundredsBangladesh capitalised on strong partnerships to reach 476 before being bowled out on Day 2 in Dhaka, with Andy McBrine claiming six wickets. Mushfiqur Rahim and Litton Das' hundreds and a disciplined performance by the bowlers put the hosts in a strong position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2025-26-meg-lanning-smash-135-wpl-auction-delhi-capitals-release-2823194-2025-11-20",
      "headline": "Fresh off DC release, Meg Lanning proves she's got it with 135 before WPL auctionsMeg Lanning delivered a WBBL masterclass just days after being released by Delhi Capitals, sending a powerful reminder of her value ahead of the WPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-chopra-defends-gambhir-player-rotation-india-transition-phase-2823170-2025-11-20",
      "headline": "Are India experimenting too much with the Test team? Aakash Chopra explainsAakash Chopra has defended Gautam Gambhir's use of 24 players in just 18 months as India's Test coach, saying the churn reflects an unavoidable transition period rather than excessive experimentation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-skips-virat-kohli-hails-joe-root-steve-smith-best-batters-of-generation-2823133-2025-11-20",
      "headline": "Stokes overlooks Kohli, hails Root and Smith as top batters of this generationBen Stokes has identified Joe Root and Steve Smith as the greatest batters of their generation before the opening Ashes Test, leaving out Virat Kohli. England and Australia are set to take on each other in the first Ashes Test on November 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-backs-ben-stokes-england-to-win-ashes-in-australia-2823148-2025-11-20",
      "headline": "England have tools to win in Australia: Michael Vaughan backs Ben StokesFormer England captain Michael Vaughan has said he believes the Ben Stokes-led side have \"the tools\" to win their first Ashes series Down Under since 2010–11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-lose-wuhan-jiganda-afc-womens-champions-league-match-report-2823152-2025-11-20",
      "headline": "East Bengal lose 0-2 to Wuhan Jiangda in AFC Women's Champions LeagueEast Bengal were outplayed early but not outclassed entirely, with Panthoi's heroics preventing further damage. Now, everything rests on the Nasaf clash as they fight to keep their knockout dream alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-advances-australian-open-quarterfinals-win-kodai-naraoka-2823111-2025-11-20",
      "headline": "Australian Open: Satwik-Chirag and Shetty advance, HS Prannoy bows outAyush Shetty progressed to the Australian Open quarterfinals with a straight-games victory over World No.9 Kodai Naraoka, while top-seeded Satwiksairaj Rankireddy and Chirag Shetty also secured their place in the last eight. HS Prannoy's early exit continued his disappointing run this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-ashes-2025-26-england-performance-define-progress-2823098-2025-11-20",
      "headline": "England's performance in Ashes 2025 will define their progress: Brendon McCullumEngland head coach Brendon McCullum believes that their performance in the upcoming Ashes tour will define how far this team has come. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}