{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-formula-1-racing-dream-taxation-roadblock-motorsport-entertainment-tax-2761667-2025-07-26",
      "headline": "How taxes drove Formula 1 out of IndiaFormula 1 didn't leave India because of a lack of fans or infrastructure. It left because of unclear policies, tax confusion, and a system that didn't treat it like a sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-hires-chatgpt-co-creator-as-chief-scientist-to-lead-new-ai-lab-glbs-2761556-2025-07-26",
      "headline": "Meta hires ChatGPT co-creator as chief scientist to lead new AI labMeta has appointed ChatGPT co-creator Shengjia Zhao as chief scientist of its new Superintelligence Lab, aiming to advance AGI and regain AI leadership after Llama 4's weak performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/explained-why-india-uk-free-trade-agreement-is-a-big-deal-for-both-nations-2761520-2025-07-25",
      "headline": "Explained: Why India-UK free trade agreement is a big deal for both nationsIndia and the United Kingdom have formally sealed a Comprehensive Economic and Trade Agreement, a deal described as the \"biggest, most economically significant trade deal that the UK has made since leaving the EU.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-comstar-denies-coercion-claims-by-sunjay-kapurs-mother-defends-agm-2761391-2025-07-25",
      "headline": "Not a shareholder, no coercion: Sunjay Kapur's firm counters mother's chargesThe clarification comes after it was reported that Rani Kapur had written a letter to delay the AGM and alleged that she was made to sign documents shortly after her son's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-hailed-as-key-post-brexit-success-by-the-british-media-2761344-2025-07-25",
      "headline": "Remainers will choke on their cornflakes: British media hails India trade dealThe India-UK Free Trade Agreement (FTA) or the Comprehensive Economic and Trade Agreement (CETA) seeks to enhance bilateral trade by around USD 34 billion annually, besides ensuring better market access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ftas-with-eu-us-in-talks-says-commerce-secretary-after-india-uk-trade-deal-2761327-2025-07-25",
      "headline": "FTAs with EU, US in talks, says Commerce Secretary after India-UK trade dealThe agreement now needs to pass through both houses of the British Parliament. A special committee will study it before giving final approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-721-points-lower-nifty-below-24900-bajaj-finance-falls-5-2761243-2025-07-25",
      "headline": "Sensex ends 721 points lower, Nifty below 24,900; Bajaj Finance falls 5%The S&P BSE Sensex was down 721.08 points to 81,463.09 at the closing bell, while the NSE Nifty50 declined 225.10 points to trade at 24,837. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother alleges business coercion, attempt to 'usurp family legacy'Rani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "This key agreement in UK trade deal will hugely benefit Indian firms, workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-has-to-file-itr-by-when-all-2025-deadlines-explained-income-tax-filing-2761076-2025-07-25",
      "headline": "Who has to file ITR by when? All 2025 deadlines explainedFiling your ITR on time can save you from paying extra penalties. But not everyone has the same deadline this year. Here's a quick look at who must file by when for the 2025 cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-why-stock-markets-are-in-the-red-today-2761014-2025-07-25",
      "headline": "Sensex tumbles over 700 points: Why stock markets are in the red today The benchmark S&P BSE Sensex fell 624.64 points to 81,559.53 by 10:41 am, while the NSE Nifty50 slipped 215.85 points to 24,846.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-gain-11-percent-why-reason-q1-results-indian-energy-exchange-stock-up-2761005-2025-07-25",
      "headline": "Explained: Why IEX share price gained 11% todayIEX stock opened at Rs 137.00 today, higher than the previous close of Rs 132.45. It climbed further to touch a high of Rs 149.45 in morning trade. As of 9:37 am, the share was trading at Rs 146.80, up 10.84%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-bajaj-finance-shares-tumbled-up-to-6-percent-despite-strong-q1-results-2761000-2025-07-25",
      "headline": "Explained: Why Bajaj Finance shares tumbled 6% despite strong Q1 resultsThe Bajaj Finance stock was down 5.42% at Rs 907 on the BSE at around 9:28 am, while Bajaj Finserv also fell nearly 5%. Bajaj Finance touched an intraday low of Rs 898.10, marking a 6.3% decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-ipo-check-price-band-gmp-key-dates-issue-size-and-more-2760994-2025-07-25",
      "headline": "NSDL IPO: Check price band, GMP, key dates, issue size and moreThe IPO, a pure offer for sale, aims to raise Rs 4,011 crore. It will open for subscription on July 30 and close on August 1, with anchor bids starting a day earlier on July 29."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-falls-300-points-at-opening-nifty-below-25000-bajaj-finance-tanks-5-percent-2760986-2025-07-25",
      "headline": "Sensex falls 300 points at opening, Nifty below 25,000; Bajaj Finance tanks 5%The S&P BSE Sensex was down by 389.42 points to 81,794.75, while the NSE Nifty50 lost 133.70 points to 24,928.40 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-q1-results-indian-energy-exchange-stock-in-focus-why-cerc-market-coupling-2760976-2025-07-25",
      "headline": "IEX stock: Indian Energy Exchange shares to be in focus today. Here's whyIEX shares fell sharply on Thursday, July 24. The stock dropped as much as 28% and touched a 52-week low of Rs 135.26 on the BSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-layoffs-25000-job-cut-ceo-lip-bu-tan-chipmaker-cost-cutting-tech-roles-us-report-restructuring-2760964-2025-07-25",
      "headline": "Intel layoffs: 25,000 roles at risk as company braces for big reset, says reportIn a letter to employees, Intel's new CEO Lip-Bu Tan acknowledged the difficult period the company is going through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-microsoft-tech-hiring-in-us-donald-trump-warning-indians-ai-race-america-first-policy-2760959-2025-07-25",
      "headline": "Why Donald Trump doesn't want Google, Microsoft to hire IndiansSpeaking at an AI Summit in Washington on Wednesday, Donald Trump said American companies must now put national interest first, especially in the fast-growing field of artificial intelligence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kristin-cabot-resigns-from-astronomer-after-viral-coldplay-kiss-cam-scandal-glbs-2760932-2025-07-25",
      "headline": "Kristin Cabot, Astronomer HR head, resigns after viral Coldplay kiss-cam scandalAstronomer's HR chief Kristin Cabot resigned days after being caught on a Coldplay kiss-cam with CEO Andy Byron, who also stepped down earlier amid the viral scandal and public backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunder-pichai-net-worth-hits-usd-1-billion-alphabet-shares-rise-quarterly-results-google-ceo-money-salary-2760915-2025-07-25",
      "headline": "Billionaire behind your browser: Sundar Pichai's net worth crosses $1 billionAlphabet stock has returned around 120% to investors since 2023 and is now trading close to its all-time high. This has benefited top executives, including Sundar Pichai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-uk-free-trade-deal-how-the-deal-could-boost-bilateral-trade-2760706-2025-07-24",
      "headline": "India-UK free trade deal: How the deal could boost bilateral tradeThe deal is expected to provide greater market access for Indian products and services, while UK companies, particularly in sectors like automobiles and medical equipment, will also benefit from reduced tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-some-purchases-are-priceless-startup-founder-shyam-achuthan-on-spending-and-living-well-2760739-2025-07-24",
      "headline": "Why some purchases are priceless: Startup founder on spending and living wellWe often treat money decisions like maths problems, but this startup founder says some buys, like a family car or your own home, bring wealth you can't count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-in-uk-for-fta-cheaper-scotch-and-cars-on-cards-2760695-2025-07-24",
      "headline": "PM Modi in UK for FTA: Cheaper scotch and cars on cardsPrime Minister Narendra Modi is in the UK for a meeting with the UK Prime Minister and is also expected to meet King Charles III, with the India-UK Free Trade Agreement (FTA) being the main focus. This agreement is set to provide significant market access to Indian sectors like fisheries, textiles, gems, jewellery, and leather, with a potential market size of $5.2 billion in the UK for the fisheries sector alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/money-matters-but-joy-matters-more-edelweiss-mutual-fund-radhika-gupta-mantra-for-life-2760708-2025-07-24",
      "headline": "Money matters, but joy matters more: Edelweiss' Radhika Gupta's mantra for lifeMany young earners feel constant pressure to save every rupee for the future. It's common to hear advice about building a fat retirement fund or aiming for the highest returns. But Radhika Gupta wants people to know that money is only useful if it also makes your present better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Whisky, chocolates, cars: What gets cheaper for Indians after UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-542-points-lower-nifty-below-25100-as-volatility-weighs-heavy-2760677-2025-07-24",
      "headline": "Sensex ends 542 points lower, Nifty below 25,100 as volatility weighs heavyThe S&P BSE Sensex ended 542.47 points lower at 82,184.17, while the NSE Nifty50 declined 157.80 points to close at 25,062.10. Selling pressure was visible across sectors, with FMCG, IT, and financial stocks dragging the indices down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-shopkeepers-are-turning-away-from-upi-payments-2760642-2025-07-24",
      "headline": "Small shopkeepers are turning away from UPI paymentsAccording to the National Payments Corporation of India (NPCI), UPI saw over 14.04 billion transactions in June 2024. Yet, for many at the grassroots, the system seems too complex and risky to fully embrace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/anil-ambani-ed-raid-today-reliance-power-infra-shares-down-5-percent-loan-fraud-2760636-2025-07-24",
      "headline": "ED raids hit Anil Ambani stocks: Reliance Power, Infra sink 5%Reliance Infrastructure has lost 9.37% in the past five trading sessions, Reliance Power has fallen by 7.41% during the same period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-heres-how-to-fix-it-to-avoid-penalty-2760613-2025-07-24",
      "headline": "Filed the wrong ITR form? Here's how to fix it to avoid penaltyMany taxpayers only spot mistakes after hitting 'Submit'. Filing the wrong form can snowball into bigger headaches later, from refund delays to unexpected penalties. But tax experts say you do have ways to set things right, provided you act quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex plunges 600 points. Why is the stock market down today?The S&P BSE Sensex dropped 592.85 points to 82,133.79 by 1:04 pm, while the NSE Nifty50 fell 169.25 points to 25,050.65. All broader market indices were in the red as market sentiment weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-penalty-for-missed-income-tax-deadlines-panel-suggests-in-new-income-tax-bill-2025-2760516-2025-07-24",
      "headline": "No penalty for missed income tax deadlines? Panel suggests in New Tax BillThe suggestions come from the Select Committee, which has studied the new Income Tax Bill, 2025. This new Bill is meant to replace the old Income Tax Act of 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-conducts-raids-on-properties-linked-to-anil-ambani-in-mumbai-2760503-2025-07-24",
      "headline": "ED conducts raids on properties linked to Anil Ambani in MumbaiThe Enforcement Directorate (ED) on Thursday carried out searches at multiple locations in Mumbai connected to industrialist Anil Ambani's companies, days after the State Bank of India (SBI) classified Reliance Communications and Ambani himself as 'fraud'. While his personal residence wasn't searched, ED teams from Delhi and Mumbai targeted premises tied to Reliance Anil Ambani Group (RAAGA) companies in connection with an ongoing money laundering investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-plunges-20-today-whats-behind-the-fall-2760496-2025-07-24",
      "headline": "IEX share price crashes 23% to hit 52-week low. What's behind the fall?IEX shares nosedived after CERC announced phased implementation of market coupling. The move aims to centralise price discovery, challenging IEX's dominance. Investors await clarity from the company's Q1FY26 results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-raids-anil-ambani-linked-premises-in-mumbai-days-after-sbi-declared-him-fraud-2760489-2025-07-24",
      "headline": "ED raids Anil Ambani-linked premises in Mumbai days after SBI's 'fraud' tagWhile Anil Ambani's personal residence was not part of the search operation, the ED teams from Delhi and Mumbai visited premises tied to some of his group companies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-how-much-jr-ntr-hrithik-roshan-earning-pay-cheque-ayan-mukerji-kiara-advani-2761925-2025-07-27",
      "headline": "War 2: How much Jr NTR and Hrithik Roshan are earning for Ayan Mukerji's filmWith excitement at an all-time high for 'War 2', fans would be eager to know how much Jr NTR and Hrithik Roshan earned for their role in Ayan Mukerji's upcoming action-entertainer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-opens-up-on-cosmetic-surgery-says-its-a-personal-choice-not-to-be-judged-2761838-2025-07-26",
      "headline": "Kajol opens up on cosmetic surgery, says it's a personal choice not to be judgedActor Kajol opened up about cosmetic surgery and aging, calling both personal choices that shouldn't be judged. She said aging is a privilege and not something to fear, adding that men also undergo cosmetic procedures just like women.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pakistani-tiktoker-sumeera-rajput-found-dead-daughter-alleges-forced-marriage-2761821-2025-07-26",
      "headline": "Pak TikToker found dead, daughter claims she was poisoned for refusing marriagePakistani TikToker Sumeera Rajput was found dead under suspicious circumstances in Sindh's Ghotki district, with her daughter alleging she was poisoned over pressure to marry forcibly. Two suspects have been arrested, but the motive remains unconfirmed as investigations continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-slams-trolls-age-shaming-marriage-2761795-2025-07-26",
      "headline": "Zareen Khan slams trolls for age-shaming: Will marriage make me young again?Actor Zareen Khan gave a sharp and witty response to an ageist troll who told her to get married because she's getting old. She questioned the mindset of people behind their words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-ektaa-kapoor-to-visit-nathdwara-temple-ahead-of-kyunki-saas-bhi-kabhi-bahu-thi-2-2761766-2025-07-26",
      "headline": "Smriti Irani, Ektaa Kapoor to visit Nathdwara temple ahead of Kyunki rebootSmriti Irani and Ektaa Kapoor will visit Nathdwara Temple in Rajasthan on July 27 to seek blessings ahead of the premiere of 'Kyunki Saas Bhi Kabhi Bahu Thi' Season 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-box-office-vijay-sethupathi-nithya-menen-earns-rs-4-crore-2761771-2025-07-26",
      "headline": "Thalaivan Thalaivii box office Day 1: Vijay Sethupathi's film earns Rs 4.15 crorePandiraj's Thalaivan Thalaivii, featuring Vijay Sethupathi and Nithya Menen, opened to an encouraging start at the box office, earning Rs 4.15 crore on day one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-shares-miss-india-connection-gauri-pradhan-kyunki-saas-bhi-bahu-thi-reboot-2761735-2025-07-26",
      "headline": "Smriti Irani shares Miss India connection with Gauri Pradhan ahead of Kyunki 2Actor-politician Smriti Irani shared that she and Gauri Pradhan were Miss India finalists in 1998, long before becoming the iconic saas-bahu duo in 'Kyunki Saas Bhi Kabhi Bahu Thi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-producer-sandra-thomas-files-nomination-burqa-legal-battle-film-chamber-kfpa-2761754-2025-07-26",
      "headline": "Malayalam producer files nomination in burqa after legal battle with film chamberMalayalam producer Sandra Thomas filed her nomination papers in a burqa amid a legal battle with the Kerala Film Producers Association (KFPA). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-returns-ramp-12-years-india-couture-week-2025-showstopper-falguni-shane-peacock-2761693-2025-07-26",
      "headline": "Akshay Kumar returns to ramp as showstopper after 12 years. WatchAkshay Kumar made a grand return to the ramp after 12 years as the showstopper for Falguni Shane Peacock at India Couture Week 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/seventeens-joshua-breathes-new-life-into-slanders-love-is-gone-2761710-2025-07-26",
      "headline": "SEVENTEEN's Joshua breathes new life into Slander's Love Is GoneSEVENTEEN's Joshua brings a heartfelt new twist to Love Is Gone with American DJs SLANDER, showcasing his unique vocal tone. This collaboration marks another step in his growing global music journey as SEVENTEEN gears up for their world tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-distributes-sweets-wraps-border-2-varun-dhawan-ahaan-shetty-2761705-2025-07-26",
      "headline": "Diljit distributes sweets as he wraps Border 2, Varun Dhawan, Ahan Shetty reactDiljit Dosanjh has wrapped the shooting of his upcoming film 'Border 2'. In a video shared by the singer-turned-actor, he distributed sweets on the sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-against-8-hour-shifts-deepika-padukone-spirit-2761649-2025-07-26",
      "headline": "Is Farah Khan against 8-hour shifts? Director reacts to ongoing buzzFilmmaker Farah Khan has hinted that she doesn't support the idea of an eight-hour workday in the film industry. Her remark comes amid the ongoing debate sparked by Deepika Padukone's reported exit from Spirit over work-hour demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-confirms-hera-pheri-3-announcement-soon-paresh-rawal-suniel-shetty-2761665-2025-07-26",
      "headline": "Akshay Kumar confirms return of Hera Pheri trio, says announcement coming soonAkshay Kumar has confirmed that all issues around 'Hera Pheri 3' have been resolved and the original team is reuniting. He assured fans that an official announcement would be made soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-praises-ahaan-panday-aneet-padda-saiyaara-success-welcomes-them-industry-mohit-suri-2761658-2025-07-26",
      "headline": "Akshay Kumar praises Ahaan-Aneet after Saiyaara success, welcomes them to industryAkshay Kumar shared his appreciation for 'Saiyaara'. The actor congratulated the entire team and praised newcomers Ahaan Panday and Aneet Padda. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mallika-sherawat-reacts-bhajan-mandali-singing-bheege-honth-in-mumbai-local-murder-emraan-hashmi-2761633-2025-07-26",
      "headline": "Mallika Sherawat reacts to mandali singing Bheege Honth in Mumbai local. WatchActor Mallika Sherawat shared a viral video of a bhajan mandali singing her iconic song 'Bheege Honth Tere' from 'Murder' inside a Mumbai local.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/curious-case-of-missing-dance-from-dance-numbers-no-choreography-only-clickbait-2760698-2025-07-26",
      "headline": "Curious case of missing dance from dance numbers - no choreography, only clickbaitOnce driven by choreography, dance numbers now rely on their potential to go viral. Industry insiders, including actors, directors, trade analysts, and choreographers, weigh in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ektaa-kapoor-denies-association-with-altt-amid-ban-for-vulgar-content-2761620-2025-07-26",
      "headline": "Ektaa Kapoor denies association with ALTT amid ban for vulgar contentTV Czarina Ektaa Kapoor denied her association with ALTT after the government banned the app for vulgar content. Kapoor stated that she had stepped down from her association with the app in June 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-box-office-marvel-film-earns-rs-5-crore-saiyaara-craze-pedro-pascal-2761603-2025-07-26",
      "headline": "Fantastic Four box office Day 1: Marvel film earns Rs 5 crore amid Saiyaara crazeMarvel Studios' 'The Fantastic Four: First Steps' opened modestly in India, earning Rs 5.10 crore on its first day, facing stiff competition from the Bollywood hit 'Saiyaara'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-pawan-kalyan-film-sees-a-huge-dip-2761599-2025-07-26",
      "headline": "Hari Hara Veera Mallu box office Day 2: Pawan Kalyan's film sees a huge dipPawan Kalyan's 'Hari Hara Veera Mallu' saw a sharp decline at the box office on its second day, earning Rs 8 crore after an impressive Rs 47.50 crore opening. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-brokers-ceasefire-talks-amid-escalating-thai-cambodian-border-clashes-glbs-2761881-2025-07-27",
      "headline": "Thailand, Cambodia have agreed to hold immediate ceasefire talks: TrumpUS President Donald Trump said Thailand and Cambodia agreed to hold immediate ceasefire talks after deadly border clashes. Both sides seek peace, while regional and international efforts push for a long-term resolution.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gaurav-gogoi-slams-himanta-sarma-pakistan-isi-allegation-bjp-smear-campaign-congress-2761884-2025-07-27",
      "headline": "Smear campaign: Gaurav Gogoi slams Himanta Sarma's ISI link allegation on his wifeCongress leader Gaurav Gogoi slammed Assam Chief Minister Himanta Biswa Sarma for linking his wife to Pakistan's ISI, calling it a BJP-led smear campaign. He accused the BJP of using defamation and propaganda to divert public attention.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/journey-of-hiv-positive-indians-from-death-to-marriage-certificate-aids-jeevansathi-matrimony-websites-ivf-2761670-2025-07-27",
      "headline": "From death certificate to marriage certificate: Journey of HIV-positive IndiansBeing declared HIV-positive was akin to a death sentence in India of the 1990s. With new medicines, lifespan is not an issue any more. And now, more and more HIV-positive individuals are getting married, and having healthy kids. Matrimonial sites have launched sections focused on HIV+ individuals. This is how science and activism have turned stigma into happily-ever-after stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shubman-gill-kl-rahul-test-day-5-2761899-2025-07-27",
      "headline": "750g of grit, 250g of luck: Can India cook up a great escape in Manchester?England vs India, 4th Test: Shubman Gill and KL Rahul ensured India lived to fight another day in the Anderson-Tendulkar Trophy. From 0 for 2, the Indian duo added 174 runs for the third wicket, setting up a cracking finish to the fourth Test in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/can-india-unite-for-its-biggest-war-2761448-2025-07-27",
      "headline": "Can India unite for its biggest war?The target is clear. India needs to be Viksit Bharat by 2047. But half of the second decade of this century is over like the two before. To make up for the lost decades, India needs to grow faster to be counted among high-income nations. AI is now challenging the very sector on which India grew for two decades. It's the time for reforms at a war-footing and manufacturing, not consents and dissents, but what the world needs. Because, for Indians, it is now or never."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-origin-man-33-attacked-with-machete-in-australia-says-it-went-through-his-wrist-2761918-2025-07-27",
      "headline": "Went through my wrist: Indian-origin man, 33, attacked with machete in AustraliaThe 33-year-old was ambushed outside a shopping centre, suffering multiple stab wounds, a fractured spine, and the near-severing of his hand in what police have described as a vicious assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/boeing-jet-catches-fire-on-runway-in-us-viral-videos-shows-panicked-passengers-slide-out-amid-smoke-2761912-2025-07-27",
      "headline": "Boeing jet catches fire on runway in US, panicked passengers slide out amid smokeThe plane, operating as Flight 3023 to Miami, was carrying 173 passengers and six crew members when the mechanical issue unfolded on Saturday afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/revamp-tensions-in-bjp-rss-why-the-sangh-stamp-is-all-over-2760614-2025-07-24",
      "headline": "Revamp tensions in BJP-RSS: Why the Sangh stamp is all overThe RSS is no longer content playing second fiddle. It is not just shaping state appointments in the BJP but also the central leadership transition"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-jabs-obama-with-oj-simpson-meme-amid-renewed-scrutiny-of-2016-russia-probe-glbs-2761886-2025-07-27",
      "headline": "Trump trolls Obama with OJ Simpson meme, starring JD Vance in college cameoTrump mocks Obama with an OJ Simpson meme and deepfake video as JD Vance's cameo goes viral, amid renewed scrutiny of 2016 Russia probe and explosive claims from DNI Tulsi Gabbard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-india-credit-for-kolhapuri-chappal-controversy-prada-2761898-2025-07-27",
      "headline": "India will get its due credit: Piyush Goyal on Kolhapuri chappal-Prada rowUnion Minister Piyush Goyal said India will receive rightful credit for the design of Kolhapuri chappals when exported. His remarks follow backlash over luxury brand Prada showcasing similar footwear without crediting Indian origins.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pune-mumbai-expressway-accident-vehicles-collision-dead-injured-2761885-2025-07-27",
      "headline": "16 vehicles collide on Pune-Mumbai Expressway, one dead, many injuredA major pile-up involving 16 vehicles on the Pune-Mumbai Expressway left one dead and caused heavy traffic disruption. The accident was reportedly triggered by a container truck's brake failure.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bahraich-love-jihad-case-hindu-men-kidnapped-assaulted-baba-group-fake-identity-2761897-2025-07-27",
      "headline": "Assaulted, forced to drink urine: UP men who reported 'love jihad' kidnappedTwo Hindu men in Uttar Pradesh's Bahraich alleged they were abducted, stripped, and tortured by a group after previously reporting a suspected 'love jihad' case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-most-runs-test-batter-joe-root-batting-blueprint-2761913-2025-07-27",
      "headline": "Patience, Honour, and Heart: The Joe Root blueprint for lasting successIn a game that so often idolises the spectacular and the brash, Joe Root's journey reminds us that true greatness is forged in patience, humility, and the relentless pursuit of self-improvement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-cancels-bhubaneswar-metro-project-naveen-patnaik-calls-it-shocking-2761872-2025-07-26",
      "headline": "Odisha cancels Bhubaneswar metro contract, Naveen Patnaik says people betrayedBJD chief Naveen Patnaik dropped a scathing post on social media criticising Odisha's Mohan Charan Manjhi government for calling off a contract with the Delhi Metro Rail Corporation (DMRC) for the Bhubaneswar metro project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-5-rain-weather-report-2761926-2025-07-27",
      "headline": "4th Test, Day 5 weather forecast: Will rain aid India's epic escape?India vs England: Shubman Gill and KL Rahul waged an epic fightback on Day 4 of the Manchester Test match. But if they are to save this game, and stay alive in the series, they will need help from the weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-udit-raj-calls-rahul-gandhi-second-br-ambedkar-bjp-slams-remark-2761906-2025-07-27",
      "headline": "Congress leader calls Rahul Gandhi 2nd Ambedkar, BJP decries insult of DalitsCongress leader Udit Raj compared Rahul Gandhi to Ambedkar, triggering strong backlash from BJP leaders who called it an insult to the Dalit icon. BJP demanded an apology from Congress for allegedly undermining Ambedkar's legacy.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-opens-up-on-cosmetic-surgery-says-its-a-personal-choice-not-to-be-judged-2761838-2025-07-26",
      "headline": "Kajol opens up on cosmetic surgery, says it's a personal choice not to be judgedActor Kajol opened up about cosmetic surgery and aging, calling both personal choices that shouldn't be judged. She said aging is a privilege and not something to fear, adding that men also undergo cosmetic procedures just like women.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/reminds-me-of-india-pakistan-conflict-trump-on-thailand-cambodia-border-clash-glbs-2761891-2025-07-27",
      "headline": "Trump likens Thailand-Cambodia border clash to India-Pakistan conflictUS President Donald Trump compared the Thailand-Cambodia border clash to the India-Pakistan conflict, urging both nations to halt hostilities as violence intensifies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/11-stabbed-at-walmart-in-michigans-traverse-city-suspect-in-custody-glbs-2761893-2025-07-27",
      "headline": "11 injured in mass stabbing at Walmart store in Michigan, suspect arrestedA 42-year-old man walked into the Walmart store at around 4.45 pm and used a folding knife to stab 11 people before being restrained by bystanders and arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/theres-still-hope-delhis-old-vehicle-ban-to-be-reviewed-by-supreme-court-2761856-2025-07-26",
      "headline": "There's still hope: Delhi's old vehicle ban to be reviewed by Supreme CourtThe Supreme Court will hear a pivotal plea on July 28 that could overturn Delhi's controversial ban on older vehicles, offering hope to old vehicle owners facing unfair and non-scientific, end-of-life restrictions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-was-wwe-wrestler-hulk-hogan-wife-sky-daily-how-was-his-relationship-with-her-jennifer-mcdaniel-linda-claridge-2761336-2025-07-26",
      "headline": "Who is Sky Daily, Hulk Hogan's 3rd wife and last real-life tag-team partnerWWE Hall of Famer and actor Hulk Hogan passed away earlier this week due to cardiac arrest. The wrestling icon had many tag-team partners in the ring, but it was Sky Daily, his third wife, who became his real-life tag-team partner in the end. Sky, 25 years younger than Hogan, is a yoga instructor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/teen-driving-fathers-car-rams-kills-e-rickshaw-driver-delhi-case-dwarka-2761887-2025-07-27",
      "headline": "16-year-old driving father's car rams e-rickshaw, kills its driver in DelhiA 16-year-old boy, who was driving his father's car, rammed an e-rickshaw, killing its driver in Delhi. Police said the vehicle was being driven without a valid licence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-will-bat-for-india-on-day-5-confirms-sitanshu-kotak-2761878-2025-07-27",
      "headline": "Rishabh Pant will bat for India on Day 5 in Manchester, confirms batting coachIndia batting coach Sitanshu Kotak has confirmed that wicketkeeper batter Rishabh Pant will bat on Day 5 of the fourth Test against England at Old Trafford in Manchester. Pant suffered a toe fracture on Day 1 of the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-boy-student-dies-by-suicide-after-mother-scolds-him-for-playing-mobile-games-2761916-2025-07-27",
      "headline": "Boy, 14, dies by suicide in Lucknow after mother scolds him for playing gamesThe class 8 student was using his mobile phone at night when his mother, Kumodini, scolded him for not focusing on his studies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-ahaan-panday-aneet-padda-love-story-becomes-2nd-biggest-hit-chhaava-mohit-suri-2761928-2025-07-27",
      "headline": "Saiyaara box office Day 9: Ahaan-Aneet's love story becomes year's 2nd biggest hitMohit Suri's romantic drama 'Saiyaara', featuring Ahaan Panday and Aneet Padda, has raced into the Rs 200 crore club, collecting Rs 217.25 crore in India in just nine days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-how-much-jr-ntr-hrithik-roshan-earning-pay-cheque-ayan-mukerji-kiara-advani-2761925-2025-07-27",
      "headline": "War 2: How much Jr NTR and Hrithik Roshan are earning for Ayan Mukerji's filmWith excitement at an all-time high for 'War 2', fans would be eager to know how much Jr NTR and Hrithik Roshan earned for their role in Ayan Mukerji's upcoming action-entertainer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-opens-up-on-cosmetic-surgery-says-its-a-personal-choice-not-to-be-judged-2761838-2025-07-26",
      "headline": "Kajol opens up on cosmetic surgery, says it's a personal choice not to be judgedActor Kajol opened up about cosmetic surgery and aging, calling both personal choices that shouldn't be judged. She said aging is a privilege and not something to fear, adding that men also undergo cosmetic procedures just like women.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/samantha-ruth-prabhu-charms-in-yellow-as-she-arrives-in-mumbai-airport-2761809-2025-07-26",
      "headline": "Samantha Ruth Prabhu charms in yellow as she arrives in Mumbai. VideoSamantha Ruth Prabhu was seen at Mumbai airport on Saturday afternoon."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-batting-runs-india-vs-england-test-series-2761927-2025-07-27",
      "headline": "Better late than never: Rahul emerges out of shadows, makes merry in EnglandIndia vs England: With over 500 runs in the Anderson-Tendulkar Trophy, KL Rahul has finally embraced his role as the senior statesman for the tourists, emerging as the heartbeat of India's batting lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-5-rain-weather-report-2761926-2025-07-27",
      "headline": "4th Test, Day 5 weather forecast: Will rain aid India's epic escape?India vs England: Shubman Gill and KL Rahul waged an epic fightback on Day 4 of the Manchester Test match. But if they are to save this game, and stay alive in the series, they will need help from the weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-most-runs-test-batter-joe-root-batting-blueprint-2761913-2025-07-27",
      "headline": "Patience, Honour, and Heart: The Joe Root blueprint for lasting successIn a game that so often idolises the spectacular and the brash, Joe Root's journey reminds us that true greatness is forged in patience, humility, and the relentless pursuit of self-improvement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sitanshu-kotak-on-karun-nair-snub-gambhir-gill-2761883-2025-07-27",
      "headline": "Did India lose faith in Karun Nair? Batting coach explains Manchester selection callIndia's batting coach Sitanshu Kotak explained the reasoning behind dropping Karun Nair from the playing XI for the ongoing fourth Test against England at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shubman-gill-kl-rahul-test-day-5-2761899-2025-07-27",
      "headline": "750g of grit, 250g of luck: Can India cook up a great escape in Manchester?England vs India, 4th Test: Shubman Gill and KL Rahul ensured India lived to fight another day in the Anderson-Tendulkar Trophy. From 0 for 2, the Indian duo added 174 runs for the third wicket, setting up a cracking finish to the fourth Test in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-will-ben-stokes-bowl-on-day-5-in-manchester-2761882-2025-07-27",
      "headline": "Ben Stokes blow for England! Will England captain bowl on Day 5 in Manchester?Ben Stokes' availability to bowl on Day 5 of the fourth Test against India has come under question after the England captain was seen hobbling in the field following his 198-ball long innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-will-bat-for-india-on-day-5-confirms-sitanshu-kotak-2761878-2025-07-27",
      "headline": "Rishabh Pant will bat for India on Day 5 in Manchester, confirms batting coachIndia batting coach Sitanshu Kotak has confirmed that wicketkeeper batter Rishabh Pant will bat on Day 5 of the fourth Test against England at Old Trafford in Manchester. Pant suffered a toe fracture on Day 1 of the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-day-4-manchester-kl-rahul-shubman-gill-ben-stokes-2761871-2025-07-26",
      "headline": "India show spine as gritty Shubman Gill, KL Rahul drag Manchester Test into Day 5Defiant Shubman Gill and KL Rahul led India's fightback on Day 4 of the fourth Test against England at Old Trafford in Manchester. India finished the day on 174/2, trailing England by 137 runs in the second innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-vikas-kohli-bowling-manchester-test-2761863-2025-07-26",
      "headline": "Virat Kohli's brother takes dig at India's bowling flop show in Manchester TestIndia vs England, 4th Test: Virat Kohli's brother, Vikas Kohli, lamented the lack of firepower in India's bowling performance during the Manchester Test, contrasting it with the success the bowling unit enjoyed just a few years ago. India conceded 669 runs to England in the first innings of the fourth Test of the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-lose-china-open-to-malaysian-duo-2761850-2025-07-26",
      "headline": "China Open: Satwiksairaj, Chirag Shetty lose to familiar foes in semifinalsSatwiksairaj Rankireddy and Chirag Shetty were defeated by Aaron Chia and Soh Wooi Yik i the semi-finals of the China Open. The loss continues their title drought as they continue to struggle against the second-ranked Malaysian pair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matt-henry-new-zealand-beat-south-africa-t20i-tri-series-final-2761848-2025-07-26",
      "headline": "New Zealand clinch thriller, seal T20 tri-series title vs South AfricaMatt Henry held his nerve in the final over to guide New Zealand to a nail-biting three-run win over South Africa in the final of the T20 tri-series at the Harare Sports Club on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-will-bat-for-india-on-day-5-confirms-sitanshu-kotak-2761878-2025-07-27",
      "headline": "Rishabh Pant will bat for India on Day 5 in Manchester, confirms batting coachIndia batting coach Sitanshu Kotak has confirmed that wicketkeeper batter Rishabh Pant will bat on Day 5 of the fourth Test against England at Old Trafford in Manchester. Pant suffered a toe fracture on Day 1 of the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-day-4-manchester-kl-rahul-shubman-gill-ben-stokes-2761871-2025-07-26",
      "headline": "India show spine as gritty Shubman Gill, KL Rahul drag Manchester Test into Day 5Defiant Shubman Gill and KL Rahul led India's fightback on Day 4 of the fourth Test against England at Old Trafford in Manchester. India finished the day on 174/2, trailing England by 137 runs in the second innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-vikas-kohli-bowling-manchester-test-2761863-2025-07-26",
      "headline": "Virat Kohli's brother takes dig at India's bowling flop show in Manchester TestIndia vs England, 4th Test: Virat Kohli's brother, Vikas Kohli, lamented the lack of firepower in India's bowling performance during the Manchester Test, contrasting it with the success the bowling unit enjoyed just a few years ago. India conceded 669 runs to England in the first innings of the fourth Test of the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-lose-china-open-to-malaysian-duo-2761850-2025-07-26",
      "headline": "China Open: Satwiksairaj, Chirag Shetty lose to familiar foes in semifinalsSatwiksairaj Rankireddy and Chirag Shetty were defeated by Aaron Chia and Soh Wooi Yik i the semi-finals of the China Open. The loss continues their title drought as they continue to struggle against the second-ranked Malaysian pair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matt-henry-new-zealand-beat-south-africa-t20i-tri-series-final-2761848-2025-07-26",
      "headline": "New Zealand clinch thriller, seal T20 tri-series title vs South AfricaMatt Henry held his nerve in the final over to guide New Zealand to a nail-biting three-run win over South Africa in the final of the T20 tri-series at the Harare Sports Club on Saturday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}