{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-orders-indigo-to-end-agreement-with-turkish-airlines-amid-diplomatic-tensions-2733472-2025-05-31",
      "headline": "India orders IndiGo to end agreement with Turkish Airlines amid diplomatic tensionsThe Indian government has ordered IndiGo Airlines to terminate its damp lease agreement with Turkish Airlines by August 31. This decision comes in response to Turkey's continued support for Pakistan against India. The aviation regulator DGCA has granted a final three-month extension to the current lease, which was set to expire on May 31. IndiGo is currently operating two Boeing aircraft on damp lease from Turkish Airlines. The move is part of India's broader response to Turkey's actions, including supplying arms to Pakistan and condemning India's Operation Sindhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-nagarjuna-invites-revanth-reddy-to-younger-son-akhil-akkineni-zainabs-wedding-2733723-2025-05-31",
      "headline": "Nagarjuna invites Revanth Reddy to younger son Akhil Akkineni-Zainab's weddingActor Nagarjuna met Telangana Chief Minister Revanth Reddy to extend the invitation to his son Akhil Akkineni's wedding with Zainab Ravdjee. He was accompanied by his wife Amala and the bride's parents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-aishwarya-rajinikanth-son-yathra-school-graducation-2733722-2025-05-31",
      "headline": "Dhanush, Aishwarya Rajinikanth come together for son's school graduation. PicsDhanush and Aishwarya Rajinikanth were proud parents as their eldest son, Yathra, graduated from school. The couple got divorced in November 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bring-back-chinmayi-samantha-supports-singer-after-viral-thug-life-performance-2733686-2025-05-31",
      "headline": "Bring back Chinmayi: Samantha supports singer after being shadow-banned for 8 yearsActor Samantha Ruth Prabhu shared singer Chinmayi Sripada's viral clip from 'Thug Life' music launch event. She questioned the ban on the singer since 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-wishes-lady-love-sobhita-dhulipala-on-birthday-with-vacation-pic-2733670-2025-05-31",
      "headline": "Naga Chaitanya wishes lady love Sobhita Dhulipala on birthday with vacation picActor Naga Chaitanya wished his wife Sobhita Dhuliapala on her thirty third birthday with a cute selfie. The post drew warm reactions from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-pickleball-with-raj-nidimoru-happy-weekend-2733668-2025-05-31",
      "headline": "Samantha plays pickleball with Raj Nidimoru, gives glimpse of her happy weekendActor Samantha Ruth Prabhu shared a clip of herself playing pickleball with director Raj Nidimoru. The two are rumoured to be dating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manushi-chhillar-calls-out-misogynistic-remarks-against-women-a-deep-rooted-bias-2733653-2025-05-31",
      "headline": "Manushi Chhillar calls out misogynistic remarks against women: A deep-rooted biasManushi Chhillar has spoken against the deep-rooted misogynistic mindset undermining women's success in the entertainment industry. She called out the disrespectful comments against women achievers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathis-ai-generated-image-as-hera-pheri-baburao-goes-viral-fans-react-2733612-2025-05-31",
      "headline": "Pankaj Tripathi's AI-generated image as Hera Pheri's Baburao goes viral, fans reactActor Pankaj Tripathi's AI-generated image as Baburao has caught the attention of internet users. The picture has led to debate over casting Tripathi in 'Hera Pheri 3' after Paresh Rawal's departure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-victim-of-terrorism-operation-sindoor-2733655-2025-05-31",
      "headline": "Anupam Kher, victim of terrorism, applauds Operation Sindoor: Felt vindicatedAnupam Kher shared his personal pain as a victim of terrorism and reflects on the plight of Kashmiri Pandits. He commended the Indian Army's Operation Sindoor and urged strong leadership to combat terrorism effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/the-academy-revisits-iconic-aamir-khan-song-radha-kaise-na-jale-from-lagaan-fans-call-it-legendary-2733575-2025-05-31",
      "headline": "The Academy revisits iconic Aamir Khan song from Lagaan, fans call it legendaryThe Academy revisited a clip of the popular song 'Radha Kaise Na Jale' from 'Lagaan' featuring Aamir Khan and Gracy Singh. Indian fans got nostalgic about the iconic track and the groundbreaking visuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-shah-homebound-cinematographer-sexual-harassment-over-20-women-complaint-2733616-2025-05-31",
      "headline": "Homebound cinematographer accused of sexual harassment. Dharma Productions reacts'Homebound' cinematographer Pratik Shah has been accused of sexually inappropriate behaviour. He deleted his Instagram profile after allegations from over 20 women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/priyanka-chopra-lara-dutta-casting-choice-director-suneel-darshan-in-andaaz-2733601-2025-05-31",
      "headline": "Nobody had faith in Priyanka Chopra: Director Suneel Darshan on Andaaz castingFilmmaker Suneel Darshan shared exclusive insights on the casting choices behind the 2003 hit 'Andaaz' that introduced Lara Dutta and Priyanka Chopra to Bollywood. The film's fresh pairing and Akshay Kumar's support played key roles in their breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-on-admiring-keanu-reeves-in-the-matrix-john-wick-i-dig-those-movies-2733552-2025-05-31",
      "headline": "Tom Cruise on admiring Keanu Reeves in The Matrix, John Wick: I dig those moviesActor Tom Cruise recently opened up about his admiration for 'Speed,' 'The Matrix' and 'John Wick' franchise featuring Keanu Reeves. The 'Mission Impossible: 8' actor praised Reeves for his charisma in his films."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-nadu-movie-ticket-price-reduce-thug-life-release-local-body-tax-2733572-2025-05-31",
      "headline": "Movie ticket prices to reduce in Tamil Nadu ahead of Thug Life release. Here's howTamil Nadu movie ticket prices will reduce after the government slashed the local body tax by half. Kamal Haasan had earlier appealed to the government to cut down the local body tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-kannappa-akshay-kumar-cameo-2733558-2025-05-31",
      "headline": "Wasn't easy to reach Akshay Kumar: Vishnu Manchu on star-studded Kannappa castingActor Vishnu Manchu discussed the emotional and creative process behind casting for 'Kannappa', a personal passion project for his father Mohan Babu. He highlighted the importance of personal relationships and support from industry veterans in bringing the project to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-bollywood-silence-operation-sindoor-hypocrisy-2733490-2025-05-31",
      "headline": "Javed Akhtar weighs in on Bollywood's silence on Operation SindoorJaved Akhtar addressed criticism of Bollywood's silence on Operation Sindoor, stressing that not everyone is obliged to speak. He also challenged the notion of expecting artistes to respond to all issues when there are risks involved."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-accuse-brother-manoj-manchu-theft-kannappa-hard-disk-2733481-2025-05-31",
      "headline": "Actor Vishnu Manchu accuses brother Manoj over alleged theft of Kannappa hard diskTelugu actor Vishnu Manchu accused his brother Manoj Manchu over the alleged theft of Kannappa's hard disk. Over the past few months, the brothers have been involved in a family feud, which resulted in Manoj being ousted from their father Mohan Babu's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-can-you-watch-the-tony-awards-this-year-streaming-details-inside-glbs-2733445-2025-05-31",
      "headline": "How can you watch the Tony Awards this year? Streaming details insideThe 2025 Tony Awards will be live on June 8 with top nominees, historic firsts, and a Hamilton cast reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emmy-winning-actress-and-mash-star-loretta-swit-dies-at-87-glbs-2733439-2025-05-31",
      "headline": "Emmy-winning actress and MASH star Loretta Swit dies at 87Loretta Swit, renowned for her role as Major Houlihan in MASH, has died at 87. The Emmy-winning actress redefined female roles on TV and was also a passionate animal rights advocate."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-president-mallikarjun-kharge-slams-centre-as-cds-general-anil-chauhan-admits-jet-loss-2733715-2025-05-31",
      "headline": "Government misled nation: Mallikarjun Kharge on top general's 'jets downed' remarkMallikarjun Kharge's attack came after CDS Chauhan said that an unspecified number of India's fighter jets were downed initially during Operation Sindoor precision strikes on May 7, but asserted that the armed forces rectified mistakes quickly to hit Islamabad again."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nia-conducts-searches-in-multiple-states-in-pakistan-linked-espionage-case-2733759-2025-05-31",
      "headline": "NIA conducts searches in multiple states in Pakistan-linked espionage caseNIA searches were conducted at the premises of suspects linked to Pakistani intelligence operatives in Delhi, Maharashtra (Mumbai), Haryana, Uttar Pradesh, Rajasthan, Chhattisgarh, Assam and West Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/palestinian-terror-group-hamas-leader-mohammad-sinwar-killed-may-13-strike-israeli-defence-forces-2733776-2025-05-31",
      "headline": "Israel claims it killed Hamas leader Mohammad Sinwar in May 13 strikeMohammad Sinwar was the younger brother of Yahya Sinwar, Hamas's deceased leader and the mastermind of the October 7, 2023 attack on Israel, who was killed by Israel in a military operation in the Gaza Strip last October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/active-covid-19-cases-india-kerala-maharashtra-highest-deaths-reported-health-ministry-2733740-2025-05-31",
      "headline": "Active Covid tally in India crosses 3,000-mark, 4 deaths reported so farFour deaths were reported in the past 24 hours as the number of active Covid-19 cases reached 3,395 across the country. Kerala has the most number of active cases so far, with 1,336."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/thailand-opal-suchata-crowned-miss-world-2025-winner-2733756-2025-05-31",
      "headline": "Thailand's Opal Suchata Chuangsri crowned Miss World 2025Thailand's Opal Suchata Chuangsri has won the Miss World 2025 title. Nandini Gupta represented India and made it to the top 20 finalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-general-ani-chauhan-india-lost-fighter-jets-operation-sindoor-pakistan-2733656-2025-05-31",
      "headline": "Understood mistakes, rectified them: Top General reflects on Op Sindoor lossesChief of Defence Staff General Anil Chauhan, however, dismissed the Pakistan Prime Minister's claims that it shot down six Indian jets, calling it 'absolutely incorrect'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-victim-of-terrorism-operation-sindoor-2733655-2025-05-31",
      "headline": "Anupam Kher, victim of terrorism, applauds Operation Sindoor: Felt vindicatedAnupam Kher shared his personal pain as a victim of terrorism and reflects on the plight of Kashmiri Pandits. He commended the Indian Army's Operation Sindoor and urged strong leadership to combat terrorism effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/drunk-man-detained-rams-car-into-group-civil-services-aspirants-pune-injured-2733763-2025-05-31",
      "headline": "13 injured after drunk man rams car into group of civil service aspirants in PuneAs many as 13 people were injured after a drunk driver rammed his car into them in Pune. A medical examination confirmed that the accused consumed alcohol at the time of the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtube-video-confirms-isi-trained-indian-spy-kasim-visited-pakistan-twice-2733661-2025-05-31",
      "headline": "'Feels like home': Interview video of Indian 'spy' in Pak alerted agenciesKasim was apprehended from the Deeg area of Mewat in Rajasthan on Thursday for allegedly spying at the behest of Pakistani intelligence agency Inter-Service Intelligence (ISI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jairam-ramesh-pm-modi-silence-donald-trump-india-pakistan-ceasefire-nuclear-war-2733634-2025-05-31",
      "headline": "9th time in 20 days: Jairam Ramesh asks PM to clarify 'Donaldbhai's' Pak claimThe fresh attack by Congress's Jairam Ramesh came as Trump reiterated his claim that he avoided a potential nuclear disaster by mediating the ceasefire between India and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/harvard-president-alan-garber-jab-donald-trump-speech-2025-batch-standing-ovation-2733586-2025-05-31",
      "headline": "Harvard president's dig at Trump with 'around the world' remark gets standing ovationHarvard University President Alan Garber's opening lines drew loud applause at the historic Tercentenary Theatre in Harvard Yard. This comes as the Donald Trump administration has been targeting the enrolment of international students at the institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-rubbishes-rumours-of-rift-with-hardik-pandya-2733695-2025-05-31",
      "headline": "Shubman Gill rubbishes rumours of rift with Hardik Pandya through Instagram storyStar India batter Shubman Gill rubbished rumours of rift with Hardik Pandya after clips of their awkward exchange at the toss ahead of Gujarat Titans vs Mumbai Indians Eliminator game went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jeff-bezoss-blue-origin-launches-six-customers-on-tourist-flight-to-space-2733709-2025-05-31",
      "headline": "Jeff Bezos's Blue Origin launches six customers on tourist flight to spaceThe suborbital flight lasted approximately 11 minutes, propelling the crew above the Kármán line—the internationally recognized boundary of space at 100 kilometers altitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hearing-of-charges-against-sheikh-hasina-to-be-aired-on-tv-in-bangladesh-tomorrow-2733770-2025-05-31",
      "headline": "Hearing of charges against Sheikh Hasina to be aired on TV in Bangladesh tomorrowState-run BTV will broadcast the live telecast of the hearing, a first such instance in Bangladesh's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-colombia-statement-condemning-pakistan-deaths-in-operation-sindoor-2733470-2025-05-31",
      "headline": "Confident that…: Colombia's U-turn on Pak deaths after Shashi Tharoor's disapprovalColombia has withdrawn its statement condemning the deaths in Pakistan during India's Operation Sindoor following Congress MP Shashi Tharoor's rebuttal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-bjp-announces-new-team-of-office-bearers-with-eye-on-upcoming-state-polls-2733750-2025-05-31",
      "headline": "Bihar BJP announces new team of office-bearers with eye on upcoming state pollsBihar BJP president Dilip Jaiswal has appointed five state general secretaries, 14 state ministers, 13 state vice presidents, one state treasurer and two state co-treasurers ahead of the upcoming Assembly polls scheduled for later this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pakistan-india-trade-talks-representatives-visit-washington-next-week-close-to-deal-operation-sindoor-2733602-2025-05-31",
      "headline": "Pak rushes to US for trade talks as Trump says close to sealing deal with IndiaUS President Donald Trump said that Pakistani representatives will be coming to America next week for trade talks, even as he highlighted that his administration is \"very close to making a deal with India\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mit-bans-indian-origin-student-megha-vemuri-graduation-ceremony-pro-palestine-speech-2733628-2025-05-31",
      "headline": "MIT bans Indian-origin student from graduation event over pro-Palestine speechThe Class of 2025 president, Megha Vemuri of Massachusetts Institute of Technology (MIT), earlier delivered a pro-Palestine speech following which she was barred from attending the official graduation commencement ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-law-student-arrested-gurugram-for-offensive-operation-sindoor-linked-remarks-2733510-2025-05-31",
      "headline": "Pune law student arrested in Gurugram for offensive Op Sindoor-linked remarksSharmistha Panoli, a Pune law student, was arrested by Kolkata Police from Gurugram on Thursday night over \"disrespectful and derogatory remarks\" targeting a particular religion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/security-drills-jammu-kashmir-punjab-rajasthan-india-pak-tensions-government-2733724-2025-05-31",
      "headline": "Evacuation simulations, blackout scenarios: Security drills in states bordering PakOperation Shield, the second phase of the nationwide security drills, was held in Jammu and Kashmir, Gujarat, Punjab and Rajasthan - the states bordering Pakistan. The exercise included blackout protocols, evacuation simulations and coordinated emergency response checks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-reacts-to-emmanuel-macron-wife-slap-video-says-couple-was-just-joking-2733433-2025-05-31",
      "headline": "Make sure door remains closed: Trump's advice to Emmanuel Macron after slap videoTrump said he had spoken to Macron and assured reporters that the couple was fine. He added that they are two good people he knows very well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/firooza-amiri-afghanistan-womens-cricket-taliban-exclusive-interview-2733519-2025-05-31",
      "headline": "From hostility to hope: Afghanistan women's cricket sees a new dawnIn an exclusive chat with India Today Digital, Firooza Amiri narrated how the Afghanistan women's cricketers took exile in Australia after fleeing their home country following the Taliban takeover. Amiri spoke about her fandom for Virat Kohli and fondly recalled the match against Cricket Without Borders XI in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-12-auction-mohammadreza-shadloui-pardeep-narwal-mumbai-2733786-2025-05-31",
      "headline": "Pro Kabaddi League 12 auction: Shadloui creates history, Pardeep Narwal goes unsoldMohammadreza Shadloui created history on Saturday, May 31 during Day 1 of the Pro Kabaddi League season 12 auction as he was bought by the Gujarat Giants for Rs. 2.23 Crores. Three-time Pardeep Narwal went unsold on Day 1 of the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-harry-maguire-ruben-amorim-2733767-2025-05-31",
      "headline": "Manchester United will improve next season after poor 2024-25: Harry MaguireManchester United defender Harry Maguire said that the team will improve next season after their horror 2024-25 campaign. United finished 15th in the Premier League and went trophyless during 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-raj-kundra-press-conference-financial-irregularities-2733760-2025-05-31",
      "headline": "Former Rajasthan Royal co-owner threatens to expose finiachial irregularitiesFormer Rajasthan Royals co-owner Raj Kundra has stirred fresh controversy by alleging financial misconduct and offshore laundering by a top team promoter—adding to the franchise's woes after their disastrous IPL 2025 campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-final-live-score-updates-luis-enrique-simone-inzaghi-munich-2733758-2025-05-31",
      "headline": "UEFA Champions League final live updates: PSG, Inter battle for ultimate glory in MunichUEFA Champions League Final live score and updates: PSG and Inter Milan will lock horns for ultimate glory in the Champions League final in Munich on May 31. Inter are chasing their fourth UCL title while PSG look for their first one. Lautaro Martinez and Ousmane Dembele will hold the key for their respective sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-dabang-delhi-defeat-jaipur-patriots-campaign-kick-off-2733757-2025-05-31",
      "headline": "Dabang Delhi crush Jaipur Patriots 11-4 to begin UTT 2025 campaignDabang Delhi TTC kicked off their UTT 2025 journey in style, overpowering Jaipur Patriots 11-4 with dominant performances from Sathiyan Gnanasekaran, Quek Izaac, and Diya Chitale in the season opener on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/soham-desai-departure-india-cricket-strength-conditioning-coach-2733754-2025-05-31",
      "headline": "Indian team support staff confirms exit, Siraj pens heartfelt goodbyeSoham Desai has announced his departure from his role as the Indian cricket team's strength and conditioning coach. His exit marks a significant change following staff reshuffles after the Border-Gavaskar Trophy 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-7-results-alexander-zverev-jack-draper-joao-fonseca-2733755-2025-05-31",
      "headline": "Alexander Zverev advances, Joao Fonseca knocked out by Jack DraperAlexander Zverev continued his march at the French Open as he went past Flavio Cobolli in straight sets on Saturday, May 31. Joao Fonseca's impressive run at the tournament came to a screetching end as fifth seed Jack Draper dispatched him easily in the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-paulo-badosa-exit-mirra-andreeva-jessica-pegula-advance-2733745-2025-05-31",
      "headline": "10th seed Badosa crashes out of Roland Garros as Andreva and Pegula advancePaula Badosa's French Open journey ended in the third round, while Mirra Andreeva and Jessica Pegula surged into the last 16 with commanding wins, setting up a potentially explosive second-week showdown in Paris."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-asia-cup-relocation-india-visas-2733737-2025-05-31",
      "headline": "Pakistan hockey to seek Asia Cup relocation if India fails to assure visas: ReportThe Pakistan Hockey Federation has threatened to seek a relocation of the Asia Cup from India if the visas are not guaranteed for their national team, according to a report from PTI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-kagiso-rabada-drug-ban-2733721-2025-05-31",
      "headline": "Kagiso Rabada looking to move on from drug ban: Won't be Mr-I-Apologise-Too-MuchKagiso Rabada said that he is looking to move on from the drug ban and won't be apologizing too much about the incident ahead of the World Test Championship final against Australia. Rabada is expected to lead South Africa's pace attack in the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jannik-sinner-win-vs-jiri-lehechka-into-4th-round-paris-2733720-2025-05-31",
      "headline": "Jannik Sinner cruises into French Open 4th round with flawless Lehecka winJannik Sinner showed no mercy at Roland Garros, thrashing Jiri Lehecka in straight sets to book a spot in the French Open fourth round. The World No. 1 continued his flawless run in Paris, as he now gears up for a clash against Alexander Rublev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-7-results-alexander-zverev-jack-draper-joao-fonseca-2733755-2025-05-31",
      "headline": "Alexander Zverev advances, Joao Fonseca knocked out by Jack DraperAlexander Zverev continued his march at the French Open as he went past Flavio Cobolli in straight sets on Saturday, May 31. Joao Fonseca's impressive run at the tournament came to a screetching end as fifth seed Jack Draper dispatched him easily in the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-paulo-badosa-exit-mirra-andreeva-jessica-pegula-advance-2733745-2025-05-31",
      "headline": "10th seed Badosa crashes out of Roland Garros as Andreva and Pegula advancePaula Badosa's French Open journey ended in the third round, while Mirra Andreeva and Jessica Pegula surged into the last 16 with commanding wins, setting up a potentially explosive second-week showdown in Paris."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-asia-cup-relocation-india-visas-2733737-2025-05-31",
      "headline": "Pakistan hockey to seek Asia Cup relocation if India fails to assure visas: ReportThe Pakistan Hockey Federation has threatened to seek a relocation of the Asia Cup from India if the visas are not guaranteed for their national team, according to a report from PTI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-kagiso-rabada-drug-ban-2733721-2025-05-31",
      "headline": "Kagiso Rabada looking to move on from drug ban: Won't be Mr-I-Apologise-Too-MuchKagiso Rabada said that he is looking to move on from the drug ban and won't be apologizing too much about the incident ahead of the World Test Championship final against Australia. Rabada is expected to lead South Africa's pace attack in the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jannik-sinner-win-vs-jiri-lehechka-into-4th-round-paris-2733720-2025-05-31",
      "headline": "Jannik Sinner cruises into French Open 4th round with flawless Lehecka winJannik Sinner showed no mercy at Roland Garros, thrashing Jiri Lehecka in straight sets to book a spot in the French Open fourth round. The World No. 1 continued his flawless run in Paris, as he now gears up for a clash against Alexander Rublev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-2nd-odi-playing-xi-jamie-overto-ruled-out-cardiff-2733712-2025-05-31",
      "headline": "ENG vs WI: England forced to make one change for 2nd ODI as Overton ruled outEngland have been forced to make one change to their lineup for the second ODI as Jamie Overton has been ruled out for the rest of the series. Overton sustained a finger injury during the first ODI win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-medal-winners-full-list-tally-asian-athletics-championship-2025-2733708-2025-05-31",
      "headline": "Asian Athletics Championships 2025: India's full list of medal winnersThe Indian contingent at the Asian Athletics Championships 2025 finished with a strong outing in Gumi, Korea. On the final day of the competition, India won 6 medals, taking their tally to a total of 24 in the competition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/firooza-amiri-afghanistan-womens-cricket-taliban-exclusive-interview-2733519-2025-05-31",
      "headline": "From hostility to hope: Afghanistan women's cricket sees a new dawnIn an exclusive chat with India Today Digital, Firooza Amiri narrated how the Afghanistan women's cricketers took exile in Australia after fleeing their home country following the Taliban takeover. Amiri spoke about her fandom for Virat Kohli and fondly recalled the match against Cricket Without Borders XI in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-rubbishes-rumours-of-rift-with-hardik-pandya-2733695-2025-05-31",
      "headline": "Shubman Gill rubbishes rumours of rift with Hardik Pandya through Instagram storyStar India batter Shubman Gill rubbished rumours of rift with Hardik Pandya after clips of their awkward exchange at the toss ahead of Gujarat Titans vs Mumbai Indians Eliminator game went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asian-athletics-india-win-silver-in-womens-4x100-relay-pooja-bags-bronze-in-800m-2733675-2025-05-31",
      "headline": "India win silver in Women's 4x100 relay, Pooja bags bronze in 800mAfter a terrific start to the final day of the Asian Athletics Championships 2025, India closed out the day with two more medals as Pooja bagged a bronze in the Women's 800m final while the women's 4x100 m relay team secured a silver medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-double-century-india-a-england-lions-tour-opener-2733664-2025-05-31",
      "headline": "Karun Nair for No.3? Comeback star hit statement double hundred vs LionsKarun Nair scored a commanding double century in India A's match against England Lions. His calm and composed innings boosted India's strong position and hinted at his readiness for Test cricket return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-shubman-gills-captaincy-blunder-vs-mumbai-indians-2733659-2025-05-31",
      "headline": "How Shubman Gill's major blunder cost GT in Eliminator vs MI, explains Robin UthappaFormer India cricketer-turned commentator Robin Uthappa highlighted a major blunder in Shubman Gill's captaincy during their Eliminator loss against Mumbai Indians in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marquinhos-psg-champions-league-final-fight-inter-milan-2733654-2025-05-31",
      "headline": "Marquinhos wants redemption for 2020 UCL final: Won't go down without a fightParis Saint-Germain captain Marquinhos aims to avenge their 2020 Champions League final defeat. PSG faces Inter Milan with hopes to secure the club's first European title amid a season of resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asian-athletics-india-win-silver-in-womens-4x100-relay-pooja-bags-bronze-in-800m-2733675-2025-05-31",
      "headline": "India win silver in Women's 4x100 relay, Pooja bags bronze in 800mAfter a terrific start to the final day of the Asian Athletics Championships 2025, India closed out the day with two more medals as Pooja bagged a bronze in the Women's 800m final while the women's 4x100 m relay team secured a silver medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-double-century-india-a-england-lions-tour-opener-2733664-2025-05-31",
      "headline": "Karun Nair for No.3? Comeback star hit statement double hundred vs LionsKarun Nair scored a commanding double century in India A's match against England Lions. His calm and composed innings boosted India's strong position and hinted at his readiness for Test cricket return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-shubman-gills-captaincy-blunder-vs-mumbai-indians-2733659-2025-05-31",
      "headline": "How Shubman Gill's major blunder cost GT in Eliminator vs MI, explains Robin UthappaFormer India cricketer-turned commentator Robin Uthappa highlighted a major blunder in Shubman Gill's captaincy during their Eliminator loss against Mumbai Indians in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marquinhos-psg-champions-league-final-fight-inter-milan-2733654-2025-05-31",
      "headline": "Marquinhos wants redemption for 2020 UCL final: Won't go down without a fightParis Saint-Germain captain Marquinhos aims to avenge their 2020 Champions League final defeat. PSG faces Inter Milan with hopes to secure the club's first European title amid a season of resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-enrique-psg-champions-league-final-2024-inter-milan-dembele-2733651-2025-05-31",
      "headline": "PSG's Enrique confident of repeating decade old Champions League gloryLuis Enrique targets a second Champions League title as PSG face Inter Milan in the final. His experienced team aims to control the game and make history in European football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-parul-chaudhary-vithya-ramraj-medals-2733652-2025-05-31",
      "headline": "Parul Chaudhary claims silver in women's 5000m, Vithya bags bronzeAsian Athletics Championship 2025: Parul Chaudhary won her second medal in the form of silver when she clocked 15:15.33 in the women's 5000m final on Saturday. Vithya Ramraj also added to India's medal's tally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/arshad-nadeem-javelin-final-asian-athletics-2025-sachin-yadav-2733645-2025-05-31",
      "headline": "Asian Athletics: Arshad Nadeem wins gold, Sachin Yadav bags silver medalArshad Nadeem claimed gold with a massive 86.40m throw at the Asian Athletics Championship 2025. India's Sachin Yadav achieved his personal best and secured the silver medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/asian-athletics-animesh-kujur-shatters-national-record-to-win-200m-bronze-2733630-2025-05-31",
      "headline": "Asian Athletics: Animesh Kujur shatters national record to win 200m bronzeIndia's Animesh Kujur won bronze medal in the men's 200m at the Asian Athletics Championship 2025. Kujur shattered national record as he finished third, completing the race in 20.32 seconds behind Japan's Towa Uzawa (1st) and Saudi Arabia's Abdulaziz Abdu Atafi (2nd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-badosa-sinner-djokovic-andreeva-gauff-2733626-2025-05-31",
      "headline": "Day 7 Live Updates: Gauff beats Bouzkova, Keys advancesFrench Open 2025 Live Updates: Coco Gauff has sealed her spot in the fourth round with a straight win over Marie Bouzkova. Meanwhile, USA's Madison Keys scripted a comeback win over her counterpart Sofia Kenin to advance. Earlier, Alexander Zverev has made it to the next round with a convincing win over Cobolli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-is-perfect-choice-for-test-captaincy-hes-matured-a-lot-sikhar-dhawan-2733610-2025-05-31",
      "headline": "Shubman Gill is perfect choice for Test captaincy, he's matured a lot: Shikhar DhawanFormer India cricketer Shikhar Dhawan has backed Shubman Gill to excel as Test captain on the upcoming tour of England. India will take on England in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-final-psg-vs-inter-milan-luis-enrique-simone-inzaghi-battle-europe-dream-2733578-2025-05-31",
      "headline": "Luis Enrique and Simone Inzaghi chase one European dream in MunichAs Paris Saint-Germain and Inter Milan prepare to lock horns in the UEFA Champions League final this Saturday in Munich, the spotlight extends beyond the glittering roster of star players. The true battle will also be waged in the dugouts, where Luis Enrique and Simone Inzaghi—the tactical architects behind their teams' remarkable journeys—will play their chess match on Europe's grandest stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-is-a-cheat-code-in-t20-cricket-says-r-ashwin-2733582-2025-05-31",
      "headline": "Bumrah is a cheat code in T20 cricket, he elevates captain's stature: R AshwinFormer India off-spinner Ravichandran Ashwin has called Jasprit Bumrah a cheat code in T20 cricket, comparing him with the famous video game Road Rash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-wheelchair-cricket-mumbai-fans-video-2733567-2025-05-31",
      "headline": "Watch: AB de Villiers wows fans by playing wheelchair cricketFormer South African cricketer AB de Villiers joined the Mumbai wheelchair team at the Islam Gymkhana in Marine Lines. Fans captured the moments with pictures and videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-assures-mahela-jayawardene-of-comeback-minutes-before-dismissing-sundar-2733534-2025-05-31",
      "headline": "Watch: Jasprit Bumrah assures coach of comeback minutes before dismissing SundarIndia and Mumbai Indians (MI) fast bowler Jasprit Bumrah was seen calming the nerves of head coach Mahela Jayawardene minutes before dismissing Washington Sundar in the Eliminator fixture of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-sai-sudharsan-press-conference-gujarat-titans-2733516-2025-05-31",
      "headline": "County stint has helped me: Sai Sudharsan set for England Tests after stellar IPLIPL 2025: Sai Sudharsan said that the playing county cricket in England has helped his batting. After a stellar run in the IPL where he scored 759 runs in 15 games, the left-hander will head to England for a five-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-mi-suryakumar-yadav-full-post-match-press-conference-2733506-2025-05-31",
      "headline": "Mahela Jaywardene gives update on Suryakumar Yadav's injury after GT gameMumbai Indians (MI) head coach Mahela Jayawardene gave an update on Suryakumar Yadav's fitness after their win over Gujarat Titans (GT) in the Eliminator of the Indian Premier League 2025 (IPL 2025). Suryakumar was seen being attended by physio in the final stages of the game."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}