{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-to-invest-in-gold-long-short-tem-outlook-etf-vs-sgb-vs-digital-gold-price-rate-gst-2846760-2026-01-05",
      "headline": "How investors can manage short-term uncertainty with digital gold, ETFs and SGBsFrom an investment perspective, buying physical gold may no longer be the most efficient choice. When purchasing physical gold, investors must pay 3% GST upfront, which immediately impacts returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-price-rising-again-key-reasons-explained-us-venezuela-tensions-2846720-2026-01-05",
      "headline": "Gold prices rise again as US–Venezuela tensions flare. Buy now or wait?Market participants say the latest geopolitical flare-up has reinforced gold's role as a hedge against uncertainty, at a time when investors are already navigating an uneasy global backdrop."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-in-india-irdai-annual-report-2024-2025-2846709-2026-01-05",
      "headline": "Mis-selling complaints are rising. Here's what IRDAI's latest report showsData in the IRDAI Annual Report 2024–25 shows that grievances categorised under Unfair Business Practices increased to 26,667 in FY25, up from 23,335 in FY24, a rise of around 14% year-on-year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/commodities/story/us-action-venezuela-oil-opportunity-beneift-india-reliance-ongc-share-price-commodities-2846675-2026-01-05",
      "headline": "US action on Venezuela's oil: Is there an opportunity for India?Indian oil refiners and upstream companies could still find opportunities if Venezuelan crude re-enters global markets and long-pending investments and payments are unlocked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/cupid-share-price-bse-reasons-behind-crash-explained-2846649-2026-01-05",
      "headline": "Cupid share price tumbles nearly 20%. Why is it falling today?Cupid shares have now fallen nearly 30% over the past five trading sessions, wiping out a significant portion of the gains made during a recent sharp rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-petrodollar-why-us-attack-venezuela-oil-dollar-explained-donald-trump-nicolas-maduro-2846630-2026-01-05",
      "headline": "Petrodollar power play: How oil dollars connect to the US attack on VenezuelaWhile Washington has cited narcoterrorism charges and security concerns, questions are being raised over whether Venezuela's vast oil reserves and its efforts to trade oil outside the US dollar system played a role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-belll-sensex-nifty-open-lower-it-stocks-decline-hcltech-infosys-metal-2846618-2026-01-05",
      "headline": "Sensex, Nifty open lower as IT stocks see decline in early tradeThe S&P BSE Sensex was down by 68.48 points to 85,693.53, while the NSE Nifty50 lost 15.35 points to 26,313.20 as of 9:23 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-new-ceo-tata-sons-global-search-campbell-wilson-exit-report-2846600-2026-01-05",
      "headline": "Unhappy with pace of change, Tata Group looks to replace Air India CEO: ReportGroup chairman N Chandrasekaran has spoken with chief executives of at least two large airlines based in the UK and the US. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuela-oil-production-cuts-us-blockade-pdvsa-storage-chevron-shipments-glbs-2846558-2026-01-05",
      "headline": "Venezuela cuts crude output as US oil blockade chokes storageCaracas is in political crisis under an interim government after President Nicolas Maduro and his wife were captured by US forces on Saturday. The OPEC country's oil exports, its main source of revenue, are now at a standstill following a US blockade on tankers under sanctions and the seizure of two oil cargoes last month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-control-of-venezuelan-oil-could-unlock-usd-1-billion-in-dues-for-india-lift-output-2846543-2026-01-04",
      "headline": "US control of Venezuelan oil could unlock $1 billion in dues for India, lift outputA US-led takeover or restructuring of Venezuela's oil sector could help India recover nearly $1 billion in long-pending dues and revive crude production from fields operated by ONGC Videsh, analysts and industry sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gig-economy-10-minute-delivery-real-cost-india-zomato-instamart-zepto-bilinkit-2846257-2026-01-04",
      "headline": "Inside the gig economy: The real cost of your 10-minute deliveriesTen-minute deliveries have become part of everyday life in urban India. What makes that speed possible is rarely part of the conversation. Read on to understand the people, platforms and policies behind it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-salaried-indians-need-personal-finance-reset-2026-labour-codes-impact-2845893-2026-01-03",
      "headline": "Why salaried Indians need a personal finance reset in 2026Rising living costs, changing job patterns and sweeping labour law reforms are urging salaried Indians to rethink how secure their finances really are."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/gig-economy-debate-zomato-blinkit-eternal-deepinder-goyal-2845626-2026-01-02",
      "headline": "Ban gig work and you don't solve inequality: Eternal CEO Deepinder GoyalEternal founder Deepinder Goyal argued that the gig economy debate is less about wages and more about discomfort with inequality, warning that bans and over-regulation could erase livelihoods instead of fixing systemic gaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-573-points-higher-nifty-hits-fresh-high-ntpc-up-5-percent-2845552-2026-01-02",
      "headline": "Sensex closes 573 points higher, Nifty hits fresh high; NTPC up 5%The S&P BSE Sensex added 573.41 points to close at 85,762.01, while the Nifty50 jumped 182 points to end at 26,328.55​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-window-closed-tax-refund-eligiblity-2845428-2026-01-02",
      "headline": "Missed the revised ITR filing deadline? Know what happens to tax refundIn most cases, refunds are issued within a few weeks to a few months. Delays may occur due to mismatches in TDS details, bank account validation issues, or cases selected for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-update-brokerage-targets-views-buy-sell-hold-2845403-2026-01-02",
      "headline": "ITC shares tumble 4%, down 13% in 2 days: Buy the dip or stay away?The sharp sell-off comes after the finance ministry revised the taxation structure for cigarettes, effective February 1, 2026. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mcx-share-price-crash-explained-stock-split-ex-split-adjustment-2845396-2026-01-02",
      "headline": "MCX shares crash 80% in early deals, but the fall is not what it seemsMCX shares fell by more than 80% on trading screens on Friday, hitting an intraday low of Rs 2,192 on the BSE. This was compared with Thursday's closing price of Rs 10,988.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/devyani-international-share-price-sapphire-foods-merger-shares-in-focus-kfc-pizza-hut-india-2845368-2026-01-02",
      "headline": "Devyani International and Sapphire Foods India shares in focus. Here's whyDevyani International shares were trading at Rs 152.80, up Rs 5.37 or 3.64% during the morning session as of 9:39 am. In contrast, Sapphire Foods India shares were trading lower at Rs 253.95, down Rs 8.75 or 3.33%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-auto-shares-rise-fmcg-itc-godfrey-phillips-2845357-2026-01-02",
      "headline": "Sensex, Nifty open higher driven by auto, metal stocks as FMCG continues to fallThe S&P BSE Sensex was up 172.34 points to 85,360.94, while the NSE Nifty50 rose 44.10 points to 26,190.65 as of 9:26 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-launches-initiative-to-empower-creative-talent-on-40th-birthday-2846732-2026-01-05",
      "headline": "Deepika Padukone launches initiative to empower creative talent on 40th birthday Deepika Padukone launched an initiative to empower creative talent. She launched her platform for aspirants across the film, television and advertising industry on January 5, 2025, which marks her 40th birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahhi-vij-jay-bhanushali-separation-co-parenting-commitment-2846726-2026-01-05",
      "headline": "Stop making it dirty: Mahhi Vij's message after separation with Jay Bhanushali Mahhi Vij has responded to media speculation following her separation from Jay Bhanushali, emphasising the couple's commitment to their children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/explained-dashavatar-in-oscars-contention-list-vs-homebound-as-official-nominee-2846755-2026-01-05",
      "headline": "Explained: Dashavatar in Oscars contention list vs Homebound as official nominee Marathi film Dashavatar has entered the Oscar contention list, marking a major moment for regional cinema. Here's what the contention list means and how it differs from final Oscar nominations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kakashi-hatake-the-sad-ninja-who-still-slays-and-leads-like-a-legend-2846704-2026-01-05",
      "headline": "Kakashi Hatake: Sad ninja who still slays and leads like a legend In this week's Animania, we discover Kakashi Hatake's tragic past, his losses, and how he became one of Naruto's most powerful and respected ninjas.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meg-stalter-paul-w-downs-recreate-timothee-chalamet-kylie-jenner-neon-orange-looks-critics-choice-awards-2846723-2026-01-05",
      "headline": "Hacks stars cheekily recreate Timothee Chalamet and Kylie Jenner's look Actors Meg Stalter and Paul W. Downs recreated the notable red carpet look of Timothee Chalamet and Kylie Jenner at the 2026 Critics Choice Awards, drawing attention with their precise homage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-intimate-new-year-celebration-with-wife-sheetal-and-son-vardaan-2846752-2026-01-05",
      "headline": "Vikrant Massey's intimate new year celebration with wife Sheetal and son Vardaan Vikrant Massey rang in 2026 with a quiet and intimate family getaway, as wife Sheetal Thakur shared heartwarming moments from their New Year celebrations on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/beyond-the-kerala-story-release-date-announced-february-27-2026-sunshine-pictures-2846729-2026-01-05",
      "headline": "Beyond The Kerala Story set for February 2026 release The makers of Beyond The Kerala Story have anounced the release date of the film. The sequel builds on the momentum of the 2023 film and features new cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-expresses-pride-over-ranveer-dhurandhar-at-pre-brirthday-bash-with-fans-2846685-2026-01-05",
      "headline": "Deepika expresses pride over Ranveer's Dhurandhar at pre-brirthday bash with fans Deepika Padukone expressed pride over the success of her actor-husband Ranveer Singh's 'Dhurandhar' (2025). Deepika celebrated her pre-birthday bash with her fans at an intimate meet-and-greet event in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-death-hema-malini-emotional-tribute-90th-birthday-2846682-2026-01-05",
      "headline": "Hema Malini recalls Dharmendra's last days in hospital: Inconsolable shock In her first interview after Dharmendra's death, Hema Malini shared insights into the actor's last days and the deep impact of his absence on their family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-anurag-kashyap-ad-collab-wins-the-internet-2846710-2026-01-05",
      "headline": "Ananya Panday and Anurag Kashyap's ad collaboration wins the internet. Watch Ananya Panday surprised fans by sharing a humorous shampoo ad featuring Anurag Kashyap, marking an unexpected and playful collaboration between the actor and the filmmaker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-bets-on-zombie-film-pralay-with-lokahs-kalyani-priyadarshan-report-2846687-2026-01-05",
      "headline": "Ranveer Singh bets on zombie film Pralay with Lokah's Kalyani Priyadarshan: Report Fresh off the success of Dhurandhar, Ranveer Singh is now gearing up for a zombie-thriller, also featuring Lokah fame Kalyani Priyadarshan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bigg-boss-tamil-9-eviction-subiksha-exits-aurora-sinclair-first-finalist-vijay-sethupathi-ticket-2846677-2026-01-05",
      "headline": "Bigg Boss Tamil 9: Subiksha evicted, Aurora Sinclair becomes 1st finalist Subiksha, a representative of the fishermen community, was evicted from Bigg Boss Tamil 9 after receiving the lowest votes. Vijay Sethupathi presented the Ticket to Finale to Aurora Sinclair, who became the first finalist of the ongoing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-box-office-success-rahul-khanna-waits-to-watch-akshaye-acclaimed-film-2846640-2026-01-05",
      "headline": "Rahul Khanna reveals why he hasn't watched brother Akshaye's Dhurandhar yet Rahul Khanna has not yet seen his brother Akshaye Khanna's acclaimed performance in the blockbuster film 'Dhurandhar'. In a recent interview, Rahul shared the reason behind the delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-film-praised-by-vivek-agnihotri-innovative-production-strong-performances-2846666-2026-01-05",
      "headline": "Vivek Agnihotri calls Dhurandhar a writer-director's film that raises the bar Filmmaker Vivek Agnihotri has praised Aditya Dhar's film Dhurandhar, highlighting its exceptional production qualities and collaborative effort. Agnihotri described the film as a benchmark for writer-director-driven cinema in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannan-pattambi-dies-malayalam-actor-production-controller-dies-62-2846662-2026-01-05",
      "headline": "Malayalam actor and production controller Kannan Pattambi dies at 62 Kannan Pattambi, a well-known Malayalam actor and production controller, died at the age of 62 in Kozhikode due to a kidney-related ailment, with his brother Major Ravi confirming the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jimmy-kimmel-jokes-about-donald-trump-role-in-his-success-at-critics-choice-awards-2846661-2026-01-05",
      "headline": "Jimmy Kimmel jokes about Trump's role in his success at Critics Choice Awards Jimmy Kimmel sarcastically highlighted President Donald Trump's role in his Critics Choice Award win, following a period of controversy and suspension from ABC after remarks related to political events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nivin-pauly-sarvam-maya-crosses-rs-100-crore-global-box-office-2846624-2026-01-05",
      "headline": "Sarvam Maya hits Rs 100 crore, Nivin Pauly elated after phenomenal comeback Malayalam actor Nivin Pauly's Sarvam Maya has crossed the Rs 100-crore mark globally within 10 days of release. This blockbuster success marks a strong comeback and renewed momentum in his film career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-wins-best-actor-critics-choice-awards-praises-kylie-jenner-2846622-2026-01-05",
      "headline": "Timothee Chalamet thanks Kylie Jenner for 3 years of love at Critics Choice. Watch Timothee Chalamet delivered a notable acceptance speech at the Critics Choice Awards, openly declaring his affection for Kylie Jenner and recognising her support as he accepted the best actor award for his performance in Marty Supreme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indias-got-talent-season-11-winner-amazing-apsaras-2846627-2026-01-05",
      "headline": "Amazing Apsaras win India's Got Talent Season 11 Amazing Apsaras from Kolkata secured the title of India's Got Talent Season 11 champions, impressing judges with their innovative dance performances and taking home a cash prize of Rs 10 lakh and a car."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-government-ban-ipl-telecast-after-mustafizur-rahman-kkr-row-2846745-2026-01-05",
      "headline": "Bangladesh orders indefinite ban on IPL telecast after Mustafizur Rahman rowThe Bangladesh government has imposed an indefinite ban on the telecast and promotion of the Indian Premier League (IPL) in response to the controversy over the removal of national fast bowler Mustafizur Rahman from the Kolkata Knight Riders squad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/maryland-nikita-murder-boyfriend-arjun-sharma-arrested-interpol-tamil-nadu-2846763-2026-01-05",
      "headline": "Indian who fled US after murdering Telugu ex-girlfriend arrested in Tamil NaduAn international manhunt concluded in Tamil Nadu with the arrest of Arjun Sharma, accused of murdering Telugu woman Nikita Godishala in the US and fleeing to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-envoy-asked-for-relief-trump-by-his-side-us-senators-big-tariffs-claim-2846754-2026-01-05",
      "headline": "Trump aide claims Indian envoy sought tariff relief; Congress alleges selloutSpeaking to reporters aboard Air Force One alongside US President Donald Trump, US Senator Lindsey Graham said that during a meeting at the Indian Ambassador's residence last month, the focus was entirely on India cutting back its Russian oil imports. According to Graham, India's Ambassador to the United States requested that he convey this message to President Trump and ask for relief from the 25 per cent tariff imposed on Indian goods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/umar-khalid-and-sharjeel-imam-to-stay-in-jail-as-supreme-court-rejects-bail-in-delhi-riots-case-2846667-2026-01-05",
      "headline": "No bail for Umar Khalid, Sharjeel Imam in Delhi riots case; 5 others get reliefDenying bail to Umar Khalid and Sharjeel Imam, the Supreme Court said national security and public order trump prolonged pre-trial custody. The bench, however, granted bail to Gulfisha Fatima, Meeran Haider, Shifa Ur Rehman, Mohd Saleem Khan and Shadab Ahmed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/venezuela-oil-production-collapse-reasons-oil-rich-reserves-trump-us-companies-feasibility-investment-2846742-2026-01-05",
      "headline": "Trump bets big on Venezuela crude. Can he unlock world's largest oil reserves?Venezuela holds nearly 20% of the world's proven oil reserves, but pumps less than a percent of global crude. After capturing its leader, Trump is now promising that US companies will revive production. Can he unlock the world's largest oil reserves?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/what-is-the-device-on-deepinder-goyals-temple-brain-monitor-wearable-explained-2846626-2026-01-05",
      "headline": "What is the device on Deepinder Goyal's temple? Brain-monitor wearable explainedZomato founder Deepinder Goyal appeared on a popular podcast wearing an unusual brain-monitoring wearable called Temple, sparking online buzz and memes as he explains how it tracks cerebral blood flow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/make-in-india-moment-apple-shipped-50-billion-worth-iphones-in-2025-electronics-exports-jump-8x-2846756-2026-01-05",
      "headline": "New Make in India record? Apple ships iPhones worth $50bn from IndiaApple surpassed iPhone exports worth $50 billion in 2025 from India to global markets, as confirmed by the Union Minister of Electronics and Information Technology, Ashwini Vaishnav, on X. The Cupertino giant is one of the largest companies part of the Government of India's smartphone production linked initiative (PLI) scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/explained-dashavatar-in-oscars-contention-list-vs-homebound-as-official-nominee-2846755-2026-01-05",
      "headline": "Explained: Dashavatar in Oscars contention list vs Homebound as official nomineeMarathi film Dashavatar has entered the Oscar contention list, marking a major moment for regional cinema. Here's what the contention list means and how it differs from final Oscar nominations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-ipl-release-political-pressure-cricket-governance-india-bangladesh-controversy-2846638-2026-01-05",
      "headline": "BCCI's Mustafizur Rahman no-ball shows why cricket is not a serious sportAs avoidable as a no-ball, the BCCI's handling of Mustafizur Rahman has pushed Bangladesh to reconsider touring India, further destabilising a sport already weakened by political interference, administrative hesitation and an alarming lack of clear, consistent authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trial-delay-cannot-be-trump-card-what-supreme-court-said-in-denying-bail-to-umar-khalid-2846673-2026-01-05",
      "headline": "Trial delay not a trump card: Top Supreme Court remarks on Umar Khalid bail pleaWhile pronouncing its order on Monday, the Supreme Court said that a delay in trial cannot be sued as a trump card and observed that prima facie, Umar Khalid and Sharjeel Imam seemed to have played a \"central role\" on the alleged Delhi riots conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/government-backed-bharat-taxi-adds-45000-users-daily-big-nationwide-launch-teased-features-safety-setup-process-other-details-2846688-2026-01-05",
      "headline": "Government-backed Bharat Taxi adds 45,000 users daily, big nationwide launch teasedGovernment-backed Bharat Taxi is seeing rapid early traction, adding up to 45,000 users daily as it prepares for a larger nationwide rollout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-river-two-param-virs-the-audacious-crossing-basantar-1971-war-2846660-2026-01-05",
      "headline": "One river, two Param Virs: The audacious crossing of Basantar in 1971 WarThe Battle of Basantar, a pivotal clash in the 1971 India-Pakistan War, showcased the heroism of Major Hoshiar Singh and Second Lieutenant Arun Khetarpal. Both earned India's highest gallantry award, the Param Vir Chakra for their valour in the Shakargarh bulge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/illegal-crossings-indians-us-from-canada-border-down-68-per-cent-since-donald-trump-president-immigrants-usa-deportation-2846716-2026-01-05",
      "headline": "Illegal crossings by Indians to US from Canada down 68% since Trump took officeThe number of Indians apprehended while trying to illegally cross into the US from Canada fell by a record 68% between 2024 and 2025. The development comes amid the Trump administration's crackdown on illegal immigration that has shut off many routes used by undocumented Indians, as well as a record number of Indians being deported from the US in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-knew-i-wasnt-happy-trump-hints-new-tariffs-russian-oil-2846577-2026-01-05",
      "headline": "PM Modi knew I wasn't happy: Trump hints at new tariffs over Russian oilAddressing reporters on board Air Force One on Sunday, Trump said, \"PM Modi's a very good man. He's a good guy. He knew I was not happy. It was important to make me happy. They do trade, and we can raise tariffs on them very quickly.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bangalore-man-chat-with-yet-another-bengaluru-landlord-viral-and-youll-see-why-rs-10-lakh-security-deposit-2846761-2026-01-05",
      "headline": "Man's chat with 'yet another Bengaluru landlord' goes viral and you'll see whyThe exchange was posted on Reddit's r/Bengaluru forum with the title \"Yet another Bengaluru landlord.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/three-amur-falcons-flew-5000-km-in-five-days-from-india-they-used-physics-2846733-2026-01-05",
      "headline": "5,000 km in 5 days: Tiny Amur falcons from India aced physics to flyThey flew to Africa in late 2025 as conservationists monitored their movement using satellites and tracked their cross-continent journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/ips-isha-singh-transferred-lady-singham-confronted-rebuked-tvk-bussy-anand-crowd-rally-stampede-2846617-2026-01-05",
      "headline": "Lady Singham, who confronted TVK leader seeking more crowd at rally, transferredDuring actor Vijay's Puducherry rally, IPS officer Isha Singh was seen snatching the mic from Bussy Anand mid-announcement. The fierce officer has now been transferred to Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-new-ceo-tata-sons-global-search-campbell-wilson-exit-report-2846600-2026-01-05",
      "headline": "Unhappy with pace of change, Tata Group looks to replace Air India CEO: ReportGroup chairman N Chandrasekaran has spoken with chief executives of at least two large airlines based in the UK and the US. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-woman-stabs-south-korean-live-in-partner-to-death-in-greater-noida-2846582-2026-01-05",
      "headline": "Manipur woman stabs South Korean live-in partner to death in Greater NoidaA late-night drinking session in Greater Noida turned tragic when a South Korean national was fatally stabbed by his live-in partner from Manipur. The police have arrested the woman and are investigating the circumstances surrounding the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/this-roadside-stop-in-west-brngal-became-famous-for-just-one-dish-langcha-2846609-2026-01-05",
      "headline": "This roadside stop became famous for just one dishThere's a certain stretch where both sides of the road line up with sweet shops stacked back-to-back, each promising the same thing: Langcha. This is Shaktigarh, or what most travellers now simply recognise as the place to stop for this delectable sweet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-womens-cricket-legacy-continues-india-new-era-world-cup-2846693-2026-01-05",
      "headline": "World champion India Women eye Australia-like era of dominanceIndia won the Women's World Cup last year in front of a packed house in Navi Mumbai, but there's still a long way to go before they can build a legacy like Australia have since their first World Cup victory in 1978."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/tips-and-tricks/story/cbse-exam-revision-walking-method-memory-focus-stress-2846641-2026-01-05",
      "headline": "A Gurukul-era study hack every CBSE student should tryCBSE students can use the ancient Gurukul walking method to enhance exam revision. This technique helps improve memory and reduce stress during intense study sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-lovely-dinner-donald-trump-melania-trump-buzz-bromance-back-in-action-2846598-2026-01-05",
      "headline": "Elon Musk's 'lovely dinner' with Trump, Melania brings back bromance buzzElon Musk and President Donald Trump's relationship soured after the Tesla CEO's criticism of the administration's One Big Beautiful Bill, a major tax and spending legislation. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-ai-photo-editing-privacy-concerns-grok-platform-response-2846779-2026-01-05",
      "headline": "Pratika Rawal strongly reacts after her edited photos go viral on social media India women's cricketer Pratika Rawal spoke out against unauthorised AI-edited photos going viral on social media platforms. Last year, Pratika was one of India's star performers in the Women's World Cup on Indian soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mansur-ali-khan-pataudi-cricket-resilience-eye-injury-leadership-2846728-2026-01-05",
      "headline": "How India's one-eyed Tiger overcame career-ending injury to score 2793 Test runs A serious eye injury threatened to end Mansur Ali Khan Pataudi's career before it began. Instead, he rebuilt his game, overcame profound limitations and went on to become one of Indian cricket's most influential captains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-comes-up-with-idea-to-help-arrest-indias-test-cricket-slide-report-2846776-2026-01-05",
      "headline": "Shubman Gill comes up with idea to help arrest India's Test cricket slide: Report India's new Test captain Shubman Gill has reportedly proposed dedicated 15-day red-ball camps ahead of every Test series, as the team looks to arrest its slide following back-to-back home series defeats and revive its campaign in the World Test Championship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-jamie-smith-worst-ashes-dismissal-nasser-hussain-sydney-test-2846771-2026-01-05",
      "headline": "Former England captain blasts Jamie Smith's SCG Test dismissal: Worst of this Ashes Jamie Smith's rash dismissal at the SCG shifted England's momentum on Day 2. Nasser Hussain called it one of the worst shots of this Ashes, highlighting England's ongoing struggle with game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-5th-test-travis-head-joe-root-sydney-cricket-score-2846767-2026-01-05",
      "headline": "5th Test: Travis Head 91 follows Joe Root 160 in strong Aussie reply in Sydney Ashes 5th Test: Any doubts about Australia's intensity were brushed aside as the hosts came up with an intense bowling show to bowl England out for 384 and then rode on Travis Head's unbeaten 91 off 87 balls to reach 166 for 2 at Stumps on Day 2 in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-steve-smith-ashes-2025-series-sydney-cricket-ground-2846734-2026-01-05",
      "headline": "Travis Head first Australian since Steve Smith with 500 runs in an Ashes edition Travis Head ended Australia's seven-year wait in the Ashes with a stellar 528 runs in the 2025 series. His dominant innings in the final Test at SCG kept Australia competitive despite a strong England total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-government-ban-ipl-telecast-after-mustafizur-rahman-kkr-row-2846745-2026-01-05",
      "headline": "Bangladesh orders indefinite ban on IPL telecast after Mustafizur Rahman row The Bangladesh government has imposed an indefinite ban on the telecast and promotion of the Indian Premier League (IPL) in response to the controversy over the removal of national fast bowler Mustafizur Rahman from the Kolkata Knight Riders squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-son-maheika-sharma-hardik-pandya-girlfriend-cute-moment-watch-video-ind-vs-nz-2846717-2026-01-05",
      "headline": "Watch: Rohit's son Ahaan shares adorable moment with Pandya's girlfriend A warm off-field moment involving Mahieka Sharma and Rohit Sharma's son went viral ahead of India's New Zealand ODIs. With the 2026 season beginning, focus also shifts to squad rotation and Rohit's form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-launches-vel-sports-after-ending-decade-long-partnership-with-jsw-sports-2846699-2026-01-05",
      "headline": "Neeraj Chopra parts ways with JSW Sports, launches his own management firm India's Olympic and world champion javelin thrower Neeraj Chopra has brought an end to his decade-long association with JSW Sports, opting to take a new step in his career by launching his own athlete management firm, Vel Sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-womens-cricket-legacy-continues-india-new-era-world-cup-2846693-2026-01-05",
      "headline": "World champion India Women eye Australia-like era of dominance India won the Women's World Cup last year in front of a packed house in Navi Mumbai, but there's still a long way to go before they can build a legacy like Australia have since their first World Cup victory in 1978."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zaman-khan-replaces-shaheen-afridi-brisbane-heat-bbl-injury-2846676-2026-01-05",
      "headline": "Brisbane Heat name out-of-favour Pakistan pacer as Shaheen Afridi replacement Brisbane Heat have drafted in Pakistan pacer Zaman Khan as an injury replacement for Shaheen Shah Afridi, who has returned home after suffering a knee cartilage injury during the Big Bash League. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mohammed-siraj-unlucky-india-squad-snub-ab-de-villiers-harshit-rana-2846683-2026-01-05",
      "headline": "Mohammed Siraj is unlucky to miss out on T20 World Cup spot: AB de VilliersAB de Villiers believes Mohammed Siraj was unfortunate to miss India's T20 World Cup squad. The former South Africa captain feels balance, not ability, worked against Siraj in a spin-heavy selection approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/naseem-shah-fiery-spell-desert-vipers-win-ilt20-final-clash-kieron-pollard-2846664-2026-01-05",
      "headline": "Watch: Pakistan's Naseem Shah trumps Kieron Pollard after heated verbal exchangeILT20 final: Pakistan fast bowler Naseem Shah was engaged in a verbal battle with Kieron Pollard during the big final in Dubai. Naseem's three-wicket haul played a key role in helping Desert Vipers beat MI Emirates and win their maiden ILT20 title on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-bangladesh-ipl-snub-kkr-rangpur-riders-win-2846657-2026-01-05",
      "headline": "Mustafizur IPL row: Bangladesh teammate reveals how pacer reacted to KKR snubDespite the IPL setback after his KKR release, Mustafizur Rahman has stayed calm and responded emphatically with match-winning performances for Rangpur Riders in the Bangladesh Premier League (BPL) 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-vs-fulham-draw-style-of-play-arne-slot-defends-formation-premier-league-2846656-2026-01-05",
      "headline": "Arne Slot backs Liverpool's measured style of play despite Fulham drawArne Slot defended Liverpool's approach after another frustrating draw. Despite questions over creativity and identity, the manager insisted his philosophy remains intact as the Reds continue to search for balance and consistency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/brazil-135-ultra-pooja-krishnamoorthy-india-women-endurance-run-2846141-2026-01-05",
      "headline": "Running with a purpose: Pooja Krishnamurthy flies the Indian flag at Brazil 135Speaking to India Today exclusively, Indian ultrarunner Pooja Krishnamoorthy talks about her journey from the start, her bigger cause with each mile she covers and the challenges at the Brazil 135. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-ipl-release-political-pressure-cricket-governance-india-bangladesh-controversy-2846638-2026-01-05",
      "headline": "BCCI's Mustafizur Rahman no-ball shows why cricket is not a serious sportAs avoidable as a no-ball, the BCCI's handling of Mustafizur Rahman has pushed Bangladesh to reconsider touring India, further destabilising a sport already weakened by political interference, administrative hesitation and an alarming lack of clear, consistent authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-leaves-ptpa-citing-governance-and-transparency-concerns-2846599-2026-01-05",
      "headline": "Novak Djokovic quits tennis player body he founded in shock exitNovak Djokovic co-founded the PTPA to give players a stronger, independent voice in how the sport is run. Six years on, he has stepped away from the organisation, saying concerns over transparency mean it no longer reflects his values."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/report-bangladesh-cricket-board-seeks-hybrid-model-for-t20-world-cup-in-india-ytvd-2846602-2026-01-05",
      "headline": "Report: Bangladesh Cricket Board Seeks Hybrid Model For T20 World Cup In IndiaIn this transcript, an unidentified speaker discusses the Bangladesh Cricket Board's (BCB) request for a 'hybrid model' for the T20 World Cup. The speaker states that the board is ready to play India but prefers matches to be moved out of the country due to safety concerns for players. The individual mentions that the decision is influenced by government directives and cites the release of a player, likely Mustafizur Rahman, from the IPL franchise Kolkata Knight Riders (KKR) for security reasons. The speaker also notes that the team was scheduled to play three games in Kolkata and one in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-swai-mansingh-stadium-ipl-2026-home-games-writes-bcci-cricket-board-2846595-2026-01-05",
      "headline": "RR to play in Pune? State board approaches BCCI to retain IPL matches in JaipurRajasthan Cricket Association has stepped in to protect Rajasthan Royals' Jaipur base. With uncertainty over IPL 2026 venues, the RCA has formally urged the BCCI to keep RR home games at Sawai Mansingh Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-cristiano-ronaldo-fifa-world-cup-2026-stage-final-battle-goats-2845284-2026-01-05",
      "headline": "Messi vs Ronaldo: Will FIFA World Cup 2026 be the stage for a final GOAT battle?Lionel Messi and Cristiano Ronaldo will lock horns once again, this time under the bright lights of the World Cup. With their careers set to come to a close, can the GOATS deliver one final magical performance for Argentina and Portugal respectively?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-brother-from-another-mother-dwayne-bravo-csk-ipl-2026-relationship-2846581-2026-01-05",
      "headline": "MS Dhoni is my brother from another mother: Dwayne Bravo opens up on CSK bondDwayne Bravo revealed how MS Dhoni's trust shaped his role at Chennai Super Kings. By keeping things simple and backing his players, Dhoni built an environment that helped CSK succeed consistently in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ruben-amorim-tension-manchester-united-management-leeds-draw-2846572-2026-01-05",
      "headline": "Ruben Amorim's jibe hints at off-field tensions at Manchester United after Leeds drawRuben Amorim's post-match comments overshadowed Manchester United's draw at Leeds. By stressing he is a manager and not just a coach, Amorim publicly exposed growing tension with the club's hierarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-vs-eng-joe-root-century-equal-ricky-ponting-record-sydney-test-2846570-2026-01-05",
      "headline": "Joe Root goes level with Ricky Ponting after 2nd Ashes 100 in AustraliaJoe Root's SCG century pushed him level with Ricky Ponting on the all-time Test list. The hundred underlined his dominance in the Ashes and England's strong position in the series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ilt20-desert-vipers-champion-beat-mi-emirates-sam-curran-mvp-performance-2846567-2026-01-05",
      "headline": "Desert Vipers clinch ILT20 title after Sam Curran pulls off MVP showSam Curran crowned a flawless ILT20 campaign as Desert Vipers finally converted consistency into long-awaited silverware. A dominant final display confirmed their supremacy and ended years of near-misses on Dubai's biggest night under lights Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-pull-out-of-india-t20-world-cup-2846548-2026-01-04",
      "headline": "Bangladesh cricket official explains call to not play T20 World Cup in IndiaT20 World Cup 2026: Bangladesh have requested the ICC to move their matches from India to Sri Lanka. BCB director Faruque Ahmed explains to India Today how the country's cricket board arrived at that decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jay-shah-100-medals-olympics-india-2036-2846541-2026-01-04",
      "headline": "Jay Shah's mission Olympics: Want 100 medals from India in 2036Former BCCI president Jay Shah wants a 100 medals from India in the 2036 Olympics. Shah, who now heads the ICC made his statements during the Run for Girl Child Half Marathon in Surat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-boxing-championship-no-ring-day-1-bfi-logistical-nightmare-greater-noida-report-2846524-2026-01-04",
      "headline": "No rings on Day 1: National Boxing Championship delayed after logistical nightmareA chaotic, ringless start delayed the National Boxing Championships by over four hours, leaving boxers waiting in uncertainty as logistical lapses disrupted what was meant to be a landmark opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ahmed-al-ahmed-bondi-beach-shooting-hero-scg-ashes-sydney-2846480-2026-01-04",
      "headline": "Bondi hero Ahmed al-Ahmed gets standing ovation from sold-out SCGBondi hero Ahmed al-Ahmed was honoured by the Sydney Cricket Ground on Day 1 of the final Ashes Test match. Al-Ahmed had risked his life to save civilians when two armed men opened fire at Bondi Beach on December 14, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/special-report-bangladesh-cricket-board-refuses-to-play-t20-world-cup-matches-in-india-ytvd-2846463-2026-01-04",
      "headline": "IPL Controversy: BCB Cites Security Threats And Demands Relocation Of World Cup Games To Sri LankaIn this special broadcast, the focus is on the escalating diplomatic and sporting tension between India and Bangladesh. The controversy stems from the Indian Premier League (IPL) franchise Kolkata Knight Riders reportedly releasing Bangladeshi pacer Mustafizur Rahman following political pressure. In a retaliatory move, the Bangladesh Cricket Board (BCB) has officially requested the International Cricket Council (ICC) to shift their T20 World Cup matches from India to Sri Lanka, citing security concerns. The programme features a discussion on the implications of this decision, comparing it to Pakistan's stance, and explores whether politics is overshadowing the spirit of the game. Experts debate if this sets a dangerous precedent for global sports and if the IPL brand value could suffer due to such geopolitical exclusions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}