{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-allows-cab-aggregators-to-double-peak-hour-fares-under-new-guidelines-2749292-2025-07-02",
      "headline": "Ola, Uber get government okay for surge pricing, can charge double the base fareStates have been advised to implement the updated guidelines within the next three months. The revised fare structure is aimed at giving platforms flexibility during high-demand periods, while maintaining an overall regulatory framework for pricing and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-higher-nifty-above-25600-infosys-up-2-percent-us-india-trade-deal-it-shares-2749287-2025-07-02",
      "headline": "Sensex, Nifty open higher as IT stocks rally on hopes of US-India trade dealThe S&P BSE Sensex was up 103.13 points to 83,800.42, while the NSE Nifty50 added 21 points to 25,562.80 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-refuses-to-remove-mask-at-airport-says-shes-unwell-watch-2749465-2025-07-02",
      "headline": "Rasha Thadani refuses to remove mask at Airport, says she's unwell. WatchActor Rasha Thadani was clicked at the Mumbai airport wearing a mask and politely informed the paparazzi that she was unwell. Despite their requests, she kept her mask on but thanked them and posed for photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-heads-of-state-role-director-ilya-naishuller-idris-elba-john-cena-2749468-2025-07-02",
      "headline": "Priyanka Chopra says Heads of State team knows value of strong female leadPriyanka Chopra, who plays the role of MI6 agent Noel Bisset in 'Heads of State', shared her views on performing high-octane action stunts in the film. The actor even credited the director Ilya Naishuller for making her character strong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-seo-yi-dies-at-43-cause-of-death-unknown-south-korean-actor-2749473-2025-07-02",
      "headline": "The Divorce Insurance actor Lee Seo-yi dies at 43, cause of death unknownSouth Korean actor Lee Seo-yi died at the age of 43 with the cause of death still unknown. Her manager shared the news on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-defends-romancing-fatima-sana-shaikh-in-thugs-of-hindostan-after-playing-her-father-2749377-2025-07-02",
      "headline": "Aamir Khan defends romancing Fatima Sana Shaikh in Thugs after playing her fatherBollywood actor Aamir Khan defended the casting of 'Thugs of Hindostan' in a recent interview. The actor shared that the director wanted to remove the romantic angle between him and Fatima Sana Shaikh, but he had no issues romancing her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-fresh-post-about-truth-after-deleting-diljit-dosanjh-post-2749453-2025-07-02",
      "headline": "Naseeruddin Shah writes about truth after deleting Diljit Dosanjh postVeteran actor Naseeruddin Shah made a cryptic post about telling the truth a day after deleting his previous post backing Diljit Dosanjh for working with Hania Aamir in 'Sardaar Ji 3' and going ahead with the overseas release of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/all-you-need-to-know-about-txts-fourth-studio-album-the-name-chapter-together-2749474-2025-07-02",
      "headline": "All you need to know about TXT's fourth studio album The Name Chapter: TOGETHERK-pop sensation TOMORROW X TOGETHER is all set to drop their much-awaited fourth studio album, The Name Chapter: TOGETHER, marking the end of their popular Name Chapter series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-to-promote-war-2-separately-heres-why-2749406-2025-07-02",
      "headline": "Hrithik Roshan-Jr NTR to promote War 2 separately. Here's whyActors Hrithik Roshan and Jr NTR would only be seen fighting with each other on the big screen in 'War 2'. The makers of the film decided that it would be better if the two actors promoted the film separately to build their on-screen rivalry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-cheers-for-shanaya-kapoor-aankhon-ki-trailer-welcomes-her-to-films-2749463-2025-07-02",
      "headline": "Abhishek Bachchan cheers for Shanaya Kapoor's debut in Aankhon Ki GustaakhiyanShanaya Kapoor is all set to make her Bollywood debut with 'Aankhon Ki Gustaakhiyan'. Ahead of that, Abhishek Bachchan gave her a warm welcome, cheering for the upcoming love drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sumit-vyas-says-theatre-feels-less-pressured-more-friends-2749449-2025-07-02",
      "headline": "Sumit Vyas says theatre feels less pressured: I have more friends thereActor Sumit Vyas, in an exclusive interview, shared the reason behind his love for theatre and what makes it his creative anchor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mawra-hocane-saba-qamar-instagram-handles-reappear-pak-artists-ban-in-india-2749330-2025-07-02",
      "headline": "Mawra Hocane, Saba Qamar's Instagram handles reappear amid Pak artists ban in IndiaThe Instagram handles of Mawra Hocane, Saba Qamar, and many other Pakistani actors reappeared for Indian social media users. Amid a ban on Pakistani artists, certain restricted YouTube channels are also now visible in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-producer-sirish-reddy-reacts-to-backlash-over-ram-charan-remark-2749409-2025-07-02",
      "headline": "Please forgive me: Game Changer producer reacts to backlash over Ram Charan remark'Game Changer' producer Shirish Reddy clarified his viral remark about Ram Charan not reaching out after the film's failure, stating he meant no disrespect. He apologised and emphasised his long-standing bond with Ram Charan and Chiranjeevi's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-announces-daughter-vismaya-debut-film-thudakkam-wishes-her-lifelong-affair-with-cinema-2749373-2025-07-02",
      "headline": "Mohanlal announces daughter Vismaya's debut, wishes her lifelong affair with cinemaMohanlal has announced his daughter Vismaya Mohanlal's acting debut with the film 'Thudakkam', directed by Jude Anthany Joseph. The actor shared the first-look poster and penned a note, blessing her new journey in cinema.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-acting-offers-people-say-he-should-be-in-films-heads-of-state-screening-2749384-2025-07-02",
      "headline": "Will Raghav Chadha make his acting debut? Parineeti Chopra answersParineeti Chopra is in London for the screening of Priyanka's 'House of State'. In an interview with India Today, the actor jokingly spoke about how her husband-politician Raghav Chadha, often gets acting offers because of his good looks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pete-davidson-says-grandfather-abused-him-jokes-about-his-slow-death-2749356-2025-07-02",
      "headline": "Comedian Pete Davidson says grandfather abused him, jokes about his slow deathDuring a recent stand-up performance, comedian Pete Davidson shared about the abuse he faced from his grandfather while growing up. He joked about anticipating his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gautam-gambhir-yuzvendra-chahal-rishabh-pant-and-others-light-up-the-great-indian-kapil-show-2749348-2025-07-02",
      "headline": "Gautam Gambhir, Yuzi Chahal, Rishabh Pant, and others light up Kapil's showThe latest episode of 'The Great Indian Kapil Show' on Netflix brings together cricket stars Gautam Gambhir, Rishabh Pant, Yuzvendra Chahal, and Abhishek Sharma. Hosted by Kapil Sharma, the show reveals the fun and playful side of these athletes, promising plenty of laughter and entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fx-the-bear-gets-renewed-for-season-5-jeremy-allen-white-2749339-2025-07-02",
      "headline": "The Bear gets renewed for Season 5, fans reactFX has renewed the critically acclaimed series 'The Bear' for a fifth season, following the widespread praise for its fourth season streaming on Hulu. Season 4 premiered on June 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-kapoor-emotional-tearful-at-daughter-shanaya-kapoor-debut-film-aankhon-ki-gustaakhiyan-trailer-launch-watch-viral-video-2749308-2025-07-02",
      "headline": "Sanjay Kapoor fights tears at trailer launch of daughter Shanaya's filmActor Sanjay Kapoor was visibly emotional at the trailer launch of his daughter Shanaya Kapoor's upcoming film 'Aankhon Ki Gustaakhiyan'. The film is set to release on July 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-failing-at-pr-attended-parties-spent-rs-60k-on-designer-clothes-2749295-2025-07-02",
      "headline": "Vikrant Massey on failing at PR: Attended parties, spent Rs 60k on designer clothesActor Vikrant Massey recently spoke about the challenges one faces when it comes to PR tactics in Bollywood. He reflected on staying authentic amid industry expectations and costly publicity efforts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-minu-muneer-granted-bail-in-actor-balachandra-menon-defamation-case-2749313-2025-07-02",
      "headline": "Malayalam actor Minu Muneer granted bail in actor Balachandra Menon defamation caseMalayalam actor Minu Muneer was granted bail on Tuesday in an old case involving actor-director Balachandra Menon. She was accused of defaming him through her social media posts. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sheikh-hasina-sentenced-to-6-months-in-prison-in-a-contempt-of-court-case-in-bangladesh-report-2749485-2025-07-02",
      "headline": "Bangladesh court sentences Sheikh Hasina to 6-month jail in contempt case: ReportFormer Bangladesh Prime Minister Sheikh Hasina was given her first conviction since exile, sentencing her to six months in prison for contempt over a leaked phone call threatening the judiciary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-rape-love-bites-found-on-accused-monojit-mishra-neck-2749451-2025-07-02",
      "headline": "If it was rape, why did accused have love bites on neck? Kolkata lawyer's shockerThe lawyer's claim comes after a medico-legal examination revealed scratch marks on the body of the prime accused, pointing to signs of resistance by the rape survivor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dalai-lama-reveals-when-his-successor-will-be-chosen-shuts-out-chinas-participation-2749311-2025-07-02",
      "headline": "Dalai Lama reveals his succession plan, shuts out China's role; Beijing fumesThe Dalai Lama has reaffirmed that only his official office will choose his successor, rejecting any Chinese claim over selecting the next spiritual leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-teacher-gave-anti-depressants-raped-student-for-a-year-in-5-star-hotels-2749424-2025-07-02",
      "headline": "Teacher at top Mumbai school rapes her student for a year in 5-star hotelsThe teacher allegedly committed the acts at various locations, including five-star hotels, and is also accused of putting the survivor on antidepressants. After his Higher Secondary exams, the student finally informed his parents when the teacher sent her servant to his house, requesting a meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/zohran-mamdani-cutlery-shaming-and-america-finger-lickin-hypocrisy-eating-with-hands-viral-video-2749306-2025-07-02",
      "headline": "Zohran Mamdani, cutlery shaming, and America's Finger-Lickin' hypocrisyIndians love to eat with their hands and the West can never digest this fact. This age-old debate flared up when Zohran Mamdani was found eating with his bare hands and was told to go back to the \"Third World\" by a US politician. Slightly hypocritical for a country whose second-largest restaurant chain's slogan is \"Finger Lickin' Good\".  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-2nd-test-day-1-updates-birmingham-weather-2749459-2025-07-02",
      "headline": "2nd Test Day 1 Live: Toss in 10 mins, will Bumrah play in Birmingham?India vs England Live Score, 2nd Test Day 1: Shubman Gill's India eye redemption in the high-stakes Edgbaston Test after a Leeds setback, while Ben Stokes' England look to extend their lead — with Jasprit Bumrah's availability adding suspense to the buildup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-puts-end-to-leadership-change-speculation-says-he-will-stay-ktaka-cm-for-full-five-year-term-2749421-2025-07-02",
      "headline": "Siddaramaiah says will remain Chief Minister, DK Shivakumar throws his hands upKarnataka Chief Minister Siddaramaiah asserted that he would complete his five-year term. Meanwhile, Deputy Chief Minister DK Shivakumar stated that he has no option but to support him and follow the party high command's decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/dubai-dark-secret-sexual-abuse-behind-porta-potty-parties-ultra-rich-influencers-social-media-racial-profile-2748912-2025-07-02",
      "headline": "Dubai's dark secret: Sexual extremities in Porta-Potty parties of the ultrarichDubai's ultrarich lure women into secret Porta-Potty parties with luxury gifts, only to exploit them through degrading sexual acts. The recent death of a Ukrainian model in Dubai has been linked to sexual extremities at a Porta-Potty party. Experts are now warning young female tourists against such private events that have legal risks too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/japan-airlines-flight-pressure-drop-passengers-write-out-wills-boeing-plummets-sharply-china-tokya-plane-2749395-2025-07-02",
      "headline": "Japan Airlines Boeing 737 drops 26,000 feet, passengers write farewell notesThe aircraft encountered a mid-air mechanical issue that triggered a rapid descent from approximately 36,000 feet to just under 10,500 feet in under 10 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-india-hamid-mir-journalish-spin-theory-narendra-modi-operation-sindoor-israel-benjamin-netanyahu-2749347-2025-07-02",
      "headline": "Not Saqlain Mushtaq, Pakistan's all-time greatest spinner is Hamid MirNeither Saqlain Mushtaq nor Abdul Qadir, the greatest spinner that Pakistan has produced, is a journalist, Hamid Mir. From spinning theories of India and Israel coming together to attack Pakistan by October 2025 and PM Modi not being invited to the recent G7 summit due to India's \"state-sponsored terrorism\", his extravagant claims, especially after Operation Sindoor, have left people bewildered."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-plane-crash-pilots-simulate-accident-technical-flaw-2749357-2025-07-02",
      "headline": "What led to Air India crash? Pilots simulate accident, find key flaw, says reportAir India crash: As part of the simulation, the Air India pilots kept the landing gear deployed and the wing flaps retracted. It was found that these configurations alone would not have resulted in a crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-indian-student-visa-f1-j1-duration-change-fix-2025-bill-department-of-homeland-security-2749380-2025-07-02",
      "headline": "US plans time limit on student visas; likely to hit plans of IndiansIn yet another crackdown on immigration in the US, the Donald Trump administration may cut the stay time of international students in the US. Enforcing a time limit on F-1 and J-1 visas will impact the plans of students from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-heads-of-state-role-director-ilya-naishuller-idris-elba-john-cena-2749468-2025-07-02",
      "headline": "Priyanka Chopra says Heads of State team knows value of strong female leadPriyanka Chopra, who plays the role of MI6 agent Noel Bisset in 'Heads of State', shared her views on performing high-octane action stunts in the film. The actor even credited the director Ilya Naishuller for making her character strong. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gangrape-case-monojit-mishra-another-student-bengal-tmc-2749381-2025-07-02",
      "headline": "Undressed me, pulled hair: Another student alleges molestation by Kolkata accusedFresh allegations have surfaced against Kolkata rape accused Monojit Mishra. A second-year student, while speaking to India Today, alleged that he locked her in a room and molested her in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/the-dubai-property-boom-among-indians-is-cheap-real-estate-the-reason-2749408-2025-07-02",
      "headline": "The Dubai property boom among Indians: Is cheap real estate the reason?Wanting to buy property in Dubai is understandable, but what's really behind the boom? Let's find out.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-gang-rape-given-inhaler-panic-attack-police-court-2749420-2025-07-02",
      "headline": "Kolkata survivor given inhaler to ward off panic attack, only to be raped againThe submission was made by the chief public prosecutor as the Kolkata court extended the police custody of the three rape accused till July 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cardiac-surgeon-ramakanta-panda-flags-rising-heart-issues-in-young-indians-in-karnataka-hassan-2749188-2025-07-02",
      "headline": "Top cardiac surgeon flags rising heart issues in young IndiansFour sudden heart attack deaths in Hassan district have alarmed the community. Dr. Ramakanta Panda talks about deadly lifestyle habits that have increased cardiovascular issues in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/ap-high-court-rules-cannabis-seeds-and-leaves-are-not-ganja-not-illegal-under-ndps-act-2749423-2025-07-02",
      "headline": "Cannabis seeds, leaves not ganja: Andhra Pradesh High Court weeds out confusionIn a key ruling, the Andhra Pradesh High Court has clarified that only the flowering or fruiting tops of the cannabis plant are banned under the NDPS Act, not seeds or leaves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/meet-anil-menon-the-next-indian-american-set-to-go-to-space-after-sunita-williams-2749367-2025-07-02",
      "headline": "Surgeon, pilot, astronaut: This Indian-American will go to space in 2026Selected as part of Nasa's 23rd astronaut class in 2021, Menon graduated as an astronaut in 2024. Since then, he has been preparing intensively for his first spaceflight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-warms-up-us-president-donald-trump-after-deportation-threat-lauds-global-peace-efforts-2749345-2025-07-02",
      "headline": "Elon Musk warms up to Trump after deportation threatPosting Donald Trump's Truth Social post claiming that Israel has agreed to a 60-day ceasefire in Gaza, Elon Musk credited the US President for resolving global conflicts, saying, 'Credit where credit is due.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-cm-siddaramaiah-45-year-old-record-congress-devaraj-urs-life-parallels-power-tussle-2749100-2025-07-02",
      "headline": "Siddaramaiah stays for now. Is he chasing 45-year-old record by a Karnataka CM?Karnataka Chief Minister Siddaramaiah's desire to be Karnataka's longest-serving CM is partly behind his power tussle with DK Shivakumar. To fulfil his desire, Siddaramaiah will have to break D Devaraj Urs' record. There are interesting parallels between the life of Siddaramaiah and that of Urs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/career-growth-tips-that-helped-a-linkedin-employee-get-5-promotions-in-6-years-2749396-2025-07-02",
      "headline": "LinkedIn employee gets 5 promotions in 6 years, shares 2 questions and 4 tipsCareer growth isn't magic -- it's strategy. A former LinkedIn employee shared 2 rules and 4 promotion tips that earned her five promotions in six years. Try these proven career success tips."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-schedule-fixtures-alcaraz-raducanu-bopanna-2749443-2025-07-02",
      "headline": "Day 3 schedule: Alcaraz, Raducanu in 2nd round, Bopanna begins campaignWimbledon 2025: Defending champion Carlos Alcaraz and World No 1 Aryna Sabalenka play second round matches on Wednesday. India's doubles players, including Rohan Bopanna, begin their campaigns in London."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-2nd-test-day-1-updates-birmingham-weather-2749459-2025-07-02",
      "headline": "India vs England Live Score, 2nd Test Day 1: Will Jasprit Bumrah play in Birmingham?India vs England Live Score, 2nd Test Day 1: Shubman Gill's India eye redemption in the high-stakes Edgbaston Test after a Leeds setback, while Ben Stokes' England look to extend their lead — with Jasprit Bumrah's availability adding suspense to the buildup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-schedule-fixtures-alcaraz-raducanu-bopanna-2749443-2025-07-02",
      "headline": "Day 3 schedule: Alcaraz, Raducanu in 2nd round, Bopanna begins campaignWimbledon 2025: Defending champion Carlos Alcaraz and World No 1 Aryna Sabalenka play second round matches on Wednesday. India's doubles players, including Rohan Bopanna, begin their campaigns in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shikhar-dhawan-indian-cricket-ishan-kishan-200-bangladesh-2749446-2025-07-02",
      "headline": "Ishan's iconic 200: The moment Dhawan knew his India career was overShikhar Dhawan revealed that Ishan Kishan's 200 vs Bangladesh gave him the realisation and he accepted that his time with the Indian team was well and truly over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-trading-news-sanju-samson-csk-aakash-chopra-2749392-2025-07-02",
      "headline": "Sanju Samson to CSK? RR might want Jadeja or Ashwin in return, says ex-openerIPL trade news: Former India opener Aakash Chopra said he is intrigued by reports of Chennai Super Kings seeking a trade of Sanju Samson from Rajasthan Royals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-wimbledon-loss-roland-garros-switch-no-time-overwhelmed-2749393-2025-07-02",
      "headline": "How Roland Garros success overwhelmed Coco Gauff to Wimbledon lossCoco Gauff's dream of a historic Roland Garros–Wimbledon double came crashing down in the first round at SW19, as the emotional toll and rushed grass-court switch proved too much against an inspired Dayana Yastremska."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-origin-players-abroad-represent-india-new-national-sports-policy-2749358-2025-07-02",
      "headline": "Indian-origin players abroad may now represent India under new National Sports PolicyThe new National Sports Policy allows Indian-origin players living abroad to represent India internationally. This shift aims to strengthen India's sports ecosystem and enhance global sporting ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-no-more-mr-nice-guy-ruthless-edgbaston-test-2749340-2025-07-02",
      "headline": "No more Mr Nice Guy: Gill needs to show his ruthless self in BirminghamIndia's chances of winning the second Test in Birmingham boil down to whether Shubman Gill is able to establish his vision and bring out his style of cricket in the team. This includes picking more attacking options in the bowling unit and being more demanding of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-interview-16-year-old-park-tae-sang-2749329-2025-07-02",
      "headline": "Part Saina, part Sindhu, 16-year-old Tanvi Sharma sets sights on Olympic glorySpeaking to IndiaToday.in, 16-year-old Tanvi Sharma and her coach, Park Tae Sang, reflect on the run to the US Open final. A true PV Sindhu fan, Tanvi based her game on India's double Olympic medalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-birmingham-test-weather-forecast-rain-prediction-pitch-report-edgbaston-2749305-2025-07-02",
      "headline": "ENG vs IND, Birmingham weather forecast: Will rain douse India's comeback?ENG vs IND: India's push to level the series at Edgbaston may be dictated more by Birmingham's skies than the scorecard, as unpredictable weather and a seam-friendly pitch threaten to take centre stage in the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-sammy-calls-for-justice-rape-allegations-west-indies-player-2749301-2025-07-02",
      "headline": "W'Indies cricketer faces rape allegations: We believe in justice, says Darren SammyWest Indies head coach Darren Sammy expressed confidence that the proper processes would be followed in the investigation into rape allegations against a current cricketer. Sammy said he had worked to maintain morale in the dressing room ahead of the second Test against Australia, starting on 3 June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-origin-players-abroad-represent-india-new-national-sports-policy-2749358-2025-07-02",
      "headline": "Indian-origin players abroad may now represent India under new National Sports PolicyThe new National Sports Policy allows Indian-origin players living abroad to represent India internationally. This shift aims to strengthen India's sports ecosystem and enhance global sporting ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-no-more-mr-nice-guy-ruthless-edgbaston-test-2749340-2025-07-02",
      "headline": "No more Mr Nice Guy: Gill needs to show his ruthless self in BirminghamIndia's chances of winning the second Test in Birmingham boil down to whether Shubman Gill is able to establish his vision and bring out his style of cricket in the team. This includes picking more attacking options in the bowling unit and being more demanding of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-interview-16-year-old-park-tae-sang-2749329-2025-07-02",
      "headline": "Part Saina, part Sindhu, 16-year-old Tanvi Sharma sets sights on Olympic glorySpeaking to IndiaToday.in, 16-year-old Tanvi Sharma and her coach, Park Tae Sang, reflect on the run to the US Open final. A true PV Sindhu fan, Tanvi based her game on India's double Olympic medalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-birmingham-test-weather-forecast-rain-prediction-pitch-report-edgbaston-2749305-2025-07-02",
      "headline": "ENG vs IND, Birmingham weather forecast: Will rain douse India's comeback?ENG vs IND: India's push to level the series at Edgbaston may be dictated more by Birmingham's skies than the scorecard, as unpredictable weather and a seam-friendly pitch threaten to take centre stage in the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-sammy-calls-for-justice-rape-allegations-west-indies-player-2749301-2025-07-02",
      "headline": "W'Indies cricketer faces rape allegations: We believe in justice, says Darren SammyWest Indies head coach Darren Sammy expressed confidence that the proper processes would be followed in the investigation into rape allegations against a current cricketer. Sammy said he had worked to maintain morale in the dressing room ahead of the second Test against Australia, starting on 3 June."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}