{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-213-points-lower-nifty-below-24900-tata-motors-down-2-percent-2742082-2025-06-17",
      "headline": "Sensex ends 213 points lower, Nifty below 24,900; Tata Motors down 2%The S&P BSE Sensex lost 212.85 points to close at 81,583.30, while the NSE Nifty50 declined by 93.10 points to end at 24,853.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/savings-accounts-interest-rates-fall-rbi-cuts-fixed-deposits-debt-mutual-funds-2742063-2025-06-17",
      "headline": "Savings account interest rates see sharp drop. Do you really need one?A look into the declining utility of savings accounts as interest rates fall, questioning their role in financial growth and suggesting alternative investment options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/octafx-forex-trading-fraud-scam-enforcement-directorate-investors-raids-mumbai-delhi-mule-accounts-url-masking-fake-e-commerce-platforms-2742067-2025-06-17",
      "headline": "Mule accounts, url masking: How forex trading platform OctaFX scammed investorsThe Enforcement Directorate on June 13 conducted raids at seven locations across four cities, and various incriminating documents and digital devices seized during the operation showed how forex trading platform - OctaFX - cheated investors and generated more than Rs 800 crore in less than a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hyderabad-real-estate-price-rise-80-percent-outpaces-delhi-mumbai-bengaluru-2742020-2025-06-17",
      "headline": "Over 80% jump: The city that outpaced Delhi, Mumbai in property price growthOver the past four years, one city has quietly clocked an 80% surge in home prices, outshining Delhi, Mumbai, and Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-location-importance-crude-oil-india-israel-iran-tensions-stock-market-inflation-2741920-2025-06-17",
      "headline": "Why the Strait of Hormuz matters to India amid Israel-Iran tensionsThe Strait of Hormuz is located between Iran to the north and Oman and the United Arab Emirates (UAE) to the south. It connects the Persian Gulf to the Gulf of Oman, and then to the Arabian Sea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-unemployment-rate-rises-may-2025-youth-women-affected-2741900-2025-06-17",
      "headline": "India's unemployment rate rises to 5.6% in May 2025Rural areas saw a considerable rise in unemployment among those aged 15–29, with the rate reaching 13.7% in May from 12.3% in April. The situation was similarly difficult for urban youth, where unemployment marginally increased to 17.9% from 17.2% the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vishal-mega-mart-share-price-drop-stock-crash-stake-sale-promoter-samayat-services-llp-2741875-2025-06-17",
      "headline": "Explained: Why Vishal Mega Mart shares crashed 8% todayDespite the drop, Vishal Mega Mart's shares have done well overall this year. They have risen 18% in 2025 so far, outperforming the Nifty index, which has given a return of 5% year-to-date. Since the company's listing, the stock has gained 12%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bank-fixed-deposits-decline-indian-households-prefer-mutual-funds-equities-2741869-2025-06-17",
      "headline": "Explained: Why fixed deposits are losing appeal among Indian householdsOnce the go-to option for safety-first savers, fixed deposits are steadily losing favour. Read on to know what's driving the shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trend-strong-rally-iran-israel-conflict-limited-impact-reason-explained-2741852-2025-06-17",
      "headline": "Explained: Why Dalal Street hasn't panicked amid ongoing Iran–Israel conflictDespite war jitters and foreign outflows, domestic markets held firm. With retail inflows steady and domestic themes strong, is the buy-the-dip playbook still the smartest move?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-titan-tata-motors-down-1-percent-2741849-2025-06-17",
      "headline": "Sensex opens flat, Nifty below 25,000; Titan down 1%The S&P BSE Sensex was down by 194.71 points to 81,601.44, while the NSE Nifty lost 69 points to 24,877.50 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/arisinfra-solutions-ipo-june-2025-price-band-gmp-listing-2741840-2025-06-17",
      "headline": "Arisinfra Solutions IPO to open for bidding: All you need to knowArisinfra Solutions, a tech-driven B2B platform in the construction materials industry, is launching its IPO on June 18, seeking to raise Rs 499.60 crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-17-sensex-nifty-today-trading-setup-nse-bse-iran-israel-war-us-wall-street-2741825-2025-06-17",
      "headline": "Stock market opening: Will Sensex, Nifty rise again today?At 8:12 am, the Gift Nifty futures were trading at 24,957. This points to a likely flat start for the Nifty50, which closed at 24,946.5 on Monday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-gets-an-oscar-alongside-dolly-parton-and-debbie-allen-glbs-2742323-2025-06-18",
      "headline": "Tom Cruise gets an Oscar alongside Dolly Parton and Debbie AllenTom Cruise, Debbie Allen, Wynn Thomas, and Dolly Parton will receive honorary Oscars at the 2025 Governors Awards for their lasting impact on film and humanitarian work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/i-am-not-scared-veteran-actor-aruna-irani-on-beating-cancer-twice-2742269-2025-06-17",
      "headline": "I am not scared: Veteran actor Aruna Irani on beating cancer twiceIn a recent interview, actor Aruna Irani opened up about beating cancer twice and how she chose surgery over chemotherapy during her first cancer diagnosis.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-naked-gun-trailer-liam-neeson-pamela-anderson-lead-action-comedy-reboot-2742206-2025-06-17",
      "headline": "The Naked Gun trailer: Liam Neeson, Pamela Anderson lead action-comedy rebootThe official trailer for 'The Naked Gun', featuring Liam Neeson and Pamela Anderson was released by Paramount Pictures. The film is a reboot of the American action-comedy featuring Leslie Nielson in the lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-shares-bts-of-sapphire-shoot-says-i-love-you-india-2742224-2025-06-17",
      "headline": "Ed Sheeran shares BTS of Sapphire shoot, says I love you IndiaEd Sheeran gave fans a glimpse of what went on behind the scenes of his new music video Sapphire, calling it the longest shoot of his career. In a recent Instagram post, he shared that the three-week shoot was tough but totally worth it, and also expressed his love for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-draws-stunt-ideas-from-tom-jerry-2742207-2025-06-17",
      "headline": "Akshay Kumar draws stunt ideas from Tom & Jerry, calls it the most violent showAkshay Kumar revealed that many of his action stunts were inspired by the cartoon 'Tom & Jerry', which he considers full of creative and intense action. The actor shared how scenes from the show shaped iconic moments in his films like 'Sabse Bada Khiladi' and 'Khiladi 420'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-gives-hera-pheri-fans-hope-after-paresh-rawals-exit-2742173-2025-06-17",
      "headline": "Akshay Kumar gives Hera Pheri fans hope after Paresh Rawal's exitBollywood star Akshay Kumar has addressed Paresh Rawal's sudden exit from Hera Pheri 3, expressing hope that everything will go well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-eric-dane-fights-back-tears-in-1st-interview-on-als-diagnosis-fans-react-2741981-2025-06-17",
      "headline": "Actor Eric Dane fights back tears in 1st interview on ALS diagnosis, fans reactActor Eric Dane, who was recently diagnosed with ALS, opened up about his condition in a deeply emotional interview. Devastated fans around the world have expressed their heartbreak in response to the video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-deepika-padukone-was-unaware-of-jnu-politics-during-2020-visit-2742086-2025-06-17",
      "headline": "Vivek Agnihotri says Deepika Padukone was unaware of JNU politics during 2020 visitDirector Vivek Agnihotri recently shared his views on actor Deepika Padukone's 2020 visit to the JNU campus during a protest. He also highlighted the risks associated with celebrities getting involved in politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/modern-family-lily-aubrey-anderson-emmons-comes-out-as-bisexual-2742045-2025-06-17",
      "headline": "Modern Family's Lily comes out as bisexual, quotes iconic 'I am gay' line from the showModern Family's child star Aubrey Anderson-Emmons comes out as bisexual. She shared a video of her lip-syncing to her iconic line, 'I am gay' from the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-on-toughest-moment-after-stage-2-cancer-diagnosis-new-vlog-2742093-2025-06-17",
      "headline": "Dipika Kakar shares toughest moment after stage 2 cancer diagnosis in new vlogAfter undergoing surgery for stage 2 liver cancer, Dipika Kakar shared that the hardest part was having to abruptly wean her son, Ruhaan, off breastfeeding in a single night. She also expressed gratitude for the overwhelming love and support from her fans during this difficult time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-calls-kuberaa-a-special-film-thanks-co-stars-nagarjuna-and-rashmika-mandanna-2742105-2025-06-17",
      "headline": "Dhanush calls Kuberaa a special film, thanks co-stars Nagarjuna and RashmikaAt the pre-release event of 'Kuberaa' in Hyderabad, actor Dhanush described his upcoming Telugu film as \"special.\" Also starring Nagarjuna and Rashmika Mandanna, the film is set to release on June 20.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-rajinikanth-villain-lokesh-kanagaraj-coolie-august-14-release-2742088-2025-06-17",
      "headline": "Nagarjuna says playing Rajinikanth's villain in Coolie is liberating. Here's whyTelugu actor Nagarjuna will play Rajinikanth's villain in director Lokesh Kanagaraj's 'Coolie'. In a recent interview, he called it a liberating experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samyuktha-joins-vijay-sethupathi-in-puri-jagannadh-upcoming-pan-india-film-2741961-2025-06-17",
      "headline": "Samyuktha joins Vijay Sethupathi in Puri Jagannadh's upcoming pan-India filmActor Samyuktha has been confirmed to play the lead role opposite Vijay Sethupathi in Puri Jagannadh's untitled pan-India project. The film will be released in multiple languages across India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-snaps-at-paps-outside-her-gym-in-mumbai-2742051-2025-06-17",
      "headline": "Stop it guys: Samantha snaps at paps taking pictures of her outside her gymActor Samantha Ruth Prabhu snapped at the paparazzi stationed outside her gym in Mumbai. She requested them to stop and looked visibly irked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/genelia-deshmukh-joins-long-work-hours-debate-says-its-not-impossible-2742016-2025-06-17",
      "headline": "Genelia Deshmukh joins long work hours debate, says 10-hour shifts not impossibleActor Genelia Deshmukh shared her thoughts on long working hours in the film industry. She said she often works 10–12 hours a day but believes it's manageable with the right understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rekha-is-not-easy-find-director-muzaffar-ali-on-why-he-wouldnt-remake-umrao-jaan-2741909-2025-06-17",
      "headline": "Rekha is not easy find: Director Muzaffar Ali on why he wouldn't remake Umrao JaanDirector Muzaffar Ali's epic musical-drama 'Umrao Jaan' is all set to re-release in theatres. In an interview recently, he talked about the possibility of remaking the 1981 cult classic and why it wouldn't make sense now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-chitrangda-singh-apoorva-lakhia-military-action-film-2741994-2025-06-17",
      "headline": "Salman Khan and Chitrangda Singh team up for Apoorva Lakhia's next filmSalman Khan and Chitrangda Singh are set to star together for the first time in Apoorva Lakhia's upcoming military action drama. The untitled film is inspired by real events and marks a significant commercial outing for Chitrangda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aishwarya-rai-iconic-devdas-saree-look-created-overnight-by-designer-neeta-lulla-2741968-2025-06-17",
      "headline": "Aishwarya Rai's iconic Devdas saree created overnight, says designer Neeta LullaAishwarya Rai's iconic climax look in 'Devdas' was created overnight by designer Neeta Lulla after a last-minute request from director Sanjay Leela Bhansali. The dramatic saree scene became one of the film's most memorable moments and contributed to its National Award-winning costume design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-on-career-gaps-after-heeramandi-success-2741913-2025-06-17",
      "headline": "Aditi Rao Hydari opens up about career gaps after Heeramandi success: Still waitingDespite receiving immense praise for her role in 'Heeramandi', Aditi Rao Hydari revealed she hasn't signed a new project yet. She also opened up about the ongoing challenges women face in the entertainment industry. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-know-where-supreme-leader-is-hiding-wont-take-him-out-for-now-trumps-warning-to-iran-2742273-2025-06-17",
      "headline": "Trump says US won't take out Khamenei for now, wants Iran's unconditional surrenderUS President Donald Trump has warned that the United States knows the exact location of Iran's Supreme Leader Ayatollah Ali Khamenei but has chosen not to target him, \"at least not for now.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/focus-on-aircraft-safety-tighten-flight-ops-ensure-timely-departures-aviation-body-to-air-india-top-brass-2742218-2025-06-17",
      "headline": "No major concerns found in Air India Boeing 787 jets: Aviation body after checksThe Directorate General of Civil Aviation (DGCA) has directed Air India to significantly strengthen its focus on aircraft safety and maintenance protocols, streamline and tighten overall flight operations, and implement measures to ensure timely departures across its domestic and international network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-canada-mark-carney-hold-bilateral-meeting-g7-summit-2742336-2025-06-18",
      "headline": "PM Modi, Canada's Mark Carney hold bilateral meeting on sidelines of G7 SummitPrime Minister Narendra Modi meets Canadian PM Mark Carney on the G7 Summit sidelines. Both the leaders discussed strengthening India-Canada ties in trade, energy, AI and anti-terror cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/on-iran-israel-conflict-trump-says-he-wants-a-real-end-not-a-ceasefire-2742074-2025-06-17",
      "headline": "Real end, not just a ceasefire: Trump's endgame on Iran-Israel conflictTrump, who left the G7 summit early due to the Middle East situation, said the US is looking at a \"real end\" to Iran-Israel conflict and not a ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/i-wasnt-on-air-india-flight-171-but-i-havent-stopped-reliving-the-horror-2742127-2025-06-17",
      "headline": "I wasn't on Air India Flight 171, but I haven't stopped reliving the horrorI can't shake off what happened on Air India Flight 171. It's brought back my old fear of flying, stronger than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/canada-mark-carney-receives-pm-narendra-modi-g7-summit-venue-2742312-2025-06-18",
      "headline": "PM Narendra Modi meets world leaders at G7 Summit in CanadaCanadian PM Mark Carney received Prime Minister Narendra Modi as he arrived at the venue of the G7 Summit in Kananaskis, Alberta. Following this, PM Modi met world leaders, including French President Emmanuel Macron, Mexican President Claudia Sheinbaum, Lee Jae-Myung, President of the Republic of Korea and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-considering-joining-israel-strikes-iranian-nuclear-facilities-us-media-reports-glbs-2742327-2025-06-18",
      "headline": "Trump mulls joining Israeli strikes on Iranian nuclear sites: ReportUS President Donald Trump is weighing the possibility of joining Israel's strikes on Iranian nuclear facilities, according to media reports. The move follows a high-level security meeting in the White House and rising tensions after Trump's abrupt G7 exit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-day-5-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2741862-2025-06-17",
      "headline": "Live: US shuts embassy in Jerusalem for three days as conflict escalatesIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other for the fifth consecutive day. Amid the ongoing crisis in the Middle East, G7 leaders gathered in Canada urged an end to hostilities between Iran and Israel, with French President Emmanuel Macron revealing that his US counterpart, Donald Trump, has already initiated a truce deal between the two warring nations. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/genelia-deshmukh-joins-long-work-hours-debate-says-its-not-impossible-2742016-2025-06-17",
      "headline": "Genelia Deshmukh joins long work hours debate, says 10-hour shifts not impossibleActor Genelia Deshmukh shared her thoughts on long working hours in the film industry. She said she often works 10–12 hours a day but believes it's manageable with the right understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-extremists-plot-ambush-during-pm-modi-canada-visit-g7-summit-kananaskis-alberta-trump-carney-2741942-2025-06-17",
      "headline": "Khalistanis plot 'ambush' during PM Modi's Canada visitKhalistani separatists in Alberta staged an \"ambush\" protest during PM Narendra Modi's G7 visit, shouting violent slogans. The anti-Modi rallies in Calgary drew Canadian media attention, but many journalists also praised PM Mark Carney's decision to invite Modi, viewing it as a signal that Canada is beginning to push back against separatist pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-indian-students-evacuation-hurdles-land-route-airspace-pakistan-2742163-2025-06-17",
      "headline": "Why a Ukraine-style evacuation of Indians is not possible in IranWhen the Russia-Ukraine war broke out in 2022, India swiftly evacuated thousands of students. However, a similar evacuation from Iran may not be as easy. Here is why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/12-flights-diverted-roads-waterlogged-as-rain-lashes-delhi-ncr-2742226-2025-06-17",
      "headline": "14 flights hit, water enters terminal 1 after heavy rain lashes Delhi-NCRAt least 14 flights were diverted at the Delhi airport due to poor weather conditions on Tuesday evening. Several areas faced waterlogging as rain lashed the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/air-india-ceo-campbell-wilson-post-crash-speech-plagiarised-social-media-users-debate-2742131-2025-06-17",
      "headline": "Was Air India CEO's post-crash speech plagiarised? Social media users debateDays after a deadly plane crash killed over 270 people in Ahmedabad, Air India found itself under scrutiny again. This time, for the CEO's speech after the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-has-good-defensive-equipment-but-cant-compare-to-us-stuff-trump-claims-total-control-of-skies-over-iran-glbs-2742303-2025-06-17",
      "headline": "Trump declares US control over Iranian skies after warning unconditional surrenderDonald Trump claimed the US has full control of Iranian airspace and knows the exact location of Iran's Supreme Leader. He warned Iran against targeting civilians or American troops, saying US patience is wearing thin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-air-india-crash-mbbs-students-jump-from-hostel-to-escape-fire-in-new-video-2742003-2025-06-17",
      "headline": "New Air India crash videos show students jumping off balcony as smoke billowsSeveral videos have surfaced showing how people in nearby hostels tried to save their lives by climbing down from balconies after the London-bound Air India flight, with 242 on board, crashed into the BJ Medical College Hostel near Ahmedabad airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bomb-that-israel-needs-to-destroy-iranian-site-key-to-making-nukes-2742262-2025-06-17",
      "headline": "Bomb that Israel needs to destroy Iranian site key to making nukesStopping Iran's nuclear programme hinges on whether Israel can destroy the underground uranium enrichment facility at Fordow, south of Tehran"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-shadow-of-sanjay-how-indira-gandhi-son-shaped-the-emergency-2741974-2025-06-17",
      "headline": "The shadow of Sanjay: How Indira Gandhi's son shaped the EmergencyThe second part of the Democracy's Darkest Hour series chronicles how Indira Gandhi's doubts and her son Sanjay Gandhi's ambition triggered one of the most repressive chapters in India's political history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-bcci-india-captaincy-rohit-virat-2742145-2025-06-17",
      "headline": "I refused BCCI's offer of Test captaincy: Jasprit BumrahENG vs IND: Senior India bowler Jasprit Bumrah refused the Indian Test captaincy offered by BCCI during IPL 2025. The BCCI wanted to move on from Rohit Sharma much before he called time on his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-woman-elopes-with-lover-husband-says-saved-from-becoming-raja-raghuvanshi-2742114-2025-06-17",
      "headline": "UP woman elopes with lover, husband says spared from Raja Raghuvanshi-like fateA newly married woman ran away with her lover just a few days after the wedding. Her husband, instead of taking legal action, accepted her decision to live with her lover and let her go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-survivor-released-from-hospital-perform-brother-last-rites-2742302-2025-06-17",
      "headline": "Air India crash survivor released from hospital, to perform brother's last ritesAir India crash survivor Viswashkumar Ramesh has been released from hospital. In an interview with Aaj Tak, he shared that he is heading home and will do the cremation of his younger brother on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-harold-gillies-turned-plastic-surgery-into-an-art-of-healing-in-world-war-1-2742122-2025-06-17",
      "headline": "The facemaker of World War 1: How Harold Gillies gave shattered soldiers a new selfBorn in remote Dunedin, New Zealand, Sir Harold Gillies pioneered reconstructive facial surgery for World War 1 soldiers, turning trauma into artistry. His legacy reshaped lives, and modern plastic surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-cancels-delhi-paris-flight-says-pre-flight-checks-identified-an-issue-2742083-2025-06-17",
      "headline": "6 Dreamliners among 7 Air India flights cancelled amid tough post-crash checksSix among the cancelled flights were scheduled to be operated by Boeing 787-8 Dreamliners, the same passenger mode involved in the Ahmedabad crash that killed over 270 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/alliance-only-with-like-minded-sharad-pawar-refutes-tie-up-rumours-with-ajit-pawar-2742253-2025-06-17",
      "headline": "Alliance only with like-minded: Sharad Pawar refutes tie-up rumours with AjitNationalist Congress Party (SP) chief Sharad Pawar has once again reinforced his ideological stance and dismissed any reconciliation with the breakaway group led by Ajit Pawar ahead of local body elections in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/kalladka-flyover-in-dakshina-kannada-leaks-15-days-after-inauguration-viral-video-shows-water-gushing-like-free-car-wash-2742087-2025-06-17",
      "headline": "Free car wash: Rainwater gushes from Karnataka flyover 15 days after openingJust 15 days after its inauguration, the National Highways Authority of India (NHAI)-built Kalladka Flyover in Dakshina Kannada developed major leaks during rain. A viral video showing water pouring onto a car triggered online trolling and forced quick patchwork repairs."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-test-series-ashes-warmup-graeme-swann-slammed-fans-2742309-2025-06-18",
      "headline": "Test series vs India warm up for Ashes? Swann slammed for bizarre statementFormer England cricketer Graeme Swann called the India vs England Test series a warm-up for the Ashes, sparking backlash from Indian fans online who reminded him of recent results and backed India to dominate the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-super-giant-fifa-lifts-transfer-ban-within-month-2742304-2025-06-17",
      "headline": "FIFA lift Mohun Bagan's transfer ban within a month of announcing punishmentMohun Bagan Super Giant can now officially enter the transfer market after FIFA lifted their one-month-old ban, giving the club a major boost ahead of the new season under new administrative leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-arrives-leeds-watch-video-train-headingley-test-vs-england-2742277-2025-06-17",
      "headline": "Watch: Shubman Gill-led Team India reach Leeds for Headingley TestTeam India, led by new captain Shubman Gill, arrived in Leeds ahead of the first Test against England at Headingley, set to begin on June 20 in the much-anticipated five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-championship-entry-list-carlos-alcaraz-raducanu-jannik-sinner-2742250-2025-06-17",
      "headline": "Alcaraz and Raducanu, Sinner and Navarro: US Open unveil mixed doubles listCarlos Alcaraz-Emma Raducanu and Naomi Osaka-Nick Kyrgios lead a star-studded lineup in the revamped US Open mixed doubles, set to kick off Fan Week with 1 million USD prize and bold new rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-squad-vs-england-harshit-rana-2742241-2025-06-17",
      "headline": "Harshit Rana added to India's 18-man squad against EnglandFast bowler Harsit Rana has been added to India's 18-man squad for the England Test series. Rana is expected to be an additional resource for the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-bumrah-shubman-gambhir-2742195-2025-06-17",
      "headline": "Jasprit Bumrah opens up on relationship with Gautam Gambhir and Shubman GillEngland vs India: Jasprit Bumrah has opened up on his relationship with new captain Shubman Gill and coach Gautam Gambhir. He also revealed that he declined the full-time Test captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-bangladesh-day-1-report-najmul-shanto-mushfiqur-rahim-century-2742191-2025-06-17",
      "headline": "Shanto, Mushfiqur centuries power Bangladesh to strong Day 1 vs Sri LankaNajmul Hossain Shanto and Mushfiqur Rahim's unbeaten centuries helped Bangladesh dominate Day 1 of the first Test against Sri Lanka in Galle, kicking off their World Test Championship 2025-27 campaign in style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/i-league-inter-kashi-aiff-cas-ruling-points-dispute-chruchill-brothers-2742175-2025-06-17",
      "headline": "Inter Kashi win CAS appeal over AIFF ruling in I-League points disputeInter Kashi secured a crucial win at CAS as their appeal against the AIFF's points deduction was upheld. The ruling restores their position in the I-League table, with one more appeal still pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-jasprit-bumrah-headingley-test-confirms-2742168-2025-06-17",
      "headline": "Ready for Headingley, can play only three Tests in England: Jasprit BumrahJasprit Bumrah confirmed his participation in the Headingley Test against England and revealed he's aiming to play three matches in the series, providing a major boost to India's pace attack amid ongoing fitness concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-bcci-india-captaincy-rohit-virat-2742145-2025-06-17",
      "headline": "I refused BCCI's offer of Test captaincy: Jasprit BumrahENG vs IND: Senior India bowler Jasprit Bumrah refused the Indian Test captaincy offered by BCCI during IPL 2025. The BCCI wanted to move on from Rohit Sharma much before he called time on his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-pataudi-medal-winning-captain-sachin-tendulkar-request-2742117-2025-06-17",
      "headline": "ENG vs IND series-winning captain to get Pataudi medal on Sachin's requestA new medal honouring the Pataudi legacy will be awarded to the winning captain of the India-England Test series, following efforts by Sachin Tendulkar and Jay Shah to preserve the historic cricketing connection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-bangladesh-day-1-report-najmul-shanto-mushfiqur-rahim-century-2742191-2025-06-17",
      "headline": "Shanto, Mushfiqur centuries power Bangladesh to strong Day 1 vs Sri LankaNajmul Hossain Shanto and Mushfiqur Rahim's unbeaten centuries helped Bangladesh dominate Day 1 of the first Test against Sri Lanka in Galle, kicking off their World Test Championship 2025-27 campaign in style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/i-league-inter-kashi-aiff-cas-ruling-points-dispute-chruchill-brothers-2742175-2025-06-17",
      "headline": "Inter Kashi win CAS appeal over AIFF ruling in I-League points disputeInter Kashi secured a crucial win at CAS as their appeal against the AIFF's points deduction was upheld. The ruling restores their position in the I-League table, with one more appeal still pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-jasprit-bumrah-headingley-test-confirms-2742168-2025-06-17",
      "headline": "Ready for Headingley, can play only three Tests in England: Jasprit BumrahJasprit Bumrah confirmed his participation in the Headingley Test against England and revealed he's aiming to play three matches in the series, providing a major boost to India's pace attack amid ongoing fitness concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-bcci-india-captaincy-rohit-virat-2742145-2025-06-17",
      "headline": "I refused BCCI's offer of Test captaincy: Jasprit BumrahENG vs IND: Senior India bowler Jasprit Bumrah refused the Indian Test captaincy offered by BCCI during IPL 2025. The BCCI wanted to move on from Rohit Sharma much before he called time on his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-pataudi-medal-winning-captain-sachin-tendulkar-request-2742117-2025-06-17",
      "headline": "ENG vs IND series-winning captain to get Pataudi medal on Sachin's requestA new medal honouring the Pataudi legacy will be awarded to the winning captain of the India-England Test series, following efforts by Sachin Tendulkar and Jay Shah to preserve the historic cricketing connection."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}