{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-share-price-to-be-in-spotlight-today-reason-loan-deal-us-dfc-cancel-self-fund-2648001-2024-12-11",
      "headline": "Adani Ports shares to be in spotlight today. Here's why Adani group stocks: Shares of Adani Ports are expected to be in focus today after the firm shared a crucial announcement to the stock exchanges for one of its projects in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-0-a-step-by-step-guide-to-apply-for-a-reprint-with-qr-code-2647779-2024-12-11",
      "headline": "PAN 2.0: A step-by-step guide to applying for a reprint with QR codeIndian PAN cardholders can now reprint their PAN card with a QR code for just Rs 50 through Protean or UTIITSL portals, the process of which is simple and user-friendly. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-ports-enterprises-ambuja-cements-bajaj-auto-ntpc-green-energy-2647995-2024-12-11",
      "headline": "Stocks to watch today: Adani Ports, Bajaj Auto, NTPC Green EnergySeveral stocks are likely to be in focus due to recent news and developments, such as Adani Ports, Adani Green Energy, Bajaj Auto, Star Health, Awfis Space, NTPC Green, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-group-us-funding-colombo-port-project-indictment-controversy-2647976-2024-12-11",
      "headline": "Will use own resources: Adani Ports opts out of US funding for Colombo Port projectAdani Ports said the Colombo Port project was on track for commissioning by early next year and that it will fund the project through \"internal accruals\", aligning with its capital management strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldirams-attracts-bids-from-alpha-wave-2-others-for-15-20-percent-stake-2647746-2024-12-10",
      "headline": "Haldiram's attracts bids from Alpha Wave, 2 others for 15-20% stake: ReportThe bids, which could mark one of India's largest private-equity deals, peg the company's valuation at Rs 75,000-80,000 crore ($8.8-9.4 billion)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-malhotras-focus-as-rbi-governor-3-key-areas-to-watch-out-for-according-to-nomura-2647649-2024-12-10",
      "headline": "Sanjay Malhotra's focus as RBI Governor: 3 key areas to watch out forBrokerage firm Nomura anticipates Sanjay Malhotra's tenure as RBI Governor may bring rate cuts, foster credit growth, and allow flexible currency management amid economic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-card-for-minors-benefits-documents-and-application-process-2647584-2024-12-10",
      "headline": "PAN Card for minors: Benefits, documents and application process Securing a PAN card for your child ensures smooth financial transactions and better preparation for future responsibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-close-flat-it-sector-stocks-leads-the-way-rupee-hits-record-low-2647691-2024-12-10",
      "headline": "Sensex, Nifty close flat; IT leads way, rupee hits record lowThe S&P BSE Sensex was up 1.59 points to end at 81,510.05, while the NSE Nifty50 lost 8.95 points to close at 24,610.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fmcg-sector-consumer-stocks-godrej-tata-titan-nestle-poor-performance-reason-q3-outlook-expert-view-2647669-2024-12-10",
      "headline": "FMCG sector slowdown: Can consumer stocks stage a comeback? After a promising run earlier this year, the FMCG sector seems to be stuck in a rough patch, as its stocks have not been performing well and has left investors wondering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/november-blues-for-mutual-funds-as-equity-inflows-down-14-percent-amfi-data-report-2647619-2024-12-10",
      "headline": "November blues for mutual funds as equity inflows down 14%: AMFI data Investment through systematic investment plans (SIPs) remained steady in November. Total SIP inflows stood at Rs 25,319.66 crore, showing little change from October's Rs 25,323 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sanjay-malhotra-5-things-to-know-about-the-new-rbi-governor-2647531-2024-12-10",
      "headline": "Who is Sanjay Malhotra? 5 things to know about the new RBI GovernorAs Shaktikanta Das bids farewell, Sanjay Malhotra takes charge as the 26th RBI Governor on December 11, bringing decades of experience to the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-shaktikanta-das-had-to-say-on-sanjay-malhotra-new-rbi-governor-press-conference-2647565-2024-12-10",
      "headline": "One RBI Governor to another: What Shaktikanta Das had to say on Sanjay MalhotraShaktikanta Das spoke highly of Sanjay Malhotra, who is set to take over as the new RBI Governor for a three-year term, effective Wednesday, December 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-loan-biggest-since-2023-usd-3-billion-mukesh-ambani-offshore-market-2647509-2024-12-10",
      "headline": "Reliance eyes $3 billion in India's largest loan deal since 2023: ReportThe loan comes at a time when the Indian rupee has been under pressure, recently hitting a record low against the US dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-rise-nearly-10-percent-to-hit-record-high-up-39-percent-this-week-2647483-2024-12-10",
      "headline": "ITI shares surge nearly 10% to a record high, up 39% this weekITI share price: ITI shares have been on an exceptional run, gaining 15% in Monday's session and over 13% the day before. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-last-day-immensely-grateful-thanks-pm-modi-fm-nirmala-sitharaman-2647464-2024-12-10",
      "headline": "Immensely grateful: Shaktikanta Das thanks PM Modi on last day as RBI GovernorIn a series of tweets, Das extended his thanks to Finance Minister Nirmala Sitharaman, various stakeholders, including financial sector participants, economists, industry bodies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-auto-stocks-shed-in-early-trade-swiggy-up-4-percent-2647449-2024-12-10",
      "headline": "Sensex, Nifty open flat as auto stocks shed in early trade; Swiggy up 4% The S&P BSE Sensex was down 10.62 points to 81,497.84, while the Nifty50 lost 1.85 points to 24,617.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-hundreds-in-washington-california-face-job-losses-reduction-in-global-workforce-report-2647430-2024-12-10",
      "headline": "Boeing layoffs: Hundreds in Washington and California face job lossesBoeing Layoffs: The recent layoffs are part of a larger reduction that aims to cut around 17,000 jobs from Boeing's global workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-ceo-md-radhika-gupta-explains-why-fixed-income-mfs-belong-in-your-portfolio-2647155-2024-12-10",
      "headline": "Edelweiss' Radhika Gupta explains why fixed income MFs belong in your portfolioFixed-income MFs, as Radhika Gupta suggests, enhance equity portfolios with stability, flexibility, and tax efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-stocks-vodafone-idea-godrej-consumer-tata-motors-2647423-2024-12-10",
      "headline": "Stocks to watch today: Adani stocks, Vodafone Idea, Godrej Consumer, Tata MotorsAs markets open today, several stocks, including Vodafone Idea, Adani stocks, Tata Motors, etc are likely to be in focus due to recent announcements and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/sanjay-malhotra-appointed-as-new-rbi-governor-2647273-2024-12-09",
      "headline": "Sanjay Malhotra appointed as new RBI GovernorThe government on Monday appointed Revenue Secretary Sanjay Malhotra as the next Reserve Bank of India (RBI) Governor."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-evacuates-nationals-from-syria-days-after-rebels-oust-bashar-al-assad-2647988-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India evacuates 75 nationals from Syria days after rebels oust AssadThe evacuation of 75 Indians, coordinated by the embassies of India in Damascus and Beirut, was carried out two days after rebels ousted long-time President Bashar al-Assad from power, ending his 14-year rule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-atul-subhash-suicide-ministry-of-law-and-justice-family-court-2647991-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Law Ministry's post on family courts amid outrage over techie's death by suicideAtul Subhash Suicide: The Ministry of Law and Justice issued a statement about family courts handling cases with \"care and sensitivity\" amid public outrage following the suicide of Bengaluru-based techie Atul Subhash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-expedite-environmental-permits-1-billion-investment-2647987-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump promises 'fully expedited' permits for anyone investing $1 billion in USIn a post on his Truth Social app on Tuesday, the President-elect said that anyone making a $1 billion investment in the US \"will receive fully expedited approvals and permits, including, but in no way limited to, all environmental approvals\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/mumbai-bus-accident-need-to-probe-if-bus-in-accident-that-killed-7-used-as-weapon-by-driver-police-tells-court-2647886-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Need to probe if driver used bus as weapon in Mumbai crash: Cops to courtThe police also stated that they would examine if the driver had undergone proper training, if he was under the influence of narcotics at the time, and if there was any conspiracy behind the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-peeing-after-sex-really-prevent-uti-2647827-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can peeing after sex really prevent UTI? It is believed that urinating after sex is not merely a good hygiene practice but also keeps issues like UTI (urinary tract infection) and other infections away, especially among women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mohammed-siraj-reaction-icc-fine-after-travis-head-bust-up-2647963-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohammed Siraj responds to ICC fine after bust-up with Travis HeadMohammed Siraj has broken his silence following the ICC sanctions imposed on him and Travis Head after their heated exchange during the Adelaide Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bengaluru-techie-atul-subhash-suicide-a-reality-check-of-family-court-system-2647971-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie suicide: A reality check of family court systemThe over 20-page suicide note by Bengaluru techie Atul Subhash raised serious allegations against his wife, his family and even the family court system for pushing him towards the decision to end his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/opposition-to-move-supreme-court-against-evm-tampering-irregularities-in-poll-process-2647942-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "INDIA bloc to move Supreme Court against 'EVM tampering' in MaharashtraThe INDIA bloc's decision to approach the Supreme Court against the Election Commission was announced by Prashant Jagtap, leader of Sharad Pawar's NCP faction, who contested and lost the Assembly elections from the Hadapsar seat in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-jill-biden-photo-notre-dame-paris-perfume-fight-enemies-cant-resist-2647819-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump uses photo with Jill Biden to launch perfume: 'Enemies can't resist'Donald Trump launches a new fragrance line, 'Fight, Fight, Fight', with a political twist, featuring a photo with Jill Biden, promising a scent of strength, victory, and even appeal to your enemies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/why-mcdonalds-worker-who-helped-catch-unitedhealthcare-ceos-killer-is-facing-online-hate-glbs-2647966-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why McDonald's worker who helped catch UnitedHealthcare CEO's killer is facing online hateLuigi Mangione's arrest for allegedly murdering UnitedHealthcare CEO Brian Thompson sparked backlash, with a McDonald's employee who tipped off police facing online trolling. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-rajnath-singh-meets-russian-president-vladmir-putin-in-moscow-says-friendship-higher-than-highest-mountain-2647923-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Friendship higher than highest mountain: Rajnath Singh on meeting Putin in MoscowThe high-level discussions focused on deepening bilateral defence collaboration and exploring new avenues of partnership between the two nations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-suicide-wife-harassment-up-father-mediation-court-mental-pressure-2647978-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie's father on his suicide: He was frustrated, never showed it to usThe father of a Bengaluru techie, who died by suicide, said his son told him that the mediation court did not work as per law and had faced harassment while travelling to Jaunpur to face cases filed against him by his estranged wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-visits-vikas-khanna-new-restaurant-bungalow-2647993-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shah Rukh Khan visits Vikas Khanna's restaurant, chef recalls holding back tearsShah Rukh Khan recently visited Chef Vikas Khanna's new restaurant, Bungalow, in New York. The chef shared a picture and opened up about his interaction with SRK in an emotional Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-group-us-funding-colombo-port-project-indictment-controversy-2647976-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will use own resources: Adani Ports opts out of US funding for Colombo Port projectAdani Ports said the Colombo Port project was on track for commissioning by early next year and that it will fund the project through \"internal accruals\", aligning with its capital management strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mit-phd-student-prahlad-iyengar-pro-palestine-essay-suspends-expels-magazine-banned-provoke-violent-protests-2647813-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MIT suspends Indian-origin student for pro-Palestine essay, bans magazineThe Massachusetts Institute of Technology (MIT) has barred an Indian-origin PhD scholar from his college campus over a pro-Palestine essay he wrote in the college magazine. Prahlad Iyengar's suspension till January 2026 is in a way his expulsion. His scholarship has also been terminated and the magazine banned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-internet-shutdowns-economic-activity-cheating-exams-other-measures-2647979-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Internet shutdowns impact economic activity, Supreme Court toldThe Supreme Court was told that internet shutdowns were being imposed by multiple states to prevent cheating in exams and that there were other ways to prevent such malpractices in exams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflixs-mary-biopic-sparks-debate-overasting-israeli-actor-noa-cohen-in-lead-role-2647869-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Netflix's Mary biopic sparks debate over casting Israeli actor Noa Cohen in lead roleA new Netflix film on Mary, mother of Jesus, sparked controversy due to its casting choices. The film, directed by DJ Caruso, aimed to present an authentic portrayal of Mary's life and challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/minorities-sheikh-hasina-takeaways-from-indian-foreign-secretarys-dhaka-visit-2647656-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Minorities, Sheikh Hasina...: Takeaways from Indian foreign secy's Dhaka visitBoth India and Bangladesh have acknowledged the need to work closely to dispel the 'clouds' lately shrouding the bilateral relationship"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/japanese-atomic-bomb-survivor-group-nihon-hidankyo-nobel-peace-prize-hiroshima-nagasakis-nuclear-weapons-2647981-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Japan's atomic bomb survivors' message for youth: Fight for nuclear-free worldNihon Hidankyo, a grassroots movement of survivors of the 1945 nuclear bombings of Japanese cities Hiroshima and Nagasaki, is campaigning for a world free of nuclear weapons using witness testimony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigenously-developed-zorawar-light-tank-indian-army-trials-ladakh-drdo-2647983-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indigenously-developed Zorawar light tank undergo trials in LadakhZorawar's trials are underway in Ladakh's Nyoma region and the indigenously-developed light tank will be handed over to the Indian Army for user trials next year after current trials are completed, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/fact-check-500-year-old-ancient-torah-not-recovered-from-bashar-al-assad-palace-syria-2647900-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fact Check: This 500-year-old ancient Torah was NOT recovered from Assad's palace in SyriaIndia Today Fact Check found that the video is from Tunisia and dates back to March 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/panna-tiger-reserve-woman-killed-man-animal-conflict-maneater-madhya-pradesh-2647854-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Panna tiger siblings kill woman: Are they man-eaters? Here are the factsThis is probably the first ever tiger-human conflict in the history of Panna Tiger Reserve, whih is known for its successful tiger re-introduction programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sudden-deaths-among-youth-not-linked-to-covid-vaccines-jp-nadda-tells-parliament-2647894-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sudden deaths among youth not linked to Covid vaccines, JP Nadda tells ParliamentJP Nadda clarified that the study by the Indian Council of Medical Research (ICMR) ruled out any connection between Covid-19 vaccination and unexplained sudden deaths among young adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/google-year-in-search-2024-ipl-to-mango-pickle-what-people-searched-in-india-2647851-2024-12-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Google Year in Search 2024: IPL to Mango Pickle, what people searched in IndiaOverall, the Indian Premier League (IPL) claimed the top spot, showcasing the country's enduring passion for cricket. It was followed by the T20 World Cup, Bharatiya Janata Party (BJP), Election Results 2024, and the Olympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-box-office-collection-day-6-detailed-report-allu-arjun-film-1000-crore-worldwide-rashmika-mandanna-2647999-2024-12-11",
      "headline": "Pushpa 2 box office Day 6: Allu Arjun's film to cross Rs 1,000 crore globallyPushpa 2 box office collection Day 6: Allu Arjun and director Sukumar's Pushpa 2: The Rule is set to create a new record by grossing Rs 1,000 crore worldwide. The film is on a dream run in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-visits-vikas-khanna-new-restaurant-bungalow-2647993-2024-12-11",
      "headline": "Shah Rukh Khan visits Vikas Khanna's restaurant, chef recalls holding back tearsShah Rukh Khan recently visited Chef Vikas Khanna's new restaurant, Bungalow, in New York. The chef shared a picture and opened up about his interaction with SRK in an emotional Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-saif-ali-khan-ranbir-kapoor-in-delhi-to-mark-raj-kapoor-100th-birth-anniversary-2647922-2024-12-10",
      "headline": "Kareena-Saif, Ranbir Kapoor in Delhi to mark Raj Kapoor's 100th birth anniversaryKareena Kapoor, Saif Ali Khan, Ranbir Kapoor and Neetu Kapoor were in the capital to celebrate the 100th birth anniversary of filmmaker and actor Raj Kapoor.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-sunil-pal-stree-2-actor-mushtaq-khan-says-he-was-kidnapped-2647901-2024-12-10",
      "headline": "After Sunil Pal, Stree 2 actor Mushtaq Khan says he was kidnappedAfter comedian Sunil Pal, actor Mushtaq Khan claims that he was kidnapped on the pretext of being invited to an event. A police complaint regarding the same has been filed.  "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/uefa-champions-league-results-real-madrid-snap-losing-run-liverpool-remain-unbeaten-2647997-2024-12-11",
      "headline": "UEFA Champions League: Real Madrid snap losing run, Liverpool remain unbeatenReal Madrid halted their losing streak with a thrilling 3-2 victory over Atalanta, while Liverpool continued their winning run by defeating Girona. Bayern Munich also secured a commanding win over Shakhtar Donetsk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wi-vs-ban-jayden-seales-brandon-king-help-hosts-clinch-series-with-clinical-win-2647996-2024-12-11",
      "headline": "Jayden Seales, Brandon King help Windies clinch series with clinical winWI vs BAN: Hosts West Indies beat Bangladesh in the second ODI of the series to take an unassailable lead of 2-0. Jayden Seales won the player of the match award with a sensational four-wicket haul.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-pakistan-1st-t20i-report-george-linde-david-miller-durban-2647990-2024-12-11",
      "headline": "SA vs PAK: Linde, Miller star as South Africa down Pakistan in 1st T20IGeorge Linde's all-round brilliance and David Miller's explosive batting helped an inexperienced South African side down Pakistan in the first T20I of the series on Tuesday, December 10. Linde picked up 4 wickets and scored 48 runs to help his side win in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-champions-league-juventus-top-form-manchester-city-problems-manager-thiago-motta-2647965-2024-12-10",
      "headline": "Juventus must be in top form to pose Manchester City problems: Thiago MottaJuventus manager Thiago Motta acknowledged the challenge posed by Manchester City in a high-stakes clash between two European powerhouses striving to reignite their Champions League campaigns.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/khvicha-kvaratskhelia-napoli-injured-club-statment-confirms-antonio-conte-serie-a-2647967-2024-12-10",
      "headline": "Napoli's Kvaratskhelia ruled out till January after suffering knee injuryNapoli have confirmed that Khvicha Kvaratskhelia will miss action until January 2025 due to a knee ligament tear, leaving Antonio Conte's team without their star winger during crucial Serie A fixtures in an intense title race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mohammed-siraj-reaction-icc-fine-after-travis-head-bust-up-2647963-2024-12-10",
      "headline": "Mohammed Siraj responds to ICC fine after bust-up with Travis HeadMohammed Siraj has broken his silence following the ICC sanctions imposed on him and Travis Head after their heated exchange during the Adelaide Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-david-miller-fiery-batting-durban-early-dismissals-abrar-ahmed-2647948-2024-12-10",
      "headline": "SA vs PAK: Miller puts on a fiery batting show vs Pakistan with his 82 off 40David Miller showcased a stunning display of power-hitting, rescuing South Africa with his 82 off 40 balls in their T20I series opener against Pakistan in Durban, turning the game around after an early top-order collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fifa-to-confirm-world-cup-hosts-saudi-set-to-stage-2034-tournament-2647943-2024-12-10",
      "headline": "FIFA to confirm World Cup hosts, Saudi set to stage 2034 tournamentFIFA is set to announce the 2030 and 2034 men's World Cup hosts on Wednesday, with Morocco, Spain, and Portugal leading a unique six-nation, three-continent bid for 2030, while Saudi Arabia is poised to host the 2034 edition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-not-to-manage-another-club-manchester-city-national-team-doors-open-2647921-2024-12-10",
      "headline": "Guardiola drops Manchester City exit remark: Not going to manage another teamPep Guardiola stunned the football world by announcing his intention to step away from club football management after his Manchester City tenure, citing exhaustion, while keeping the door open for a potential national team role in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-litton-das-to-lead-bangladesh-in-t20i-series-vs-west-indies-2647920-2024-12-10",
      "headline": "Litton Das to lead Bangladesh in T20I series against West Indies Litton Das will lead a 15-man Bangladesh squad in the three-match T20I series against West Indies, starting December 15. Litton was named Bangladesh captain in the absence of regular skipper Najmul Hossain Shanto.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-david-miller-fiery-batting-durban-early-dismissals-abrar-ahmed-2647948-2024-12-10",
      "headline": "SA vs PAK: Miller puts on a fiery batting show vs Pakistan with his 82 off 40David Miller showcased a stunning display of power-hitting, rescuing South Africa with his 82 off 40 balls in their T20I series opener against Pakistan in Durban, turning the game around after an early top-order collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fifa-to-confirm-world-cup-hosts-saudi-set-to-stage-2034-tournament-2647943-2024-12-10",
      "headline": "FIFA to confirm World Cup hosts, Saudi set to stage 2034 tournamentFIFA is set to announce the 2030 and 2034 men's World Cup hosts on Wednesday, with Morocco, Spain, and Portugal leading a unique six-nation, three-continent bid for 2030, while Saudi Arabia is poised to host the 2034 edition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-not-to-manage-another-club-manchester-city-national-team-doors-open-2647921-2024-12-10",
      "headline": "Guardiola drops Manchester City exit remark: Not going to manage another teamPep Guardiola stunned the football world by announcing his intention to step away from club football management after his Manchester City tenure, citing exhaustion, while keeping the door open for a potential national team role in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-litton-das-to-lead-bangladesh-in-t20i-series-vs-west-indies-2647920-2024-12-10",
      "headline": "Litton Das to lead Bangladesh in T20I series against West Indies Litton Das will lead a 15-man Bangladesh squad in the three-match T20I series against West Indies, starting December 15. Litton was named Bangladesh captain in the absence of regular skipper Najmul Hossain Shanto.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/laura-wolvaardt-reclaims-top-spot-in-icc-women-odi-rankings-2647884-2024-12-10",
      "headline": "Laura Wolvaardt reclaims top spot in ICC Women's ODI RankingsSouth Africa's Laura Wolvaardt replaced England's Nat Sciver-Brunt as the No.1 ODI batter in the world in this week's ICC Women's ODI Player Rankings. The England all-rounder has slipped to third place with 732 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/imane-khelif-most-searched-athlete-google-2024-hardik-pandya-lamine-yamal-top-10-2647882-2024-12-10",
      "headline": "Imane Khelif most searched athlete on Google in 2024, Hardik in top 10Google's list of most-searched athletes in 2024 featured diverse icons, from Algerian boxing gold medallist Imane Khelif to breakout cricket star Shashank Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neelam-bhardwaj-18-years-youngest-indian-woman-to-hit-list-a-double-hundred-2647868-2024-12-10",
      "headline": "Neelam Bhardwaj becomes youngest Indian woman to hit List A double hundred Eighteen-year-old Uttarakhand batter Neelam Bhardwaj became the youngest woman to score a double century in a List A match, smashing an unbeaten 202 off just 137 balls in the Senior Women's One Day Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-when-team-india-breached-australias-fortress-gabba-in-2021-2647720-2024-12-10",
      "headline": "When Team India breached 'Australia's Fortress Gabba' in 2021The Border-Gavaskar Trophy now shifts to the Gabba in Brisbane for the third Test, a venue where India has fond memories of their historic 2021 triumph. India's previous Test at the Gabba was in 2020/21 tour, which they won by three wickets to seal the series 2-1.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-andy-roberts-australia-vs-india-border-gavaskar-trophy-2024-25-2647847-2024-12-10",
      "headline": "Virat Kohli will score runs in Tests only when he is fully focused: Andy RobertsFormer West Indies fast bowler Andy Roberts has come up with an advice for struggling India batter Virat Kohli, saying that he needs to focus on the longest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-match-calendar-unbearable-national-team-players-dortmund-coach-sahin-2647822-2024-12-10",
      "headline": "Match calendar almost unbearable for national team players: Dortmund coach SahinBorussia Dortmund coach Nuri Sahin has criticised the \"unbearable\" demands of an overcrowded football calendar, particularly for national team players, citing its toll on fitness and injury rates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-akash-deep-in-harshit-rana-out-brisbane-test-sanjay-manjrekar-2647821-2024-12-10",
      "headline": "Akash Deep in, Harshit Rana out for Brisbane Test: Sanjay ManjrekarSanjay Manjrekar suggested Akash Deep's inclusion in India's lineup for the Gabba Test could strengthen the bowling attack and ease Jasprit Bumrah's workload, as India aim to recover from their crushing defeat in Adelaide against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-manjrekar-on-jasprit-bumrah-workload-australia-vs-india-border-gavaskar-trophy-2647810-2024-12-10",
      "headline": "Bumrah is well rested: Manjrekar wants pacer to play all Tests vs AustraliaFormer India cricketer Sanjay Manjrekar has played down workload concerns for Jasprit Bumrah, saying that Indian cricket takes care of their premier fast player, and he should play all five Tests vs Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-andy-roberts-australia-vs-india-border-gavaskar-trophy-2024-25-2647847-2024-12-10",
      "headline": "Virat Kohli will score runs in Tests only when he is fully focused: Andy RobertsFormer West Indies fast bowler Andy Roberts has come up with an advice for struggling India batter Virat Kohli, saying that he needs to focus on the longest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-match-calendar-unbearable-national-team-players-dortmund-coach-sahin-2647822-2024-12-10",
      "headline": "Match calendar almost unbearable for national team players: Dortmund coach SahinBorussia Dortmund coach Nuri Sahin has criticised the \"unbearable\" demands of an overcrowded football calendar, particularly for national team players, citing its toll on fitness and injury rates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-akash-deep-in-harshit-rana-out-brisbane-test-sanjay-manjrekar-2647821-2024-12-10",
      "headline": "Akash Deep in, Harshit Rana out for Brisbane Test: Sanjay ManjrekarSanjay Manjrekar suggested Akash Deep's inclusion in India's lineup for the Gabba Test could strengthen the bowling attack and ease Jasprit Bumrah's workload, as India aim to recover from their crushing defeat in Adelaide against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-manjrekar-on-jasprit-bumrah-workload-australia-vs-india-border-gavaskar-trophy-2647810-2024-12-10",
      "headline": "Bumrah is well rested: Manjrekar wants pacer to play all Tests vs AustraliaFormer India cricketer Sanjay Manjrekar has played down workload concerns for Jasprit Bumrah, saying that Indian cricket takes care of their premier fast player, and he should play all five Tests vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/alzarri-joseph-fined-for-breaching-icc-code-of-conduct-in-first-odi-vs-bangladesh-2647782-2024-12-10",
      "headline": "Alzarri Joseph fined for breaching ICC Code of Conduct in 1st ODI vs BangladeshWest Indies pacer Alzarri Joseph was fined 25% of his match fee for breaching Level 1 of the ICC Code of Conduct during the first ODI against Bangladesh in St. Kitts and Nevis.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harry-brook-on-rishabh-pant-australia-vs-india-border-gavaskar-trophy-adelaide-test-2647770-2024-12-10",
      "headline": "Harry Brook praises Rishabh Pant's audacious approach in Adelaide TestEngland batter Harry Brook praised India's Rishabh Pant for his fearless batting in the second Test against Australia in Adelaide. Pant played some audacious shots as India lost wickets at the other end on Day 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-rohit-virat-shubman-focus-on-red-ball-preparations-brisbane-test-2647771-2024-12-10",
      "headline": "Indian batters focus on red-ball preparations ahead of Brisbane TestBorder-Gavaskar Trophy: Indian batters, led by Rohit Sharma and Virat Kohli, shifted their focus on red-ball preparations with an intensive net session on Tuesday.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}