{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-reschedule-chief-negotiations-meeting-on-interim-trade-deal-2872501-2026-02-22",
      "headline": "India, US reschedule chief negotiators meeting on interim trade deal: ReportThe Indian team was earlier scheduled to start the three-day meeting on February 23 in the US. Joint Secretary in the Commerce Ministry, Darpan Jain, is the chief negotiator of India for this agreement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/jpmorgan-concedes-it-closed-donald-trump-accounts-after-january-6-attack-2872283-2026-02-22",
      "headline": "JPMorgan concedes it closed Trump's accounts after January 6 attackUntil now, JPMorgan had never admitted that it closed Donald Trump's accounts in writing after January 6. The bank would only speak hypothetically about when the bank closes accounts and its reasons for closing accounts, citing bank privacy laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-hikes-tariff-from-10-to-15-after-supreme-court-verdict-says-us-was-ripped-off-for-decades-2872234-2026-02-21",
      "headline": "Trump hikes tariffs to 15% after court ruling, says US ripped off for decadesDonald Trump said the 150-day hike is legally permitted and that new \"legally permissible\" tariffs will be introduced during this period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-income-tax-regime-benefits-proposed-hra-meal-vouchers-is-it-better-now-salaried-individuals-2871962-2026-02-21",
      "headline": "Old tax regime gets a boost. Does it work better for you than the new one?Handcrafted ByOur Editors If you have moved on to the new income tax regime, should you give the old one another look after the proposed benefits? Read on to see what the changes could mean for your tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-is-catching-up-fast-with-us-china-in-ai-race-indiaai-ceo-abhishek-singh-2871846-2026-02-20",
      "headline": "India is catching up fast with US, China in AI race: IndiaAI CEO Abhishek SinghIn an exclusive interview following the Grand AI India Impact Summit, Abhishek Singh, CEO of India's Mission AI, discusses the nation's emerging role in the global artificial intelligence landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brazil-president-lula-exclusive-india-brazil-trade-own-currency-need-not-rely-on-us-dollar-2871794-2026-02-20",
      "headline": "Brazilian President Lula says India and Brazil can trade without relying on US dollarAs Brazil looks to deepen ties with India, Brazilian President Luiz Inácio Lula da Silva signals a future where the two economies trade more, rely less on the US dollar, and build a partnership driven by growth, technology and trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-debates-within-brics-to-create-new-currency-brazils-lula-to-india-today-2871784-2026-02-20",
      "headline": "No debates within BRICS to create new currency: Brazil's Lula to India TodayIn an exclusive interview with India Today TV, Brazilian President Luiz Inacio Lula da Silva clarified there is no BRICS currency plan, but said India and Brazil can still rethink dollar-based trade and slowly build alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-multiple-ppf-accounts-here-is-the-answer-2871751-2026-02-20",
      "headline": "Can you open multiple PPF accounts? Here's the answerThe Public Provident Fund (PPF) is one of India's most trusted long-term savings options, thanks to its tax benefits, steady returns and government backing. Many investors, however, wonder if it's possible to open more than one PPF account to save more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sips-in-crypto-what-they-are-and-how-to-get-started-2871634-2026-02-20",
      "headline": "SIPs in crypto? What they are and how to get startedCrypto is often linked with sharp price swings and high risk. SIPs, on the other hand, are associated with steady, long-term investing. So what happens when these two very different ideas come together? That is where the conversation around crypto SIPs begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-is-like-a-tsunami-hitting-jobs-market-warns-imfs-chief-2871599-2026-02-20",
      "headline": "Exclusive: AI is like a tsunami hitting jobs market, warns IMF's chiefAccording to Georgieva, AI can boost growth and raise incomes. However, if not handled carefully, it can deepen inequality and unsettle workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-300-points-higher-nifty-gains-despite-market-volatility-2871564-2026-02-20",
      "headline": "Sensex ends over 300 points higher, Nifty gains despite market volatilityThe S&P BSE Sensex rose 316.57 points to end at 82,814.71, while the Nifty50 gained 116.90 points to settle at 25,571.25. Broader market indices also recovered well through the afternoon, lifting overall sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-nearly-rs-1000-silver-surges-rs-4000-time-to-invest-or-wait-for-a-dip-bullion-gold-prices-silver-prices-2871519-2026-02-20",
      "headline": "Gold jumps nearly Rs 1,000, silver surges Rs 4,000: Time to invest or wait for a dip?After several weeks of uncertainty, gold and silver are now moving higher with steady gains. This has boosted market sentiment, but it has also left many wondering whether to buy now or wait for more favourable prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/biryani-billing-scam-multicrore-tax-evasion-rs-70000-turnover-supression-2871475-2026-02-20",
      "headline": "How Hyderabad's love for biryani exposed a nationwide multi-crore tax scamIn India, biryani is more than food. It is an emotion that finally left a trail too big to hide. Read on to find out how it exposed a nationwide multi-crore tax scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-you-get-your-arrears-and-salary-hike-2871457-2026-02-20",
      "headline": "8th Pay Commission: When will you get your arrears and salary hike?Central government employees and pensioners are closely watching every update on the 8th Pay Commission. The big questions remain, i.e., when will the new pay structure be implemented, and when will arrears actually reach your bank account?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/guardrails-needed-as-ai-reshapes-jobs-and-global-growth-says-imf-chief-2871416-2026-02-20",
      "headline": "IMF chief says India well-positioned in AI race thanks to digital infrastructureAccording to Kristalina Georgieva, India is in a strong position due to its early investment in digital public infrastructure, which now forms the base for wider AI access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-evasion-fraud-biryani-chains-billing-scam-2871390-2026-02-20",
      "headline": "How a biryani billing trail exposed tax scam; Rs 70,000 crore sales hiddenWhat began as a simple I-T review of biryani restaurant bills turned into a sweeping hunt for Rs 70,000 crore in suppressed sales buried across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/dutch-company-asml-jumps-90-last-si-months-global-tech-ecosystem-explained-2871359-2026-02-20",
      "headline": "Why has this Dutch company's stock gained over 90% on Nasdaq in six months?ASML Holding's stock has gained 94.66% in the past six months on the US stock exchange Nasdaq, where many of the world's biggest technology companies list their shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tech-mahindra-tcs-why-it-stocks-are-crashing-again-today-2871347-2026-02-20",
      "headline": "Infosys, Tech Mahindra, TCS: Why IT stocks are falling again todayThe slide in IT stocks raises fresh questions about what is spooking investors and how long this uneasy phase could last. A closer look may reveal more than the morning numbers suggest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-high-volatility-us-iran-tensions-2871341-2026-02-20",
      "headline": "Sensex, Nifty open flat amid volatility, IT stocks continue to declineWith global cues expected to remain volatile, investors are likely to stay cautious. Movements in crude oil, the rupee and developments in the US–Iran standoff will remain key drivers for market direction through the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/uk-and-india-must-shape-ai-together-says-kanishka-narayan-2871082-2026-02-19",
      "headline": "UK and India must shape AI together, says Kanishka NarayanIn an exclusive conversation with India Today, UK AI Minister Kanishka Narayan highlighted the strengthening technological partnership between India and the United Kingdom."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/farhan-akhtar-backed-boong-wins-bafta-award-for-best-childrens-family-film-2872650-2026-02-23",
      "headline": "BAFTA 2026: India's Boong wins Best Children's and Family Film award, makes history Farhan Akhtar-backed Manipuri film Boong has won the BAFTA award for Best Children's and Family Film. The Lakshmipriya Devi directorial is the first Indian film to win in the category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-calls-raha-her-inspiration-at-bafta-2026-farhan-akhtar-joins-boong-team-2872634-2026-02-22",
      "headline": "Alia Bhatt calls Raha her inspiration at BAFTA 2026, Farhan Akhtar joins Boong team Alia Bhatt made her BAFTA 2026 red carpet debut in a silver gown. Boong director Lakshipriya Devi, producers Ritesh Sidhwani and Farhan Akhtar also graced the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-make-relationship-official-announce-wedding-2872611-2026-02-22",
      "headline": "Rashmika Mandanna-Vijay Deverakonda make relationship official, announce wedding Rashmika Mandanna and Vijay Deverakonda have made their relationship official. The duo shared their wedding plans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-2-director-slams-anurag-kashyap-he-has-a-problem-with-everything-2872594-2026-02-22",
      "headline": "The Kerala Story 2 director slams Anurag Kashyap: He has a problem with everything The Kerala Story 2 director Kamakhya Narayan Singh reacted to Anurag Kashyap's criticism of his film. Anurag had earlier called it a propaganda film. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-regrets-missing-sunday-meet-at-jalsa-shares-a-note-to-fans-2872574-2026-02-22",
      "headline": "Amitabh Bachchan regrets missing Sunday meet at Jalsa, shares a note to fans Amitabh Bachchan skipped his Sunday meet with fans outside Jalsa. He expressed regret in a personal note and asked them to save energy for the future.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-prabhu-has-the-same-credo-on-praise-and-trolls-read-it-here-2872557-2026-02-22",
      "headline": "Samantha Ruth Prabhu has the same credo on praise and trolls. Read it here Samantha Ruth Prabhu opened up on handling social media negativity in a recent interaction with fans. She spoke about her perspective towards praise and trolls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bafta-2026-which-female-actors-of-bollywood-were-presenters-before-alia-bhatt-2872529-2026-02-22",
      "headline": "BAFTA 2026: Which female actors of Bollywood were presenters before Alia Bhatt? Alia Bhatt will debut as a presenter at the BAFTA Awards this year. Here are the female Bollywood stars who've presented before her. Also, check out when and where to watch the show live. We also look at Boong, the Manipuri film in contention this year, besides the celeb list expected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-harsh-mehta-valentines-week-romantic-italy-getaway-2872522-2026-02-22",
      "headline": "Malaika Arora dating Harsh Mehta? Viral pic from Italy trip sparks buzz Malaika Arora is reportedly in a relationship with diamond merchant Harsh Mehta, and the two are said to have celebrated Valentine's week with a romantic getaway to Italy. A picture of the two from the trip has surfaced online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/taapsee-pannu-recalls-embarrassing-demands-to-wear-padded-bras-in-south-films-2872508-2026-02-22",
      "headline": "Taapsee Pannu recalls embarrassing demands to wear padded bras in South films Taapsee Pannu opened up about certain uncomfortable realities female actors face at times in Southern cinema. She said filmmakers often make demands to cater to perceived audience fantasies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jai-hanuman-film-launched-at-anjanadri-betta-with-rishab-shetty-2872494-2026-02-22",
      "headline": "Jai Hanuman: Rishab Shetty, Teja Sajja, Bhushan Kumar begin shoot with puja ceremony The upcoming film Jai Hanuman, starring Rishab Shetty, was launched today with a grand mahurat ceremony. The film is envisioned as a high-scale cinematic tribute to the revered deity Hanuman.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kerala-story-2-controversy-film-certification-propaganda-claims-india-2872406-2026-02-22",
      "headline": "The Kerala Story 2 filmmaker is greedy, wants to divide people: Anurag Kashyap Anurag Kashyap recently slammed the makers of The Kerala Story 2 and called it a propaganda film. The film has attracted controversy similar to its predecessor, prompting court involvement and public debate over its themes and portrayal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-2-toxic-box-office-clash-dhuroxic-ram-gopal-varma-2872366-2026-02-22",
      "headline": "Dhurandhar 2 vs Toxic: RGV makes his choice, calls it a clash between two cultures Director Ram Gopal Varma reaffirmed support for Aditya Dhar's Dhurandhar and its sequel ahead of its highly anticipated box office clash with Yash's Toxic: A Fairytale for Grown-Ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/willie-colon-dies-legendary-salsa-musician-grammy-nominee-remembered-2872355-2026-02-22",
      "headline": "Salsa legend Willie Colon dies at 75, family requests privacy in statement Grammy-nominated salsa musician Willie Colon died at the age of 75. His family confirmed his death in an official statement, asking for privacy as they mourn the huge loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cbfc-denies-certification-to-sudipto-sens-charak-filmmaker-remains-clueless-on-reasons-2872346-2026-02-22",
      "headline": "Sudipto Sen's Charak faces censor hurdle, director ready to trim visuals Filmmaker Sudipto Sen recently revealed that his latest production, Charak, has been refused certification by the Central Board of Film Certification. Sen expressed complete uncertainty about the reason for the board's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-deewane-seher-mein-box-office-rises-saturday-rs-1-60-crore-collections-2872331-2026-02-22",
      "headline": "Do Deewane Seher Mein Box Office Day 2: Mrunal-Siddhant film earns Rs 3.42 crore Mrunal Thakur and Siddhant Chaturvedi's romantic drama Do Deewane Seher Mein recorded a rise in box office collections on its second day. The film earned Rs 1.60 crore on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-tribute-janell-shirtcliff-intimate-instagram-posts-2872311-2026-02-22",
      "headline": "Eric Dane's girlfriend Janell Shirtcliff posts romantic photos in emotional tribute Actor Eric Dane's girlfriend, Janell Shirtcliff, paid tribute to him by sharing a collection of photos and videos of the couple. The heartfelt post offered a glimpse into their relationship following the actor's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/taapsee-pannu-assi-box-office-collections-rise-second-day-positive-audience-response-2872301-2026-02-22",
      "headline": "Assi box office Day 2: Taapsee Pannu's film sees mild growth on Saturday Anubhav Sinha's latest film Assi, starring Taapsee Pannu, has shown a modest improvement on its second day. The Saturday collections brought the two-day total to Rs 2.60 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/darkness-redux-anurag-kashyap-is-back-on-the-neo-noir-trail-with-kennedy-2872269-2026-02-22",
      "headline": "Darkness redux: Anurag Kashyap is back on the neo-noir trail with Kennedy After over half a decade when he played the field with more mainstream subjects, Anurag Kashyap's new release, Kennedy, marks his return to exploring dark cinema.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-bridal-lehenga-videos-wedding-rumours-bigg-boss-19-2872238-2026-02-21",
      "headline": "Is Bigg Boss 19's Tanya Mittal getting married? New video sparks buzz Bigg Boss 19 contestant Tanya Mittal's recent bridal-themed social media posts have fuelled speculation about a possible wedding, leaving fans divided over whether the preparations are for a real event or another project."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-miller-jansen-south-africa-beat-india-ahmedabad-2872626-2026-02-22",
      "headline": "Ahmedabad heartbreak 2.0: SA bring India back to earth, hand massive Super 8 lossIndia vs South Africa, T20 World Cup: Ahmedabad continues to haunt India's unbeaten runs. On November 19, 2023, Australia ended their perfect ODI World Cup campaign at the final hurdle. On Sunday, South Africa repeated the script, snapping India's 12-match winning streak in the T20 World Cup, inflicting a crushing 76-run defeat on the hosts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-tejas-fighter-jet-crashes-during-training-sortie-pilot-ejects-safely-2872595-2026-02-22",
      "headline": "India loses another Tejas jet to suspected technical glitch, pilot ejects safelyUnder investigation, the Tejas fighter jet suffered severe damage during landing after a routine sortie, though the pilot ejected safely. The IAF has yet to issue an official statement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-malviya-nagar-couple-calls-arunachal-women-sex-workers-upsc-aspirant-2872615-2026-02-22",
      "headline": "Sex work for Rs 500, massage parlour: Arunachal women face racial abuse in DelhiA minor dispute over AC installation dust in Delhi's Malviya Nagar has escalated into serious allegations of racial abuse against a UPSC aspirant and her roommates from the Northeast.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/el-mencho-killed-mexican-security-operation-cjng-violence-jalisco-mexico-glbs-2872658-2026-02-23",
      "headline": "Mexico's most wanted drug lord 'El Mencho' killed, cartel violence sweeps regionAfter the killing of the drug loard, buses, trucks and cars were set ablaze across Jalisco, Guanajuato, Nayarit, Michoacn and Tamaulipas, local media and officials said, while residents in Guadalajara fled streets and transport hubs fearing reprisals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/farhan-akhtar-backed-boong-wins-bafta-award-for-best-childrens-family-film-2872650-2026-02-23",
      "headline": "BAFTA 2026: India's Boong wins Best Children's and Family Film award, makes historyFarhan Akhtar-backed Manipuri film Boong has won the BAFTA award for Best Children's and Family Film. The Lakshmipriya Devi directorial is the first Indian film to win in the category."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/man-trying-to-unlawfully-enter-trumps-mar-a-lago-resort-shot-and-killed-by-us-secret-service-agents-2872583-2026-02-22",
      "headline": "Man carrying shotgun and fuel can tries to enter Trump's Florida home, shot deadThe Secret Service said the man was seen near the resort's north gate carrying what appeared to be a shotgun and a fuel container, triggering an immediate armed response from security personnel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-airstrikes-afghanistan-india-condemns-back-kabul-attack-islamabad-2872618-2026-02-22",
      "headline": "India condemns Pak airstrikes in Afghanistan: Externalising internal failuresIndia condemned Pakistan's cross-border airstrikes in Afghanistan, citing civilian casualties. Meanwhile, Kabul has warned of a measured response after Islamabad said it targeted militant hideouts following recent attacks in Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-poor-performance-ind-vs-sa-t20-world-cup-gautam-gambhir-criticism-2872617-2026-02-22",
      "headline": "Gambhir slammed as India's Washington Sundar experiment fails vs South AfricaIndia head coach Gautam Gambhir faced criticism after Washington Sundar's underwhelming performance against South Africa in the T20 World Cup. The tactical choice to include Sundar over Axar Patel sparked debate over team selection and strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-owns-the-bafta-night-in-custom-silver-gucci-gown-2872622-2026-02-22",
      "headline": "Alia Bhatt owns the BAFTA night in custom silver Gucci gownAlia Bhatt stole the spotlight at the BAFTA Film Awards in a custom Gucci gown that shimmered effortlessly and matched her glow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/dharavi-redevelopment-project-gautam-adani-gutter-but-of-gold-why-mumbai-slums-charge-rs-5-lakh-rent-shanties-2872188-2026-02-22",
      "headline": "Gutter, but of gold. Why Dharavi slums charge Rs 5 lakh rent a monthThe towers of Mumbai have seen kilometres of expanse of Dharavi's asbestos and tin roofs for decades. Most pity the slums as a place that is deprived of the basics, while others romanticise them. As Asia's largest shanty town stands at the cusp of a major overhaul, it's humming with enterprise. Beyond the filth, Dharavi runs businesses that generate a billion dollars a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sukhbir-singh-jaunapuria-former-bjp-mp-refuses-blankets-to-muslims-tonk-rajasthan-says-not-for-those-who-abuse-pm-modi-2872656-2026-02-23",
      "headline": "Not for those who abuse PM Modi: Ex-BJP MP denies blankets to MuslimsEx-BJP MP Sukhbir Singh Jaunapuria also expressed displeasure towards his supporters for gathering people from the Muslim community for a charitable drive. When a villager objected to the BJP leader's behaviour, the latter asserted that the drive was not part of a government initiative and was sponsored by him in his personal capacity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/man-who-tried-to-break-into-mar-a-lago-identified-as-21-year-old-austin-martin-was-carrying-shotgun-fuel-can-2872621-2026-02-22",
      "headline": "21-year-old identified as Mar-a-Lago intruder, was reported missing by familyMartin drove through the north gate of the Palm Beach property at about 1:30 am as another vehicle exited and was confronted by two Secret Service agents and a Palm Beach County sheriff's deputy, authorities said. He was carrying a shotgun and a petrol canister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-make-relationship-official-announce-wedding-2872611-2026-02-22",
      "headline": "Rashmika Mandanna-Vijay Deverakonda make relationship official, announce weddingRashmika Mandanna and Vijay Deverakonda have made their relationship official. The duo shared their wedding plans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-semi-final-chances-76-run-loss-to-south-africa-super-8-2872641-2026-02-22",
      "headline": "T20 World Cup: Why India's semifinal chances look bleak after 67-run defeat to SASouth Africa handed India a crushing 76-run defeat at the Narendra Modi Stadium in the T20 World Cup 2026, pushing the Men in Blue into a tricky position with their semi-final spot now under serious threat. Here's a look at how they can still progress to the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-nuclear-enrichment-nears-weapons-grade-trump-on-edge-us-military-pressure-glbs-2872602-2026-02-22",
      "headline": "Why hasn't Iran capitulated? Trump on edge as Tehran 'a week away' from nuclear bombWashington wants Iran to surrender highly enriched uranium stockpiles and accept tighter restrictions on enrichment, arguing the material could be used for nuclear weapons. Tehran maintains its programme is peaceful and rejects demands to end enrichment entirely."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/abandoned-lolita-express-jet-still-bears-chilling-traces-of-jeffrey-epsteins-abuses-glbs-2872644-2026-02-23",
      "headline": "Decaying 'Lolita Express' jet still bears chilling traces of Epstein's abusesLolita Express is one of the most disturbing proofs of Epstein's trafficking operation. Prosecutors said it was used to move underage girls between his private properties in New York, Florida and the Caribbean, while victims described abuse occurring during flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/unsafe-no-footfall-delhis-og-mall-ansal-plaza-is-now-a-ghost-town-2871780-2026-02-22",
      "headline": "Delhi's OG mall Ansal Plaza is now a ghost townHandcrafted ByOur Editors Not every generation might be able to relate to Ansal Plaza or its existence. But that doesn't change the fact that it was Delhi's OG mall. But today, its condition is as good as a ghost town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-574-20-02-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-terror-module-busted-shabbir-shah-lone-link-lashkar-let-hafiz-saeed-pak-bangladesh-2872548-2026-02-22",
      "headline": "Lashkar module's Bangladesh-based handler was in touch with Hafiz SaeedSources said that the Bangladesh-based handler of the eight suspects arrested today had been in direct contact with Lashkar's top leadership, including 26/11 Mumbai terror attack mastermind Hafiz Saeed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-looks-to-remove-ex-prince-andrew-british-royal-succession-line-arrest-epstein-files-case-2872565-2026-02-22",
      "headline": "Insult on top of ignominy: Andrew could be axed from royal line of successionAndrew, 66, remains eighth in line to the throne despite having been stripped of his royal titles and stepping back from official duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/patents-filed-vs-patents-granted-truth-behind-indias-ranking-race-2872551-2026-02-22",
      "headline": "The Indian patent story: Why private universities file more patents than IITs combinedHandcrafted ByOur Editors India has crossed 1 lakh patent filings in 2024–25, with educational institutes driving a 62% surge in a year. Private universities dominate filings, overtaking the IITs. But are these patents signs of real innovation or ranking strategy? This deep dive breaks down patent filings vs patent grants, incentives, reimbursements, and commercial impact to uncover what is really behind India's university patent boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/army-dog-tyson-leads-troops-to-jaish-terrorists-hideout-injured-gunfight-jammu-kashmir-kishtwar-2872588-2026-02-22",
      "headline": "Army dog leads troops to Jaish terrorists' hideout in J&K, injured in gunfightArmy dog Tyson ran ahead of the troops during the search operation in Kishtwar and successfully pinpointed the terrorists' location in the operation zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gunfight-erupts-between-security-forces-and-terrorists-in-jks-kishtwar-2872371-2026-02-22",
      "headline": "Top Jaish commander among 3 terrorists killed in gunfight in J&K's KishtwarThree terrorists were killed in a gunfight with security forces in Jammu and Kashmir's Kishtwar. The operation was launched after intel about two-three terrorists hiding in Chatroo forest belt."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-content-creator-sachin-awasthi-claims-38-hour-detention-and-blackmail-in-south-korea-china-2872475-2026-02-22",
      "headline": "Treated like criminals: Indian vlogger detained in South Korea, China for 38 hoursIndian content creator Sachin Awasthi claimed that he was held for 38 hours in detention at Jeju Island, South Korea, and during transit through China. He shared his experience of being denied entry, facing strict supervision and limited communication."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-t20-world-cup-sunil-gavaskar-india-batters-six-hitters-south-africa-defeat-2872649-2026-02-23",
      "headline": "Sunil Gavaskar calls for India's batters to be more than six-hitters after SA defeat Former India cricketer, Sunil Gavaskar, in an exclusive interaction with Nikhil Naz on India Today, opened up on the batting unit of the Indian T20I side after the crushing 76-run defeat to South Africa in the Super 8 stages of the T20 World Cup. The batting legend called for the side led by Suryakumar Yadav to be more than just six-hitters and ones who can also play based on the conditions and the situation as well, when the conditions get tough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-sunil-gavaskar-sundar-pichai-meeting-ahmedabad-2872648-2026-02-23",
      "headline": "Sundar Pichai says Gavaskar his idol. Batting great lifts lid on T20WC meeting Indian batting great Sunil Gavaskar shared details of his meeting with Google and Alphabet CEO Sundar Pichai during the Super Eights clash between India and South Africa in Ahmedabad on Sunday, after the tech leader described him as his childhood idol and recalled growing up with his posters on the wall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-suryakumar-blames-poor-batting-for-south-africa-loss-aggressive-style-2872640-2026-02-22",
      "headline": "Suryakumar blames poor batting for SA loss, refuses to abandon aggressive style India suffered a heavy defeat against South Africa in the Super 8 fixture of the T20 World Cup 2026. India captain Suryakumar Yadav blamed team's poor batting show for the crushing loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-semi-final-chances-76-run-loss-to-south-africa-super-8-2872641-2026-02-22",
      "headline": "T20 World Cup: Why India's semifinal chances look bleak after 67-run defeat to SA South Africa handed India a crushing 76-run defeat at the Narendra Modi Stadium in the T20 World Cup 2026, pushing the Men in Blue into a tricky position with their semi-final spot now under serious threat. Here's a look at how they can still progress to the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-miller-jansen-south-africa-beat-india-ahmedabad-2872626-2026-02-22",
      "headline": "Ahmedabad heartbreak 2.0: SA bring India back to earth, hand massive Super 8 loss India vs South Africa, T20 World Cup: Ahmedabad continues to haunt India's unbeaten runs. On November 19, 2023, Australia ended their perfect ODI World Cup campaign at the final hurdle. On Sunday, South Africa repeated the script, snapping India's 12-match winning streak in the T20 World Cup, inflicting a crushing 76-run defeat on the hosts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-poor-performance-ind-vs-sa-t20-world-cup-gautam-gambhir-criticism-2872617-2026-02-22",
      "headline": "Gambhir slammed as India's Washington Sundar experiment fails vs South Africa India head coach Gautam Gambhir faced criticism after Washington Sundar's underwhelming performance against South Africa in the T20 World Cup. The tactical choice to include Sundar over Axar Patel sparked debate over team selection and strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-super-8-jasprit-bumrah-masterclass-ahmedabad-2872612-2026-02-22",
      "headline": "Jasprit Bumrah stands out in Ahmedabad: 3 for 15 and a new T20 World Cup record T20 World Cup 2026, IND vs SA Super 8: Jasprit Bumrah delivered a masterclass in control and craft, claiming three crucial wickets and conceding just 15 runs in his quota of four overs, but South Africa's late surge denied India complete dominance in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-unlikely-to-play-all-matches-of-ipl-2026-csk-2872578-2026-02-22",
      "headline": "MS Dhoni unlikely to play all matches of IPL 2026: Report MS Dhoni has confirmed his availability for the IPL 2026 season with Chennai Super Kings. However, his participation in all matches remains uncertain due to fitness and team strategy considerations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-super-8s-playing-xi-toss-2872564-2026-02-22",
      "headline": "IND vs SA Super 8: India continue to bench vice-captain Axar Patel IND vs SA, T20 World Cup: India once again left out vice-captain Axar Patel as the defending champions named an unchanged playing XI for their Super 8 clash against South Africa in Ahmedabad on Sunday, February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-england-vs-sri-lanka-super-8-score-will-jacks-pallekele-2872563-2026-02-22",
      "headline": "Sri Lanka hand Harry Brook a birthday gift as England begin Super 8 with win T20 World Cup, SL vs ENG Super 8: Sri Lanka were bundled out for 95 in 16.4 overs as England's spinners ran riot, successfully defending a par total of 146. Will Jacks starred with his part-time off-spin, claiming three crucial wickets in Pallekele on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sialkot-stallionz-sold-again-ownership-dispute-psl-11-2872554-2026-02-22",
      "headline": "Pakistan Super League: Sialkot Stallionz sold again ahead of new seasonThe Sialkot Stallionz franchise in the Pakistan Super League has been sold again following disputes over ownership and financial background. The controversy raises questions about the PCB's vetting process ahead of the PSL 11 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-women-defend-acc-womens-asia-cup-rising-stars-title-46-run-victory-bangladesh-a-2872531-2026-02-22",
      "headline": "India retain Women's Asia Cup Rising Stars title, beat Bangladesh again in finalIndia A women's cricket team retained their ACC Women's Asia Cup Rising Stars crown after defeating Bangladesh A by 46 runs in the final held at the Terdthai Cricket Ground. The defending champions overcame early setbacks and relied on strong batting and disciplined bowling to secure victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-live-score-super-8s-t20-world-cup-ahmedabad-2872520-2026-02-22",
      "headline": "IND vs SA Super 8 Highlights: South Africa hammer India by 76 runsIndia (IND) vs South Africa (SA), T20 World Cup Super 8 Highlights: South Africa hammered India by 76 runs in Match 43 of the T20 World Cup 2026. Chasing a target of 188, India were bundled out for just 111 runs in 18.5 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-fih-pro-league-australia-penalty-shootout-loss-hobart-2872515-2026-02-22",
      "headline": "India loses six on the trot in FIH Pro League, suffers AUS shootout heartbreakIndia's horrible run in the FIH Pro League continued as they lost their sixth match on the trot on Sunday, February 22. Australia edge past the Indian team 5-4 in the penalty shoot-out in Hobart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-origin-players-shine-t20-world-cup-global-pride-pm-modi-2872509-2026-02-22",
      "headline": "Indian-origin players global ambassadors of Indianness at T20 World Cup: PM ModiMany players of Indian origin are making their countries proud, reflecting the true spirit of being Indian, Prime Minister Narendra Modi said on Sunday. He added that wherever Indians go, they remain connected to their roots while contributing to the growth and development of the country they live and work in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-india-vs-south-africa-t20-world-cup-ravi-shastri-2872507-2026-02-22",
      "headline": "Abhishek Sharma's 3 ducks a positive: Shastri's stunning claim before IND vs SAT20 World Cup: Ravi Shastri feels that Abhishek Sharma's three ducks in the T20 World Cup 2026 is actually a good thing for India. Shastri feels that the other teams will be scared of the Indian opener knowing that he is due for runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-instagram-story-cryptic-heartfelt-note-sports-doesnt-care-about-feelings-ausw-vs-indw-2872483-2026-02-22",
      "headline": "Smriti Mandhana writes heartfelt note on Instagram after Australia T20I heroicsSmriti Mandhana posted a cryptic message after her match-winning 82 in the T20I decider against Australia. The India opener stressed that performance, not emotions, ultimately defines success in sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-board-meetings-doha-cricket-growth-qatar-2872468-2026-02-22",
      "headline": "Qatar in focus: Doha to host ICC board meetings in MarchDoha will host the next ICC board and committee meetings from March 25 to 27, reflecting Qatar's rapid cricket growth and increasing role in international cricket governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/premier-league-chelsea-burnley-wesley-fofana-hannibal-mejbri-vinicius-jr-2872400-2026-02-22",
      "headline": "After Vini Jr., Fofana, Hannibal receive racial abuse after Chelsea-Burnley drawWesley Fofana and Hannibal Mejbri have been subjected to racial abuse following Chelsea's draw with Burnley in the Premier League. This happens days after Vinicius Jr was allegedly racially abused during the Real Madrid vs Benfica game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-england-live-score-super-8-t20-world-cup-rain-updates-pallekele-2872426-2026-02-22",
      "headline": "SL vs ENG Super 8 Highlights: Jacks, Archer guide England to 51-run victorySri Lanka (SL) vs England (ENG), T20 World Cup Highlights: England have inflicted a massive 51-run loss on Sri Lanka as Will Jacks, Jofra Archer, Adil Rashid and Liam Dawson have run through their batting line up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-history-sachin-tendulkar-through-years-2872425-2026-02-22",
      "headline": "India vs South Africa: A cricket journey scripted as Tendulkar's travelogueAs India prepare to face South Africa in the T20 World Cup Super 8 in Ahmedabad, Sachin Tendulkar's career reminds us how one opponent shaped his journey through reunion, rivalry, scandal, accusation, redemption, and ultimate triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-retirement-2026-fifa-world-cupo-brazil-injury-problems-santos-carlo-ancelotti-2872403-2026-02-22",
      "headline": "Neymar hints at possible retirement at the end of 2026 season: Living year to yearNeymar has revealed he could retire at the end of the 2026 season but remains determined to play one final FIFA World Cup with Brazil. The 34-year-old says he is taking his career year by year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-spin-threat-not-a-threat-neil-mckenzie-super-8-varun-chakravarthy-2872376-2026-02-22",
      "headline": "India's spin power not a threat to South Africa: Neil McKenzie ahead of Super 8 clashT20 World Cup: Neil McKenzie believes India's spin attack will not automatically trouble South Africa in the Super 8 clash. The former Proteas batter feels match-ups and execution will matter more than variety in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-suryakumar-yadav-batting-approach-sanjay-manjrekar-2872373-2026-02-22",
      "headline": "Surya taking it a bit too far: Manjrekar calls IND captain's approach dangerousT20 World Cup: Ahead of India's clash against South Africa in the Super 8, Sanjay Manjrekar criticised Suryakumar Yadav's batting approach in the tournament so far. Suryakumar has adopted a cautious approach during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/albie-vs-morne-morkel-ind-vs-sa-t20-world-cup-2026-2872357-2026-02-22",
      "headline": "From backyard rivalry to Ahmedabad: Morkel brothers ready for IND vs SA clashT20 World Cup: It may be India vs South Africa in Ahmedabad on Sunday, February 22, but the match will also feature two brothers on opposite camps. Albie and Morne Morkel open up about their backyard rivalry, job roles and more in a candid chat with the BCCI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-super-8-match-preview-ahmedabad-2872343-2026-02-22",
      "headline": "India, South Africa set for Super 8 showdown in 2024 final rematch Live updatesT20 World Cup: India take on South Africa in their first Super 8 clash in the T20 World Cup. In Ahmedabad's cricketing circles, this is being billed as the toughest challenge for India yet in this World Cup.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-pakistan-ahmed-shehzad-umar-akmal-2872341-2026-02-22",
      "headline": "Chasing Virat Kohli, losing themselves: Pakistan stars who faded awayPakistan has produced several cricketers, including Babar Azam, who were compared to Virat Kohli. While many made impressive starts to their careers, most struggled to demonstrate the level of consistency and dedication that Kohli has maintained over the years at the highest level of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-aiden-markram-threat-to-jasprit-bumrah-super-8-ahmedabad-2872248-2026-02-22",
      "headline": "Who will be biggest threat to Jasprit Bumrah vs South Africa? Varun Aaron revealsFormer cricketer Varun Aaron warns India about Aiden Markram ahead of their Super 8 T20 World Cup match. The contest in Ahmedabad could hinge on Markram's ability to counter Jasprit Bumrah's bowling, says Aaron."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-super-8-tilak-varma-2024-version-not-anchor-vs-south-africa-suryakumar-yadav-2872339-2026-02-22",
      "headline": "Not slow and steady, India need the 2024 version of Tilak Varma in Super 8sT20 World Cup: India cruised through a manageable group stage, but the real test begins now. Against South Africa and tougher Super 8 opponents, Tilak Varma may need to rediscover his 2024 tempo, not just his anchor role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-2872322-2026-02-22",
      "headline": "India don't need changes vs South Africa: Sunil Gavaskar backs XI for Super 8 clashT20 World Cup: Sunil Gavaskar feels India should stick to their winning XI for the Super 8 clash against South Africa, with Washington Sundar the only possible tweak if Abhishek Sharma's struggles continue. Otherwise, he backs the side to handle the pressure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}