{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-cylinders-price-hike-by-rs-50-each-ujwala-non-ujwala-consumers-2705343-2025-04-07",
      "headline": "LPG cylinder prices hiked by Rs 50 for both subsidised, non-subsidised consumersThe government has hiked LPG prices to recover past losses, pushing up household cooking costs at a time of rising economic uncertainty and global trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eu-india-car-import-tariff-trade-deal-2705338-2025-04-07",
      "headline": "After Trump, EU wants India to remove tariffs on car imports: ReportThe European Union is pressing India to eliminate steep import tariffs on automobiles under a long-delayed trade deal , with India signalling a willingness to offer more attractive terms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-2200-points-lower-nifty-below-22200-trent-crashes-15-2705318-2025-04-07",
      "headline": "Sensex closes 2,200 points lower as Dalal Street logs worst session in 10 monthsStock market crash: The S&P BSE Sensex ended 2226.79 points lower at 73,137.90, while the NSE Nifty50 fell 742.85 points to trade at settle at 22,161.60. Most of the broader market indices also crashed during the extremely volatile trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/petrol-diesel-to-cost-more-as-government-raises-excise-duty-by-rs-2-per-litre-2705313-2025-04-07",
      "headline": "Excise duty on petrol, diesel increased by Rs 2; no impact on consumersThe move comes at a time when global crude oil prices are actually on a downward trend, driven by fears of a global trade war sparked by the US administration's reciprocal tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-flies-iphones-from-india-and-china-to-dodge-trump-tariffs-report-2705296-2025-04-07",
      "headline": "Apple flies iphones from India and China to dodge Trump's tariffs: ReportApple is closely studying how different tariff rules in various countries could impact its supply chain. The US remains one of Apple's key markets, and the company is trying to avoid passing on higher costs to customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-india-richest-wealth-decline-usd-10-billion-ambani-adani-savitri-jindal-shiv-nadar-2705286-2025-04-07",
      "headline": "$10 billion wiped out: India's richest 4 take a hit in stock market crashThe country's top four billionaires, Mukesh Ambani, Gautam Adani, Savitri Jindal & family, and Shiv Nadar, together lost over $10 billion as markets around the world fell sharply. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/what-is-black-monday-stock-market-crash-know-why-it-is-making-headlines-again-trump-reciprocal-tariffs-2705233-2025-04-07",
      "headline": "What is 'Black Monday' stock market crash? Know why it's making headlines againOn Friday, April 4, 2025, the US stock market had its worst day since the Covid-19 crash. More than $5 trillion was erased in a matter of hours as stocks plummeted, and volatility soared. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-what-should-retail-investors-do-trump-tariffs-make-portfolios-bleed-2705229-2025-04-07",
      "headline": "Stock market crash: What should investors do as Trump tariffs batter portfolios?Dalal Street is bleeding as global turmoil deepens amid Trump's tariff shock. Read on to find out what investors should do now amid the chaos and confusion. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-worst-stock-market-crashes-from-covid-19-to-trump-tariffs-april-7-black-monday-2705192-2025-04-07",
      "headline": "India's worst stock market crashes: From Covid-19 to Trump tariffsOn Monday, April 7, the Indian stock market faced one of its biggest falls since June 2024. The Sensex fell nearly 4,000 points, while the Nifty 50 slipped below 21,750, dragging down investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-crashes-3000-points-nifty-tumbles-sharply-sectors-hit-hardest-in-stock-market-bloodbath-2705188-2025-04-07",
      "headline": "Stock market crash: Which sectors have been hit hardest today?All sectors ended deep in the red, triggering sharp wealth erosion for investors. Some bore steeper losses than others. Here's a breakdown of the hardest-hit sectors in today's session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-fall-10-percent-why-reason-stock-market-crash-2705154-2025-04-07",
      "headline": "Explained: Why Tata Motors share price fell 10% todayTata Motors share price: Tata Motors' stock has seen a steady decline over the past few months. It has fallen by 17.12% in the last five trading days alone. In the past six months, the stock is down by 39.42%. Over the last one year, it has lost 44.50% of its value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-down-3000-points-5-things-to-know-2705148-2025-04-07",
      "headline": "Sensex plunges 3,000 points: 5 reasons behind stock market crashShare market crash: Dalal Street is facing its worst trading session in a year, as Donald Trump's tariff shock has sparked a global rout and reignited fears of a looming recession."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-shooting-dance-number-for-raid-2-but-not-with-honey-singh-exclusive-2705354-2025-04-07",
      "headline": "Tamannaah Bhatia shooting dance number for Raid 2, but not with Honey SinghActor Tamannaah Bhatia has been shooting for a special dance number in 'Raid 2'. However, as opposed to the viral reports, she has not collaborated with Honey Singh for the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-video-message-drivers-after-wife-sonali-road-accident-2705342-2025-04-07",
      "headline": "Sonu Sood's video message for drivers after wife Sonali's road accidentDays after Sonu Sood's wife, Sonali, was injured in a road accident, the actor shared an important message for all drivers. The video message highlights the importance of seat belts for passengers sitting at the back of the car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aaditi-pohankar-opens-up-about-performing-intimate-scenes-with-bobby-deol-2705345-2025-04-07",
      "headline": "Actor Aaditi Pohankar opens up about performing intimate scenes with Bobby DeolActor Aaditi Pohankar recently spoke to India Today Digital about sharing screen space with Ashram co-star Bobby Deol. Pohankar shared how she broke the ice with Deol on the set of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tv-legend-jay-north-dies-at-73-after-long-cancer-battle-glbs-2705329-2025-04-07",
      "headline": "TV legend Jay North dies at 73 after long cancer battleJay North, beloved star of the classic TV show Dennis the Menace, has died at 73 after battling colon cancer. He will always be remembered for the wonderful work he did. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baeksang-awards-2025-full-nominees-list-when-life-gives-you-tangerines-lovely-runner-2705316-2025-04-07",
      "headline": "Baeksang Awards 2025 full nominees list: When Life Gives You Tangerines leadsThe 61st Baeksang Arts Awards nominations highlight a fierce competition in Korean film and television, with When Life Gives You Tangerines leading with nine nods across major categories. Other notable contenders include Lovely Runner, Doubt, and Love in the Big City in both acting and film categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-age-gap-best-friend-rasha-thadani-doesnt-matter-2705321-2025-04-07",
      "headline": "Tamannaah Bhatia shares why age gap doesn't affect her friendship with Rasha ThadaniActor Tamannaah Bhatia shares a profound bond with actor Rasha Thadani. In a recent interview, she addressed the age gap between them and what defines her friendships. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-scenes-removed-from-g-dragon-show-good-day-2705301-2025-04-07",
      "headline": "Kim Soo-hyun's scenes removed from G-Dragon's show Good DayK-drama star Kim Soo-hyun's segment has been completely removed from the ongoing variety show Good Day, amid the Kim Sae-ron death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-stylish-statement-black-the-last-five-years-broadway-opening-show-2705315-2025-04-07",
      "headline": "Priyanka-Nick make stylish statement in black at The Last Five Years opening showPriyanka Chopra and Nick Jonas made a stylish entry at the Broadway opening of the singer's show, The Last Five Years, in New York City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-trailer-emraan-hashmi-is-a-man-on-a-mission-in-conflict-ridden-kashmir-2705299-2025-04-07",
      "headline": "Ground Zero trailer: Emraan Hashmi wages war in Kashmir-set thrillerThe high-octane trailer of the upcoming film Ground Zero is out. Starring Emraan Hashmi in the lead role, the gripping film is set against the backdrop of conflict-ridden Kashmir, and will release on April 25. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-7-review-ted-black-and-others-talk-the-talk-but-dont-walk-the-walk-2705280-2025-04-07",
      "headline": "Suits LA Episode 7 review: Talks the talk but doesn't walk the walk 'Suits LA' is getting nowhere, it seems. After Ted Black wins his trial, there's a sudden rush of overwhelming happiness in him and around him. Everything has turned happy in the show, and while we are not against sweetness, this is not the world of 'Suits'. We like our conflicts here, no? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-veer-pahariya-nail-viral-one-leg-dance-move-rang-song-sky-force-2705257-2025-04-07",
      "headline": "Farah Khan, Veer Pahariya nail viral one-leg dance move: Been dying to do thisFarah Khan and Veer Pahariya join forces in a viral dance trend, showcasing the popular one-leg move from the song 'Rang' in a recent Instagram reel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-finale-2705285-2025-04-07",
      "headline": "The White Lotus S3 finale review: Bloody, chaotic and weirdly enlighteningReleased-Sun Apr 06, 2025The White Lotus Season 3, streaming on JioHotstar, is a worthy follow-up but doesn't create the same magic as it did with the first two seasons. The latest season struggled to find a unifying theme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-praises-brad-pitt-driving-skills-f1-2705217-2025-04-07",
      "headline": "Tom Cruise praises Brad Pitt's driving skills, eager to see F1Hollywood star Tom Cruise has praised former co-star Brad Pitt's driving skills in a new interview. The actors had previously shared screen space in Interview with the Vampire (1994). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karma-kdrama-review-park-hae-soo-shin-min-a-lee-kwang-soo-show-is-sharp-2705206-2025-04-07",
      "headline": "Karma review: A sharp, gritty tangle of fate and retributionReleased-Fri Apr 04, 2025Karma Kdrama review: The series delves into the intricacies of fate intertwined with retribution in a sharp and gritty narrative. Itmasterfully portrays the consequences of actions through its compelling storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-wife-tahira-kashyap-suffers-breast-cancer-relapse-after-7-years-still-got-this-2705205-2025-04-07",
      "headline": "Filmmaker Tahira Kashyap's breast cancer relapses, says 'Round 2, but I got this'Tahira Kashyap said she's 'still got this' while expressing her positive outlook towards life in a post mentioning her battle with breast cancer for the second time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-joins-sons-taimur-jeh-at-football-match-chats-with-fans-2705201-2025-04-07",
      "headline": "Kareena Kapoor joins sons Taimur, Jeh at football match, chats with fansActor Kareena Kapoor Khan accompanied her sons, Taimur and Jeh, to a football match on Sunday. There, she not only greeted several fans but also took the time to interact with them and sign autographs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-slams-fan-for-questioning-age-gap-between-her-and-mohanlal-2705197-2025-04-07",
      "headline": "Malavika Mohanan slams fan for questioning age gap between her and MohanlalActor Malavika Mohanan has slammed the internet for raising questions about her and co-star Mohanlal's age gap. The two will soon be seen sharing screen space in the Malayalam film Hridayapoorvam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-idol-15-winner-manasi-ghosh-want-to-collab-with-ar-rahman-sonu-nigam-2705195-2025-04-07",
      "headline": "Indian Idol 15 winner Manasi Ghosh: Want to collab with AR Rahman, Sonu NigamKolkata's Manasi Ghosh was crowned the winner of Indian Idol 15 on Sunday. In an exclusive chat, she shared her aspirations of collaborating with music legends like AR Rahman and Sonu Nigam. She emphasised her journey of hard work, diverse singing capabilities, and future plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-loses-cool-at-elderly-fan-during-manoj-kumars-prayer-meet-2705159-2025-04-07",
      "headline": "Jaya Bachchan loses cool at elderly fan during Manoj Kumar's prayer meetAt the prayer tribute for the late Manoj Kumar in Mumbai, a video of Jaya Bachchan's interaction with an elderly woman went viral, sparking reactions on social media. The veteran actor appeared miffed when the fan requested a photo."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-global-markets-crash-us-tariff-no-inflation-2705362-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No inflation, says Donald Trump as global markets crash after US tariff shockNo inflation, says Donald Trump as global markets crash after US tariff shock"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-cylinders-price-hike-by-rs-50-each-ujwala-non-ujwala-consumers-2705343-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPG cylinder prices hiked by Rs 50 for both subsidised, non-subsidised consumersThe government has hiked LPG prices to recover past losses, pushing up household cooking costs at a time of rising economic uncertainty and global trade tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/varansi-gangrape-woman-drink-spiked-confined-for-days-up-student-alleges-gangrape-by-men-2705297-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drink spiked, confined for 7 days: UP student alleges gangrape by 23 menFollowing a complaint from the girl's family, police located her and also began questioning staff at the hookah bar. CCTV footage from the location is being examined as part of the investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-home-minister-g-parameshwara-bengaluru-woman-molested-street-2705193-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka minister's shocker on Bengaluru molestation: Tends to happen in big cityCCTV footage went viral on social media last week showing a man groping a woman on a street in Bengaluru. The Home Minister directed the police to increase beat patrolling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-india-richest-wealth-decline-usd-10-billion-ambani-adani-savitri-jindal-shiv-nadar-2705286-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "$10 billion wiped out: India's richest 4 take a hit in stock market crashThe country's top four billionaires, Mukesh Ambani, Gautam Adani, Savitri Jindal & family, and Shiv Nadar, together lost over $10 billion as markets around the world fell sharply. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/petrol-diesel-to-cost-more-as-government-raises-excise-duty-by-rs-2-per-litre-2705313-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Excise duty on petrol, diesel increased by Rs 2; no impact on consumersThe move comes at a time when global crude oil prices are actually on a downward trend, driven by fears of a global trade war sparked by the US administration's reciprocal tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/cpms-ma-baby-steps-reveal-a-fault-line-dominance-of-kerala-lobby-against-bengal-bloc-general-secretary-election-2705247-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CPM's Baby steps reveal a rift, dominance of Kerala blocThe CPI(M)'s internal elections, which saw the election of Kerala veteran MA Baby to the general secretary's post, reveals not just a decades-old fault line, but the dominance of the Kerala lobby over the Bengal bloc. This is critical as the party tries to take Baby steps towards revival ahead of crucial elections in its strongholds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-meets-sacked-teachers-supreme-court-verdict-wbssc-exam-recruitment-bjp-marches-to-her-residence-2705213-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I can be jailed but..: Mamata Banerjee vows to back sacked Bengal teachersThe Supreme Court's April 3 verdict cited large-scale irregularities and fraud in the recruitment process, leading to the dismissal of thousands of teachers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/hypocrites-indian-origin-techie-confronts-microsoft-bosses-quits-over-gaza-2705109-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'How dare you?': Indian-origin techie confronts Microsoft bosses, quits over GazaFollowing the confrontation, Vaniya Agrawal dropped a scathing resignation letter, stating that her last day at the office would be April 11. She said she could no longer be part of an organisation that empowers 'oppressors' instead of the oppressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-2200-points-lower-nifty-below-22200-trent-crashes-15-2705318-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex closes 2,200 points lower as Dalal Street logs worst session in 10 monthsStock market crash: The S&P BSE Sensex ended 2226.79 points lower at 73,137.90, while the NSE Nifty50 fell 742.85 points to trade at settle at 22,161.60. Most of the broader market indices also crashed during the extremely volatile trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-questions-empuraan-producer-gokulam-gopalan-chit-fund-company-raids-cash-recovery-2705258-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED questions Empuraan producer Gokulam Gopalan after cash recovery from officesED questions Empuraan producer Gokulam Gopalan days after recovering Rs 1.5 crore from his offices"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-metro-passenger-drinking-alcohol-peeling-boiled-eggs-truth-behind-viral-video-2705333-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Delhi Metro passenger drink alcohol in coach? Here's the truth behind viral videoAs the video went viral on social media, several users assumed that the Delhi Metro passenger was openly consuming alcohol on public transport.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-womans-biryani-mix-up-goes-viral-noida-restaurant-worker-arrested-2705302-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Noida woman gets chicken biryani instead of veg biryani; restaurant staff arrestedA woman in Noida received non-veg biryani instead of veg. Her video complaining about the 'intentional' mix-up went viral, leading to the restaurant staff's arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-wife-tahira-kashyap-suffers-breast-cancer-relapse-after-7-years-still-got-this-2705205-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Filmmaker Tahira Kashyap's breast cancer relapses, says 'Round 2, but I got this'Tahira Kashyap said she's 'still got this' while expressing her positive outlook towards life in a post mentioning her battle with breast cancer for the second time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/sndp-yogam-vellapally-natesan-calls-malappuram-different-country-iuml-sadiq-thangal-reacts-2705145-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala politician calls Muslim-majority Malappuram 'different country'SNDP yogam general secretary Vellappally Natesan sparked controversy by calling Kerala's Muslim-majority district Malappuram \"a different country\". This drew sharp reactions from IUML and others, even as he defended his remarks and accused critics of misrepresenting his intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-to-make-met-gala-debut-this-year-2705360-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mother-to-be Kiara Advani to make Met Gala debut this yearAfter Alia Bhatt, Kiara Advani is all set to make her much-anticipated Met Gala debut this year. Last year, she represented India at the Cannes Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-shooting-dance-number-for-raid-2-but-not-with-honey-singh-exclusive-2705354-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamannaah Bhatia shooting dance number for Raid 2, but not with Honey SinghActor Tamannaah Bhatia has been shooting for a special dance number in 'Raid 2'. However, as opposed to the viral reports, she has not collaborated with Honey Singh for the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-varanasi-indigo-flight-makes-emergency-landing-aurangabad-airport-after-woman-dies-mid-air-2705254-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman dies onboard, Mumbai-Varanasi IndiGo flight makes emergency landingAn 89-year-old woman from Mirzapur fell ill mid-air after boarding the Mumbai-Varanasi flight. The plane made an emergency landing in Aurangabad, but she was declared dead on arrival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-match-preview-predicted-xi-pitch-conditions-2705230-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah comeback today? MI look to return to winning ways vs RCBIPL 2025, MI vs RCB Match Preview: Mumbai Indians got a major boost with Jasprit Bumrah's possible return as they gear up for a crucial Wankhede clash against Royal Challengers Bengaluru, while doubts remain over Rohit Sharma's fitness ahead of the high-stakes Monday night battle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-prashanth-nair-suicide-marital-dispute-police-file-udr-2705295-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "40-year-old Bengaluru techie dies by suicide amid alleged marital disputeA 40-year-old techie from Bengaluru in Karnataka, died by suicide amid ongoing marital issues. He was found dead at his home by his father. Police have filed an Unnatural Death Report and are investigating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tarrifying-congress-ups-ante-on-pm-modi-as-trump-tariffs-jolt-indian-markets-bse-nse-nifty-stock-crash-2705265-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Tarrifying': Congress ups ante on PM Modi as Trump tariffs jolt Indian marketsComparing PM Modi to his US counterpart, Congress said that both leaders are experts in delivering 'self-inflicted wounds' to their countries as a result of which the markets are responding in a 'tariffying' manner."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-extends-interim-protection-from-arrest-kunal-kamra-shinde-joke-case-parody-2705292-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra's interim protection from arrest extended in Shinde jibe rowThe Madras High Court on Monday extended comedian Kunal Kamra's interim protection from arrest, which was set to end today, until April 27, in connection with an FIR lodged in Mumbai over his 'traitor' jibe at Maharashtra Deputy Chief Minister Eknath Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-meets-infosys-employee-who-works-as-bike-taxi-rider-in-his-free-time-2705260-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru woman meets Infosys employee who works as bike taxi rider in his free timeThe Bengaluru man said that he decided to use weekends and early mornings to earn some extra money and stay productive instead of spending his free time doom-scrolling. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-shares-adorable-moment-with-son-caius-in-warriors-vs-rockets-glbs-2705363-2025-04-07",
      "headline": "NBA: Stephen Curry shares adorable moment with son Caius in Warriors vs RocketsNBA star Stephen Curry had a heartwarming moment with his youngest son Caius during a timeout in a game between the Golden State Warriors and the Houston Rockets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-named-englands-new-white-ball-captain-2705358-2025-04-07",
      "headline": "Harry Brook named England's new ODI and T20I captainYoung England batter Harry Brook has been named his team's new white-ball captain, replacing Jos Buttler, who recently stepped down from his role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/digvesh-rathi-celebration-ipl-2025-suspension-kkr-vs-lsg-2705344-2025-04-07",
      "headline": "Hope Digvesh Rathi does not repeat his celebration: Shahbaz AhmedKKR vs LSG: Young spinner Digvesh Rathi has been in the eye of the storm for his controversial celebration. Rathi's teammate has hoped that he will not repeat the celebration any more.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-botez-sisters-awkward-p-icture-fan-reaction-freestyle-chess-2705306-2025-04-07",
      "headline": "D Gukesh and Botez sisters reunite: Awkward picture sparks viral reactionsChess World Champion D Gukesh shared another meme-worthy moment with Alexandra and Andrea Botez ahead of the Freestyle Chess Tour in Paris, as fans erupted with hilarious reactions to their viral photo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-charlotte-edwards-p-art-ways-england-head-coach-2705246-2025-04-07",
      "headline": "MI and Charlotte Edwards part ways as WPL-winning coach takes England jobCharlotte Edwards leaves Mumbai Indians after guiding them to two WPL titles. The England legend now takes on the challenge of coaching her national side, aiming to revive their form after disappointing World Cup and Ashes campaigns under Jon Lewis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-rcb-jasprit-bumrah-virat-kohli-ipl-2025-2705236-2025-04-07",
      "headline": "Jasprit Bumrah vs Virat Kohli: Wankhede prepares for epic battleMumbai Indians pacer Jasprit Bumrah has joined the side ahead of their home game against Royal Challengers Bengaluru. If Bumrah plays, his battle against Virat Kohli might turn out to be a spectacle.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-match-preview-predicted-xi-pitch-conditions-2705230-2025-04-07",
      "headline": "Jasprit Bumrah comeback today? MI look to return to winning ways vs RCBIPL 2025, MI vs RCB Match Preview: Mumbai Indians got a major boost with Jasprit Bumrah's possible return as they gear up for a crucial Wankhede clash against Royal Challengers Bengaluru, while doubts remain over Rohit Sharma's fitness ahead of the high-stakes Monday night battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravi-ashwin-youtube-controversy-explained-noor-ahmad-prasanna-2705199-2025-04-07",
      "headline": "R Ashwin's YouTube channel to not cover remaining CSK games in IPL 2025IPL 2025: Ravi Ashwin's YouTube channel will not be covering CSK matches going forward. Ashwin's YouTube admin explained the reason behind taking the decision to keep away from content related to CSK.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-fined-player-code-of-conduct-2705181-2025-04-07",
      "headline": "Ishant Sharma fined 25 per cent match fees for breach of conduct vs SRHGujarat Titans fast bowler Ishant Sharma has been fined 25 per cent of his match fees for breaching the code of conduct vs SRH. Ishant is the fifth player to be fined this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-gt-coach-ashish-nehra-passes-game-knowledge-prasidh-krishna-2705174-2025-04-07",
      "headline": "Nehra passes his game knowledge to us: Prasidh Krishna praises GT coachGujarat Titans pacer Prasidh Krishna heaped praise on his side's head coach Ashish Nehra, highlighting how the former India pacer helps his side's bowling attack by passing on his own game knowledge to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-ashish-nehra-sourav-ganguly-2705160-2025-04-07",
      "headline": "Sourav Ganguly praises GT coach Ashish Nehra after thumping win vs SRHFormer India captain Sourav Ganguly heaped praise on Gujarat Titans coach Ashish Nehra after they beat SunRisers Hyderabad away from home. Ganguly said that Nehra had tremendous game sense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-match-preview-predicted-xi-pitch-conditions-2705230-2025-04-07",
      "headline": "Jasprit Bumrah comeback today? MI look to return to winning ways vs RCBIPL 2025, MI vs RCB Match Preview: Mumbai Indians got a major boost with Jasprit Bumrah's possible return as they gear up for a crucial Wankhede clash against Royal Challengers Bengaluru, while doubts remain over Rohit Sharma's fitness ahead of the high-stakes Monday night battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravi-ashwin-youtube-controversy-explained-noor-ahmad-prasanna-2705199-2025-04-07",
      "headline": "R Ashwin's YouTube channel to not cover remaining CSK games in IPL 2025IPL 2025: Ravi Ashwin's YouTube channel will not be covering CSK matches going forward. Ashwin's YouTube admin explained the reason behind taking the decision to keep away from content related to CSK.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-fined-player-code-of-conduct-2705181-2025-04-07",
      "headline": "Ishant Sharma fined 25 per cent match fees for breach of conduct vs SRHGujarat Titans fast bowler Ishant Sharma has been fined 25 per cent of his match fees for breaching the code of conduct vs SRH. Ishant is the fifth player to be fined this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-gt-coach-ashish-nehra-passes-game-knowledge-prasidh-krishna-2705174-2025-04-07",
      "headline": "Nehra passes his game knowledge to us: Prasidh Krishna praises GT coachGujarat Titans pacer Prasidh Krishna heaped praise on his side's head coach Ashish Nehra, highlighting how the former India pacer helps his side's bowling attack by passing on his own game knowledge to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-ashish-nehra-sourav-ganguly-2705160-2025-04-07",
      "headline": "Sourav Ganguly praises GT coach Ashish Nehra after thumping win vs SRHFormer India captain Sourav Ganguly heaped praise on Gujarat Titans coach Ashish Nehra after they beat SunRisers Hyderabad away from home. Ganguly said that Nehra had tremendous game sense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-jasprit-bumrah-back-bowling-leader-2705146-2025-04-07",
      "headline": "Jasprit Bumrah is back: MI's bowling leader returns with season in balanceJasprit Bumrah returns to the Mumbai Indians squad at the right time with their IPL 2025 campaign in the balance. The star pacer will have his tails up and raring to go as he will be tasked with galvanising the team once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-rcb-live-score-ipl-2025-updates-royal-challengers-bengaluru-mumbai-indians-2705142-2025-04-07",
      "headline": "MI vs RCB Live Score: Can Bengaluru handle Bumrah's return?Mumbai Indians (MI) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: While IPL walks into its more competitive stages with each team having played more than two matches respectively, the intensity amongst both fans and players has already started to amp up. In terms of fresh action, Mumbai Indians take on Royal Challengers Bengaluru at Wankhede, which might even feature the return of Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-kavya-maran-frustrated-reaction-abhishek-sharma-2705133-2025-04-07",
      "headline": "SRH owner Kavya Maran left frustrated as Abhishek Sharma flops againSRH owner Kavya Maran looked visibly frustrated as her team slumped to their fourth straight loss in IPL 2025, with opener Abhishek Sharma failing yet again in what turned out to be another batting collapse against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-sundar-pichai-google-ceo-tweet-washington-sundar-2705117-2025-04-07",
      "headline": "GT respond to Google CEO Sundar Pichai after Washington IPL comebackWashington Sundar made a strong statement in his first IPL 2025 outing for Gujarat Titans, scoring 49 against his former team SRH. This \r\n prompted the franchise to revive a supportive old tweet from Google CEO Sundar Pichai praising the all-rounder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-srh-vs-gt-gujarat-titans-2705062-2025-04-07",
      "headline": "Inside Siraj's IPL renaissance: India snub heartbreak, reverse swing masteryMohammed Siraj's career has been a roller-coaster ride in the past few months, with the fast bowler facing several heartbreaks. However, the speedster has arrived at the Indian Premier League 2025 (IPL 2025) having learnt his lessons and is putting a show for the ages at the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-daniel-vettori-backs-aggressive-style-fourth-loss-2705088-2025-04-07",
      "headline": "SRH coach Vettori continues to back aggressive style despite GT thrashingAfter suffering their fourth loss of the season with a defeat to Gujarat Titans, SRH head coach Daniel Vettori still backed his team's aggressive style, insisting it can succeed again with better reading of conditions moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-srh-batting-not-bowling-hurting-vs-gt-ambati-rayudu-2705078-2025-04-07",
      "headline": "SRH's bowling and not batting hurting them the most in IPL 2025: Ambati RayuduAmbati Rayudu feels that SRH's bowling is hurting them more this season than their batting after losing to Gujarat Titans on Sunday, April 6. Hyderabad lost their 4th game on the trot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-washington-sundar-recreates-famous-gabba-six-srh-vs-gt-2705057-2025-04-07",
      "headline": "Watch: Washington Sundar recreates famous Gabba six against Sunrisers HyderabadGujarat Titans all-rounder Washington Sundar re-created his famous six from the Gabba Test 2021 during his match-winning innings against Sunrisers Hyderabad (SRH) in Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-srh-vs-gt-gujarat-titans-2705062-2025-04-07",
      "headline": "Inside Siraj's IPL renaissance: India snub heartbreak, reverse swing masteryMohammed Siraj's career has been a roller-coaster ride in the past few months, with the fast bowler facing several heartbreaks. However, the speedster has arrived at the Indian Premier League 2025 (IPL 2025) having learnt his lessons and is putting a show for the ages at the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-daniel-vettori-backs-aggressive-style-fourth-loss-2705088-2025-04-07",
      "headline": "SRH coach Vettori continues to back aggressive style despite GT thrashingAfter suffering their fourth loss of the season with a defeat to Gujarat Titans, SRH head coach Daniel Vettori still backed his team's aggressive style, insisting it can succeed again with better reading of conditions moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-srh-batting-not-bowling-hurting-vs-gt-ambati-rayudu-2705078-2025-04-07",
      "headline": "SRH's bowling and not batting hurting them the most in IPL 2025: Ambati RayuduAmbati Rayudu feels that SRH's bowling is hurting them more this season than their batting after losing to Gujarat Titans on Sunday, April 6. Hyderabad lost their 4th game on the trot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-washington-sundar-recreates-famous-gabba-six-srh-vs-gt-2705057-2025-04-07",
      "headline": "Watch: Washington Sundar recreates famous Gabba six against Sunrisers HyderabadGujarat Titans all-rounder Washington Sundar re-created his famous six from the Gabba Test 2021 during his match-winning innings against Sunrisers Hyderabad (SRH) in Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-mohammed-siraj-indian-team-snub-hyderabad-2705055-2025-04-06",
      "headline": "How Mohammed Siraj used India axe for IPL rebirth: Told myself my cricket isn't overGT pacer Mohammed Siraj revealed how he used the Indian team snub as motivation for his rebirth in IPL. Siraj picked up 4 wickets against SRH on Sunday in front of his home crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-mohammed-siraj-jasprit-bumrah-hyderabad-2705047-2025-04-06",
      "headline": "Mohammed Siraj joins Jasprit Bumrah in prestigious IPL list after 4/17 vs SRHMohammed Siraj joined Jasprit Bumrah in an elite list of bowlers as he picked up career-best figures of 4 for 17 during the SRH vs GT clash on Sunday, April 6. Siraj has been in sensational form since joining GT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-mohammed-siraj-washington-sundar-srh-vs-gt-2705045-2025-04-06",
      "headline": "IPL 2025: Sundar, Siraj special adds to Hyderabad's agony as Gujarat march onGujarat Titans beat Sunrisers Hyderabad by seven wickets in Match 19 of the Indian Premier League 2025 (IPL 2025) and registered their third consecutive win of the season. Mohammed Siraj (4/17) and Washington Sundar (49 off 29) were the top two performers for Gujarat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-tim-david-credits-rcbs-pressure-free-team-environment-for-rich-form-2705029-2025-04-06",
      "headline": "IPL 2025: Tim David credits RCB's 'pressure-free' team environment for rich formRoyal Challengers Bengaluru (RCB) batter Tim David has credited his team's pressure-free environment for his good form in the ongoing season. David has scored back-to-back fiery knocks against Chennai Super Kings (CSK) and Gujarat Titans (GT)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-on-aggressive-approach-vs-jasprit-bumrah-mi-vs-rcb-2705021-2025-04-06",
      "headline": "Tim David on approach vs Jasprit Bumrah: 1st ball will go for four or sixRoyal Challengers Bengaluru (RCB) batter Tim David opened up on the team's plan to counter Jasprit Bumrah in the clash against Mumbai Indians (MI) in Match 20 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-legends-faceoff-luis-figo-carlos-puyol-mumbai-2705015-2025-04-06",
      "headline": "Real Madrid Legends vs Barcelona Legends: Morientes, Barral hand Los Blancos winFernando Morientes and David Barral were on the score sheet as the Real Madrid legends defeated Barcelona legends in the El Clasico legends faceoff on Sunday, April 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-digvesh-rathi-sunil-narine-kolkata-2705009-2025-04-06",
      "headline": "LSG's Digvesh Rathi meets idol Sunil Narine, gives hilarious reason for celebrationLucknow Super Giants mystery spinner Digvesh Rathi finally got his wish as he met his idol and Kolkata Knight Riders star Sunil Narine on Sunday, April 6 at the Eden Gardens. KKR and LSG will square off on April 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-rcb-rohit-sharma-mahela-jayawardene-mumbai-2705002-2025-04-06",
      "headline": "Rohit Sharma deemed fit for RCB clash by MI coach Jayawardene: He looks goodMumbai Indians coach Mahela Jayawardene has said that Rohit Sharma is fit for the clash against Royal Challengers Bengaluru on Monday, April 7. Rohit had missed the last game due to a knee injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-washington-sundar-makes-debut-for-gt-unadkat-replaces-harshal-patel-2704992-2025-04-06",
      "headline": "IPL 2025: Sundar makes debut for GT, Unadkat replaces Harshal Patel in SRHGujarat Titans and Sunrisers Hyderabad have made one change each to their playing XI ahead of Match 19 in the Indian Premier League 2025 (IPL 2025). GT handed debut cap to Washington Sundar while Jaydev Unadkat replaced an ill Harshal Patel in SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrah-kieron-pollard-mi-vs-rcb-2704993-2025-04-06",
      "headline": "Jasprit Bumrah lifted up by Kieron Pollard, fans say 'handle with care'Kieron Pollard was elated to see Jasprit Bumrah back with MI as the Mumbai batting coach lifted the pacer in the air ahead of the practice session. Fans, however, asked Pollard to be careful with Bumrah in the comments section of the video released by MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-tilak-varma-retire-out-mahela-jayawardene-press-conference-2704981-2025-04-06",
      "headline": "Tilak Varma still MI's match-winner despite retire out call: Mahela JayawardeneMI coach Mahela Jayawardene has claimed that Tilak Varma is still a match-winner for the team despite his controversial retire-out call during the loss to LSG. Jayawardene continued to defend the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-retirement-rumours-ipl-2025-sreevats-goswami-2704978-2025-04-06",
      "headline": "Brand Dhoni is alive: Ex-player wants MS to stay amid retirement rumoursFormer cricketer Sreevats Goswami has said that MS Dhoni should continue to play in the Indian Premier League. Goswami's comments come amidst rumours of Dhoni's retirement."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}