{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-portal-still-facing-glitches-is-1-day-extension-enough-for-taxpayers-2788012-2025-09-16",
      "headline": "1-day ITR extension: Is it enough for taxpayers?Filing income tax returns turned into a nightmare this year, as taxpayers battled login errors, frozen screens and missed payments. Now, with just a one-day extension, many are asking, is that really enough?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-family-rs-55000-national-insurance-mdindia-rejected-claim-denied-series-2787789-2025-09-16",
      "headline": "System is tainted: Delhi family's 6-year fight over Rs 55,000 insurance claimIn this week's story, part of our ongoing series' Claim Denied,' we tell the story of a Delhi family whose insurance claim was denied and whose battle is still ongoing after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-top-buys-defence-infra-best-bets-govt-spending-it-shares-2787985-2025-09-16",
      "headline": "Want to invest in stock market? Defence and infra may be your best betsExperts highlighted the current opportunities in the market and suggested which sectors could perform well in the coming months."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-us-crucial-trade-talks-begin-after-donald-trumps-50-tariff-move-2787911-2025-09-16",
      "headline": "India-US crucial trade talks begin after Donald Trump's 50% tariff moveThe Trump administration's chief negotiator, Brendan Lynch, is in India for trade discussions following Washington's decision to impose a 50% tariff on Indian goods, a move New Delhi termed \"unfair, unjustified and unreasonable.\" The visit is an initial meeting to ease tensions, not a formal round of negotiations. This follows five previous rounds of talks. Prime Minister Narendra Modi responded to the trade situation by promising to protect local interests and stating his government would not let farmers, small entrepreneurs, or animal breeders be harmed. He also promoted a 'swadeshi' philosophy of encouraging products made in India. US President Donald Trump, while noting his friendly relationship with PM Modi, expressed disappointment over India buying Russian oil but affirmed the special relationship means there is \"nothing to worry about.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cas-taxpayers-slam-governments-midnight-1-day-itr-income-tax-filing-deadline-extension-2787951-2025-09-16",
      "headline": "One day is an insult: CAs, taxpayers slam last-minute ITR deadline extensionThe government's last-minute one-day ITR extension has ignited anger, with taxpayers and chartered accountants slamming it as tokenism, mocking portal glitches and questioning accountability in digital governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-dalal-street-us-fed-rate-decision-september-16-2787943-2025-09-16",
      "headline": "Sensex, Nifty open flat as investors await key US Fed decisions on rate cutThe S&P BSE Sensex added 148.51 points to 81,934.25, while the NSE Nifty50 gained 40.25 points to 25,109.50 as of 9:28 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-surge-elon-musk-1-billion-investment-record-high-2787926-2025-09-16",
      "headline": "Tesla shares surge 3% as Elon Musk invests $1 billion in company stockTesla shares rose over 3% on Monday after CEO Elon Musk purchased more than 2.5 million shares, valued at about $1 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inox-siddharth-jain-buys-india-inc-first-tesla-ev-cars-elon-musk-2787917-2025-09-16",
      "headline": "INOX's Siddharth Jain buys India Inc's first Tesla EVSiddharth Jain's purchase follows the earlier delivery of India's first Tesla Model Y to Maharashtra Transport Minister Pratap Sarnaik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-agreement-talks-resume-trump-tariffs-shift-modi-commerce-ministry-2787907-2025-09-16",
      "headline": "India, US resume trade talks, first since Trump's 50% tariffsThe trade talks come after Trump softened his tone, saying he was optimistic about finalising a trade agreement with India. Government officials see a chance to rescue a free trade deal that had been thrown into doubt by punitive tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deadline-for-filing-income-tax-returns-extended-by-one-day-until-tuesday-government-glbs-2787853-2025-09-16",
      "headline": "Income tax return deadline extended till todayTo facilitate necessary updates and changes in the filing utilities, the department also announced that the e-filing portal will undergo maintenance from 12:00 am to 2:30 am on September 16, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-turns-to-barter-trade-to-dodge-sanctions-swaps-grain-for-chinese-cars-2787713-2025-09-15",
      "headline": "Russia turns to barter trade to dodge sanctions, swaps grain for Chinese carsEven as Russia builds warm ties with China and India, the return of barter shows just how far the war in Ukraine has distorted trading relationships for the world's biggest producer of natural resources, three decades after the 1991 collapse of the Soviet Union ushered in Russian economic integration with the West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/last-chance-to-file-itr-2025-step-by-step-online-filing-process-explained-2787567-2025-09-15",
      "headline": "Last chance to file ITR 2025: Step-by-step online filing process explainedThe clock is ticking! Today is the final chance for taxpayers to file their ITR for AY 2025–26. Missing the deadline could mean penalties. Here's a quick guide to file online before midnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-coming-to-table-trump-aide-navarrros-big-claim-day-ahead-of-trade-talks-in-delhi-2787651-2025-09-15",
      "headline": "India coming to table: Trump aide Navarro's big claim ahead of Delhi trade talksIndia and the US will hold fast-tracked trade talks in New Delhi on Tuesday after White House trade adviser Peter Navarro said India is \"coming to the table,\" weeks after Washington imposed tariffs on Indian exports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-close-cautious-ahead-of-us-fed-meet-gst-20-seen-as-growth-trigger-2787628-2025-09-15",
      "headline": "Markets close flat ahead of US Fed meet, GST 2.0 driving consumption boostA cautious session kept Indian equities flat, with investors eyeing the US Fed's decision. Experts, however, expect GST 2.0 reforms to drive domestic consumption and benefit core sectors such as FMCG and banking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-119-points-lower-nifty-below-25100-titan-down-1-percent-2787607-2025-09-15",
      "headline": "Sensex ends 119 points lower, Nifty below 25,100; Titan down 1%The S&P BSE Sensex was down by 118.96 points to end at 81,785.74, while the NSE Nifty50 lost 44.80 points to end at 25,069.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-extension-glitch-income-tax-portal-what-to-do-september-15-2787597-2025-09-15",
      "headline": "Income tax portal faces glitch on last day of ITR filing. Here's what to doAs the September 15, 2025 deadline ticks away, users have been facing serious issues like very slow page loading, errors in uploading forms, and repeated system failures while submitting their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-gen-z-is-changing-money-habits-explains-financial-advisor-2787518-2025-09-15",
      "headline": "How Gen-Z is changing money habits, explains financial advisorGen-Z is shaking up traditional money habits. From saving to investing and spending on experiences, this generation is rewriting the rules of wealth. A financial advisor explains how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-relief-insurance-policyholders-tax-cut-benefit-hospital-bills-2787519-2025-09-15",
      "headline": "Can GST relief on insurance turn first-time buyers into long-term policyholders?For millions of families who hesitated to buy insurance because of the extra tax burden, the recent GST reforms could be a turning point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2025-deadline-know-penalties-and-benefits-you-lose-for-missing-the-due-date-2787482-2025-09-15",
      "headline": "ITR 2025 deadline: Know penalties and benefits you lose for missing the due dateThe deadline to file Income Tax Returns (ITR) for 2025 is here, and missing it can cost more than just a late fee. From penalties to lost tax perks, here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-deadline-today-september-15-how-much-to-pay-and-penalty-for-delay-2787458-2025-09-15",
      "headline": "Advance tax deadline today: How much to pay and penalty for delayThe second instalment of advance tax for financial year 2026 is due on 15 September. Here's what individuals need to pay, who is liable, and the consequences of missing the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/value-stocks-to-buy-on-dalal-street-top-picks-auto-psu-railways-nbfc-bajaj-finance-2787450-2025-09-15",
      "headline": "Looking for value-based stocks to buy on Dalal Street? Here are the top picksExperts believe the current market offers good opportunities, especially in sectors that have seen recent corrections and are expected to benefit from domestic demand, GST reforms, and a good monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dev-accelerator-ipo-allotment-finalised-strong-subscription-listing-2025-2787414-2025-09-15",
      "headline": "Dev Accelerator IPO allotment today: Step-by-step guide to check status onlineThe share allotment for Dev Accelerator IPO was finalised on September 15, 2025. Investors can check their allotment status using official BSE or registrar websites following outlined procedures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-54-points-higher-nifty-above-25100-eternal-rises-1-percent-2787372-2025-09-15",
      "headline": "Sensex opens 54 points higher, Nifty above 25,100; Eternal rises 1%The S&P BSE Sensex was up by 57.17 points to 81,961.87, while the NSE Nifty50 added 5.35 points to 25,119.35 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-allotment-check-status-gmp-listing-date-profit-shares-rise-market-debut-2787348-2025-09-15",
      "headline": "Urban Company IPO allotment out today: Check status as GMP jumps ahead of debutUrban Comapny IPO allotment follows a strong response, with bidding exceeding 100 times during the three-day subscription period from September 10 to 12, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-reforms-big-win-for-every-citizen-finance-minister-nirmala-sitharaman-2787197-2025-09-14",
      "headline": "Tax reforms for rising Bharat: GST 2.0 big win for citizens, says Nirmala SitharamanThe Union Finance Minister said that GST reforms will be implemented much ahead of Prime Minister Narendra Modi's instructions of launching them before Deepavali festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-supports-kunickaa-bigg-boss-19-house-tensions-2788002-2025-09-16",
      "headline": "Gauahar slams Amaal for disrespecting 61-year-old Kunickaa on Bigg Boss 19Gauahar Khan has expressed sympathy for Kunickaa Sadanand on social media, highlighting concerns about the tone used by other Amaal Mallik towards her on Bigg Boss 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-without-shah-rukh-khan-kajol-and-twinkle-khanna-explain-with-humour-2788008-2025-09-16",
      "headline": "Two Much without Shah Rukh Khan? Kajol and Twinkle Khanna explain with humourKajol and Twinkle Khanna offer witty explanations for Shah Rukh Khan's absence from their upcoming talk show 'Two Much', which features several major Bollywood stars, including Salman Khan and Aamir Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-reflects-unexpected-success-lokah-chapter-1-chandra-2787991-2025-09-16",
      "headline": "Dulquer Salmaan amazed by Lokah's unexpected success, says was prepared for a lossDulquer Salmaan's 'Lokah Chapter 1: Chandra' has become a pan-India sensation, surpassing all expectations and sparking excitement about the franchise's future. The actor admitted he and the team weren't prepared for the strong reception. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-sachdev-kapur-appears-amid-sanjay-kapur-inheritance-dispute-2787932-2025-09-16",
      "headline": "Priya Sachdev makes first public appearance amid property disputePriya Sachdev Kapur has made her first public appearance since the death of her husband, Sunjay Kapur, while legal proceedings continue over his estate. The Delhi High Court has ordered Priya to disclose all assets, as Sunjay's children contest the validity of his will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-release-november-26-new-cast-lynxley-family-disney-2787960-2025-09-16",
      "headline": "Zootopia 2 announces new cast members Andy Samberg, Macaulay Culkin, Brenda Song'Zootopia 2' is scheduled for release on November 26 with new and returning voice cast members. The sequel introduces the Lynxley family alongside other notable characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-kelce-emotional-proposal-taylor-swift-nfl-engagement-2787979-2025-09-16",
      "headline": "Travis Kelce admits he cried while proposing to Taylor SwiftTravis Kelce and Taylor Swift revealed their engagement on August 26. Kelce described his proposal as highly emotional and shared his admiration for Swift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-box-office-collection-day-4-detailed-report-monday-drop-but-historic-run-goes-on-2787986-2025-09-16",
      "headline": "Demon Slayer Infinity Castle box office Day 4: Monday dips but historic run goes on'Demon Slayer: Infinity Castle' earns Rs 44.50 crore in India despite a drop on Monday, becoming the biggest non-Hollywood foreign film and rewriting records worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-day-4-teja-sajja-film-slows-on-1st-monday-crosses-rs-50-crore-2787977-2025-09-16",
      "headline": "Mirai box office Day 4: Teja Sajja's film slows on 1st Monday, crosses Rs 50 croreTeja Sajja's 'Mirai' has taken the Indian box office by storm, crossing the Rs 50 crore mark within just four days of release. The multilingual action fantasy is setting new benchmarks across India and overseas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/yeh-rishta-kya-kehlata-hai-rohit-purohit-and-sheena-bajaj-welcome-baby-boy-2787962-2025-09-16",
      "headline": "Actor couple Rohit Purohit-Sheena Bajaj welcome baby boyTelevision couple Rohit Purohit and Sheena Bajaj announced the arrival of their baby boy. The couple, who had shared their pregnancy journey on social media, received an outpouring of congratulations from fans and celebrities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-draws-hilarious-parallel-between-salman-khan-and-baba-ramdev-2787927-2025-09-16",
      "headline": "Farah Khan draws hilarious parallel between Salman Khan and Baba RamdevFarah Khan's visit to Baba Ramdev's Haridwar ashram was full of humour and filmi banter, as she playfully compared Salman Khan's lavish lifestyle with Ramdev's simple living. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-on-aryan-khan-the-director-he-is-a-perfectionist-2787752-2025-09-16",
      "headline": "Bobby Deol on Aryan Khan the director: He is a perfectionistBobby Deol opens up on Aryan Khan's directorial debut with Netflix's 'The Bads of Bollywood'. He praises Aryan's maturity, hard work, and perfectionist approach as a filmmaker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-manchu-confirms-father-mohan-babus-role-in-nani-the-paradise-2787921-2025-09-16",
      "headline": "Lakshmi Manchu confirms father Mohan Babu's role in Nani The ParadiseNani's upcoming film 'The Paradise' is already turning heads with the addition of veteran actor Mohan Babu in a lead role. His daughter and actor Lakshmi Manchu reportedly confirmed the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-completes-ustaad-bhagat-singh-shoot-makers-release-video-2787749-2025-09-15",
      "headline": "Pawan Kalyan completes Ustaad Bhagat Singh shoot, makers release videoPawan Kalyan wrapped his portions for the much-anticipated action entertainer 'Ustaad Bhagat Singh', with the makers releasing a celebratory video from the set. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-slams-actors-for-making-producers-pay-for-trainers-cooks-live-kitchen-2787718-2025-09-15",
      "headline": "Aamir Khan slams actors for making producers pay for trainers and cooksActor Aamir Khan, who is also a producer, has opened up about a trend that he finds extremely strange and unfair. He called out actors who ask producers to pay for personal staff and luxuries in a recent interview. 'When will this stop?', he quipped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tesher-reacts-jalebi-baby-replaces-pakistan-anthem-during-asia-cup-2025-match-2787727-2025-09-15",
      "headline": "Rapper Tesher reacts as Jalebi Baby replaces Pakistan anthem during Asia Cup matchIndia vs Pakistan Asia Cup match in Dubai turned into a talking point after Tesher's hit song 'Jalebi Baby' was accidentally played instead of Pakistan's national anthem, creating a viral moment on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-shares-hera-pheri-3-shoot-update-talks-bond-with-priyadarshan-2787700-2025-09-15",
      "headline": "Paresh Rawal shares Hera Pheri 3 shoot update, talks bond with PriyadarshanParesh Rawal has confirmed his return to 'Hera Pheri 3', reuniting with Akshay Kumar and Suniel Shetty, with filming set to begin early next year. The actor addressed his earlier exit, saying he returned the signing amount with interest and maintained a strong bond with director Priyadarshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-reacts-fans-calling-deserving-national-award-shah-rukh-khan-2787729-2025-09-15",
      "headline": "Manoj Bajpayee reacts to fans calling him more deserving of National Award than SRKActor Manoj Bajpayee, in an exclusive interview, spoke about losing the National Award to Shah Rukh Khan. He dismissed the entire debate as a 'loser conversation.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nagma-mirajkars-eviction-from-bigg-boss-19-is-a-lesson-for-influencers-2787673-2025-09-15",
      "headline": "Nagma Mirajkar's eviction from Bigg Boss 19 is a lesson for influencersHaving a massive social media following is not a sure-shot guarantee of success in 'Bigg Boss 19' or in life. The eviction of Nagma Mirajkar, who has over 8 million Instagram followers, is proof of that. Here's how her eviction is a lesson for influencers aspiring to come on the reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/composer-gv-prakash-on-turning-down-raayan-role-wont-betray-dhanush-even-in-films-2787696-2025-09-15",
      "headline": "Composer GV Prakash on turning down Raayan role: Won't betray Dhanush even in filmsGV Prakash, who has scored several of Dhanush's films, revealed he turned down a key role in the actor-director's third outing, 'Raayan'. The two are now awaiting the release of 'Idli Kadai'.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/icc-rejects-pakistans-demand-to-remove-match-referee-andy-pycroft-from-asia-cup-amid-handshake-row-with-india-2788050-2025-09-16",
      "headline": "ICC rejects Pak's demand to drop Asia Cup match referee over handshake rowThe International Cricket Council has rejected Pakistan's demand to remove match referee Andy Pycroft from Asia Cup. Pakistan had threatened that if Pycroft was not removed, they would withdraw from the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/landslides-waterlogging-bring-states-to-a-halt-as-relentless-rain-batters-india-2787975-2025-09-16",
      "headline": "Landslides, waterlogging bring states to a halt as relentless rain batters IndiaWith the monsoon showing no signs of relenting, several states continue to battle floods, landslides, and waterlogging. Authorities remain on high alert as heavy rainfall disrupts daily life and threatens more damage across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-to-deport-16000-foreign-nationals-involved-in-narcotics-trafficking-under-new-immigration-law-sources-2788077-2025-09-16",
      "headline": "India to deport 16,000 foreigners involved in narcotics trafficking: SourcesThe action, among the biggest crackdowns on narcotics in recent times, is based on a report submitted by the Narcotics Control Bureau (NCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-us-howard-lutnick-donald-trump-aide-corn-attack-linked-to-india-ethanol-rush-2787793-2025-09-16",
      "headline": "Is US corn attack linked to India's ethanol rush?US Commerce Secretary Howard Lutnick attacked India for not importing American corn. India was an exporter of maize till 2023 but the diversion of corn to produce ethanol for fuel blending turned it into an importer. DC's desperation as China skips its grains and India's corn imports are behind the Trump aide's attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-vs-arshad-nadeem-world-athletics-champs-tokyo-handshake-row-2787984-2025-09-16",
      "headline": "Neeraj vs Arshad: Will the India-Pakistan handshake row travel to Tokyo?As the Tokyo World Championships prepares for the Neeraj Chopra–Arshad Nadeem showdown, all eyes will be on more than just distances thrown. In the shadow of the Asia Cup handshake row, fans wonder if history will repeat itself or if mutual respect will prevail. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/puja-khedkar-father-dilip-khedkar-road-rage-kidnapping-truck-driver-manorama-khedkar-cops-dogs-bungalow-2787901-2025-09-16",
      "headline": "Puja Khedkar's father kidnapped driver, mother used dogs to scare cops: PoliceDilip Khedkar, the father of ex-IAS probationer Puja Khedkar, kidnapped a truck driver in Navi Mumbai and took him to his wife Manorama Khedkar's bungalow, police said. Manorama allegedly unleashed two dogs to scare a police team and helped her husband flee."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-boycott-mohsin-naqvi-2787989-2025-09-16",
      "headline": "Asia Cup withdrawal only honourable exit for below-par PakistanPakistan have threatened to withdraw from the Asia Cup if match referee Andy Pycroft is not removed for the remainder of the tournament. Is the abrupt exit the only way for Pakistan to avoid humiliation in the Super 4 stage?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-sues-new-york-times-over-its-reporting-on-his-links-with-epstein-2787950-2025-09-16",
      "headline": "Lying for decades: Trump sues New York Times for $15bn over Epstein links reportsUS President Donald Trump sued The New York Times over its reporting on him over the decades, including his links to late sex offender Jeffrey Epstein, saying the newspaper was engaging in a \"decades-long method\" of lying about him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-family-rs-55000-national-insurance-mdindia-rejected-claim-denied-series-2787789-2025-09-16",
      "headline": "System is tainted: Delhi family's 6-year fight over Rs 55,000 insurance claimIn this week's story, part of our ongoing series' Claim Denied,' we tell the story of a Delhi family whose insurance claim was denied and whose battle is still ongoing after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/nitish-kumar-vows-to-remain-in-nda-henceforth-pm-modi-in-purnea-bihar-polls-2787758-2025-09-15",
      "headline": "Stand up: At Bihar rally, Nitish Kumar urges crowd to their feet to applaud PMAddressing a rally in Purnea, Bihar Chief Minister Nitish Kumar called his short-lived partnerships with the RJD and Congress a mistake."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-summons-yuvraj-singh-and-robin-uthappa-on-september-23-and-22-respectively-in-illegal-betting-app-case-2788073-2025-09-16",
      "headline": "ED summons cricketers Yuvraj Singh, Robin Uthappa in illegal betting app caseED summons Yuvraj Singh and Robin Uthappa on September 23 and 22, respectively, in illegal betting app case"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-mondo-duplantis-pole-vault-world-record-2787812-2025-09-15",
      "headline": "Duplantis soars to 14th world record as Tokyo falls in love with pole vault KingWorld Athletics Championships 2025: On a night of soaring drama and raw emotion, Mondo Duplantis turned Tokyo into his stage once more. Rivals became cheerleaders, a stadium held its breath, and history bowed as the pole vault king cleared 6.30m — his 14th world record and perhaps his most beautiful yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iit-bombay-humanities-liberat-arts-workshop-courses-controversy-left-liberal-agenda-debate-iim-nep-2020-2787574-2025-09-16",
      "headline": "Why humanities at IITs? Arts courses spark debate on Left liberal agendaAn illustration for a workshop on 'South Asian Capitalism(s)' at IIT Bombay sparked a controversy. Though IIT Bombay distanced itself from the event, the row has snowballed into a debate, with critics alleging that humanities were being used by Left liberals to \"capture\" India's tech institutes. Here are both sides of the argument and a balanced takeaway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-portal-still-facing-glitches-is-1-day-extension-enough-for-taxpayers-2788012-2025-09-16",
      "headline": "1-day ITR extension: Is it enough for taxpayers?Filing income tax returns turned into a nightmare this year, as taxpayers battled login errors, frozen screens and missed payments. Now, with just a one-day extension, many are asking, is that really enough?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-triggers-cloudburst-in-uttarakhands-dehradun-cars-shops-washed-away-2-people-missing-2787900-2025-09-16",
      "headline": "4 dead as heavy rain triggers cloudburst in Dehradun, washes away cars and shopsA cloudburst in Dehradun triggered by heavy rain washed away cars and shops and resulted in the deaths of four people. Rescue personnel are on alert amid the inclement weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ias-officer-swapnil-wankhede-warm-interaction-with-orphan-girl-viral-video-2788041-2025-09-16",
      "headline": "Viral video of IAS officer's warm interaction with orphan girl delights InternetA touching video of Swapnil Wankhede, a 2016-batch IAS officer and Collector of Datia district in Madhya Pradesh, warmly interacting with an orphaned girl has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-sachdev-kapur-appears-amid-sanjay-kapur-inheritance-dispute-2787932-2025-09-16",
      "headline": "Priya Sachdev makes first public appearance amid property disputePriya Sachdev Kapur has made her first public appearance since the death of her husband, Sunjay Kapur, while legal proceedings continue over his estate. The Delhi High Court has ordered Priya to disclose all assets, as Sunjay's children contest the validity of his will."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-battered-heavy-rain-bus-depot-flooded-mandi-landslide-disrupts-traffic-2787928-2025-09-16",
      "headline": "3 dead in landslide, bus depot flooded, vehicles submerged as rain pounds HimachalBesides the heavy downpour, parts of Himachal Pradesh also witnessed thunderstorms, while 493 roads, including three national highways, remained closed for traffic on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-guardian-tsunami-warning-kamchatka-earthquake-ai-detection-2787715-2025-09-16",
      "headline": "Nasa's Guardian spots tsunami from space 30 minutes before landfallNasa's Guardian system rapidly detected a tsunami following a major earthquake off Russia. The system issued alerts within 20 minutes, potentially extending evacuation timeframes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-speed-skating-golds-anandkumar-velkumar-krish-sharma-world-championships-2787831-2025-09-15",
      "headline": "India script history with two gold medals at Speed Skating World ChampionshipsAnandkumar Velkumar made history by clinching India's first-ever World Championship title in the senior men's 1000m speed skating event in China. Krish Sharma also secured gold in the junior 1000m sprint, marking a memorable day for Indian speed skating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/interpol-synthetic-drug-seizure-76-tonnes-methamphetamine-fentanyl-global-crackdown-2788034-2025-09-16",
      "headline": "Interpol seizes 76 tonnes of drugs in biggest global crackdown, including IndiaOperation Lionfish-Mayag III, coordinated by Interpol, has resulted in the confiscation of 76 tonnes of synthetic narcotics across 18 nations, including India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-ai-raters-globallogic-layoffs-unionisation-workplace-concerns-2787998-2025-09-16",
      "headline": "Google lays off 200 AI contractors who feared they were training bots to take their jobsContractors working on Google's AI projects through GlobalLogic face job insecurity, suppressed organising, and claims of worsening conditions as layoffs intensify and unionisation efforts grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-uproar-centre-bars-sikh-pilgrimage-pakistan-security-concerns-kartarpur-nankana-sahib-2787949-2025-09-16",
      "headline": "Can play cricket but no pilgrimage? Kartarpur Corridor restrictions spark uproarThe Union Home Ministry's advisory asking states against allowing Sikh pilgrims to travel to Pakistan will affect thousands of devotees who traditionally visit Nankana Sahib and Kartarpur Sahib to commemorate Guru Nanak's birth anniversary."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-denies-fake-quote-india-pakistan-asia-cup-handshake-controversy-2788064-2025-09-16",
      "headline": "Ricky Ponting slams fake comments amid Asia Cup controversyRicky Ponting dismissed a fake quote circulating online that falsely claimed he criticised India and praised Pakistan after their Asia Cup clash, clarifying he never made any such remarks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/icc-rejects-pakistans-demand-to-remove-match-referee-andy-pycroft-from-asia-cup-amid-handshake-row-with-india-2788050-2025-09-16",
      "headline": "ICC rejects Pak board's demand to drop Asia Cup match referee over handshake rowThe International Cricket Council has rejected Pakistan's demand to remove match referee Andy Pycroft from Asia Cup. Pakistan had threatened that if Pycroft was not removed, they would withdraw from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-steeplechase-el-bakkali-2787993-2025-09-16",
      "headline": "Life in 8 minutes: The tears, euphoria, and a final kick for the agesNew Zealand's Geordie Beamish stunned the athletics world by winning gold in the 3000m steeplechase. The dramatic finish saw reigning champion Bakkali fall short of a historic three-peat in the world champs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-pm-modi-gold-speed-skating-world-championships-india-world-champion-2788021-2025-09-16",
      "headline": "PM Modi praises Anandkumar Velkumar after Speed Skating World Championships goldPM Narendra Modi hailed Anandkumar Velkumar for becoming India's first-ever world champion in speed skating after his historic gold in the men's 1000m sprint at the World Championships in China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-coach-trott-mistakenly-claims-bangladesh-won-asia-cup-2025-clash-2788001-2025-09-16",
      "headline": "Trott calls Bangladesh Asia Cup winners in funny goof-up, googles to confirm: WatchJonathan Trott sparked laughter at the pre-match press conference by mistakenly claiming Bangladesh had won the Asia Cup, before admitting his blunder. He later praised Bangladesh's match-winners and said Afghanistan's week-long break would help them recharge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-boycott-mohsin-naqvi-2787989-2025-09-16",
      "headline": "Asia Cup withdrawal only honourable exit for below-par PakistanPakistan have threatened to withdraw from the Asia Cup if match referee Andy Pycroft is not removed for the remainder of the tournament. Is the abrupt exit the only way for Pakistan to avoid humiliation in the Super 4 stage?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-vs-arshad-nadeem-world-athletics-champs-tokyo-handshake-row-2787984-2025-09-16",
      "headline": "Neeraj vs Arshad: Will the India-Pakistan handshake row travel to Tokyo?As the Tokyo World Championships prepares for the Neeraj Chopra–Arshad Nadeem showdown, all eyes will be on more than just distances thrown. In the shadow of the Asia Cup handshake row, fans wonder if history will repeat itself or if mutual respect will prevail. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-afghanistan-asia-cup-2025-must-win-group-b-clash-2787969-2025-09-16",
      "headline": "Bangladesh brace for do-or-die clash as Afghanistan aim Super 4 berthBangladesh and Afghanistan clash in a decisive Asia Cup 2025 Group B match in Abu Dhabi. The outcome will heavily influence Super 4 qualification and net run rate scenarios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-boring-no-competition-sourav-ganguly-2787938-2025-09-16",
      "headline": "India vs Pakistan boring? Sourav Ganguly finds more thrill in City vs UnitedFormer India captain Sourav Ganguly has landed a telling blow on the India-Pakistan rivalry. Ganguly, at an event in Kolkata, said that Pakistan were a no contest against India, and he switched over to the Manchester Derby after only 15 overs in the Asia Cup contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-india-wins-youtuber-refuses-revive-channel-2787322-2025-09-16",
      "headline": "A cricket clash, a YouTube dream, and a shocking choiceIndia secured a notable win over Pakistan in the Asia Cup 2025 cricket match. An auto driver, who is also an aspiring YouTuber, chose ethics over views, refusing to revive his channel amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-r-vaishali-grand-swiss-win-mother-video-viral-2787916-2025-09-16",
      "headline": "Vaishali celebrates Grand Swiss win with mother, video goes viralIndian Grandmaster R Vaishali won Grand Swiss for the second time in a row. As the win helped her seal a spot in the Candidates tournament, Vaishali celebrated the moment with her mother, the video of which has now gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-vs-arshad-nadeem-world-athletics-champs-tokyo-handshake-row-2787984-2025-09-16",
      "headline": "Neeraj vs Arshad: Will the India-Pakistan handshake row travel to Tokyo?As the Tokyo World Championships prepares for the Neeraj Chopra–Arshad Nadeem showdown, all eyes will be on more than just distances thrown. In the shadow of the Asia Cup handshake row, fans wonder if history will repeat itself or if mutual respect will prevail. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-afghanistan-asia-cup-2025-must-win-group-b-clash-2787969-2025-09-16",
      "headline": "Bangladesh brace for do-or-die clash as Afghanistan aim Super 4 berthBangladesh and Afghanistan clash in a decisive Asia Cup 2025 Group B match in Abu Dhabi. The outcome will heavily influence Super 4 qualification and net run rate scenarios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-boring-no-competition-sourav-ganguly-2787938-2025-09-16",
      "headline": "India vs Pakistan boring? Sourav Ganguly finds more thrill in City vs UnitedFormer India captain Sourav Ganguly has landed a telling blow on the India-Pakistan rivalry. Ganguly, at an event in Kolkata, said that Pakistan were a no contest against India, and he switched over to the Manchester Derby after only 15 overs in the Asia Cup contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-india-wins-youtuber-refuses-revive-channel-2787322-2025-09-16",
      "headline": "A cricket clash, a YouTube dream, and a shocking choiceIndia secured a notable win over Pakistan in the Asia Cup 2025 cricket match. An auto driver, who is also an aspiring YouTuber, chose ethics over views, refusing to revive his channel amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-r-vaishali-grand-swiss-win-mother-video-viral-2787916-2025-09-16",
      "headline": "Vaishali celebrates Grand Swiss win with mother, video goes viralIndian Grandmaster R Vaishali won Grand Swiss for the second time in a row. As the win helped her seal a spot in the Candidates tournament, Vaishali celebrated the moment with her mother, the video of which has now gone viral."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}