{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-expectations-bull-run-on-dalal-street-will-the-stock-market-rally-last-2675023-2025-02-05",
      "headline": "Bull run on Dalal Street: Will the stock market rally last? The stock market saw a bull run in the last session with the benchmark indices, Sensex and Nifty, both closing over 1.5% higher, driven by gains in banking and financial stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tatas-milennial-friend-shantanu-naidu-gets-top-role-at-tata-motors-2675017-2025-02-05",
      "headline": "Ratan Tata's millennial friend Shantanu Naidu gets top role at Tata MotorsIn 2018, Shantanu Naidu began working as Ratan Tata's assistant, a role that brought him public attention, especially after a viral video of his birthday surprise for the industrialist.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/p-chidambaram-on-budget-2025-gst-cut-would-have-benefited-everybody-2674953-2025-02-04",
      "headline": "P Chidambaram on Budget 2025: 'GST cut would have benefited everybody'Former Finance Minister P Chidambaram analysed Nirmala Sitharaman's Budget 2025, criticising its focus on tax cuts for a small segment of the population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-says-gst-council-to-decide-on-fewer-lower-tax-rates-soon-2674903-2025-02-04",
      "headline": "GST Council to decide on fewer, lower tax rates soon: Nirmala SitharamanFinance Minister Nirmala Sitharaman stated on Tuesday that the GST Council is close to finalising a decision on tax rate rationalisation, with the review process nearly complete. At present, the Goods and Services Tax (GST) is structured into four slabs: 5 per cent, 12 per cent, 18 per cent, and 28 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-get-a-student-credit-card-check-eligibility-and-documents-required-2674860-2025-02-04",
      "headline": "How to get a student credit card? Check eligibility and documents requiredWhile the credit card can be a valuable financial tool, students must be aware of its potential misuse and pitfalls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-will-think-about-india-nirmala-sitharaman-as-trump-2-0-goes-big-on-crypto-2674644-2025-02-04",
      "headline": "I will think about India: Nirmala Sitharaman as Trump 2.0 goes big on cryptoFinance Minister Nirmala Sitharaman said that the government during its G20 presidency pushed for a global understanding of crypto regulations and how to tackle trading in cryptocurrencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-rally-sensex-jumps-1397-points-nifty-nears-23750-as-bulls-take-charge-2674640-2025-02-04",
      "headline": "Market rally: Sensex jumps 1,397 points, Nifty nears 23,750 as bulls take chargeStock Market: The S&P BSE Sensex surged by 1397.07 points to close at 78,583.81, while the NSE Nifty50 added 378.20 points to end at 23,739.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/exclusive-nirmala-sitharaman-on-budget-2025-tax-relief-for-citizens-2674621-2025-02-04",
      "headline": "Exclusive: Nirmala Sitharaman on Budget 2025 tax relief for citizensFinance Minister Nirmala Sitharaman stated that the tax relief introduced in Budget 2025 reflects Prime Minister Narendra Modi's commitment to honouring taxpayers for their contribution to nation-building."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-hindenburg-went-after-adani-group-founder-nathan-anderson-breaks-silence-2674623-2025-02-04",
      "headline": "Why did Hindenburg go after Adani Group? Nathan Anderson breaks silenceHindenburg Research founder Nathan Anderson maintained that all the firm's reports, including the one on Adani Group, were accurate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-dismisses-tax-relief-link-with-delhi-election-2674604-2025-02-04",
      "headline": "Nirmala Sitharaman dismisses tax relief link with Delhi electionFinance Minister Nirmala Sitharaman dismissed speculation that the government increased the tax relief to Rs 12 lakh due to the upcoming Delhi elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-plans-to-shut-it-down-nirmala-sitharaman-on-old-tax-regime-2674587-2025-02-04",
      "headline": "No plans to shut it down: Nirmala Sitharaman on old tax regimeFinance Minister Nirmala Sitharaman table the Union Budget 2025 on February 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/part-of-pms-effort-to-respect-service-the-taxpayers-are-doing-for-nation-nirmala-sitharaman-on-tax-relief-2674570-2025-02-04",
      "headline": "Respecting service of taxpayers: Nirmala Sitharaman on Budget income tax breaks Finance Minister Nirmala Sitharman said that the tax relief given in Budget 2025 was Prime Minister Narendar Modi's effort to respect the service the taxpayers are doing for nation building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-key-tax-reforms-for-middle-class-introduced-in-budget-2025-no-tax-till-rs-12-lakh-revised-tax-slabs-extension-in-updated-tax-filing-2674538-2025-02-04",
      "headline": "5 key tax reforms for middle class introduced in Budget 2025 Union Budget 2025: The new tax structure announced in the Union Budget 2025 aims to ease the financial burden of the middle class, enhancing their disposable income and giving a boost to their consumption levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/consumption-capex-has-the-government-prioritised-spending-over-growth-2674524-2025-02-04",
      "headline": "Consumption vs capex: Has the government prioritised spending over growth?Budget 2025 provided tax relief for taxpayers, but the government also maintained its fiscal deficit target at 4.4% of GDP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-transform-agriculture-and-bring-rural-prosperity-prime-minister-dhan-dhaanya-krishi-yojana-kisan-credit-cards-2674480-2025-02-04",
      "headline": "Budget 2025: What's in it for farmers, agriculture and rural businesses?Budget 2025 aims to modernise India's agricultural landscape and reinforces the government's commitment to sustainable agriculture and farmer empowerment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-over-700-points-3-reasons-why-is-stock-market-rising-today-nifty-nse-bse-2674439-2025-02-04",
      "headline": "Sensex jumps over 1,000 points: 3 reasons why stock market is rising todayAt 1:34 PM, the S&P BSE Sensex was up 981.63 points at 77,918.17, while the NSE Nifty50 gained 286.90 points to trade at 23,647.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-rebound-after-sharp-fall-after-global-trade-concerns-ease-2674431-2025-02-04",
      "headline": "Sensex, Nifty rebound after sharp fall after global trade concerns easeThe S&P BSE Sensex gained 522.62 points to 77,709.36, while the NSE Nifty50 rose 142.15 points to 23,503.20 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cbt-meeting-237-will-pf-deposit-interest-rate-go-up-epfo-board-to-meet-on-february-28-2674415-2025-02-04",
      "headline": "Will PF deposit interest rate go up? EPFO board to meet on February 28The Central Board of Trustees (CBT), which is led by the Union Minister for Labour and Employment, is the top decision-making body of the (Employees Provident Fund Organisation) EPFO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-trade-war-fears-spook-markets-sensex-nifty-take-a-hit-as-rupee-weakens-2673983-2025-02-03",
      "headline": "Trade war fears spook markets: Sensex, Nifty take a hit as rupee weakensThe S&P BSE Sensex tanked by 319.22 points to end at 77,186.74, while the NSE Nifty50 lost 128.85 points to close at 23,353.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-reason-why-has-volkswagen-sued-the-indian-authorities-legal-angle-expert-2673959-2025-02-03",
      "headline": "Explained: Why Volkswagen has sued Indian authoritiesAccording to the government, Volkswagen broke down imports of some VW, Skoda, and Audi cars into separate components, instead of declaring them as completely knocked down (CKD) units."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-removes-karla-sofia-gascon-emilia-perez-oscar-campaign-controversial-posts-zoe-saldana-2675013-2025-02-05",
      "headline": "Netflix removes Karla Sofia Gascon from Oscar campaign after controversial postsEmilia Perez actor Karla Sofia Gascon has been removed from Netflix's Oscar campaign for the film. This comes following backlash over her controversial posts in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-gets-a-head-massage-in-chennai-video-2674929-2025-02-04",
      "headline": "Ed Sheeran gets a head massage in Chennai, jokes 'it's abuse'. WatchSinger Ed Sheeran is currently in India. On Tuesday, the British singing sensation shared a fun video of himself getting a head massage in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-mantis-to-genie-make-a-wish-netflix-k-drama-slate-2025-2674899-2025-02-04",
      "headline": "Squid Game 3, Mantis to Genie Make a Wish: Netflix unveils 2025 K-drama slateNetflix unveiled the 2025 slate of its upcoming K-dramas and films. From Squid Game 3, Mantis to Genie Make a Wish, here's what all you can watch on the OTT site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/nadaaniyan-introducing-the-parents-of-khushi-kapoor-and-ibrahim-ali-khan-2674908-2025-02-04",
      "headline": "Nadaaniyan: Introducing the parents of Khushi Kapoor and Ibrahim Ali KhanThe official social media handle of Karan Johar's Dharmatic Entertainment has shared photos of the core Nadaaniyan team. It stars Khushi Kapoor and Ibrahim Ali Khan in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vivekanandan-viralanu-shine-tom-chacko-swasika-stmp-2674672-2025-02-04",
      "headline": "Vivekanandan Viralanu: Here's where you can watch the Tom Chacko releaseMalayalam actors Shine Tom Chacko and Swasika's Vivekanandan Viralanu will soon be available to stream on an OTT platform. The announcement was shared by makers on social media recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boman-irani-on-the-mehta-boys-vs-animal-debate-2674619-2025-02-04",
      "headline": "Boman Irani on The Mehta Boys vs Animal debate: Not every father-son film is sameActor Boman Irani, who is all set to make his directorial debut with The Mehta Boys, reacts to Animal comparisons, stating not all father-son films are alike. Avinash Tiwary jokes that theirs offers the real family drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarah-michelle-gellar-to-star-in-buffy-the-vampire-slayer-sequel-2674579-2025-02-04",
      "headline": "Sarah Michelle Gellar to star in Buffy the Vampire Slayer sequel: ReportActor Sarah Michelle Gellar will reportedly be reprising her role as Buffy Summers for Buffy the Vampire Slayer's sequel on Hulu. Chloe Zhao is in talks to direct the show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-ott-release-ram-charan-kiara-advani-film-prime-video-feb-7-stmp-2674519-2025-02-04",
      "headline": "Game Changer OTT release: When and where to watch Ram Charan-Kiara Advani filmRam Charan's Game Changer OTT release date: Shankar's telugu directorial, Game Changer, is all set to stream on OTT soon. Read details about when and where you can watch the Ram Charan and Kiara Advani-starrer on OTT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karisma-kapoor-recreates-hum-saath-saath-hain-scene-badshah-sooraj-barjatya-indian-idol-15-2674503-2025-02-04",
      "headline": "Karisma Kapoor recreates Hum Saath Saath Hain scene with Badshah on Indian Idol 15Actors Karisma Kapoor, Mohnish Behl and filmmaker Sooraj Barjatya were among the special guests on Indian Idol 15. During their appearance, Karisma recreated one of her iconic scenes from Hum Saath Saath Hain with Badshah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dining-with-the-kapoors-kareena-kapoor-ranbir-kapoor-karisma-kapoor-saif-ali-khan-food-film-family-bonds-2674465-2025-02-04",
      "headline": "Dining With The Kapoors: Kareena, Ranbir, and family bond over food and filmsThe entire Kapoor Khandaan including Kareena Kapoor, Ranbir Kapoor, Karisma Kapoor, and others have united for a Netflix special film, Dining With the Kapoors. The project was announced as a part of the Netflix 2025 slate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samay-raina-rekha-joke-amitabh-bachchan-kbc-16-video-2674445-2025-02-04",
      "headline": "Did Samay Raina joke about Rekha on Amitabh Bachchan's KBC 16? Here's the truthA viral video shows Samay Raina joking about Rekha with Amitabh Bachchan on KBC 16, but it appears to be doctored."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-rashtrapati-bhavan-performance-back-spasm-2674444-2025-02-04",
      "headline": "Pics: Sonu Nigam performs at Rashtrapati Bhavan after suffering back painSonu Nigam performed at Rashtrapati Bhavan despite suffering from a severe back spasm just a day back. The singer performed on the occasion of Rashtrapati Bhavan Diwas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-apologises-to-babyface-for-cutting-short-grammy-interview-2674420-2025-02-04",
      "headline": "Associated Press apologises to Babyface for cutting short Grammy interviewAP apologised to 12-time Grammy-winning composer Babyface after cutting his interview short on the Grammys red carpet. Stars like Khloé Kardashian criticised the journalists for disrespecting the music legend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shah-rukh-khan-asks-fans-support-launches-son-aryan-khan-directorial-debut-project-naam-ka-producer-the-bads-of-bollywood-2674218-2025-02-03",
      "headline": "SRK jokes about being 'Naam ka producer' at son Aryan's directorial launchShah Rukh Khan launched his son, Aryan Khan's directorial debut project, The Ba***ds of Bollywood, on February 3. During the Netflix event, the actor referred to himself as 'naam ka producer'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-shah-rukh-khan-launches-son-aryan-khans-directorial-debut-netflix-gauri-khan-2674180-2025-02-03",
      "headline": "The Ba***ds of Bollywood: SRK launches son Aryan Khan's directorial debut Shah Rukh Khan launched the upcoming project, The Ba***ds of Bollywood, which marks the directorial debut of his son, Aryan Khan. The actor unveiled the announcement video during the Netflix 2025 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/test-teaser-r-madhavan-nayanthara-and-siddharth-set-for-test-of-life-2674171-2025-02-03",
      "headline": "Test teaser: R Madhavan, Nayanthara and Siddharth set for 'test of life'The teaser of TEST, starring R Madhavan, Nayanthara and Siddharth was unveiled on Monday. The upcoming cricket drama will stream on Netflix this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-teaser-zeenat-aman-makes-a-comeback-ishaan-khatter-bhumi-pednekar-regal-drama-sakshi-tanwar-dino-morea-2674149-2025-02-03",
      "headline": "The Royals teaser: Zeenat Aman makes a comeback in Ishaan, Bhumi's royal love storyThe teaser of Ishaan Khatter and Bhumi Pednekar's The Royals is finally out. Set to stream on Netflix, the upcoming drama also stars Zeenat Aman, Sakshi Tanwar and Milind Soman in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-tale-of-lady-ok-review-lim-ji-yeon-stars-in-a-standout-historical-k-drama-2674122-2025-02-03",
      "headline": "The Tale of Lady Ok review: Lim Ji-yeon stars in a standout historical K-dramaReleased-Mon Jan 06, 2025Unlike most Joseon-era dramas that revolve around kings, queens, and court politics, The Tale of Lady Ok dares to step outside the palace. Read on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-teaser-neeraj-pandey-returns-with-high-stakes-crime-drama-2674100-2025-02-03",
      "headline": "Khakee The Bengal Chapter teaser: Neeraj Pandey promises darker, grittier sagaFilmmaker Neeraj Pandey's Khakee The Bengal Chapter was unveiled at the Netflix event today, February 3. The upcoming series will feature Prosenjit Chatterjee, Saswata Chatterjee, Parambrata Chatterjee, and others in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/akka-keerthy-suresh-radhika-apte-epic-period-thriller-first-look-unveiled-2674098-2025-02-03",
      "headline": "Akka teaser: Keerthy Suresh, Radhika Apte fight for supreme power in YRF's showNetflix unveiled the first look teaser of its highly-anticipated period thriller drama, Akka. It stars Radhika Apte and Keerthy Suresh in indomitable avatars. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-2025-voting-polling-aap-arvind-kejriwal-congress-bjp-narendra-modi-rahul-gandhi-2674994-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hat-trick for AAP or BJP, Congress resurgence? Delhi votes today Live UpdatesWill AAP hold its stronghold, the BJP end its losing streak, or the Congress stage a surprise comeback? Delhi decides today as 1.56 crore voters cast their ballots across all 70 constituencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-says-us-will-take-over-gaza-strip-we-will-develop-we-will-own-it-2675004-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US will take over Gaza: Trump's shock announcement with Netanyahu by his sideUS President Donald Trump said that the US will take over and develop Gaza, asserting long-term ownership, while Israeli Prime Minister Benjamin Netanyahu called it a historic idea that could reshape Gaza's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rs-5-lakh-cash-recovered-employee-working-chief-minister-atishi-office-delhi-elections-2674963-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rs 5 lakh cash recovered from employee working at Delhi Chief Minister's officeRs 5 lakh cash was recovered from a bag inside a car in Delhi a day before Assembly elections. Gaurav, the owner of the cash said he worked at the Chief Minister's office. However, AAP has claimed that the incident is a \"conspiracy\" against the party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/age-reversing-ceo-bryan-johnson-jabs-india-again-for-poor-aqi-this-time-he-cites-a-study-2675022-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Age-reversing' CEO jabs India again for poor AQI, this time he cites a studyBryan Johnson, 47, made headlines this week after he walked out of Zerodha co-founder Nikhil Kamath's podcast midway due to poor air quality, saying that he felt a burning sensation in his throat and eyes, with rashes on his skin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tatas-milennial-friend-shantanu-naidu-gets-top-role-at-tata-motors-2675017-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ratan Tata's millennial friend Shantanu Naidu gets top role at Tata MotorsIn 2018, Shantanu Naidu began working as Ratan Tata's assistant, a role that brought him public attention, especially after a viral video of his birthday surprise for the industrialist.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-not-moving-into-chief-minister-official-residence-due-to-superstition-claims-sanjay-raut-2675000-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis avoids official residence due to superstition: Sanjay RautRumors claim that buffaloes allegedly slaughtered in Guwahati during Eknath Shinde's visit to the Kamakhya temple were buried on the premises of the Chief Minister's residence to ensure that the top post remains with him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-instructs-advisers-to-obliterate-iran-if-it-assassinates-him-2675019-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Nothing will be left': Trump's warning if Iran tries to assassinate himIf Donald Trump were assassinated, Vice President JD Vance would become president and would not necessarily be bound by any instructions left by his predecessor. Federal authorities have been tracking Iranian threats against Trump and other administration officials for years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-poison-in-yamuna-remarks-case-file-delhi-elections-voting-2674949-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "FIR against Arvind Kejriwal for 'poison in Yamuna' remark hours before Delhi pollsA case has been filed against former Delhi Chief Minister Arvind Kejriwal for his remarks that Haryana was \"poisoning\" Yamuna water. The complaint was filed by Jagmohan Manchanda. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/dry-days-in-india-outdated-rule-or-necessary-control-2674955-2025-02-04?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Dry days in India: Outdated rule or necessary control?From Gandhi's vision of prohibition to the economic realities of today, we explore the history, politics, and impact of India's dry day policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/a-celebration-of-rohit-bals-legacy-at-blenders-pride-fashion-tour-2025-2673256-2025-02-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Celebration of Rohit Bal's Legacy at Blenders Pride Fashion Tour 2025A grand celebration of Rohit Bal's iconic work at Blenders Pride Fashion Tour brought together his closest friends, industry icons, and admirers in an unforgettable evening honouring his legacy and artistic brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-jfk-forgotten-crisis-book-jawaharlal-nehru-meeting-john-kennedy-foreign-policy-2674881-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM recommends book on Nehru, jabs Congress, social media digs out excerptsPM Modi's remark is being seen as a counter to Rahul Gandhi's assertion that the government sent the External Affairs Minister 'three or four times' to the US to secure an invitation to Donald Trump's inauguration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/fir-aap-mla-sexual-harassment-delhi-assembly-election-blowing-kisses-campaigning-2675014-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP MLA charged for misbehaving with woman, 'blowing kisses' during campaignThe police have registered a case against the AAP MLA from Sangam Vihar on charges of molestation and sexual harassment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-removes-karla-sofia-gascon-emilia-perez-oscar-campaign-controversial-posts-zoe-saldana-2675013-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Netflix removes Karla Sofia Gascon from Oscar campaign after controversial postsEmilia Perez actor Karla Sofia Gascon has been removed from Netflix's Oscar campaign for the film. This comes following backlash over her controversial posts in the past. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sweden-orebro-school-attack-people-shot-dead-injured-police-2674871-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 killed in Sweden school attack, shooter likely among themAt least 10 people died in the attack at a school in Sweden. Police have called it the \"deadliest\" attack in the country's history, adding that the shooter is among those dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-parunika-sisodia-interview-mithali-raj-vvs-laxman-u19-womens-t20-world-cup-2674940-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parunika absorbs Laxman pep-talk, Mithali Raj advice to live World Cup dreamIn an exclusive interview with India Today Digital, left-arm spinner Parunika Sisodia opened up on India's campaign in the U19 Women's T20 World Cup. Parunika was India's most economical bowler, having taken 10 wickets. The 19-year-old also won the Player of the Match award in the semi-final against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-prime-minister-benjamin-netanyahu-us-president-donald-trump-white-house-meeting-hamas-iran-gaza-war-2675008-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Netanyahu calls Trump 'greatest friend of Israel', discusses eliminating HamasBenjamin Netanyahu is the first foreign leader to visit the White House after Donald Trump returned to office on January 20. Besides the Gaza war, the two leaders also discussed strategies to counter Iran and hopes for a renewed push for an Israel-Saudi Arabia normalisation deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sanju-samson-t20i-series-batting-feature-2674915-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drop Sanju Samson? Why India should shun old-school thoughts in new T20I approachIndia's T20I openers, Abhishek Sharma and Sanju Samson, experienced contrasting fortunes in their last two series against South Africa and England. As calls to replace Sanju Samson grow louder, here's why India should move beyond old-school thinking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-congress-is-betting-on-pasmanda-muslim-outreach-to-shrink-reliance-on-lalu-2674600-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Congress is betting on Pasmanda Muslim outreach to shrink reliance on LaluThe party sees in entrant Ali Anwar Ansari a leader with grassroots connections among Pasmanda Muslims, who make up 80 per cent of Bihar's Muslim community\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lost-control-says-swedish-pm-as-immigrant-gangs-take-over-sweden-islamic-muslim-balkan-ulf-kristersson-2674047-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lost control, says Swedish PM as immigrant gangs take over SwedenSweden, a country of mild-mannered people, is seeing a record rise in heinous crime. Ten people were shot dead on Tuesday. Such has been the rate of blasts and shootings, that Swedish PM Ulf Kristersson was forced to admit that the government had \"lost control\". This is how immigrants from the Middle East and Balkan nations ended up taking over the European nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/amanatullah-khan-aap-mla-delhi-police-fir-case-registered-poll-code-violation-campaigning-supporters-elections-2675016-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's Amanatullah Khan charged for poll code breach over late-night campaignThe incumbent legislator from Okhla was charged with poll code violation after he was spotted with more than 100 supporters in Delhi's Zakir Nagar on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-gets-a-head-massage-in-chennai-video-2674929-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ed Sheeran gets a head massage in Chennai, jokes 'it's abuse'. WatchSinger Ed Sheeran is currently in India. On Tuesday, the British singing sensation shared a fun video of himself getting a head massage in Chennai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/australia-bans-china-startup-ai-deepseek-on-government-devices-security-risks-2674970-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Australia bans DeepSeek on government devices over 'unacceptable' security risksAustrala has banned DeepSeek on all government devices due to concerns that the Chinese artificial intelligence startup posed \"unacceptable\" security risks, Home Affairs Minister Tony Burke said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/drunk-delhi-man-fingers-inked-before-delhi-assembly-elections-2675006-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drunk Delhi man claims his finger was inked before voting, goes to policeFollowing interrogation, the man was found to be drunk, and none of his fingers inked, police said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simona-halep-retirement-tennis-transylvania-open-2674995-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Simona Halep announces retirement after Transylvania Open exit Simona Halep announced her retirement from professional tennis after losing to Lucia Bronzetti in the first round of the Transylvania Open. The now 33-year-old became the World No.1 in 2017 and also went on to win two Grand Slams and 24 WTA titles in her illustrious career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shields-daughter-malti-camera-flashes-brother-siddharth-chopra-wedding-function-neelam-upadhyay-2675021-2025-02-05",
      "headline": "Watch: Priyanka Chopra shields Malti from flashes at brother's wedding functionPriyanka Chopra is in India with her daughter, Malti Marie, to attend her brother, Siddharth's wedding. As the pre-wedding festivities have begun, the actor was clicked with Malti leaving for a function. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/video/aamir-khan-touches-dharmendra-feet-at-loveyapa-screening-2674935-2025-02-04",
      "headline": "Video: Aamir Khan touches Dharmendra's feet at Loveyapa screeningBollywood star Aamir Khan and veteran actor Dharmendra were clicked at the screening of Junaid Khan and Khushi Kapoor's Loveyapa. Aamir touched Dharmendra's feet before the pair embraced each other warmly at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-thanks-western-fans-for-showering-insane-love-on-pushpa-2-2674961-2025-02-04",
      "headline": "Actor Allu Sirish thanks Western fans for showering 'insane love' on Pushpa 2Actor Allu Sirish, Allu Arjun's brother, on Tuesday evening expressed his gratitude towards Pushpa 2 fans in a tweet. The Allu Arjun and Rashmika Mandanna-starrer recently started streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-gets-a-head-massage-in-chennai-video-2674929-2025-02-04",
      "headline": "Ed Sheeran gets a head massage in Chennai, jokes 'it's abuse'. WatchSinger Ed Sheeran is currently in India. On Tuesday, the British singing sensation shared a fun video of himself getting a head massage in Chennai. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alphonse-davies-sings-rap-song-to-announce-contract-extension-with-bayern-munich-2675026-2025-02-05",
      "headline": "Alphonse Davies sings rap song to announce contract extension with Bayern MunichCanadian international Alphonso Davies (24) celebrated his contract extension at Bayern in an unconventional way, by releasing a rap song titled Munich My Throne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-parunika-sisodia-interview-mithali-raj-vvs-laxman-u19-womens-t20-world-cup-2674940-2025-02-05",
      "headline": "Parunika absorbs Laxman pep-talk, Mithali Raj advice to live World Cup dreamIn an exclusive interview with India Today Digital, left-arm spinner Parunika Sisodia opened up on India's campaign in the U19 Women's T20 World Cup. Parunika was India's most economical bowler, having taken 10 wickets. The 19-year-old also won the Player of the Match award in the semi-final against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kevin-pietersen-praises-abhishek-sharmas-stroke-play-in-mumbai-2675018-2025-02-05",
      "headline": "Pietersen in awe of Abhishek Sharma's stroke play: There were no funky shotsFormer England batter Kevin Pietersen praised India youngster Abhishek Sharma's stroke play after his sensational hundred against England during the fifth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-praises-rohit-sharmas-odi-batting-2675009-2025-02-05",
      "headline": "Rohit's ODI batting has been game-changing, helped team a lot: GillShubman Gill feels that Rohit Sharma's ODI batting has been a game changer for the Indian team in recent times. Rohit started using the attacking template during the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simona-halep-retirement-tennis-transylvania-open-2674995-2025-02-05",
      "headline": "Simona Halep announces retirement after Transylvania Open exit Simona Halep announced her retirement from professional tennis after losing to Lucia Bronzetti in the first round of the Transylvania Open. The now 33-year-old became the World No.1 in 2017 and also went on to win two Grand Slams and 24 WTA titles in her illustrious career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-virat-kohli-rohit-sharma-kevin-pietersen-2674964-2025-02-04",
      "headline": "Virat Kohli, Rohit Sharma aren't 'robots,' deserve more respect: Kevin PietersenKevin Pietersen has called for the fans to be more sympathetic towards Virat Kohli and Rohit Sharma and said that both stars deserve more respect. Kohli and Rohit struggled during the Border-Gavaskar Trophy in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champion-trophy-virat-kohli-rohit-sharma-indian-cricket-team-r-ashwin-2674951-2025-02-04",
      "headline": "Virat Kohli doesn't have to change his game during Champions Trophy: R AshwinR Ashwin feels that Virat Kohli doesn't need to change his game during the Champions Trophy. The former spinner said that star batter can take his time and play according to the demands of the 50-over format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-varun-chakravarthy-odi-inclusion-kevin-pietersen-2674924-2025-02-04",
      "headline": "Varun Chakravarthy not a big ODI threat? Pietersen backs England to fare betterKevin Pietersen feels that England batters would be able to play Varun Chakravarthy well during the ODI series after the mystery spinner was picked in the squad on Tuesday, February 4. Varun destroyed the England batting order during the recently-concluded T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-eng-mohammed-shami-cranks-it-up-in-intense-bowling-session-before-odi-series-2674921-2025-02-04",
      "headline": "Mohammed Shami cranks it up in intense bowling session before ODI seriesIND vs ENG: Mohammed Shami looked in great shape and bowled with full intensity before India's first ODI against England on February 4 at the VCA Stadium in Nagpur.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sanju-samson-t20i-series-batting-feature-2674915-2025-02-04",
      "headline": "Drop Sanju Samson? Why India should shun old-school thoughts in new T20I approachIndia's T20I openers, Abhishek Sharma and Sanju Samson, experienced contrasting fortunes in their last two series against South Africa and England. As calls to replace Sanju Samson grow louder, here's why India should move beyond old-school thinking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-first-odi-virat-kohli-rohit-sharma-nagpur-nets-session-2674916-2025-02-04",
      "headline": "IND vs ENG 1st ODI: Virat Kohli, Rohit Sharma take part in rigorous nets sessionIndia vs England: India's star batters Virat Kohli and Rohit Sharma took part in a rigorous nets session ahead of the Nagpur ODI on Tuesday, February 4. Kohli, Rohit will be aiming to get into top form ahead of the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champion-trophy-virat-kohli-rohit-sharma-indian-cricket-team-r-ashwin-2674951-2025-02-04",
      "headline": "Virat Kohli doesn't have to change his game during Champions Trophy: R AshwinR Ashwin feels that Virat Kohli doesn't need to change his game during the Champions Trophy. The former spinner said that star batter can take his time and play according to the demands of the 50-over format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-varun-chakravarthy-odi-inclusion-kevin-pietersen-2674924-2025-02-04",
      "headline": "Varun Chakravarthy not a big ODI threat? Pietersen backs England to fare betterKevin Pietersen feels that England batters would be able to play Varun Chakravarthy well during the ODI series after the mystery spinner was picked in the squad on Tuesday, February 4. Varun destroyed the England batting order during the recently-concluded T20I series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-eng-mohammed-shami-cranks-it-up-in-intense-bowling-session-before-odi-series-2674921-2025-02-04",
      "headline": "Mohammed Shami cranks it up in intense bowling session before ODI seriesIND vs ENG: Mohammed Shami looked in great shape and bowled with full intensity before India's first ODI against England on February 4 at the VCA Stadium in Nagpur.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sanju-samson-t20i-series-batting-feature-2674915-2025-02-04",
      "headline": "Drop Sanju Samson? Why India should shun old-school thoughts in new T20I approachIndia's T20I openers, Abhishek Sharma and Sanju Samson, experienced contrasting fortunes in their last two series against South Africa and England. As calls to replace Sanju Samson grow louder, here's why India should move beyond old-school thinking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-first-odi-virat-kohli-rohit-sharma-nagpur-nets-session-2674916-2025-02-04",
      "headline": "IND vs ENG 1st ODI: Virat Kohli, Rohit Sharma take part in rigorous nets sessionIndia vs England: India's star batters Virat Kohli and Rohit Sharma took part in a rigorous nets session ahead of the Nagpur ODI on Tuesday, February 4. Kohli, Rohit will be aiming to get into top form ahead of the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-shubman-gill-press-conference-india-vs-england-nagpur-odi-2674909-2025-02-04",
      "headline": "Shubman Gill on vice-captaincy: Being in the think tank is a great learning chanceIndia vs England, 1st ODI: Shubman Gill said he is looking forward to the added responsibility of vice-captaincy in the ODI team. Gill also spoke about healthy competition among youngsters in the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shubman-gill-competition-abhishek-sharma-yashasvi-jaiswal-india-vs-england-2674902-2025-02-04",
      "headline": "No toxic competition between 'friends' Abhishek, Yashasvi and me: Shubman GillIndia vs England: Vice-captain Shubman Gill said he enjoyed watching 'friend' Abhishek Sharma find success in the T20I series against England, ruling out 'toxic competition' in the team. Gill will be Rohit Sharma's deputy in the upcoming ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-karun-nair-champions-trophy-snub-shubman-gill-india-vs-england-2674900-2025-02-04",
      "headline": "Karun Nair's Champions Trophy snub: Shubman Gill says 'continuity' key for IndiaShubman Gill commented on Karun Nair's snub from the Champions Trophy squad and claimed that the Indian team needs continuity at the moment. Karun impressed for Vidarbha during the Vijay Hazare Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-ms-dhoni-inspiring-speech-chennai-super-kings-2674864-2025-02-04",
      "headline": "MS Dhoni's inspiring speech to students: Success not dependent on a pin code anymoreMS Dhoni delivered an inspirational message to over 3,50,000 students during an event on Tuesday, February 4. Dhoni said that success is not dependent on pin code any more and advised students on how to handle pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-rohit-sharma-suresh-raina-aggressive-batting-2674768-2025-02-04",
      "headline": "Rohit Sharma should continue aggressive batting in Champions Trophy: Raina Suresh Raina said that Rohit Sharma should continue with his aggressive style of batting in the Champions Trophy. Last year, Rohit scored 157 runs in ODIs on the tour of Sri Lanka at a strike-rate of 141.44. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-injury-india-vs-england-odi-series-champions-trophy-doubt-2674852-2025-02-04",
      "headline": "No Bumrah in India's ODI squad for England series amid concerns over fitness India vs England: Fast bowler Jasprit Bumrah was not part of the updated ODI squad, announced by the BCCI on Tuesday. Bumrah has been racing against time to recover from a back injury in the lead-up to Champions Trophy, starting February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hil-jugraj-singh-journey-selling-water-bottles-flags-shrarchi-bengal-tigers-title-win-2674778-2025-02-04",
      "headline": "Water bottle seller to superstar: Jugraj Singh reflects on hockey journeyJugraj Singh reflected on his journey to reaching superstardom in the Hockey India League as he scored a hat-trick in the final to seal the win for the Shrarchi Bengal Tigers against the Hyderabad Toofans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-varun-chakravarthy-odi-bcci-confirms-squad-2674733-2025-02-04",
      "headline": "Spinner Varun Chakravarthy added to India's ODI squad for series vs England: BCCIIndia vs England: After a stellar show in the T20I series, Varun Chakravarthy earns a call-up to the ODI squad. The spinner started training with the team in Nagpur on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-rohit-sharma-suresh-raina-aggressive-batting-2674768-2025-02-04",
      "headline": "Rohit Sharma should continue aggressive batting in Champions Trophy: Raina Suresh Raina said that Rohit Sharma should continue with his aggressive style of batting in the Champions Trophy. Last year, Rohit scored 157 runs in ODIs on the tour of Sri Lanka at a strike-rate of 141.44. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-injury-india-vs-england-odi-series-champions-trophy-doubt-2674852-2025-02-04",
      "headline": "No Bumrah in India's ODI squad for England series amid concerns over fitness India vs England: Fast bowler Jasprit Bumrah was not part of the updated ODI squad, announced by the BCCI on Tuesday. Bumrah has been racing against time to recover from a back injury in the lead-up to Champions Trophy, starting February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hil-jugraj-singh-journey-selling-water-bottles-flags-shrarchi-bengal-tigers-title-win-2674778-2025-02-04",
      "headline": "Water bottle seller to superstar: Jugraj Singh reflects on hockey journeyJugraj Singh reflected on his journey to reaching superstardom in the Hockey India League as he scored a hat-trick in the final to seal the win for the Shrarchi Bengal Tigers against the Hyderabad Toofans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-varun-chakravarthy-odi-bcci-confirms-squad-2674733-2025-02-04",
      "headline": "Spinner Varun Chakravarthy added to India's ODI squad for series vs England: BCCIIndia vs England: After a stellar show in the T20I series, Varun Chakravarthy earns a call-up to the ODI squad. The spinner started training with the team in Nagpur on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/u19-womens-t20-world-cup-2025-champions-india-get-heros-welcome-in-bengaluru-2674675-2025-02-04",
      "headline": "Champions India get hero's welcome in Bengaluru after World Cup winThe Indian U19 team returned home on Tuesday after winning the U19 Women's T20 World Cup 2025 in Malaysia. Friends and family of players were present at the Bengaluru airport to greet Niki Prasad and the other Indian cricketers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-international-masters-league-video-nets-training-mumbai-indians-2674643-2025-02-04",
      "headline": "Watch: Tendulkar sparks nostalgia with nets session before Masters LeagueMumbai Indians (MI) posted a video where Sachin Tendulkar can be seen training hard in the nets before taking part in the International Masters League, starting February 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-niki-prasad-rousing-reception-india-2674630-2025-02-04",
      "headline": "Watch: Team India gets rousing reception on homecoming after U19 T20 World Cup win Niki Prasad's India returned to India on Tuesday and were welcomed with a rousing reception at the Bengaluru airport. On Sunday, India won the U19 Women's T20 World Cup after beating South Africa in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-world-test-championship-final-australia-vs-south-africa-sam-konstas-opening-travis-head-2674620-2025-02-04",
      "headline": "Sam Konstas would open in WTC final, I'll be back in middle order: Travis HeadTravis Head has claimed that he expects Sam Konstas to open the batting for Australia during the World Test Championship Final against South Africa. Head also said that he could move back to the middle order for the final. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}