{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-funds-are-on-the-rise-again-check-out-these-5-bets-nippon-india-small-cap-fund-hdfc-midcap-opportunities-fund-axis-bluechip-fund-2718643-2025-05-02",
      "headline": "Mutual funds are on the rise again. Check out these 5 bets in 2025Choosing the right mutual fund depends on how much risk you're comfortable with and how long you plan to invest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oyo-delays-ipo-attempt-for-3rd-time-as-largest-shareholder-opposes-report-2718598-2025-05-02",
      "headline": "Oyo delays IPO attempt for 3rd time as largest shareholder opposes: ReportIndia's Nifty 50 index has risen about 3% in 2025 so far, but it's still over 7% below its all-time high from October last year. This market volatility has affected several companies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/upi-witnesses-small-dip-in-april-but-yearly-growth-remains-strong-2718582-2025-05-02",
      "headline": "UPI witnesses small dip in April, but yearly growth remains strongAccording to data from the National Payments Corporation of India (NPCI), UPI processed 17.89 billion transactions in April, which is about 2.2% less than March's 18.30 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adanis-nephew-accused-of-insider-trading-by-sebi-seeks-settlement-report-2718575-2025-05-02",
      "headline": "Adani's nephew accused of insider trading by Sebi, seeks settlement: ReportThe scrutiny is the latest challenge for the Adani group. US authorities last year indicted Gautam Adani and two Adani Green executives for allegedly paying bribes to secure Indian power supply contracts and misleading US investors. The group has denied the charges and called them \"baseless\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-adani-ports-share-price-key-details-2718565-2025-05-02",
      "headline": "Sensex ends 260 points higher, Nifty above 24,300; Adani Ports gains 4%The S&P BSE Sensex rose 259.75 points to close at 80,501.99, while the NSE Nifty50 ended just 12.50 points higher at 24,346.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-halts-700-million-chip-plan-here-is-why-2718487-2025-05-02",
      "headline": "Zoho halts $700 million chip manufacturing plan. Here's whyZoho, started in 1996, is known for offering affordable business software and services to companies around the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vizhinjam-port-pm-modi-inaugurates-why-its-important-for-india-shipping-global-trade-2718492-2025-05-02",
      "headline": "Vizhinjam port inaugurated: What makes it a strategic gem for IndiaThe Vizhinjam port has a natural sea depth of around 20 metres, making it suitable for very large ships without the need for deep digging, which is common in other ports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/npci-reduces-upi-response-time-payments-to-get-faster-from-june-16-what-it-means-for-you-2718441-2025-05-02",
      "headline": "UPI payments to get faster from June 16: What it means for youNPCI shared in its latest circular stated that from June 16, 2025, UPI users can expect quicker responses when checking the status of a transaction or reversing a payment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-at-strongest-since-october-2024-as-it-breaks-84-per-dollar-mark-2718379-2025-05-02",
      "headline": "Rupee at strongest since October 2024 as it breaks 84/dollar markThis marks a nearly 2% weekly gain for the rupee, powered by a sustained rally in Indian equities and growing optimism over an early US-India trade deal under the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-zomato-eternal-shares-are-rising-despite-78-percent-drop-in-q4-profit-2718371-2025-05-02",
      "headline": "Zomato shares rise despite 78% drop in Q4 profit. Should you buy, hold or sell?Eternal posted revenue of Rs 5,830 crore, broadly in line with analyst estimates. EBITDA margin slipped to 1.2%—falling short of expectations—but the company managed to maintain stable contribution margins in both food delivery and quick commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-share-price-rise-5-percent-enterprises-good-q4-results-boost-adani-stocks-2718368-2025-05-02",
      "headline": "Adani Group stocks rise up to 5%. Here's whyAdani Enterprises' shares climbed more than 2% on Friday after the company reported an increase in its net profit for the January–March quarter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-wall-street-rally-boosts-global-markets-2718360-2025-05-02",
      "headline": "Sensex gains 900 points. 3 reasons why stock market is rising todayThe S&P BSE Sensex was up 867.48 points at 81,109.72 around 10 am, while the NSE Nifty50 gained 247.90 points to trade at 24,582.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-450-points-nifty-above-24400-adani-ports-up-4-percent-2718356-2025-05-02",
      "headline": "Sensex, Nifty soar as trade deal hopes lift sentiment; FII buying boosts rallyThe S&P BSE Sensex went past the 81,000 mark while NSE Nifty50 was close to surpassing 24,600 level as Dalal Street surged in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-check-allotment-status-online-guide-latest-gmp-listing-gain-market-debut-date-2718355-2025-05-02",
      "headline": "Ather Energy IPO: Check allotment status, latest GMP and listing dateThe total number of bids received was 7,67,49,068 against the offer of 5,11,22,370 shares. Through the IPO, Ather Energy raised Rs 2,980.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rise-or-fall-may-2-nse-bse-trading-fii-buying-2718350-2025-05-02",
      "headline": "Stock market opening today: Will Sensex, Nifty rise or fall on May 2?In the last two sessions, both Sensex and Nifty ended slightly lower. There was uncertainty among investors due to rising tension between India and Pakistan. However, markets are expected to start the day on a stronger note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-focus-eternal-zomato-tata-motors-adani-enterprises-infosys-mahindra-q4-2718333-2025-05-02",
      "headline": "Stocks to watch: Eternal, Tata Motors, Adani Enterprises, Infosys, MahindraBoth the Sensex and Nifty ended slightly lower in the last session, as cautious sentiment prevailed among investors over rising India-Pakistan tension. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-losses-pakistan-airspace-closure-shut-consequences-pahalgam-terror-attack-2718279-2025-05-01",
      "headline": "Air India expects $600 million in losses if Pak airspace shut for a year: ReportThe closure of Pakistani airspace for a year would result in losses of USD 600 million for the country's national carrier, Air India, news agency PTI reported, citing sources. The airline has sought the government's assistance to address the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-makes-pravaah-portal-mandatory-for-financial-institutions-starting-may-2025-2718086-2025-05-01",
      "headline": "RBI makes PRAVAAH portal mandatory for financial institutions starting May 1The PRAVAAH portal provides all necessary forms, along with simple instructions. Users can submit their application, track its progress, and even get alerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gst-collection-record-high-april-data-rs-237-lakh-crore-rise-126-percent-tax-2718033-2025-05-01",
      "headline": "GST collections hit record Rs 2.37 lakh crore in April, up 12.6%In March, GST collections stood at Rs 1.96 lakh crore, showing a 9.9% rise from the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodha-founder-and-ceo-nithin-kamath-exposes-whatsapp-investment-scam-using-his-name-to-dupe-investors-details-here-2718012-2025-05-01",
      "headline": "Nithin Kamath exposes this scam using his name to dupe investors. Details hereZerodha's CEO Nithin Kamath has urged investors to stay alert, always check the source, and never act on random financial advice sent on messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-q4-results-net-profit-soars-50-percent-revenue-up-23-percent-share-price-2717975-2025-05-01",
      "headline": "Adani Ports Q4 results: Net profit soars 50%, revenue up 23%The company reported a 50% rise in its consolidated net profit, which stood at Rs 3,023 crore. This is an increase from Rs 2,025 crore reported in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-atm-charges-to-lpg-prices-5-key-financial-changes-to-know-in-may-2025-itr-forms-1-and-4-home-loan-rates-cut-2717964-2025-05-01",
      "headline": "From ATM charges to LPG prices: 5 key financial changes to know in May 2025Starting May 1, taking cash out from an ATM after your free monthly limit will cost you Rs 23 per transaction, up from the current Rs 21."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/eternal-q4-earnings-zomato-results-what-to-expect-january-to-march-quarter-profit-ebitda-2717951-2025-05-01",
      "headline": "Zomato Q4 earnings: What to expect from Eternal's January-March resultsAnalysts expect mixed numbers for the fourth quarter, mainly due to expected higher losses from its quick commerce arm, Blinkit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-does-not-always-glitter-this-ca-post-might-change-your-mind-2717923-2025-05-01",
      "headline": "'Gold doesn't always glitter': This CA's post might change your mindA CA pointed out a combination of global shocks, like COVID-19, wars, inflation fears, and central bank purchases, which all contributed to the price spike in the yellow metal since 2020."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musk-slams-report-claiming-tesla-looking-to-replace-him-2717885-2025-05-01",
      "headline": "'Deliberately false': Elon Musk slams report claiming Tesla looking to replace himElon Musk responded furiously on X, calling it \"an EXTREMELY BAD BREACH OF ETHICS\" and slamming the WSJ for \"publishing a DELIBERATELY FALSE ARTICLE\" despite receiving a prior denial from Tesla's board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vedanta-q4-profit-more-than-doubles-check-price-target-fy26-estimates-and-more-2717871-2025-05-01",
      "headline": "Vedanta Q4 profit more than doubles: Check price target, FY26 estimates and moreWith expansion projects nearing completion and deleveraging underway, analysts believe Vedanta is positioning itself for a stronger, leaner phase of growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-itr-forms-1-and-4-notified-for-fy-2024-2025-check-key-changes-who-can-file-2717870-2025-05-01",
      "headline": "New ITR Forms 1 and 4 notified for FY 2024-2025. Check key changes, who can fileITR-1, or Sahaj, is for resident individuals who have an overall income of not more than Rs 50 lakh a year and the income is from a salary or pension, single house property, or income like interest from bank deposits or fixed deposits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-allotment-status-online-guide-how-to-check-latest-gmp-listing-date-2717849-2025-05-01",
      "headline": "Ather Energy IPO: Step-by-step guide to check allotment status. See latest GMPThe electric scooter maker's public offer was just fully subscribed by the end of the final day of bidding, suggesting investors were not keen to put their money on another EV scooter maker, after Ola Electric's shares have not performed well since its market debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-leadership-crisis-ceo-resigns-accounting-scandal-2717838-2025-05-01",
      "headline": "Accounting lapse, high-profile exits: What's next for IndusInd Bank?As the dust settles on IndusInd Bank's derivatives debacle, the real test begins: can the bank restore trust, steady the ship, and convince investors it's back on course?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coca-cola-record-servings-maha-kumbh-180-million-q1-fy25-results-prayagraj-atlanta-2717829-2025-05-01",
      "headline": "Coca-Cola sells record servings at Maha Kumbh. The final number may shock youWhile saints and seekers looked for divine blessings, the world's biggest beverage giant looked across the Ganga's banks and found its biggest crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-today-maharashtra-day-sensex-nifty-trading-open-close-may-1-2717776-2025-05-01",
      "headline": "Sensex, Nifty holiday: Are stock markets open for trading today?There are also no market holidays in the months of June and July 2025, so investors can expect uninterrupted trading during this period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-milk-price-hike-mother-dairy-two-rupees-per-litre-2717659-2025-04-30",
      "headline": "After Mother Dairy, Amul hikes milk prices by Rs 2 per litreAfter Mother Dairy, Amul has also hiked the prices of its milk up to 2rs per litre. The new prices will come into effect from tomorrow, i.e., May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-is-king-says-mark-mobius-amid-trade-war-fears-backs-india-over-china-2717526-2025-04-30",
      "headline": "'Cash is king,' says Mark Mobius amid trade war fears, backs India over ChinaVeteran investor Mark Mobius believes that the uncertainty around the trade wars makes it risky to invest right now. However, he does see hope in countries like India, which he says could benefit as global supply chains shift away from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-46-points-lower-nifty-below-24400-bajaj-twins-fall-5-percent-2717501-2025-04-30",
      "headline": "Sensex closes 46 points lower, Nifty below 24,400; Bajaj twins fall 5%The S&P BSE Sensex was down by 46.14 points to end at 80,242.24, while the NSE Nifty50 lost 1.75 points to close at 24,334.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-today-fall-stock-market-investment-akshaya-tritiya-safe-haven-2717498-2025-04-30",
      "headline": "Can gold retain its glitter as Dalal Street gets back its glow?Just a week ago, gold was trading at record levels due to global uncertainty. Concerns over trade tensions, US tariffs, and geopolitical issues had pushed investors towards gold, a common choice during uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-public-listing-market-buzz-dalal-street-trading-lg-tata-zepto-reliance-hdfc-2717462-2025-04-30",
      "headline": "New wave of IPOs is coming. Is Dalal Street ready?Tata Capital, PhonePe, and Zepto are also said to be in the pipeline. Financial firms like HDB Financial Services and Hero FinCorp are planning to raise Rs 12,500 crore and Rs 3,668 crore, respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rakuten-to-invest-over-100-million-dollars-in-india-plans-to-boost-hiring-by-8-percent-2717447-2025-04-30",
      "headline": "Rakuten to invest over $100 million in India, plans to boost hiring by 8%Rakuten currently employs 4,000 people in India, 90% of whom are tech staff, and plans to recruit people who it considers \"power users\" of AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-raises-atm-charges-rs-23-from-may-1-know-the-details-here-2717434-2025-04-30",
      "headline": "RBI raises ATM charges to Rs 23 from May 1: Know the details herePeople living in metro cities would get three free transactions per month, while those living in non-metro areas would get five free transactions per month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-rallies-strongest-2025-level-foreign-inflows-dollar-sales-2717421-2025-04-30",
      "headline": "Rupee jumps to highest level in 2025. Check factors behind strong rallyThe Indian rupee reached its highest level of 2025, driven by foreign inflows and exporter dollar sales. Optimism over US-India trade talks and a weakening US dollar further supported the currency's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-anirudh-ravichnder-confirms-track-thalapathy-vijay-final-film-jana-nayagan-2718938-2025-05-03",
      "headline": "Hanumankind confirms his track in Thalapathy Vijay's final film Jana NayaganRapper Hanumankind confirmed teaming up with composer Anirudh Ravichander for Thalapaty Vijay's upcoming film, 'Jana Nayagan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raid-2-box-office-day-2-ajay-devgns-thriller-crosses-rs-30-crore-in-two-days-2718923-2025-05-03",
      "headline": "Raid 2 box office: Ajay Devgn's thriller crosses Rs 30 crore in two daysAjay Devgn's 'Raid 2' has kicked off strongly at the box office, raking in over Rs 31 crore in its first two days. Directed by Raj Kumar Gupta, the film released in theatres on May 1. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoors-statement-after-mother-nirmal-kapoor-death-arjun-kapoor-anil-kapoor-sanjay-kapoor-2718918-2025-05-03",
      "headline": "She lived a full, joyful life: Boney Kapoor's mourns mother Nirmal's deathBoney Kapoor shared an emotional note in the wee hours of Saturday and mourned the death of his mother, Nirmal Kapoor. She was survived by four children- Boney, Anil, Sanjay, and Reena Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/heidi-gardner-and-bobby-ray-join-star-packed-cast-of-ferrells-judgment-day-glbs-2718891-2025-05-03",
      "headline": "Heidi Gardner and Bobby Ray join star-packed cast of Ferrell's 'Judgment Day'Heidi Gardner and golfer Bobby Ray join Will Ferrell and Zac Efron in Amazon MGM's comedy Judgment Day, directed by Nicholas Stoller. The film follows a convict hijacking a courtroom show.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gal-gadot-and-matthias-schoenaerts-to-star-in-ww-ii-thriller-ruin-from-niki-caro-glbs-2718877-2025-05-03",
      "headline": "Gal Gadot and Matthias Schoenaerts to star in WW II thriller 'Ruin' from Niki CaroGal Gadot and Matthias Schoenaerts will star in Ruin, a WWII revenge thriller directed by Niki Caro. Filming begins in 2026, with international sales launched at Cannes Film Market.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ed-sheerans-play-album-out-in-september-draws-persian-and-indian-influences-glbs-2718873-2025-05-03",
      "headline": "Ed Sheeran's 'Play' album out in September, draws Persian and Indian influencesEd Sheeran has announced his new album Play, out September 12, with the release of \"Old Phone.\" The globally inspired album was finalized in India and features Persian and Indian sounds.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-bengaluru-concert-complaint-filed-kannada-song-demand-pahalgam-attack-2718839-2025-05-02",
      "headline": "Complaint against Sonu Nigam for 'provocative' remarks at Bengaluru concertA Kannada outfit has accused Sonu Nigam of stoking \"linguistic enmity\" at a Bengaluru concert over the singer's remarks linking a fan's Kannada song request to the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/waves-2025-create-in-india-challenge-winners-n-music-filmmaking-2718831-2025-05-02",
      "headline": "From music to filmmaking: Create in India Challenge awards winners at WAVES 2025The Waves Create in India Challenge Awards, in partnership with India Today, were held at WAVES Summit 2025 in Mumbai. Take a look at the winners here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-ray-birthday-kolkata-crowdfunded-street-museum-2718783-2025-05-02",
      "headline": "Kolkata honours Satyajit Ray with crowdfunded street museumKolkata unveils a unique crowdfunded street museum to honour Satyajit Ray. This initiative marks a significant cultural tribute to the legendary filmmaker on his 104th birth anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/virat-kolhi-says-nee-singam-dhan-favourite-song-actor-simbu-reacts-2718775-2025-05-02",
      "headline": "Salman Khan's films go wrong as he tries to accommodate friends: Shehzad KhanVeteran actor Shehzad Khan calls out criticism against Salman Khan, highlighting his generosity, loyalty, and enduring mass appeal. He shared the screen with the superstar in 'Andaz Apna Apna', which was recently re-released in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/virat-kohli-calls-nee-singam-dhan-his-favourite-song-actor-simbu-reacts-2718594-2025-05-02",
      "headline": "Virat Kohli calls Nee Singam Dhan his favourite song, actor Simbu reactsDuring a recent chat show, cricketing superstar Virat Kohli revealed that his favourite song right now was AR Rahman's 'Nee Singham Dhan' from the Tamil film 'Pathu Thala' starring Silambarasan TR aka Simbu. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-to-walk-the-met-gala-2025-red-carpet-wearing-gaurav-gupta-2718740-2025-05-02",
      "headline": "Kiara Advani to walk the MET Gala 2025 red carpet wearing Gaurav GuptaSoon-to-be mother Kiara Advani is set to make her Met Gala debut in 2025 in a custom Gaurav Gupta outfit. She will be joined by Shah Rukh Khan, Diljit Dosanjh, and Priyanka Chopra, marking a grand moment for Indian stars on the global fashion stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-aishwarya-rai-eva-longoria-cannes-film-festival-red-carpet-debut-2718724-2025-05-02",
      "headline": "Alia Bhatt to join Aishwarya Rai, Eva Longoria for Cannes red carpet debutAlia Bhatt is set to make her Cannes Film Festival debut. She will join the roster of Loreal global ambassadors, including Aishwarya Rai and Eva Longoria among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-paresh-rawal-anu-aggarwal-claims-she-drank-her-urine-its-amrit-2718534-2025-05-02",
      "headline": "After Paresh Rawal, Anu Aggarwal claims she drank her urine: It's amritActor Anu Aggarwal came out in support of veteran actor Paresh Rawal's claims about the health benefits of drinking one's own urine. During a recent event, she revealed that she had also tried it herself and claimed that there were anti-aging effects on her skin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-kapoor-mother-nirmal-dies-at-90-2718714-2025-05-02",
      "headline": "Anil Kapoor's mother Nirmal dies at 90Actor Anil Kapoor's mother Nirmal Kapoor died on May 2. She was 90 years old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-attend-met-gala-in-balmain-and-bulgari-in-met-gala-2025-2718696-2025-05-02",
      "headline": "MET Gala 2025: Priyanka Chopra will make fifth appearance in Balmain and BulgariPriyanka Chopra Jonas is set to return to the MET Gala 2025 for the fifth time. She will join a star-studded lineup as the event celebrates the legacy of Black style with the theme 'Superfine: Tailoring Black Style.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lost-in-starlight-major-leap-animation-south-korean-entertainment-industry-weekly-k-fix-2718632-2025-05-02",
      "headline": "Lost In Starlight: South Korea's bet to turn global spotlight on their animation'Lost in Starlight' is marking a significant leap in the South Korean entertainment industry by being Netflix's first Korean animated film. With the global reach, will the spotlight now turn on South Korean animation?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumtaz-shah-rukh-khans-first-crush-says-no-to-playing-his-mother-in-films-2718637-2025-05-02",
      "headline": "Veteran actor Mumtaz, SRK's first crush, says no to playing his mother in filmsVeteran actor Mumtaz said she won't play Shah Rukh Khan's mother in films, as she wants roles that match her age and looks. She appreciated SRK's praise but added that she chooses roles that fit her style and image."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-temple-lairai-devi-jatra-shirgao-yatra-pligrimage-stampede-deaths-killed-injured-pramod-sawant-chief-minister-hospital-2718905-2025-05-03",
      "headline": "7 killed, over 30 injured in stampede at Goa's Lairai Devi templeAt least seven people were killed and over 30 injured in a stampede during the Shri Lairai Zatra festival in Goa's Shirgao on Friday night. Chief Minister Pramod Sawant and Prime Minister Narendra Modi expressed condolences, while authorities continue to investigate the cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-attack-bangladesh-occupy-north-east-muhammad-yunus-chinese-military-help-2718769-2025-05-02",
      "headline": "Bangladesh should occupy Northeast states if India attacks Pak: Yunus's aideBangladesh Chief Adviser Muhammad Yunus's aide suggested that if India attacks Pakistan, Bangladesh should occupy the northeastern states of India and initiate talks with China for a joint military arrangement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mp-charanjit-singh-channi-no-one-saw-surgical-strikes-remark-gets-bjp-manjinder-singh-sirsa-go-to-pakistan-reply-2718927-2025-05-03",
      "headline": "Congress MP's 'no one saw surgical strikes' remark gets BJP's 'go to Pak' replyCongress MP Charanjit Singh Channi sparked a row by questioning the 2019 surgical strikes, saying \"no one saw them\" and demanding proof. His remarks drew sharp criticism from BJP leaders, who accused him of demoralising the armed forces.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-pakistan-asks-gulf-allies-to-help-ease-india-tensions-glbs-2718887-2025-05-03",
      "headline": "Pak seeks Gulf allies' help to ease tension with India over Pahalgam terror attackAfter the Pahalgam terror attack that killed 26 tourists, Pakistan PM Shehbaz Sharif reached out to Gulf envoys, hoping to ease rising tensions with India. He sought support during a deeply sensitive time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/does-alcohol-actually-calm-your-nerves-2718797-2025-05-03",
      "headline": "Does alcohol actually calm your nerves?Alcohol does act as a sedative on the central nervous system. So yes, in the moment, you might feel relaxed, your thoughts may slow down, and those butterflies in your stomach might ease, but..."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/house-arrest-ajaz-khan-producer-rajkumar-pandey-ullu-app-ott-show-fir-mumbai-police-case-charge-sex-positions-obscene-clip-2718915-2025-05-03",
      "headline": "Case against Ajaz Khan, producer of 'House Arrest' over obscene clipThe webshow, hosted by actor Ajaz Khan and streamed on the Ullu app, has sparked a controversy and even drawn political ire for alleged obscene content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-permanent-representative-to-un-unsc-meeting-india-tensions-pahalgam-terror-attack-2718850-2025-05-03",
      "headline": "Right to seek UN Security Council meet: Pak amid tension with India over J&K attackPakistan's Permanent Representative to the UN, Asim Iftikhar Ahmad, said his country had a legitimate right as a council member to seek a meeting with the UN Security Council amid tensions with India following last month's Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/prince-harry-seeks-reconciliation-king-charles-wont-speak-to-him-royal-family-police-protection-2718824-2025-05-02",
      "headline": "Prince Harry seeks Royal reconciliation, says King Charles won't speak to himPrince Harry has expressed a desire for reconciliation with the Royal Family, admitting to a strained relationship with King Charles III following a legal defeat over UK security arrangements, which he said left him 'devastated'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/bull-scooter-joyride-spin-uttarakhand-rishikesh-road-cctv-footage-2718851-2025-05-02",
      "headline": "Un-bull-ievable: Watch bull takes scooter for a spin in RishikeshA bull unexpectedly sat on a parked scooter and moved the vehicle with its legs as if the animal was driving in Rishikesh. The 'joyride', however, lasted for a few seconds, when the bull crashed the scooter into a wall and later wandered off."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/after-pm-defence-minister-rajnath-singh-likely-skip-russia-victory-day-parade-may-9-2718861-2025-05-02",
      "headline": "After PM, Rajnath Singh likely to skip Russia's Victory Day parade on May 9Defence Minister Rajnath Singh may not attend Russia's Victory Day celebrations on May 9 in Moscow. Minister of State (MoS) for Defence Sanjay Seth is expected to represent India at the annual event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoors-statement-after-mother-nirmal-kapoor-death-arjun-kapoor-anil-kapoor-sanjay-kapoor-2718918-2025-05-03",
      "headline": "She lived a full, joyful life: Boney Kapoor's mourns mother Nirmal's deathBoney Kapoor shared an emotional note in the wee hours of Saturday and mourned the death of his mother, Nirmal Kapoor. She was survived by four children- Boney, Anil, Sanjay, and Reena Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mike-waltz-seen-using-less-secure-version-of-signal-during-white-house-meeting-glbs-2718870-2025-05-03",
      "headline": "Mike Waltz seen using less-secure version of Signal during White House meetingNew photos show ex-Trump adviser Mike Waltz using a modified Signal app called TM SGNL during a cabinet meeting. The app allows message archiving. Top officials like Vance and Rubio were also part of the conversation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-shubman-gill-angry-gujarat-titans-captaincy-2718921-2025-05-03",
      "headline": "Angry young man Shubman Gill shows glimpse of future avatar in IPL 2025Shubman Gill was left furious several times on Friday, May 2 as GT thrashed SRH in Ahmedabad. Was this the first glimpse of a passionate leader that the fans got to see in the Indian Premier League?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-students-rape-accused-farhan-shot-in-leg-in-late-night-police-encounter-2718898-2025-05-03",
      "headline": "Bhopal students' rape accused shot in leg in late-night police encounterPolice said the accused stopped the vehicle on the pretext of going to the washroom and snatched a sub-inspector's pistol, and tried to escape. During the chaos, he was shot in the right leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-kamala-harris-dances-to-boots-on-the-ground-at-san-francisco-gala-glbs-2718875-2025-05-03",
      "headline": "Watch: Kamala Harris dances to 'Boots on the Ground' at San Francisco galaA video of Kamala Harris dancing to the viral \"Boots on the Ground\" trend is winning hearts online. Filmed at a San Francisco gala, the clip shows a lighter side of Harris after her 2024 election loss, sparking joy and conversation on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-minister-ataullah-tarar-x-account-blocked-india-warning-indian-strike-pahalgam-attack-2718885-2025-05-03",
      "headline": "Pak minister's X account blocked in India days after 'India will strike' claimThe X account of Pakistan minister Ataullah Tarar, who claimed that India may soon conduct a military strike on Pakistan, citing \"credible intelligence\" has been blocked in India. The move comes amid tensions between both countries over the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/waves-2025-create-in-india-challenge-winners-n-music-filmmaking-2718831-2025-05-02",
      "headline": "From music to filmmaking: Create in India Challenge awards winners at WAVES 2025The Waves Create in India Challenge Awards, in partnership with India Today, were held at WAVES Summit 2025 in Mumbai. Take a look at the winners here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-480-03-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pakistan-violates-loc-border-ceasefire-for-ninth-straight-night-army-responds-2718902-2025-05-03",
      "headline": "Pakistan violates LoC ceasefire for 9th straight night, Army respondsSince the night of April 24, just hours after India suspended the Indus Waters Treaty following the killing of 26 people in the terror attack, Pakistani troops have been resorting to unprovoked firing at various places along the LoC in J&K, beginning from the Kashmir Valley."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tour-van-pickup-truck-collide-near-yellowstone-7-people-killed-glbs-2718881-2025-05-03",
      "headline": "Video: Tour van, pickup truck burst into flames after collision in US, 7 deadSeven people were killed and eight injured in a fiery crash between a pickup truck and a tour van near Wyoming's Yellowstone National Park. The officials have yet to determine the crash of the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-hyderabad-gt-vs-srh-ipl-2025-playoffs-qualification-2718865-2025-05-02",
      "headline": "Sunrisers Hyderabad can still qualify for IPL 2025 playoffs. Here's howIPL 2025, GT vs SRH: Sunrisers Hyderabad can still enter the playoffs through the backdoor despite their 38-run loss to the Gujarat Titans at the Narendra Modi Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-fighter-jets-night-landing-ganga-expressway-rafale-sukhoi-uttar-pradesh-2718822-2025-05-02",
      "headline": "Rafale, Sukhoi jets land under moonlight in historic night drill on UP expresswayThe Indian Air Force (IAF) landed fighter jets on a 3.5-km Ganga Expressway stretch in Uttar Pradesh, testing combat readiness and night operations on India's first 27*7 expressway airstrip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/make-america-relax-again-white-house-lofi-maga-video-goes-viral-watch-glbs-2718895-2025-05-03",
      "headline": "'Make America Relax Again': White House's Lo-Fi MAGA video goes viralThe White House released a \"Lo-Fi MAGA Video to Relax/Study To,\" featuring a cartoon-styled Trump character, campaign promises, and calm music—sparking praise online as creative PR targeting younger voters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-asks-supreme-court-to-grant-musks-doge-access-to-social-security-data-glbs-2718886-2025-05-03",
      "headline": "Trump asks Supreme Court to grant Musk's DOGE access to Social Security dataTrump administration urges Supreme Court to lift a block on Musk-led DOGE's access to Social Security data, citing urgency in fraud detection despite privacy concerns raised by a lower court ruling."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-csk-michael-hussey-press-conference-2718937-2025-05-03",
      "headline": "CSK are not going to panic, can compete with any team: Hussey ahead of RCB clashChennai Super Kings batting coach Mike Hussey said that CSK have not slipped into panic mode despite becoming the first side to be ruled out of the IPL play-off race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-srh-shubman-gill-jos-buttler-sai-sudharsan-gerald-coetzee-2718934-2025-05-03",
      "headline": "Consistent GT top 3 playing good cricket shots with no slogging: Gerald CoetzeeGerald Coetzee heaped praise on GT's top three batters, saying that the trio are playing good cricket shots with minimal slogging. Shubman Gill, Sai Sudharsan and Jos Buttler are amongst the top run-getters in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-devdutt-padikkal-rcb-vs-csk-bengaluru-press-conference-2718928-2025-05-03",
      "headline": "RCB won't treat CSK clash differently: Padikkal calm ahead of mega clashDevdutt Padikkal has played down any need for special planning ahead of RCB's high-voltage clash against CSK, backing the team's usual preparation as enough for a game that has become one of the most emotionally charged fixtures in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-jaydev-unadkat-press-conference-pat-cummins-2718926-2025-05-03",
      "headline": "Worst bowling unit of IPL 2025, pitch changes: SRH's downfall decoded by UnadkatFollowing the loss to GT in Ahmedabad, Jaydev Unadkat feels that the collective failure of the bowling unit and change in pitches has been the main reasons behind SRH's downfall in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-shubman-gill-angry-gujarat-titans-captaincy-2718921-2025-05-03",
      "headline": "Angry young man Shubman Gill shows glimpse of future avatar in IPL 2025Shubman Gill was left furious several times on Friday, May 2 as GT thrashed SRH in Ahmedabad. Was this the first glimpse of a passionate leader that the fans got to see in the Indian Premier League?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-prasidh-krishna-india-tour-of-england-2718912-2025-05-03",
      "headline": "Prasidh Krishna 2.0 gears up for England tour after swinging success in IPL 2025After taking IPL 2025 by storm, Gujarat Titans pacer Prasidh Krishna is now gearing up for India's demanding red-ball tour of England. With the control he displayed throughout the tournament, he has positioned himself as one of India's most promising pace options. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-pat-cummins-sunrisers-hyderabad-vacation-2718903-2025-05-03",
      "headline": "Still on vacation mode, SRH all but knocked out of IPL 2025SunRisers Hyderabad were hammered by Gujarat Titans on May 2, in IPL 2025. SRH players failed to grasp the pace of the game after their week-long vacation at the Maldives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-ticket-prices-how-to-book-event-dates-2718867-2025-05-03",
      "headline": "Rs 199 to Rs 44,999: Neeraj Chopra Classic's tickets go liveTickets for the Neeraj Chopra Classic 2025, set for May 24 at Bengaluru's Sree Kanteerava Stadium, are now available. The javelin throw event will begin at 6:30 PM IST, with gates opening at 5 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-hyderabad-gt-vs-srh-ipl-2025-playoffs-qualification-2718865-2025-05-02",
      "headline": "Sunrisers Hyderabad can still qualify for IPL 2025 playoffs. Here's howIPL 2025, GT vs SRH: Sunrisers Hyderabad can still enter the playoffs through the backdoor despite their 38-run loss to the Gujarat Titans at the Narendra Modi Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-match-report-all-round-show-shubman-gill-2718856-2025-05-02",
      "headline": "IPL 2025: All round Gujarat Titans too hot to handle for Sunrisers HyderabadIPL 2025: Gujarat Titans outclassed Sunrisers Hyderabad in all departments to secure a 38-run win and deal a heavy blow to SRH's playoff aspirations. Shubman Gill's calm anchor role proved decisive in contrast to SRH's disjointed approach with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-favourites-with-stellar-away-performance-says-gavaskar-2718846-2025-05-02",
      "headline": "RCB are favourites to win the IPL 2025 title: Sunil GavaskarSunil Gavaskar has declared Royal Challengers Bengaluru as the favourites to win IPL 2025. Their consistent performance, especially in away matches, sets them ahead in the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-pat-cummins-sunrisers-hyderabad-vacation-2718903-2025-05-03",
      "headline": "Still on vacation mode, SRH all but knocked out of IPL 2025SunRisers Hyderabad were hammered by Gujarat Titans on May 2, in IPL 2025. SRH players failed to grasp the pace of the game after their week-long vacation at the Maldives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-ticket-prices-how-to-book-event-dates-2718867-2025-05-03",
      "headline": "Rs 199 to Rs 44,999: Neeraj Chopra Classic's tickets go liveTickets for the Neeraj Chopra Classic 2025, set for May 24 at Bengaluru's Sree Kanteerava Stadium, are now available. The javelin throw event will begin at 6:30 PM IST, with gates opening at 5 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-hyderabad-gt-vs-srh-ipl-2025-playoffs-qualification-2718865-2025-05-02",
      "headline": "Sunrisers Hyderabad can still qualify for IPL 2025 playoffs. Here's howIPL 2025, GT vs SRH: Sunrisers Hyderabad can still enter the playoffs through the backdoor despite their 38-run loss to the Gujarat Titans at the Narendra Modi Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-match-report-all-round-show-shubman-gill-2718856-2025-05-02",
      "headline": "IPL 2025: All round Gujarat Titans too hot to handle for Sunrisers HyderabadIPL 2025: Gujarat Titans outclassed Sunrisers Hyderabad in all departments to secure a 38-run win and deal a heavy blow to SRH's playoff aspirations. Shubman Gill's calm anchor role proved decisive in contrast to SRH's disjointed approach with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-favourites-with-stellar-away-performance-says-gavaskar-2718846-2025-05-02",
      "headline": "RCB are favourites to win the IPL 2025 title: Sunil GavaskarSunil Gavaskar has declared Royal Challengers Bengaluru as the favourites to win IPL 2025. Their consistent performance, especially in away matches, sets them ahead in the race."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}