{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-investors-can-now-nominate-up-to-10-individuals-details-here-2664670-2025-01-14",
      "headline": "Mutual fund investors can now nominate up to 10 individuals. Details hereThe new rules enhance investor convenience while ensuring that the nomination process remains secure and transparent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-hits-mutual-funds-should-you-continue-sips-or-cash-in-2664671-2025-01-14",
      "headline": "Are mutual funds risky in a turbulent stock market? Here's all you need to knowIs market turbulence shaking your mutual fund confidence? Find out why experts urge patience and see volatility as a buying opportunity, not a cause for alarm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-why-you-should-file-belated-revised-tax-returns-by-january-15-stmp-2664632-2025-01-14",
      "headline": "ITR filing: Why you should file belated, revised tax returns by January 15Taxpayers missing the original deadline must file a belated ITR to meet obligations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-score-check-why-and-how-often-should-you-review-it-2664595-2025-01-14",
      "headline": "Credit score check: Why and how often should you review it?A credit score is a numerical measure of your creditworthiness, based on payment history, debt, and credit history length."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-higher-adani-enterprises-gain-7-percent-adani-ports-rise-2664584-2025-01-14",
      "headline": "Sensex, Nifty snap losing streak to end higher; Adani stocks gain up to 7%The S&P BSE Sensex gained169.62 points to close at 76,499.63, while the NSE Nifty50 added 90.10 points to end at 23,176.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-an-online-personal-loan-check-these-7-simple-steps-2664570-2025-01-14",
      "headline": "Looking for an online personal loan? Check these 7 simple steps To avoid delays in your online personal loan application, ensure you meet the eligibility criteria and have all necessary documents ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-how-government-can-prioritise-job-creation-and-skill-development-2664523-2025-01-14",
      "headline": "Budget 2025: How government can prioritise job creation and skill development The upcoming Budget 2025 is expected to focus on economic growth while addressing key challenges and leveraging opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/biocon-share-price-rise-reason-surged-7-percent-today-hsbc-rating-upgrade-2664516-2025-01-14",
      "headline": "Explained: Why Biocon shares surged 7% today Biocon share price: The stock has gained 9.66% in the last month, 7.99% over the past six months, and an impressive 37.98% in the last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-nris-are-expecting-from-nirmala-sitharaman-2664427-2025-01-14",
      "headline": "Budget 2025: What NRIs are expecting from Nirmala SitharamanAll eyes are on the Union Budget 2025, set to be announced in February, for key reform announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-shares-tumble-nearly-10-after-q3-results-what-should-investors-do-2664501-2025-01-14",
      "headline": "HCLTech shares tumble nearly 10% after Q3 results. What should investors do?Several brokerages have shared their views on the IT giant's Q3 results. Brokerage firm Morgan Stanley maintained an 'Equal-Weight' rating with a target price of Rs 1,970."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/truly-disheartening-l-and-t-hr-head-defends-chairman-amid-90-hour-workweek-row-2664470-2025-01-14",
      "headline": "Truly disheartening: L&T HR head defends chairman amid 90-hour workweek rowL&T Chairman S N Subrahmanyan's 90-hour workweek remark has triggered debate on work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-adani-green-why-adani-group-shares-jumped-up-to-18-percent-today-stmp-2664471-2025-01-14",
      "headline": "Adani Power, Adani Green: Why Adani Group shares jumped up to 18% todayAdani Group shares: At 12:05 pm, Adani Power soared 18.05% to Rs 531.40 on the Bombay Stock Exchange (BSE), while Adani Green Energy climbed 14.15% to Rs 1,015.80. Adani Enterprises, the group's flagship company, was trading 8% higher at Rs 2,401.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-energy-shares-price-rise-why-6-percent-today-ksk-mahanadi-power-company-limited-kmpcl-accquisition-stmp-2664434-2025-01-14",
      "headline": "JSW Energy shares price rises 6% today. Here's why JSW Energy share price: The stock has lost 20.14% in the last month and 23.69% over the past six months. Despite the recent decline, JSW Energy has gained 16.15% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-energy-share-price-jumps-over-7-percent-key-factors-behind-gain-explained-stmp-2664433-2025-01-14",
      "headline": "JSW Energy share price jumps nearly 7%. Why is it gaining today?JSW energy share price: The stock opened at Rs 528.15, and climbed to an intraday high of Rs 552.50 at around 11:07 am, marking a jump of 6.59% jump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-stock-price-fell-nearly-10-despite-positive-q3-results-explained-stmp-2664425-2025-01-14",
      "headline": "Explained: Why HCLTech share price fell nearly 10% despite positive Q3 resultsHCLTech share price: At 10:46 am, HCLTech's shares were trading 9.02% lower at Rs 1,806.20 on the Bombay Stock Exchange (BSE). Earlier, its shares hit an intraday low of Rs 1,798.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-and-nifty-rebound-why-is-stock-market-rising-today-key-factors-explained-2664418-2025-01-14",
      "headline": "Sensex, Nifty rebound: What's driving today's gains, and will the recovery last?Despite today's rally, the stock market remains under pressure due to several factors, especially the impact of Q3 earnings and sustained selling by foreign institutional investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quadrant-future-tek-shares-price-listing-makes-strong-debut-lists-at-27-percent-premium-nse-bse-2664408-2025-01-14",
      "headline": "Quadrant Future Tek listing: Shares make strong D-Street debut at 27% premium Quadrant Future Tek stock: The stock opened at Rs 370 on the NSE, reflecting a 27.5% premium over its IPO price of Rs 290. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-rebound-sensex-nifty-gain-in-early-trade-hcltech-down-9-percent-2664400-2025-01-14",
      "headline": "Stock market rebound: Sensex, Nifty gain in early trade; HCLTech down 9% The S&P BSE Sensex gained 408.52 points to 76,738.53, while the NSE Nifty50 110.05 points to 23,196.00 as of 9:30 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tiktok-us-may-go-to-tesla-ceo-elon-musk-as-china-explores-potential-sale-report-2664398-2025-01-14",
      "headline": "TikTok US may go to Elon Musk as China explores potential sale: ReportChinese authorities want to keep TikTok under the control of its parent company, ByteDance. One potential scenario involves Elon Musk's social media platform, X, acquiring TikTok US and running it jointly with ByteDance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-are-bse-nse-open-on-tuesday-january-14-for-pongal-makar-sankranti-2025-2664384-2025-01-14",
      "headline": "Stock market holiday: Are BSE, NSE open on January 14, Makar Sankranti?The holiday schedules for the BSE and NSE are determined based on national holidays and key religious and cultural festivals that are widely observed across the country."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-hoax-calls-accused-linked-to-political-party-claims-cops-2664564-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP vs AAP on Delhi bomb hoax emails as cops reveal NGO connectDelhi Police has uncovered key details while investigating hoax bomb emails sent to over 400 schools, which caused widespread alarm among students and disrupted classes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-to-evaluate-india-coach-gautam-gambhir-future-champions-trophy-2664624-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rift in Team India? BCCI to evaluate Gambhir's future post Champions TrophyGautam Gambhir's role as head coach is under scrutiny as India's Champions Trophy performance could determine his future, amid tensions over his efforts to dismantle the 'superstar culture' within the team. Concerns have arisen due to India's recent poor results and speculated rifts with key players, leading to a review by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-slum-slum-dwellers-population-housing-aap-arvind-kejriwal-bjp-congress-rahul-gandhi-2664539-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the way to power in Delhi is through its slumsAhead of the Delhi Assembly election, the AAP, BJP, and Congress have sharpened their pitch on slums and are courting the city's over three million slum dwellers. The residents of the 675 slums in Delhi form around 15% of Delhi's electorate, and any swing in their voting pattern will impact the fortunes of the parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-summon-meta-for-disinformation-parliamentary-panel-chief-after-mark-zuckerbergs-2024-lok-sahba-polls-claim-2664548-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meta in trouble after Zuckerberg's election claim, faces parliamentary summonsMeta boss Mark Zuckerberg had suggested that most incumbent governments worldwide, including India, were defeated in elections held post-Covid-19. His statement triggered a massive political row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/first-full-moon-of-2025-to-devour-mars-tonight-it-happens-once-in-14-years-2664528-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "First full Moon of 2025 to devour Mars. You can see it with your eyesThis lunar occultation is a rare spectacle; observers in specific locations only can expect to witness this event that happens only about once every 14 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-psychologist-arrested-raping-blackmailing-girls-counselling-camps-2664666-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Psychologist arrested for raping 50 girls in 15 years under guise of counsellingThe psychologist, identified as Rajesh Dhoke, a father of two, lured young girls under the guise of providing counselling at residential camps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-wrap-rublev-sakkari-crash-out-jabeur-medvedev-march-ahead-2664702-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rublev, Sakkari crash out; Jabeur, Medvedev march aheadAustralian Open 2025: Russian ninth seed Andrey Rublev and Greek Maria Sakkari crashed out after first-round losses while Ons Jabeur, Daniil Medvedev, and Alex de Minaur marched ahead on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/brad-pitt-dating-scam-french-woman-loses-rs-7-crore-angelina-jolie-divorce-2664640-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "French woman loses Rs 7 crore after dating scammer pretending to be Brad PittThe ordeal began in February 2023 when Anne, an interior designer, received a message on social media from someone claiming to be Brad Pitt's mother. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-2664662-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli, Rishabh Pant named as probables in Delhi squad for Ranji TrophyStar India batter Virat Kohli and Rishabh Pant have been named as probables in Delhi's squad for the next round of the Ranji Trophy 2024-25"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-ncp-rift-maha-vikas-aghadi-mumbai-civic-polls-india-bloc-future-2664543-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "INDIA for national polls: Sharad Pawar fuels MVA rift talk ahead of civic pollsSharad Pawar on Tuesday hinted that the party was likely to follow in the footsteps of Uddhav Sena and contest the Mumbai civic polls alone. The remark comes as the MVA is smarting from its Assembly election drubbing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-arvind-kejriwal-india-bloc-tensions-delhi-assembly-elections-2664301-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi's 'Paris wali Dilli' dig at Arvind Kejriwal as INDIA rift widensEscalating his attack on Arvind Kejriwal, Congress MP Rahul Gandhi visited a stream strewn with garbage in Delhi and took a jibe at the AAP chief's promise of making the national capital clean like Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-rahul-gandhi-arvind-kejriwal-end-for-opposition-india-bloc-2664610-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi vs Arvind Kejriwal: Is this beginning of the end for INDIA bloc?While Congress and the AAP were unnatural allies to begin with, the fallout ahead of the Delhi elections could have a ripple effect on opposition unity. The tremors have also been felt far away in Maharashtra, with the civic polls around the corner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/photos-assams-ancient-burial-mounds-charaideo-moidams-unesco-world-heritage-certificate-site-list-2664655-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Charaideo Moidams: Assam's ancient burial mounds get UNESCO heritage certificateAssam's Charaideo Moidams, ancient burial mounds of the Ahom dynasty, received the UNESCO World Heritage certificate on Tuesday. It is the first cultural site from Northeast India on the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/why-isro-might-have-to-wait-till-march-to-dock-spadex-satellites-2664626-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro might have to wait till March to dock SpaDeX satellites if...After several postponements, the agency is now analysing sensor data from January 11, when the two satellites, just three meters apart and aligned for docking, were triggered into safe mode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-hits-mutual-funds-should-you-continue-sips-or-cash-in-2664671-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are mutual funds risky in a turbulent stock market? Here's all you need to knowIs market turbulence shaking your mutual fund confidence? Find out why experts urge patience and see volatility as a buying opportunity, not a cause for alarm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mahakumbh-mela-2025-steve-jobs-wife-falls-unwell-2664545-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Steve Jobs's wife falls ill at Maha Kumbh Mela: Never experienced such crowdDespite her illness, Laurene Powell Jobs is determined to take part in the ritual of taking a holy dip at the Sangam, the confluence of the Ganga, Yamuna, and mythical Saraswati rivers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/watch-jailer-2-announcement-promo-video-rajinikanth-returns-to-rule-with-nelson-and-anirudh-2664677-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch Jailer 2 announcement: Rajinikanth returns to rule with Nelson and AnirudhIt's Rajinikanth's reign all over as Nelson Dilipkumar announced Jailer 2 with the superstar. The film also features music by Anirudh Ravichander.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-police-44-arrested-in-dalit-girl-serial-sexual-assault-case-red-corner-notice-against-two-absconding-abroad-2664656-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "44 men arrested for raping Kerala Dalit girl for five years, 2 accused abroadKerala Police's Special Investigation Team has arrested 44 people accused of raping a Dalit girl for over five years, with 15 more suspects yet to be caught. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-jammu-and-kashmir-pok-pakistan-cross-border-terrorism-omar-abdullah-2664605-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Crown jewel of India's forehead: Rajnath Singh says J&K incomplete without POKDefence Minister Rajnath Singh said that Jammu and Kashmir is incomplete without Pakistan Occupied Kashmir (POK) and stressed that POK is \"nothing more than a foreign territory\" for Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-visa-programme-us-companies-hiring-remotely-avoid-complex-costly-process-foreign-workers-indians-tech-2664509-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "To beat H-1B visa challenges, US companies are turning to remote hiringAmid the debate over the H-1B visa programme as Donald Trump is set to take over as the American President, companies in the US are increasingly turning to remote hiring to avoid the complex and costly process of securing H-1B visas for foreign workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-nexon-2025-launched-check-complete-details-about-brezza-venue-sonet-rival-2664664-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tata Nexon 2025 launched, check complete details about Brezza, Venue, Sonet-rivalTata Punch 2025 takes on the Maruti Suzuki Brezza, Hyundai Venue, Kia Sonet and Mahindra XUV 3XO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nesippaya-movie-review-aditi-shankar-akash-murali-vishnuvardhan-2664657-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nesippaya review: Aditi Shankar, Akash Murali's suspense drama lacks thrillReleased-Tue Jan 14, 2025Nesippaya movie review: Director Vishnuvardhan's Nesippaya, starring Aditi Shankar and Akash Murali, is a suspense drama. The film is devoid of thrill and has very little going for it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rates-coach-andy-murray-first-impression-australian-open-nishesh-basavareddy-2664572-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All new coaching pods a hit? Novak Djokovic rates Andy Murray's first impressionNovak Djokovic flaunted his partnership with Andy Murray at the Australian Open amid the debut of coaching pods, an interesting innovation allowing closer coach-player communication. While Djokovic embraced the setup, other players, including Aryna Sabalenka, expressed concerns about the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-amit-shah-flies-kite-on-makar-sankranti-in-ahmedabad-2664604-2025-01-14?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: Amit Shah takes to the skies with kite flying on Makar SankrantiUnion Home Minister Amit Shah and Gujarat Chief Minister Bhupendra Patel celebrated Makar Sankranti by flying kites on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chitrangda-singh-and-nawazuddin-siddiqui-to-star-in-raat-akeli-hai-sequel-stmp-2664708-2025-01-14",
      "headline": "Actor Chitrangda Singh joins Nawazuddin Siddiqui in Raat Akeli Hai sequelThe much-anticipated sequel to the Netflix thriller Raat Akeli Hai brings together Nawazuddin Siddiqui and Chitrangda Singh in lead roles. Fans are eagerly waiting to see how the new pairing unfolds in this suspense-driven narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/nora-fatehi-teams-up-swalla-singer-jason-derulo-for-new-track-snake-2664694-2025-01-14",
      "headline": "Nora Fatehi teams up with Swalla singer Jason Derulo for new track SnakeNora Fatehi and Jason Derulo unveiled the poster for their upcoming track, Snake. The track will release on January 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/watch-jailer-2-announcement-promo-video-rajinikanth-returns-to-rule-with-nelson-and-anirudh-2664677-2025-01-14",
      "headline": "Watch Jailer 2 announcement: Rajinikanth returns to rule with Nelson and AnirudhIt's Rajinikanth's reign all over as Nelson Dilipkumar announced Jailer 2 with the superstar. The film also features music by Anirudh Ravichander.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/prince-narula-yuvika-chaudhary-celebrate-first-lohri-with-newborn-daughter-ikleen-2664668-2025-01-14",
      "headline": "Pics: Prince Narula, Yuvika Chaudhary celebrate first Lohri with newborn daughterPrince Narula and Yuvika Chaudhary shared adorable pictures from their Lohri celebration along with their newborn daughter."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saqib-mahmood-england-pacer-pakistan-origin-visa-delay-india-t20i-series-abu-dhabi-camp-2664709-2025-01-14",
      "headline": "Pakistan-origin England pacer faces delay in securing Indian visa: ReportSaqib Mahmood's visa delays have kept him from joining England's training camp in Abu Dhabi, but the ECB remains hopeful he will join the squad in time for the T20 series against India, continuing his comeback after injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-wrap-rublev-sakkari-crash-out-jabeur-medvedev-march-ahead-2664702-2025-01-14",
      "headline": "Rublev, Sakkari crash out; Jabeur, Medvedev march aheadAustralian Open 2025: Russian ninth seed Andrey Rublev and Greek Maria Sakkari crashed out after first-round losses while Ons Jabeur, Daniil Medvedev, and Alex de Minaur marched ahead on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-2664662-2025-01-14",
      "headline": "Virat Kohli, Rishabh Pant named as probables in Delhi squad for Ranji TrophyStar India batter Virat Kohli and Rishabh Pant have been named as probables in Delhi's squad for the next round of the Ranji Trophy 2024-25"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-gabriel-jesus-out-lengthy-layoff-suspected-acl-injury-2664644-2025-01-14",
      "headline": "Arsenal's Gabriel Jesus faces lengthy layoff with suspected ACL injuryArsenal's Brazilian forward Gabriel Jesus is facing an extended period out of action after reportedly sustaining a suspected anterior cruciate ligament (ACL) injury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-suggests-ending-optional-practice-sessions-after-recent-test-debacle-2664629-2025-01-14",
      "headline": "Sunil Gavaskar suggests ending optional practice sessions after recent Test debacleLegendary India cricketer Sunil Gavaskar has suggested the Indian team to do away with the optional practice sessions for players in the aftermath of back-to-back series loss against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-should-play-ranji-trophy-take-inspiration-from-mumbai-players-delhi-cricket-secretary-2664628-2025-01-14",
      "headline": "Like Mumbai players, Kohli should play Ranji: Delhi cricket secretaryDDCA secretary Ashok Sharma urged Virat Kohli to participate in Delhi's Ranji Trophy matches, suggesting he take inspiration from Mumbai players like Rohit Sharma, who recently trained with Mumbai's squad despite not confirming his match participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-to-evaluate-india-coach-gautam-gambhir-future-champions-trophy-2664624-2025-01-14",
      "headline": "Rift in Team India? BCCI to evaluate Gambhir's future post Champions TrophyGautam Gambhir's role as head coach is under scrutiny as India's Champions Trophy performance could determine his future, amid tensions over his efforts to dismantle the 'superstar culture' within the team. Concerns have arisen due to India's recent poor results and speculated rifts with key players, leading to a review by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-available-ranji-trophy-punjab-vs-karnataka-reports-border-gavaskar-troph-2664619-2025-01-14",
      "headline": "Shubman Gill to join Punjab Ranji Trophy side for Karnataka clash: ReportsShubman Gill is reportedly set to join the Punjab Ranji Trophy side for their upcoming crucial clash against Karnataka, marking his return to domestic cricket as he looks to regain form following recent challenges on the international stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-wasim-akram-unveils-the-iconic-white-jacket-for-champions-trophy-2025-2664578-2025-01-14",
      "headline": "Watch: Wasim Akram unveils the iconic white jacket for Champions Trophy 2025Legendary Pakistan fast bowler Wasim Akram unveiled the iconic white jacket for the ICC Champions Trophy 2025 set to begin from February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-top-20-in-icc-rankings-maiden-india-century-vs-ireland-rajkot-2664607-2025-01-14",
      "headline": "Jemimah Rodrigues rises to top-20 in ICC rankings after maiden century vs IrelandJemimah Rodrigues' maiden ODI century propelled her into the ICC top-20 rankings, marking a career-defining moment in India's commanding series against Ireland, as rising stars contributed to the team's historic highest-ever total in women's ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/christopher-nkunku-chelsea-bayern-munich-swap-deal-mathys-tel-transfer-news-2664592-2025-01-14",
      "headline": "Chelsea's Christopher Nkunku eager to complete Bayern Munich move: ReportsChristopher Nkunku's potential return to Bayern Munich through a high-profile swap deal with Chelsea for Mathys Tel has sparked widespread interest, as both clubs explore a transformative move during the January transfer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-to-evaluate-india-coach-gautam-gambhir-future-champions-trophy-2664624-2025-01-14",
      "headline": "Rift in Team India? BCCI to evaluate Gambhir's future post Champions TrophyGautam Gambhir's role as head coach is under scrutiny as India's Champions Trophy performance could determine his future, amid tensions over his efforts to dismantle the 'superstar culture' within the team. Concerns have arisen due to India's recent poor results and speculated rifts with key players, leading to a review by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-available-ranji-trophy-punjab-vs-karnataka-reports-border-gavaskar-troph-2664619-2025-01-14",
      "headline": "Shubman Gill to join Punjab Ranji Trophy side for Karnataka clash: ReportsShubman Gill is reportedly set to join the Punjab Ranji Trophy side for their upcoming crucial clash against Karnataka, marking his return to domestic cricket as he looks to regain form following recent challenges on the international stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-wasim-akram-unveils-the-iconic-white-jacket-for-champions-trophy-2025-2664578-2025-01-14",
      "headline": "Watch: Wasim Akram unveils the iconic white jacket for Champions Trophy 2025Legendary Pakistan fast bowler Wasim Akram unveiled the iconic white jacket for the ICC Champions Trophy 2025 set to begin from February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-top-20-in-icc-rankings-maiden-india-century-vs-ireland-rajkot-2664607-2025-01-14",
      "headline": "Jemimah Rodrigues rises to top-20 in ICC rankings after maiden century vs IrelandJemimah Rodrigues' maiden ODI century propelled her into the ICC top-20 rankings, marking a career-defining moment in India's commanding series against Ireland, as rising stars contributed to the team's historic highest-ever total in women's ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/christopher-nkunku-chelsea-bayern-munich-swap-deal-mathys-tel-transfer-news-2664592-2025-01-14",
      "headline": "Chelsea's Christopher Nkunku eager to complete Bayern Munich move: ReportsChristopher Nkunku's potential return to Bayern Munich through a high-profile swap deal with Chelsea for Mathys Tel has sparked widespread interest, as both clubs explore a transformative move during the January transfer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-annabel-sutherland-adjudged-icc-players-of-the-month-for-december-2664585-2025-01-14",
      "headline": "Jasprit Bumrah beats Pat Cummins to win ICC Player of Month for DecemberIndia fast bowler Jasprit Bumrah and Australia all-rounder Annabel Sutherland were named ICC men's and women's players of the month respectively for December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rates-coach-andy-murray-first-impression-australian-open-nishesh-basavareddy-2664572-2025-01-14",
      "headline": "All new coaching pods a hit? Novak Djokovic rates Andy Murray's first impressionNovak Djokovic flaunted his partnership with Andy Murray at the Australian Open amid the debut of coaching pods, an interesting innovation allowing closer coach-player communication. While Djokovic embraced the setup, other players, including Aryna Sabalenka, expressed concerns about the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-pacer-ihsanullah-retires-from-psl-after-draft-snub-2664561-2025-01-14",
      "headline": "Pakistan pacer Ihsanullah retires from PSL after draft snub, makes bizarre claimPakistan's pace sensation Ihsanullah, who rose to prominence with 22 wickets in PSL 8, has retired from the Pakistan Super League after being overlooked in the PSL 10 draft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-1985-audi-100-in-raymond-supercar-meet-2664546-2025-01-14",
      "headline": "Ravi Shastri rewinds clock, flaunts his famous 1985 Audi in supercar meetFormer India captain Ravi Shastri flaunted his 1985 Audi 100 at a supercar meet in Mumbai. Shastri, who had won the Audi 100 in the Benson & Hedges World Championship of Cricket, said that he was thrilled to drive the machine after many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-vs-kasidit-samrej-high-praise-joke-melbourne-crowd-2664544-2025-01-14",
      "headline": "Money, girls, casino: Inimitable Medvedev praises opponent after tough openerAustralian Open 2025: Fifth seed Daniil Medvedev was at his inimitable best when he praised Kasidit Samrej, who dragged the Russian to five sets in their opening-round clash on Tuesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-odi-australia-extend-women-ashes-lead-win-over-england-2664531-2025-01-14",
      "headline": "2nd ODI: Australia extend Women's Ashes lead with 21-run win over EnglandAustralia extended their lead in the Women's Ashes with a 21-run win over England in a thrilling second ODI at the Junction Oval in Melbourne.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-smashes-camera-breaks-racquet-in-frustration-2664507-2025-01-14",
      "headline": "Watch: Daniil Medvedev smashes camera, breaks racquet in frustrationRussian tennis player Daniil Medvedev had an on-court meltdown in the first round of the Australian Open. Playing against Kasidit Samrej, Medvedev smashed his racquet into the net camera.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trains-mumbai-camp-rediscover-form-champions-trophy-2664495-2025-01-14",
      "headline": "Watch: Rohit Sharma trains with Mumbai camp ahead of Champions TrophyIndia captain Rohit Sharma practised with the Mumbai team on Tuesday as the side geared up for the resumption of the Ranji Trophy on January 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-vs-kasidit-samrej-high-praise-joke-melbourne-crowd-2664544-2025-01-14",
      "headline": "Money, girls, casino: Inimitable Medvedev praises opponent after tough openerAustralian Open 2025: Fifth seed Daniil Medvedev was at his inimitable best when he praised Kasidit Samrej, who dragged the Russian to five sets in their opening-round clash on Tuesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-odi-australia-extend-women-ashes-lead-win-over-england-2664531-2025-01-14",
      "headline": "2nd ODI: Australia extend Women's Ashes lead with 21-run win over EnglandAustralia extended their lead in the Women's Ashes with a 21-run win over England in a thrilling second ODI at the Junction Oval in Melbourne.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-smashes-camera-breaks-racquet-in-frustration-2664507-2025-01-14",
      "headline": "Watch: Daniil Medvedev smashes camera, breaks racquet in frustrationRussian tennis player Daniil Medvedev had an on-court meltdown in the first round of the Australian Open. Playing against Kasidit Samrej, Medvedev smashed his racquet into the net camera.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trains-mumbai-camp-rediscover-form-champions-trophy-2664495-2025-01-14",
      "headline": "Watch: Rohit Sharma trains with Mumbai camp ahead of Champions TrophyIndia captain Rohit Sharma practised with the Mumbai team on Tuesday as the side geared up for the resumption of the Ranji Trophy on January 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sam-konstas-controversy-ian-chappell-india-vs-england-test-series-2664494-2025-01-14",
      "headline": "Virat Kohli has to stop his senseless antics: Ian Chappell blasts batterFormer Australia player Ian Chappell has blasted Virat Kohli for his antics in the Border-Gavaskar Trophy. Chappell slammed Kohli for his bust-up with 19-year-old Sam Konstas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-emma-raducanu-elena-rybakina-first-round-wins-2664480-2025-01-14",
      "headline": "Emma Raducanu, Elena Rybakina advance with contrasting winsAustralian Open 2025: Sixth seed Elena Rybakina stormed into the second round with a comfortable win over 16-year-old local wildcard Emerson Jones. Emma Raducanu, who was back in action after three months, looked wobbly in her first-round win. te"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/bcci-to-take-strict-measures-against-indian-team-after-australia-series-loss-2664444-2025-01-14",
      "headline": "BCCI to take strict measures against Indian team after Australia series lossThe BCCI plans to implement stricter policies for the Indian cricket team following their disappointing tour of Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-bcci-review-meeting-captaincy-rumours-rajeev-shukla-2664423-2025-01-14",
      "headline": "Rohit insisted on remaining Test captain? BCCI vice-president rubbishes reportBCCI vice-president Rajeev Shukla rubbished rumours of a rift in the Indian dressing room and a report that claimed Rohit Sharma wanted to retain Test captaincy despite the Border-Gavaskar Trophy loss. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}