{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-keeps-small-savings-rates-including-ppf-and-nsc-steady-2795829-2025-09-30",
      "headline": "Government keeps PPF, NSC and other small savings rates unchanged. Check hereThe government has kept interest rates unchanged for key small savings schemes, including PPF and NSC, for the upcoming quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lg-electronics-india-rs-15000-crore-ipo-to-open-on-october-7-check-details-2795771-2025-09-30",
      "headline": "LG Electronics India's Rs 15,000 crore IPO to open on October 7. Check detailsThe much-anticipated IPO of LG Electronics India, worth Rs 15,000 crore, is scheduled to open on October 7. Here's everything you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buffet-vs-la-carte-all-you-can-eat-bbq-nation-the-gt-road-profit-business-model-2795755-2025-09-30",
      "headline": "Behind the buffet: How restaurants profit from all-you-can-eat deals'All you can eat.' That is how buffets work. But then how do famous buffets such as BBQ Nation, The GT Road, and Pirates of Grill, with prices ranging from Rs 900-1400, make a profit serving unlimited food?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-and-silver-lead-the-way-as-investors-seek-stability-says-expert-bullion-boom-2795753-2025-09-30",
      "headline": "Gold and silver lead the way as investors seek stability, says expertWith stock market volatility unsettling investors, many are turning to gold and silver for safety. Experts say the renewed interest in precious metals reflects a broader search for stability amid uncertain conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-rbi-mpc-decision-auto-fmcg-psu-banking-shares-2795726-2025-09-30",
      "headline": "Sensex, Nifty fall for 8th day in a row ahead of RBI MPC decisionThe S&P BSE Sensex lost 97.32 points to close at 80,267.62, while the NSE Nifty50 was down by 23.80 points to end at 24,611.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-staying-consistent-matters-more-than-timing-the-market-says-expert-2795674-2025-09-30",
      "headline": "Why staying consistent matters more than timing the market, says expertWhile market swings grab attention, experts insist that consistent investing, rather than trying to predict peaks and dips, is what helps investors achieve reliable growth over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-made-in-india-founder-sridhar-vembu-arattai-free-of-cost-whatsapp-competition-2795665-2025-09-30",
      "headline": "Is Zoho made in India? Founder Sridhar Vembu answersSridhar Vembu, founder and former CEO of Zoho Corporation, has addressed concerns about where Zoho products are developed, where user data is stored, and the pricing of its messaging service, Arattai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-reasons-why-gold-hit-a-record-high-today-should-you-buy-2795630-2025-09-30",
      "headline": "5 reasons why gold hit a record high today. Should you buy?Today, gold touched a historic high, fuelled by global uncertainty and market trends. We break down five key factors behind the rise, and whether it's a smart buy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-layoff-job-cut-staff-fluidity-list-it-shares-free-fall-h1b-visa-decline-orders-report-2795595-2025-09-30",
      "headline": "TCS shares slide as uncertainty grows over job cuts, staff report fluidity listTCS stock has fallen 4.65% in the past five days and 6.72% in the past month. Over the past year, it has lost nearly a third of its value, with reports of large-scale layoffs creating fresh panic among employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-post-office-savings-schemes-like-ppf-and-nsc-witness-a-rate-cut-2795557-2025-09-30",
      "headline": "Will Post Office Savings Schemes like PPF and NSC witness a rate cut?With the Finance Ministry set to review small savings rates at the end of September, many investors are wondering if schemes like PPF and NSC will see a cut. The RBI's recent repo rate reductions have only added to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/where-to-invest-in-psu-bank-nbfcs-analysts-pick-top-stocks-bajaj-pbn-housing-2795541-2025-09-30",
      "headline": "Where to invest in PSU banks and NBFCs? Analysts pick top stocksPSU banks remain one of the most attractive options in the current market. With the Reserve Bank of India (RBI) scheduled to meet soon, market watchers are keeping a close eye on any rate-related decisions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposal-new-rules-gold-silver-loans-easy-borrowing-tighten-credit-checks-2795519-2025-09-30",
      "headline": "New RBI proposals to make borrowing easier, tighten credit checksAnnounced through seven directions and circulars on September 29, 2025, three of these changes will take effect from October 1, while four others have been released for public consultation until October 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-250-points-nifty-above-24500-bel-gains-1-percent-2795491-2025-09-30",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; BEL gains 1%The S&P BSE Sensex was up 299.85 points to 80,664.79, while the NSE Nifty50 added 71 points to 24,705.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-wework-india-gmp-listing-gains-price-band-important-dates-should-you-invest-2795474-2025-09-30",
      "headline": "Tata Capital vs WeWork India: Which IPO should you invest in?Two names drawing strong attention this week are Tata Capital Ltd and WeWork India Management Ltd, both preparing to make their market debuts in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-new-rules-claim-settlement-of-deceased-account-holders-will-nominee-15-days-penalty-2795362-2025-09-29",
      "headline": "RBI simplifies process for claim settlement of deceased account holdersThe new framework by the Reserve Bank of India (RBI) has been introduced to remove the confusion caused by different practices followed by banks earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-the-8th-pay-commission-be-implemented-here-is-what-you-should-know-2795162-2025-09-29",
      "headline": "When will the 8th Pay Commission be implemented? Here's what you should knowThe Pay Commission affects much more than basic salaries. It influences allowances, pensions, and long-term financial security. In times of rising inflation, employees and pensioners are especially keen for the Commission's work to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-sridhar-vembu-whatsapp-alternative-piyush-goyal-radhika-gupta-2795288-2025-09-29",
      "headline": "From CEOs to ministers, support pours in for Zoho's ArattaiThe rise of Arattai has caught the attention of users, industry leaders, and public figures, many of whom have shared their support and congratulations for Zoho and its founder, Sridhar Vembu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/who-should-invest-in-tata-capital-ipo-market-expert-weighs-in-2795243-2025-09-29",
      "headline": "Who should invest in Tata Capital IPO? Market expert weighs inThe Tata Capital IPO is around the corner, and many investors are wondering whether it's the right bet. A market expert has broken down who should consider subscribing and who may want to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-flat-investors-turn-cautious-us-india-trade-deal-rbi-mpc-2795219-2025-09-29",
      "headline": "Sensex, Nifty close flat as investors turn cautious over US-India trade dealThe S&P BSE Sensex closed 61.52 points lower to end at 80,364.94, while the NSE Nifty50 lost 19.80 points to close at 24,634.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moodys-rating-india-baa3-stable-outlook-trump-tariff-us-trade-talk-credit-agency-2795201-2025-09-29",
      "headline": "Moody's keeps India's Baa3 rating unchanged with stable outlookMoody's said India's strengths include its large and fast-growing economy, a sound external position, and a stable domestic financing base for fiscal deficits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/beyond-metros-how-festive-cheer-boosts-real-estate-demand-in-tier-2-cities-2795122-2025-09-29",
      "headline": "Beyond metros: How festive cheer boosts real estate demand in Tier-2 citiesWhile metros grab most of the headlines, smaller cities are quietly stealing the show. With festivals around the corner, Tier-2 cities are witnessing a strong spike in property interest and sales."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lufthansa-layoffs-german-airline-job-cut-4000-people-struggle-economy-recession-2795123-2025-09-29",
      "headline": "Lufthansa layoffs: German airline plans 4,000 job cuts over next 5 yearsThe job cuts will mainly affect administrative roles rather than operational positions such as pilots, cabin crew or ground staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-epfos-new-ecr-system-simplify-return-filing-for-employers-2795060-2025-09-29",
      "headline": "Does EPFO's new ECR system simplify return filing for employers?The Employees' Provident Fund Organisation (EPFO) has launched a revamped electronic challan-cum-return (ECR) system, aiming to make return filing easier and more accurate for employers. But does it really simplify the process?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-rbi-announce-a-rate-cut-in-the-upcoming-mpc-meeting-here-what-to-expect-2795045-2025-09-29",
      "headline": "Will RBI announce a rate cut in the upcoming MPC meeting? Here's what to expectThe Reserve Bank of India's Monetary Policy Committee begins its three-day meeting to decide whether it is time to cut interest rates or hold steady. With inflation easing and growth signals mixed, all eyes are on what the central bank does next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/experts-reveal-best-festive-stocks-to-buy-amid-global-uncertainty-banking-fmcg-auto-2795015-2025-09-29",
      "headline": "Experts reveal best festive stocks to buy amid global uncertaintyConcerns over global trade talks with the US and new protectionist measures have weighed on investor sentiment"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-142-points-higher-nifty-above-24500-bel-gains-2-percent-2794982-2025-09-29",
      "headline": "Sensex opens 142 points higher, Nifty above 24,500; BEL gains 2%The S&P BSE Sensex added 114.15 points to 80,540.61, while the NSE Nifty50 gained 36.45 points to 24,691.15 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-ipo-stock-market-debut-founder-sridhar-vembu-says-listing-clash-company-vision-bharat-2794978-2025-09-29",
      "headline": "Arattai success proves why Zoho won't rush going public, says Sridhar VembuIn a post on X, Zoho founder Sridhar Vembu said that some of Zoho's key projects, such as its messaging app Arattai, would have never been built under the financial pressures faced by public companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-gst-exemption-boosts-life-insurance-inflows-1100-crore-2794971-2025-09-29",
      "headline": "LIC sees Rs 1,100 crore inflows on Day 1 of GST-free life cover: ReportLife Insurance Corporation of India (LIC) collected over Rs 1,100 crore in inflows on the first day following the removal of GST on individual life insurance policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-sector-issues-india-mis-selling-claim-rejection-irdai-report-star-health-care-health-neil-borate-2794566-2025-09-29",
      "headline": "Insured, but where is the protection?Despite the recent reform of zero GST, insurance remains an opaque industry where customers struggle to understand what they're actually buying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/home-buying-festive-season-griha-pravesha-important-documents-real-estate-legal-checks-2794915-2025-09-29",
      "headline": "Buying home this festive season? Top things to check before Griha PraveshaFamilies often see this period as the most auspicious time to make a big investment like a home, but experts warn that it is also the stage when due diligence becomes most important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirav-modis-brother-in-law-maiank-mehta-pardoned-in-rs-13000-crore-pnb-scam-case-2794352-2025-09-27",
      "headline": "Nirav Modi's brother-in-law Maiank Mehta pardoned in Rs 13,000 crore PNB scam caseA special CBI court granted pardon to Maiank Mehta, brother-in-law of fugitive diamantaire Nirav Modi, in the Rs 13,000 crore Punjab National Bank fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-733-points-nifty-below-24700-pharma-it-stocks-hit-hard-2793901-2025-09-26",
      "headline": "Sensex tumbles 733 points as pharma, IT stocks hitThe sell-off came after the United States announced a steep 100% tariff on imports of branded and patented pharmaceutical products, effective October 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-air-passengers-rise-to-1317-lakh-in-august-2025-amid-rising-costs-icra-report-2793857-2025-09-26",
      "headline": "Indian air passengers rise to 131.7 lakh in August 2025 amid rising costs: ReportIndia's aviation sector is bouncing back, but the journey isn't without turbulence. Rising fuel costs, operational challenges, and financial pressures are testing airlines, even as passenger traffic shows steady growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-800-points-nifty-fall-pharma-it-auto-fmcg-shares-trump-announcement-2793865-2025-09-26",
      "headline": "Sensex tanks 800 points: Why is stock market falling today?By 2:37 pm, the S&P BSE Sensex had lost 782.71 points to trade at 80,376.97, while the NSE Nifty50 slipped 247.10 points to 24,643.75. Both indices were on track to end the week in negative territory."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/john-mayer-make-mumbai-debut-next-year-calls-india-long-time-dream-2795741-2025-09-30",
      "headline": "John Mayer to make Mumbai debut next year, calls India a long-time dream Singer John Mayer to perform live in Mumbai for the first time in January next year. The event at Mahalaxmi Racecourse is produced and promoted by BookMyShow Live. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/confidence-queen-k-drama-review-heist-thriller-character-drama-2795820-2025-09-30",
      "headline": "Confidence Queen review: A stylish heist drama that balances wit and suspenseRelease Date:Sat Sep 06, 2025 Confidence Queen is a stylish K-drama that blends heist thrills with deep emotional storytelling. The show's clever scams and strong characters keep viewers hooked despite minor plot distractions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lahore-1947-sunny-deol-resumes-shoot-after-aamir-khan-suggests-changes-2795797-2025-09-30",
      "headline": "Lahore 1947: Sunny Deol resumes shoot after Aamir Khan suggests changes Actor Sunny Deol returned to shoot the final schedule of 'Lahore 1947' in Punjab following Aamir Khan's creative input. The film's release has been postponed to 2026 to ensure superior quality and vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-what-expect-from-dhanush-kriti-sanon-film-2795788-2025-09-30",
      "headline": "Tere Ishk Mein: What to expect from Dhanush and Kriti Sanon's film Filmmaker Aanand L Rai and Dhanush reunite for the romantic drama 'Tere Ishk Mein'. The teaser hints at a passionate love story with soulful music and new character dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-karimi-hospitalised-my-last-heartbeat-turned-out-to-be-exhaustion-2795782-2025-09-30",
      "headline": "Actor Mandana Karimi hospitalised: My last heartbeat turned out to be exhaustion Actor Mandana Karimi was hospitalised after fearing she had felt her last heartbeat. Extensive tests later confirmed her condition was caused by extreme exhaustion, dehydration, and stress rather than a heart problem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/avika-gor-marries-long-time-boyfriend-milind-chandwani-on-pati-patni-aur-panga-2795792-2025-09-30",
      "headline": "Avika Gor marries long-time boyfriend Milind Chandwani on Pati, Patni Aur Panga Actor Avika Gor and her long-time boyfriend Milind Chandwani are now married. Their wedding took place on the sets of 'Pati Patni Aur Panga.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-fees-payment-news-2795770-2025-09-30",
      "headline": "Kantara Chapter 1: Here's what Rishab Shetty charged for the film Ahead of 'Kantara: Chapter 1', the details of actor-director Rishab Shetty's paycheque are out. The film is reportedly made on a budget of Rs 125 crore and is set to release in cinemas on October 2, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-or-kriti-sanon-thamma-writer-niren-bhatt-hints-at-werewolf-cameo-2795751-2025-09-30",
      "headline": "Varun Dhawan or Kriti Sanon? Thamma writer Niren Bhatt hints at werewolf cameo Writer Niren Bhatt teased a surprise regarding the identity of the werewolf in the upcoming horror-comedy 'Thamma'. The Maddock Horror Comedy Universe nears a major character crossover by introducing a larger, more powerful werewolf and unresolved questions for viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-clickbait-headlines-negativity-stepping-back-film-industry-2795769-2025-09-30",
      "headline": "Anurag Kashyap: Was feeling isolated, my peers didn't want to be seen with me Anurag Kashyap opens up about his frustration with clickbait culture and negativity in the film industry. He reveals how this disillusionment has led him to step away from cinema and focus on what he truly loves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/param-punjab-that-girl-whos-changing-the-game-with-raw-musical-talent-2795716-2025-09-30",
      "headline": "Param: Punjab's 'That Girl' who's changing the game with raw musical talent Paramjeet Kaur, a 19-year-old from Punjab, is making waves as the first authentic female rapper in Punjabi hip-hop. Her viral debut track challenges industry norms and inspires many across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/single-salma-trailer-huma-qureshi-stuck-in-quirky-love-triangle-with-shreyas-talpade-sunny-singh-2795757-2025-09-30",
      "headline": "Single Salma trailer: Huma stuck in quirky love triangle with Shreyas, Sunny Singh The trailer of Huma Qureshi's upcoming film 'Single Salma' is finally out. The movie also stars Shreyas Talpade and Sunny Singh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-parties-with-seventeen-mingyu-for-cxm-unit-debut-2795636-2025-09-30",
      "headline": "BTS' Jungkook parties with SEVENTEEN's Mingyu for CXM unit debut BTS' Jungkook attended SEVENTEEN Mingyu and S Coups' listening party for CXM's debut mini-album. Multiple K-pop stars, including members of the '97-liners' group, gathered to support the new unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/chainsaw-man-the-movie-reze-arc-review-a-tongue-biting-actioner-with-quirky-romance-2795679-2025-09-30",
      "headline": "Chainsaw Man Reze Arc review: A 'tongue-biting' actioner with quirky romanceRelease Date:Tue Sep 30, 2025 'Chainsaw Man The Movie Reze Arc' is a Japanese anime film based on the manga series of the same name by Tatsuki Fujimoto. The film follows Denji, aka Chainsaw Man, who develops a liking for two girls, Makima and Reze, before one of them goes \"boom.\" Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-reviews-pawan-kalyan-they-call-him-og-at-par-with-hollywood-2795683-2025-09-30",
      "headline": "Chiranjeevi reviews Pawan Kalyan's They Call Him OG: On par with Hollywood Actor Pawan Kalyan's film 'They Call Him OG' released to strong box office response. His elder brother Chiranjeevi praised its Hollywood-level quality, highlighting the film's emotional depth and team effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-kissing-scene-trimmed-anti-alcohol-disclaimer-added-2795680-2025-09-30",
      "headline": "Sunny Sanskari: Kissing scene trimmed, anti-alcohol disclaimer added 'Sunny Sanskari Ki Tusli Kumari' has been granted UA certification by the censor board. The makers have been asked to add an anti-alcohol disclaimer along with a kissing scene reduced by 60 per cent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers clarify The poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol emerging from inside the dome of the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiva temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-rekha-viral-moment-star-studded-party-wins-internet-video-2795614-2025-09-30",
      "headline": "Orry and Rekha's viral moment at star-studded party wins over Internet. Watch Influencer Orry shared a video on Monday from producer Boney Kapoor's party. However, it was his interaction with veteran actor Rekha that is now going viral. The video has garnered more than a million views on Instagram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-good-bad-ugly-to-og-are-fanboy-films-the-new-formula-or-a-scary-trend-2795577-2025-09-30",
      "headline": "Vikram, Good Bad Ugly to OG: Are fanboy films the new formula or a scary trend? Indian cinema is witnessing a shift where fans influence film narratives, creating star-centric spectacles.  While these films thrill fanbases, concerns grow over storytelling being sidelined for mass appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahakali-akshaye-khanna-first-look-as-shukracharya-revealed-during-durga-puja-2795628-2025-09-30",
      "headline": "Mahakali: Akshaye Khanna's first look as Shukracharya revealed during Durga Puja Actor Akshaye Khanna's striking look as Shukracharya in 'Mahakali' was unveiled on Durga Puja. This marks a monumental chapter in the Prasanth Varma Cinematic Universe with Khanna's Telugu debut in a never-seen-before role."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/truth-will-emerge-soon-actor-politician-vijay-in-first-video-message-amid-blame-game-over-karur-stampede-2795717-2025-09-30",
      "headline": "Vijay blames Stalin for stampede in video message: Get me if you want revengeActor-politician Vijay, addressing the Karur stampede fallout, defended his supporters and called out authorities. He insisted he prioritised public safety, rejected any wrongdoing, and vowed that truth behind the incident will soon be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-fiasco-mohsin-naqvi-bcci-icc-complaint-2795826-2025-09-30",
      "headline": "BCCI grills PCB chief Naqvi over Asia Cup trophy fiasco, to complain to ICCThe BCCI on Tuesday, September 30, grilled PCB chief and ACC chairman Mohsin Naqvi for his role in the Asia Cup trophy fiasco after the final between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-final-voter-list-to-be-out-today-poll-schedule-likely-by-oct-6-7-2795485-2025-09-30",
      "headline": "Final Bihar voter list released, 47 lakh names dropped after poll roll revisionDuring the controversial Special Intensive Revision process in Bihar, a total of 68 lakh names were deleted from the voters list, out of which 21 lakh names were added again to the list after claims and objections period, bringing Bihar's final roll to 7.4 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-hamas-deadline-gaza-peace-plan-warning-2795832-2025-09-30",
      "headline": "Trump gives Hamas '3 or 4 days' to accept Gaza peace plan, warns of 'sad end'Trump said Hamas has \"three or four days\" to respond to the Gaza peace proposal. He warned that it would be a \"very sad end\" if Hamas rejected the deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/rahul-gandhi-ebc-outreach-challenges-nitish-kumar-dominance-in-bihar-2795763-2025-09-30",
      "headline": "Nitish's Legacy vs RaGa's Gambit: Who Will Win Bihar's EBC Vote?Rahul Gandhi's outreach to Bihar's Extremely Backward Classes challenges Nitish Kumar's long-held base. With 36% of the population, EBCs could decide whether the Mahagathbandhan gains ground or faces scepticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Deepti hits 50, India eye strong finishWomen's Cricket World Cup Live Updates: The covers have come off, and the game has once again been reduced to 47 overs per side. Amanjot Kaur and Deepti Sharma are standing strong with an 82-run stand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-visits-durga-puja-pandal-in-delhis-cr-park-on-ashtami-2795839-2025-09-30",
      "headline": "PM Modi visits Durga puja pandal in Delhi's CR Park on AshtamiIn view of the Prime Minister's presence, the Greater Kailash-II Welfare Association issued an advisory for residents, urging them to avoid certain internal roads in CR Park. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/whats-behind-the-sudden-spell-of-heavy-rain-in-delhi-ncr-imd-explains-2795677-2025-09-30",
      "headline": "What's behind the sudden spell of heavy rain in Delhi-NCR?Heavy rains and festive rush combined to create a double blow for Delhiites, as they struggled through traffic jams on their way to their destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers clarifyThe poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol emerging from inside the dome of the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiva temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/howard-lutnick-donald-trump-aide-hints-major-h1b-visa-overhaul-before-february-2026-before-fee-takes-effect-lottery-system-techies-2795811-2025-09-30",
      "headline": "Trump aide Lutnick hints at major H-1B visa overhaul before 2026 fee takes effectUS Commerce Secretary Howard Lutnick has signalled major reforms to the H-1B visa programme before a $100,000 fee takes effect in 2026. He said the current lottery-based system was \"outdated and flawed\", favouring low-cost tech consultants over skilled professionals like doctors and educators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-journalist-rajiv-prataps-family-questions-death-cite-deaths-threats-and-suspicious-injuries-2795825-2025-09-30",
      "headline": "Death threats, suspicious injuries: Uttarakhand journalist's family questions deathRajiv Pratap's body was recovered from the Joshiada Barrage in Uttarkashi on Sunday by a joint team of police and disaster management personnel, and his family has confirmed the identification. The post-mortem report indicated injuries to the chest and abdomen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buffet-vs-la-carte-all-you-can-eat-bbq-nation-the-gt-road-profit-business-model-2795755-2025-09-30",
      "headline": "Behind the buffet: How restaurants profit from all-you-can-eat deals'All you can eat.' That is how buffets work. But then how do famous buffets such as BBQ Nation, The GT Road, and Pirates of Grill, with prices ranging from Rs 900-1400, make a profit serving unlimited food?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-polls-bjp-nda-efforts-shahabad-kushwaha-and-rajput-communities-2795784-2025-09-30",
      "headline": "BJP's Operation Shahabad: How party plans to regain lost Bihar bastionShahabad — comprising Bhojpur, Buxar, Rohtas, and Kaimur — was once an NDA stronghold but has turned into its weakest link. With just weeks left for the Bihar polls, the BJP-led alliance has stepped up efforts to ensure victory in the key region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/explosion-at-frontier-corps-headquarters-in-eastern-quetta-in-pakistan-5-killed-at-least-15-injured-2795653-2025-09-30",
      "headline": "10 killed in car bombing, firing outside Frontier Corps HQ in Pak's QuettaAt least 10 people died and several were injured in a blast near Quetta FC headquarters. Initial reports suggest the blast was of high intensity, but the exact nature of the explosion has not yet been determined. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/polish-hotelier-paying-guests-to-conceive-in-his-properties-terms-and-conditions-apply-2795296-2025-09-30",
      "headline": "This hotelier is paying guests to conceive a baby in his properties. T&C applyNot a spa, complimentary dinner or a seasonal discount, this hotel chain in Poland is offering packages for couples who are ready to conceive babies at their properties! This is not a drill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ghee-health-risks-saturated-fats-heart-disease-experts-caution-moderation-2795734-2025-09-30",
      "headline": "Ghee is tasty but not a superfood: What you should knowGhee, a revered Indian product, is back in the debate over claims of being a \"superfood\". While it does have health benefits, its high content of saturated fats and lack of enough omega-3 fatty acids still make it a suboptimal option for regular daily consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lucknow-municipal-corporation-mandates-licence-for-pet-cats-fine-for-noncompliance-dog-registration-lmc-2795719-2025-09-30",
      "headline": "Lucknow mandates licence for pet cats, Rs 1,000 fine for noncomplianceThe Lucknow Municipal Corporation on Tuesday started a programme to get the city's pet cats registered to fight cases of rabies. Owners will have to pay Rs 500 to get a licence for their pet cats, which will be valid for a year. Noncompliance will attract a fine of Rs 1,000. Lucknow already has a pet dog registration programme.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/2024-pak-polls-flawed-imran-khans-party-put-at-disadvantage-commonwealth-report-2795815-2025-09-30",
      "headline": "2024 Pak polls flawed, Imran Khan's party put at disadvantage: Commonwealth reportThe report noted that a combination of pre-election factors, particularly the non-allocation of the PTI's symbol and the forced registration of its candidates as independents, disrupted the level playing field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-festivals-decide-who-you-should-fall-in-love-with-2795200-2025-09-30",
      "headline": "Love in India now comes with a festival testWould you date someone who doesn't share your excitement for pandal hopping or garba nights? Festivals can reveal a lot about your partner, but should they really decide your love story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation TilakSpeaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arattai-app-sridhar-vembu-tamil-nadu-entrepreneurs-learn-hindi-business-dealings-zoho-founder-language-debate-2795318-2025-09-30",
      "headline": "Simple app, difficult name? Arattai revives language debateEarlier this year, Zoho's Sridhar Vembu urged Tamils to learn Hindi for business, sparking outrage in the south. Months later, his app Arattai, named in Tamil, has sparked a debate over its \"hard to pronounce\" name for Hindi speakers. The name of the app, whose downloads are soaring, has also revived the language debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-companies-eye-india-for-offshore-operations-amid-h-ib-visa-fee-surge-tech-companies-trump-global-capability-centres-2795678-2025-09-30",
      "headline": "US companies eye India for offshore operations amid H-1B fee surgeUS companies are eyeing India's 1,700 global capability centres (GCCs) for offshore operations as President Donald Trump's $100,000 H-1B visa fee disrupts talent strategies. India, hosting over half the world's GCCs, is evolving into a hub for high-value tasks like AI and drug discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-clarifies-relationship-status-with-zendaya-2795833-2025-09-30",
      "headline": "Tom Holland clarifies relationship status with ZendayaActor Tom Holland corrected a journalist who called Zendaya his girlfriend during a panel. Their engagement has been carefully planned, but wedding preparations are yet to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lahore-1947-sunny-deol-resumes-shoot-after-aamir-khan-suggests-changes-2795797-2025-09-30",
      "headline": "Lahore 1947: Sunny Deol resumes shoot after Aamir Khan suggests changesActor Sunny Deol returned to shoot the final schedule of 'Lahore 1947' in Punjab following Aamir Khan's creative input. The film's release has been postponed to 2026 to ensure superior quality and vision."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-duleep-trophy-rhythm-asia-cup-2025-india-2795843-2025-09-30",
      "headline": "How Duleep trophy helped Kuldeep find rhythm for Asia Cup? Spinners reveals Kuleep Yadav revealed how bowling in the Duleep trophy helped him to get back into the groove for the Asia Cup, where he emerged as one of India's star players. Kuldeep ended the tournament as the leading wicket-taker in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-fiasco-mohsin-naqvi-bcci-icc-complaint-2795826-2025-09-30",
      "headline": "BCCI grills PCB chief Naqvi over Asia Cup trophy fiasco, to complain to ICC The BCCI on Tuesday, September 30, grilled PCB chief and ACC chairman Mohsin Naqvi for his role in the Asia Cup trophy fiasco after the final between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wins-japan-open-2025-beating-taylor-fritz-2795779-2025-09-30",
      "headline": "Carlos Alcaraz continues winning spree, thumps Taylor Fritz to win Japan Open World No. 1 Carlos Alcaraz defeated Taylor Fritz to win the Japan Open final. The victory marked his eighth title of the year despite a foot injury scare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-tilak-varma-profile-india-vs-pakistan-asia-cup-final-2795723-2025-09-30",
      "headline": "Wired for greatness: How Tilak Varma, an electrician's son, became Asia Cup hero 22-year-old Tilak Varma turned out to be the hero for India in the Asia Cup Final. From modest beginnings to cricketing greatness, here is the story of a youngster who was never supposed to play cricket in the first place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepesh-devendran-five-wicket-haul-india-youth-test-australia-2795743-2025-09-30",
      "headline": "Five-star Devendran: India U-19's young gun rattles Australia in Youth Test Deepesh Devendran's brilliant bowling helped India gain the upper hand in the Youth Test against Australia. His five-wicket haul set the tone for a strong Indian performance with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-joins-sharjah-warriorz-ilt20-batting-finisher-season-4-2795747-2025-09-30",
      "headline": "Dinesh Karthik set for ILT20 debut, joins Sharjah Warriorz for fourth season Former India wicketkeeper Dinesh Karthik will make his ILT20 debut with Sharjah Warriorz. Karthik replaces Sri Lanka's Kusal Mendis in the JP Duminy-coached Sharjah side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-cheeky-retirement-message-chris-woakes-england-career-2795737-2025-09-30",
      "headline": "Pant's cheeky retirement wish for Woakes: Definitely left a mark on me Rishabh Pant sent a cheeky message to Chris Woakes after the England pacer announced his retirement from all formats of the game on September 29. Woakes played a total of 217 international games for England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-gautam-gambhir-kuldeep-yadav-ahmedabad-2795706-2025-09-30",
      "headline": "No rest for Gambhir: Coach arrives early in Ahmedabad for India vs West Indies Test India vs West Indies: No rest for coach Gautam Gambhir. Two days after the Asia Cup final, the head coach was in Ahmedabad. Spinner Kuldeep Yadav also travelled with the coach. The first Test of the two-match series will get underway on Thursday, October 2 at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/tilak-varma-echoes-suryakumar-india-vs-pakistan-rivalry-no-longer-worth-the-hype-2795687-2025-09-30",
      "headline": "Tilak Varma echoes Suryakumar: India vs Pakistan rivalry no longer worth the hype Asia Cup 2025: Tilak Varma addressed the press upon his arrival in Hyderabad on Tuesday. From playing down the buzzword Operation Tilak to echoing Suryakumar Yadav's hot take on the India vs Pakistan rivalry, the young batter fielded a variety of questions. Tilak hit a match-winning 69 in the final against Pakistan in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation Tilak Speaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-cheeky-retirement-message-chris-woakes-england-career-2795737-2025-09-30",
      "headline": "Pant's cheeky retirement wish for Woakes: Definitely left a mark on me Rishabh Pant sent a cheeky message to Chris Woakes after the England pacer announced his retirement from all formats of the game on September 29. Woakes played a total of 217 international games for England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-gautam-gambhir-kuldeep-yadav-ahmedabad-2795706-2025-09-30",
      "headline": "No rest for Gambhir: Coach arrives early in Ahmedabad for India vs West Indies Test India vs West Indies: No rest for coach Gautam Gambhir. Two days after the Asia Cup final, the head coach was in Ahmedabad. Spinner Kuldeep Yadav also travelled with the coach. The first Test of the two-match series will get underway on Thursday, October 2 at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/tilak-varma-echoes-suryakumar-india-vs-pakistan-rivalry-no-longer-worth-the-hype-2795687-2025-09-30",
      "headline": "Tilak Varma echoes Suryakumar: India vs Pakistan rivalry no longer worth the hype Asia Cup 2025: Tilak Varma addressed the press upon his arrival in Hyderabad on Tuesday. From playing down the buzzword Operation Tilak to echoing Suryakumar Yadav's hot take on the India vs Pakistan rivalry, the young batter fielded a variety of questions. Tilak hit a match-winning 69 in the final against Pakistan in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation Tilak Speaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}