{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-potential-market-crash-investors-may-stay-away-for-years-2706820-2025-04-10",
      "headline": "Zerodha CEO Nithin Kamath on market crash: \"Investors may stay away for years\"In 2008, the global market took a major hit with the collapse of Lehman Brothers, a global financial services firm and one of the largest investment banks in the US, causing a ripple effect around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tweet-great-time-to-buy-stock-market-advice-global-market-rally-90-day-pause-tariff-2706794-2025-04-10",
      "headline": "Should stock market investors take Donald Trump's 'buy' tip seriously?From aggressive tariffs on China to sudden pauses and vague reassurances, the whiplash is real and investors are feeling it. Markets bleed one day and bounce back the next, all thanks to a tweet or a policy pivot from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/msc-turkiye-world-biggest-green-cargo-ship-docks-at-adani-vizhinjam-port-2706724-2025-04-10",
      "headline": "World's biggest green cargo ship, MSC Turkiye docks at Adani's Vizhinjam PortMSC Turkiye: The vessel is 399.9 metres long, 61.3 metres wide, and has a depth of 33.5 metres. It has the capacity to carry 24,346 twenty-foot equivalent units (TEUs), making it one of the largest container ships ever built."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-surges-as-trump-hits-pause-on-tariffs-dow-jumps-over-2300-points-glbs-2706665-2025-04-09",
      "headline": "Wall Street surges as Trump hits pause on tariffs, Dow jumps over 2,300 pointsWall Street jumped after President Trump paused new tariffs for 90 days, easing trade worries. Big tech companies like Apple and Nvidia led the gains. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-over-350-points-nifty-below-22500-banking-stocks-down-2706416-2025-04-09",
      "headline": "Sensex falls over 350 points, Nifty below 22,500; banking stocks downThe S&P BSE Sensex was down 379.73 points to close at 73,847.15, while the NSE Nifty50 lost 136.70 points to end at 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-rajdhani-to-vande-bharat-investor-criticises-india-lag-in-train-tech-2706391-2025-04-09",
      "headline": "From Rajdhani to Vande Bharat: Investor criticises India's lag in train techWhen Rajdhani was launched in 1969, it placed India among Asia's fastest rail nations, second only to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-sanjay-malhotra-us-tariff-impact-worried-over-growth-than-inflation-2706354-2025-04-09",
      "headline": "RBI Governor says US tariff impact on growth bigger worry than inflationThe RBI's rate cut comes at a time when inflation appears to be under control, but economic growth faces risks from global uncertainty after US tariffs imposed by President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-impact-market-banking-stocks-down-reason-here-why-bank-margins-2706331-2025-04-09",
      "headline": "RBI rate cut brings relief for borrowers, but banking stocks tumble. Here's whyBanking stocks, especially public sector lenders, took a sharp hit after the rate cut announcement. The Nifty Bank index was down nearly 1%, with major losers including Bank of Baroda, Canara Bank, Punjab National Bank, and SBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-6-key-takeaways-from-mpc-meeting-governor-sanjay-malhotra-announces-april-9-2025-2706322-2025-04-09",
      "headline": "RBI monetary policy: 6 key takeaways from MPC meetingWith the repo rate cut, borrowing costs for home and personal loans are likely to fall. This would provide a big relief to the homebuyers and could boost the housing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-5-key-development-reforms-you-must-know-2706284-2025-04-09",
      "headline": "RBI MPC meeting: 5 key development reforms you must knowCurrently, UPI payments are mostly capped at Rs 1 lakh for both P2P and P2M. The RBI has suggested that National Payments Corporation of India (NPCI) may now review and revise these limits based on evolving user needs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-cuts-repo-rate-by-25-bps-to-6-gdp-forecast-lowered-to-65-for-fy26-ytvd-2706254-2025-04-09",
      "headline": "RBI cuts Repo Rate by 25 points to 6% amid global trade warThe Reserve Bank of India has cut the repo rate by 25 basis points to 6%, potentially leading to lower EMIs for home loans. The RBI has also lowered the GDP forecast for FY26 to 6.5% from the earlier 6.7%. The Monetary Policy Committee unanimously decided to change the stance from neutral to accommodative, hinting at possible further easing. The RBI Governor expressed concerns over global trade uncertainties and their potential impact on inflation and growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-rate-cut-6-percent-25-bps-home-auto-loan-emis-likely-to-get-cheaper-2706246-2025-04-09",
      "headline": "Cheaper home, auto loan EMIs after RBI rate cut. What it means for youRBI reduces key lending rate to 6%. Lower interest rates are expected to make borrowing cheaper, which can help people buy homes or vehicles more easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-central-bank-moves-from-neutral-to-accommodative-stance-2706237-2025-04-09",
      "headline": "RBI changes stance from neutral to accommodative: What does it mean?The Reserve Bank of India (RBI) Governor Sanjay Malhotra has announced a cut in the repo rate by 25 basis points, bringing it down from 6.25% to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-gdp-forecast-reduces-fiscal-2025-2026-65-per-cent-from-67-per-cent-donald-trump-us-tariff-war-2706227-2025-04-09",
      "headline": "RBI downgrades 2025-26 GDP forecast to 6.5% from 6.7% amid global tariff warWhile sharing the new projections, Governor Sanjay Malhotra said the downward revision of the GDP forecast was mainly due to growing risks in global trade and policy developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/donald-trumps-26-per-cent-reciprocal-tariffs-on-india-come-into-effect-2706214-2025-04-09",
      "headline": "Donald Trump's 26% reciprocal tariffs on India come into effectA 26% tariff on Indian exports to the USA has come into effect. Key sectors impacted include electronics, gems and jewellery, auto components, and agricultural products. The Union Cabinet is set to meet to discuss India's strategy and the impact on exporters. The Indian government is in touch with exporters to minimise the impact, while also working on a bilateral trade agreement with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-mpc-meeting-cuts-key-rates-again-second-consecutive-time-25-bps-6-per-cent-2706220-2025-04-09",
      "headline": "Home loans to get cheaper as RBI cuts key lending rate by 25 basis points to 6%RBI MPC meeting: This is the second rate cut in a row, following a 25 basis point reduction in February. RBI also changed its earlier stance from neutral to 'accommodative'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-indian-exports-imports-26-per-cent-come-into-effect-government-meeting-narendra-modi-2706212-2025-04-09",
      "headline": "Trump's 26% tariffs on India come into effect, big Cabinet meet todayWith markets in a free fall since Donald Trump's reciprocal tariff announcement, the Union Cabinet will hold a crucial meeting today to strategise on ways to minimise the impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-down-300-points-nifty-below-22500-as-investors-await-rbi-mpc-announcements-2706203-2025-04-09",
      "headline": "Sensex, Nifty open lower as RBI policy and global cues weigh on investorsThe S&P BSE Sensex fell by 255.49 points to 73,971.59, while the NSE Nifty50 lost 86.70 points to 22,449.15 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-will-home-loans-get-cheaper-policy-announcement-today-rate-cut-25-bps-2706195-2025-04-09",
      "headline": "RBI MPC: Will home loans get cheaper after today's policy announcement?RBI MPC meeting: In its last meeting held in February, the RBI cut the repo rate by 25 basis points. This was the first rate cut under RBI Governor Sanjay Malhotra, and also the first cut in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-april-9-rbi-mpc-decision-pause-dalal-street-rally-2706183-2025-04-09",
      "headline": "Stock market today: Will RBI MPC decision pause Sensex, Nifty rally?The Sensex and Nifty ended Tuesday's session with big gains, but a global sell-off and worries about trade tensions are expected to affect today's opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-9-shares-in-focus-today-ntpc-adani-wilmar-vodafone-idea-bpcl-trump-tariff-sensex-nifty-2706171-2025-04-09",
      "headline": "Stocks to watch on April 9: NTPC, Adani Wilmar, Vodafone Idea, BPCLIn today's trade, many shares will be in focus due to key news developments. These include NTPC, BPCL, Adani Wilmar, Vodafone Idea, Cyient, PNB Housing Finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-lowest-close-one-year-reciprocal-tariffs-donald-trump-hopes-fading-2706141-2025-04-09",
      "headline": "S&P 500 hits lowest level in one year as hopes for Trump tariff relief fadeThe S&P 500 reached its lowest level in nearly a year after it reversed a strong morning rally, as hopes faded for any concessions or delays on President Donald Trump's global tariffs on US's trading partners set to come into effect on April 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-dow-jones-nasdaq-sp-500-sensex-nifty-prediction-rally-to-continue-2706027-2025-04-08",
      "headline": "US markets gain sharply on hopes of tariff talks: Will Dalal Street continue rally?If Wall Street wraps up today's session on a strong note, it could deliver a big dose of confidence to investors worldwide, especially in Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opening-us-markets-rally-as-dow-jones-jumps-1100-points-nasdaq-sp-surge-3-percent-2706016-2025-04-08",
      "headline": "US markets rally as Dow Jones jumps 1,100 points, Nasdaq, S&P surge 3%The surge in US stocks came as investors looked for any indication that the US might be open to easing some of its tougher tariffs through negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opting-for-new-tax-regime-know-about-this-rs-7000-post-office-savings-benefit-2705963-2025-04-08",
      "headline": "Opting for new tax regime? Know about this Rs 7,000 post office savings benefitAs per a government notification issued back in 2011, interest from post office savings accounts is exempt under Section 10(15) of the Income Tax Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-with-1000-points-gain-nifty-closes-above-22500-as-dalal-street-shrugs-off-tariff-threat-2705854-2025-04-08",
      "headline": "Sensex, Nifty end higher on global recovery and RBI rate cut expectationsThe S&P BSE Sensex added 1,089.18 points to close at 74,227.08, while the NSE Nifty5o gained 374.25 points to end at 22,535.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-rate-cut-announcement-april-9-sanjay-malhotra-what-to-expect-25-bps-2705847-2025-04-08",
      "headline": "RBI MPC to announce decision on April 9: Will there be a rate cut?Since the last MPC meeting, held in February 2025, a lot of things have changed, both positive and negative. While inflation has come down, and growth has started to pick up, there are fresh worries about the global economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-businessmen-slam-us-president-bill-ackman-jamie-dimon-good-import-2705835-2025-04-08",
      "headline": "'Economic nuclear war': Billionaire business titans slam Trump's tariff gambitDonald Trump's tariff agenda is fracturing elite support, with top businessmen — from Bill Ackman to Jamie Dimon — warning it risks recession, inflation, and global instability. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hotmail-co-founder-sabeer-bhatia-on-indian-engineers-99-percent-start-giving-gyaan-2705785-2025-04-08",
      "headline": "Hotmail co-founder Sabeer Bhatia on Indian engineers: '99% start giving gyaan'Sabeer Bhatia pointed out that in India, people respect those who talk business, not those who write code or build software. This mindset, he says, is stopping India from becoming a hub of innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-1600-points-nifty-rise-500-stocks-driving-rally-titan-zomato-infosys-sbi-hcltech-2705770-2025-04-08",
      "headline": "Sensex up 1,600 points: Which stocks are driving the rally on Dalal Street?Markets saw a huge rebound from yesterday's crash as they staged a robust recovery as no stocks on the Sensex of Nifty50 traded in red in the afternoon session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jpmorgan-jamie-dimon-ceo-donald-trump-tariff-war-us-recesion-slow-growth-economic-concern-stronger-india-ties-2705740-2025-04-08",
      "headline": "Trump's tariff war may backfire, says JPMorgan CEO, urges stronger India tiesJPMorgan CEO, Jamie Dimon, explained that higher costs of imported goods would affect consumers, while increased demand for local products could also drive prices up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-centre-studying-global-models-to-manage-ups-pool-corpus-2705732-2025-04-08",
      "headline": "Unified Pension Scheme: Centre studying global models to manage UPS pool corpusThe government aims to create proper rules for investing the extra contribution made by it in a separate pension fund called the pool corpus under the newly launched Unified Pension Scheme (UPS).     "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japan-nikkei-leads-asia-recovery-as-us-mulls-softer-tariff-approach-2705703-2025-04-08",
      "headline": "Japan's Nikkei leads Asia's recovery as hopes rise for softer tariff approachA 5.6% rebound in Japan's Nikkei far outpaced other regional markets, with Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer tasked with leading trade negotiations with Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/titan-share-price-jump-stock-rise-7-percent-q4-update-market-rally-sensex-nifty-2705705-2025-04-08",
      "headline": "Explained: Why Titan share price jumped 7% after hitting 52-week lowThe recovery in Titan share price came just a day after the stock touched its 52-week low of Rs 2,947.55. In the morning session, Titan shares climbed to a high of Rs 3,222, providing some relief to investors after a tough few months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-jump-stock-market-rising-today-why-reasons-trump-tariff-recovery-global-2705663-2025-04-08",
      "headline": "Sensex, Nifty in green: Why is stock market rising today? 3 things to knowSensex, Nifty today: Tracking global markets that showed signs of recovery, Sensex and Nifty surged more than 1.5% in early trade, shaking off fears that had weighed heavily just a day earlier, with early buying seen across most sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-over-1000-points-nifty-above-22500-as-d-street-recovers-mirroring-global-markets-2705644-2025-04-08",
      "headline": "Sensex, Nifty gain as global markets recover from Trump's tariff shockThe S&P BSE Sensex surged 1,217.78 points to 74,355.68, while the NSE Nifty50 gained 380.50 points to 22,542.10 as of 9:35 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karisma-kapoor-calls-alia-bhatt-biwi-no-1-ranveer-singh-hero-no-1-after-watching-their-new-ad-2706828-2025-04-10",
      "headline": "Karisma Kapoor calls Alia Biwi No 1, Ranveer Hero No 1 after watching their new adAlia Bhatt and Ranveer Singh channelled their '90s energy in a new ad. After fans praised the duo, actor Karisma Kapoor joined in, calling them Biwi No. 1 and Hero No. 1, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-amateur-review-rami-malek-film-watchable-but-rarely-thrilling-2706799-2025-04-10",
      "headline": "The Amateur review: Rami Malek's film is watchable, but rarely thrillingReleased-Thu Apr 10, 2025The Amateur movie review: Rami Malek stars in The Amateur, a film about a CIA codebreaker turned avenger after his wife's death, navigating a world of espionage with unconventional methods. Despite a strong cast and intriguing premise, the movie struggles to deliver sustained excitement, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-on-his-friendship-with-taylor-swift-we-have-six-hour-catchups-2706786-2025-04-10",
      "headline": "Ed Sheeran on his friendship with Taylor Swift: We have six-hour catchupsEd Sheeran shared insights into his enduring friendship with Taylor Swift, recalling their time during her Red Tour. Despite busy schedules, the two remain close, cherishing their rare meet-ups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-x-twitter-reviews-ajith-kumar-trisha-krishnan-adhik-ravichandran-fans-praise-dialgues-action-sequences-2706782-2025-04-10",
      "headline": "Good Bad Ugly X reviews: Fans hail dialogues, Ajith's mass entry, call it 'peak vibe'Internet declared Ajith Kumar's Good Bad Ugly a winner. While some raved about the dialogues between him and Simran Bagga, others highlighted the mass entry scene and peppy songs. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-day-11-box-office-salman-khans-film-struggles-to-keep-up-2706760-2025-04-10",
      "headline": "Sikandar Day 11 box office: Salman Khan's film struggles to keep upSalman Khan's much-anticipated film Sikandar has seen a decline in box office earnings on its 11th day. The film now faces stiff competition from new releases - Jaat and Good Bad Ugly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-wishes-george-clooney-ajith-kumar-good-bad-ugly-release-2706754-2025-04-10",
      "headline": "Khushbhoo Sundar sends wishes to Ajith for Good Bad Ugly: My George Clooney is backKhushboo Sundar gave a shout-out to her 'George Clooney' Ajith Kumar ahead of Good Bad Ugly release. The high-octane action comedy, directed by Adhik Ravichandran, released in theatres on April 10. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's Phule release postponed amid controversy over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-box-office-day-14-mohanlal-prithviraj-sukumaran-film-eyes-rs-260-crore-globally-2706742-2025-04-10",
      "headline": "Empuraan box office Day 14: Mohanlal's film eyes Rs 260 crore globallyMohanlal and Prithviraj Sukumaran-starrer L2: Empuraan has crossed the Rs 250-crore mark worldwide in no time. It is gearing up to enter the Rs 260-crore club soon. The film is the sequel to 2019's hit Lucifer. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-snaps-at-disrespectful-paps-in-viral-clip-not-caring-about-humans-2706731-2025-04-10",
      "headline": "Justin Bieber snaps at 'disrespectful' paps in viral clip: Not caring about humansA video going viral online shows singer Justin Bieber losing his cool with the paparazzi, labelling them 'money-hungry' and disrespectful. He further criticised them for showing no regard for basic human decency.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vidyapati-movie-review-nagabhushana-carries-a-shaky-screenplay-banking-on-emotions-2706688-2025-04-10",
      "headline": "Vidyapati review: Nagabhushana carries a shaky screenplay banking on emotionsReleased-Thu Apr 10, 2025Vidyapati movie film review: This Kannada film, produced by Dhananjaya's Daali Pictures, is a comedy entertainer starring Nagabhushana, Malaika Vasupal and Garuda Ram in the lead. The film, despite having potential, falls short in being impressive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supermodel-gigi-hadid-reveals-how-she-met-her-current-boyfriend-bradley-cooper-glbs-2706693-2025-04-10",
      "headline": "Supermodel Gigi Hadid reveals how she met her current boyfriend Bradley CooperGigi Hadid opens up in Vogue about how she met Bradley Cooper at a backyard party, sharing insights into their low-key romance and the challenges of dating in the spotlight.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tracee-ellis-ross-wows-in-burnt-orange-leather-on-good-morning-america-glbs-2706692-2025-04-10",
      "headline": "Tracee Ellis Ross wows in burnt orange leather on Good Morning AmericaTracee Ellis Ross stunned on Good Morning America in a burnt orange leather ensemble and Bottega Veneta heels while promoting Black Mirror Season 7 with Rashida Jones, impressing fashion watchers once again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/beyonce-fans-can-win-concert-tickets-in-cowboy-carter-fashion-sweepstakes-glbs-2706691-2025-04-10",
      "headline": "Beyoncé fans can win concert tickets in Cowboy Carter fashion sweepstakesBeyoncé's Cowboy Carter album has inspired a handmade fashion sweepstakes by MakerPlace. Fans can design outfits for a chance to win concert tickets and $3,000. Entries close this Friday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-shares-health-update-after-breast-cancer-relapse-2706663-2025-04-09",
      "headline": "Back home, recovering: Tahira Kashyap shares health update after cancer relapseFilmmaker Tahira Kashyap shared a post and updated fans about her health after her breast cancer relapse. She thanked her fans anf followers for their unconditional support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-grooves-to-dhol-at-son-sunny-deols-jaat-premiere-2706651-2025-04-09",
      "headline": "Dharmendra grooves to dhol beat at son Sunny Deol's Jaat premiere. WatchVeteran actor Dharmendra stole the limelight with his dance at son Sunny Deol's Jaat premiere in Mumbai. The film will release in theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mari-selvaraj-reunite-after-four-years-for-d56-2706640-2025-04-09",
      "headline": "Dhanush, Mari Selvaraj reunite after four years for 'D56'Dhanush has teamed up with director Mari Selvaraj for his next film. Tentatively titled D56, the movie will be produced by Ishari Ganesh under Vels Films International. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-2-in-works-brad-pitt-production-plan-b-entertainment-in-talks-with-netflix-for-sequel-2706624-2025-04-09",
      "headline": "Adolescence 2 in works? Brad Pitt's production in talks with Netflix for sequelNetflix's popular series, Adolescence, is in talks for a second season. The producers are in discussions with the streaming giant for the second season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tabu-haider-reunion-with-shahid-kapoor-vishal-bhardwaj-2706579-2025-04-09",
      "headline": "Tabu's Haider reunion with 'Laqt-e-jigars' Shahid Kapoor, Vishal BhardwajThe versatile Tabu on Wednesday shared a reunion photo from her meeting with Haider cast, including former co-star Shahid Kapoor and director Vishal Bhardwaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sidharth-malhotra-nail-veer-pahariya-viral-one-leg-dance-maddock-2706595-2025-04-09",
      "headline": "Varun Dhawan, Sidharth Malhotra nail Veer Pahariya's viral one-leg dance. WatchVarun Dhawan and Sidharth Malhotra's video from Maddock's success bash has gone viral. The two actors aced Veer Pahariya's viral one-leg dance step. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-security-bulletproof-vehicle-nia-headquarters-2706789-2025-04-10",
      "headline": "Top-tier security for Tahawwur Rana: Bulletproof vehicle, SWAT commandosTahawwur Rana, a Canadian national of Pakistani origin, will be transported to the National Investigation Agency (NIA) headquarters in a bulletproof vehicle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-xi-jinping-smartest-man-in-the-world-amid-ongoing-tariff-war-with-china-2706817-2025-04-10",
      "headline": "Love letter in a trade war: Trump calls Xi Jinping smartest man in the worldThe tensions flared further between the US and China when Donald Trump executed a stunning volte-face - suspending tariffs on over 75 countries in a conciliatory gesture, while simultaneously hammering Beijing with a punishing escalation, jacking up tariffs on Chinese imports to a staggering 125 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-buy-stocks-tip-before-tariffs-pause-raises-calls-for-insider-trading-probe-2706713-2025-04-10",
      "headline": "Trump's 'good time to buy' tweet minutes before tariff pause sparks calls for probeShortly after markets opened, President Trump took to his Truth Social platform with a pair of upbeat posts. \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" he wrote, followed closely by a more direct appeal to investors: \"THIS IS A GREAT TIME TO BUY!!! DJT.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/michelle-obama-barack-obama-divorce-rumours-chose-to-do-whats-best-for-me-2706773-2025-04-10",
      "headline": "Michelle Obama opens up about divorce rumours: Chose to do what's best for meAddressing divorce rumours, Michelle Obama explained that she's simply taking more control over her schedule and prioritising personal well-being over societal expectations of women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-arrival-live-updates-2611-mumbai-attack-accused-flight-land-in-delhi-tihar-jail-2706711-2025-04-10",
      "headline": "Live: Tight security as 26/11 plotter on way to Delhi, intel teams tracking flightTahawwur Rana News Live Updates: Tahawwur Hussain Rana, the 26/11 Mumbai terror attack mastermind, will reach India this afternoon after being extradited from the US on Wednesday. Rana is likely to be lodged in a high-security ward in Tihar jail here when he reaches India, prison sources said. Rana is being brought to India after his last-ditch attempt to evade extradition failed as the US Supreme Court justices rejected his application. The 64-year-old is a Pakistan-born Canadian national and is a close associate of one of the main conspirators of the 2008 Mumbai terror attacks, David Coleman Headley alias Daood Gilani, a US citizen. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariff-pause-strategy-isolate-china-countries-dialogue-negotiation-trade-deficit-art-of-the-deal-2706725-2025-04-10",
      "headline": "Tariff trap? Trump rewards allies, punishes China in 'art of the deal' strategyWhile the decision to impose across-the-board tariffs triggered panic in financial markets, the Trump administration is now suggesting it was part of a deliberate strategy aimed squarely at isolating China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-security-cell-that-held-ajmal-kasab-may-house-tahawwur-rana-next-sources-2706818-2025-04-10",
      "headline": "High-security cell that held Ajmal Kasab may house Tahawwur Rana next: SourcesAccording to sources, Tahawwur Rana may be lodged in Barrack No 12 of the Arthur Road prison — the same high-security wing where terrorist Ajmal Kasab was kept during the 26/11 trial before his execution in 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/katy-perry-will-cross-the-karman-line-to-go-to-space-what-is-it-2706512-2025-04-10",
      "headline": "Katy Perry will cross the Karman Line to go to space: What is it?Named after Hungarian-American physicist Theodore von Karman, the line represents the altitude where conventional aircraft can no longer rely on aerodynamic lift to stay aloft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/kannada-actor-darshan-court-of-renukaswamy-murder-case-attends-private-film-screening-vaamana-2706804-2025-04-10",
      "headline": "Darshan skips murder case hearing, attends film event, Bengaluru court warns actorA Bengaluru court slammed actor Darshan for skipping the Renukaswamy murder case hearing, citing back pain, only to attend a film screening the next day. The court warned against future absences. Sixteen other accused, including Pavithra Gowda, appeared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-china-us-tariff-war-pause-90-day-india-canada-2706648-2025-04-09",
      "headline": "Do not retaliate: Trump hits China with 125% tariffs, announces pause for othersDonald Trump paused his reciprocal tariffs on all countries for 90 days, retaining a reduced 10% rate. But he hit China with 125% tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-attacks-plotter-2611-delhi-tihar-jail-extradition-us-david-headley-2706682-2025-04-10",
      "headline": "From Pak Army doctor to 26/11 attacks plotter: Who is Tahawwur RanaTahawwur Rana, a former Pakistan Army doctor accused of plotting the 2008 Mumbai terror attacks, is set to land in Delhi on Thursday afternoon. He was arrested by the FBI in 2009 and was lodged in a prison in the US before his extradition to India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-x-twitter-reviews-ajith-kumar-trisha-krishnan-adhik-ravichandran-fans-praise-dialgues-action-sequences-2706782-2025-04-10",
      "headline": "Good Bad Ugly X reviews: Fans hail dialogues, Ajith's mass entry, call it 'peak vibe'Internet declared Ajith Kumar's Good Bad Ugly a winner. While some raved about the dialogues between him and Simran Bagga, others highlighted the mass entry scene and peppy songs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/2611-tahawwur-rana-mumbai-terror-attack-accused-extradited-reach-india-special-flight-to-be-kept-in-tihar-jail-2706720-2025-04-10",
      "headline": "Tahawwur Rana on way to India on special flight, to be kept in Tihar jail: SourcesTahawwur Rana is being brought to India after his last-ditch attempt to evade extradition failed as the US Supreme Court justices rejected his application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-preview-pitch-conditions-prediction-team-news-2706788-2025-04-10",
      "headline": "IPL preview: Unbeaten Delhi Captails visit Bengaluru as RCB seek home comfortUnbeaten Delhi Capitals will be aiming to make it four wins in a row when they face Royal Challengers Bengaluru at the M. Chinnaswamy Stadium on Thursday. Two explosive sides are set for a cracking contest—one that could well be decided by the finest of margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-forgotten-offspring-of-the-british-kangana-ranauts-blistering-attack-2706795-2025-04-10",
      "headline": "Congress forgotten offspring of the British: Kangana Ranaut's blistering attackKangana Ranaut accused the Congress of having ties to Pakistan and claimed that the party had facilitated an atmosphere of fear and unrest during its time in power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/iphone-may-cost-three-times-more-up-to-rs-3-lakh-if-made-in-us-glbs-2706710-2025-04-10",
      "headline": "iPhone may cost three times more, up to Rs 3 lakh, if made in US: ReportIf Apple started making iPhones entirely in the US, the price could shoot up to $3,500(Rs 3 lakh) — that's nearly triple the current cost. Experts say while the goal is to bring jobs back home, it could end up hitting consumers' pockets hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-pre-marriage-counselling-needs-to-be-non-negotiable-in-india-2706545-2025-04-09",
      "headline": "Why pre-marriage counselling needs to be non-negotiable in IndiaNeither men nor women today want to be coerced into an incompatible marriage or, if things go south, simply accept it as their fate. Things are changing, evolving for the better, which is why, now more than ever, pre-marriage counselling should be non-negotiable in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/live-panangottai-fish-held-in-mouth-kills-tn-man-2706734-2025-04-10",
      "headline": "Tamil Nadu man catches fish, puts it inside his mouth, chokes to deathA 29-year-old man from Chengalpattu, Tamil Nadu, choked to death after a live fish he held in his mouth wriggled into his throat while he was bare-hand fishing in a local lake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's Phule release postponed amid controversy over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-26-11-attack-case-narender-mann-special-public-prosecutor-2706759-2025-04-10",
      "headline": "Centre appoints Narender Mann to lead legal proceedings in Tahawwur Rana caseMumbai terror attack plotter Tahawwur Hussain Rana, who has been extradited from the US, will be lodged in a high-security ward in Tihar jail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-menstruating-girl-class-8-girl-made-to-take-exam-outside-classroom-during-period-mother-blames-principal-2706790-2025-04-10",
      "headline": "Menstruating Class 8 student in Tamil Nadu made to take exam outside classroomA Class 8 student in Coimbatore was allegedly made to take her Science exam outside the classroom during her menstrual cycle. A viral video shows her mother questioning the school and blaming the Principal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-trump-signs-order-to-make-americas-showers-great-again-glbs-2706708-2025-04-10",
      "headline": "Watch: Trump signs order to 'make America's showers great again'President Trump signed an executive order removing restrictions on water pressure in showerheads and appliances, reversing Obama-Biden-era regulations. He frames it as a fight for consumer freedom and against environmental overreach."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-prince-william-fan-disects-performance-viral-video-2706842-2025-04-10",
      "headline": "Prince William channels inner Villa fan as he dissects performance vs PSGPrince William's detailed analysis of Aston Villa's defeat to PSG has gone viral, with football fans praising his tactical breakdown and deep knowledge of the game. The royal was in attendance at the Parc des Princes for the Champions League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-intense-rivalry-rcb-vs-csk-bengaluru-2706831-2025-04-10",
      "headline": "Virat Kohli on IPL's most buzzing rivalry: Nothing Like CSK vs RCB in BengaluruIPL 2025: Virat Kohli said the buzz during Chennai Super Kings' visit to Bengaluru at the M Chinnaswamy Stadium is unmatched and adds to the theatre around the contest. RCB hammered CSK by 50 runs earlier in the season in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-khvicha-kvaratskhelia-project-luis-enrique-champions-league-2706816-2025-04-10",
      "headline": "Luis Enrique hails Kvaratskhelia key to PSG project after Villa heroicsLuis Enrique praised Khvicha Kvaratskhelia's match-winning display against Aston Villa, calling him a vital piece of PSG's future. The Georgian winger's impact has already been felt since his January move, helping the Parisians take a strong lead into the second leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-preview-pitch-conditions-prediction-team-news-2706788-2025-04-10",
      "headline": "IPL preview: Unbeaten Delhi Captails visit Bengaluru as RCB seek home comfortUnbeaten Delhi Capitals will be aiming to make it four wins in a row when they face Royal Challengers Bengaluru at the M. Chinnaswamy Stadium on Thursday. Two explosive sides are set for a cracking contest—one that could well be decided by the finest of margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-rr-gujarat-titans-assistant-coach-parthiv-patel-press-conference-2706774-2025-04-10",
      "headline": "Had to drag Sudharsan out of nets: GT coach Parthiv praises opener's work ethicsGujarat Titans assistant coach Parthiv Patel has praised Sai Sudharsan's superb run with the bat in the ongoing Indian Premier League (IPL) 2025. Sudharsan starred with the bat again, scoring 82 from 53 deliveries against the Rajasthan Royals with eight boundaries and three sixes at a strike rate of 154.72."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-elite-list-chris-gayle-kane-williamson-2706751-2025-04-10",
      "headline": "GT vs RR: Sai Sudharsan goes past Gayle, Williamson in elite IPL listSai Sudharsan's brilliant 82 against Rajasthan Royals not only powered Gujarat Titans to a commanding win but also took him past IPL greats like Chris Gayle and Kane Williamson on the elite run-scorers list after 30 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-why-no-washington-sundar-parthiv-patel-explains-2706741-2025-04-10",
      "headline": "Why no Washington Sundar for GT vs RR: Parthiv Patel explains bold callGT batting coach Parthiv Patel has explained the reason why Washington Sundar wasn't part of the playing XI for their win over RR on April 9. Sundar's omission didn't sit well with a lot of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-ashish-nehra-effect-on-mohammed-siraj-and-prasidh-krishna-2706680-2025-04-10",
      "headline": "Ashish Nehra's guidance has done a world of good to Siraj and Prasidh: Robin UthappaFormer India cricketer turned commentator Robin Uthappa has credited Gujarat Titans (GT) coach Ashish Nehra for helping Mohammed Siraj and Prasidh Krishna return to form in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-elite-list-chris-gayle-kane-williamson-2706751-2025-04-10",
      "headline": "GT vs RR: Sai Sudharsan goes past Gayle, Williamson in elite IPL listSai Sudharsan's brilliant 82 against Rajasthan Royals not only powered Gujarat Titans to a commanding win but also took him past IPL greats like Chris Gayle and Kane Williamson on the elite run-scorers list after 30 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-why-no-washington-sundar-parthiv-patel-explains-2706741-2025-04-10",
      "headline": "Why no Washington Sundar for GT vs RR: Parthiv Patel explains bold callGT batting coach Parthiv Patel has explained the reason why Washington Sundar wasn't part of the playing XI for their win over RR on April 9. Sundar's omission didn't sit well with a lot of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-ashish-nehra-effect-on-mohammed-siraj-and-prasidh-krishna-2706680-2025-04-10",
      "headline": "Ashish Nehra's guidance has done a world of good to Siraj and Prasidh: Robin UthappaFormer India cricketer turned commentator Robin Uthappa has credited Gujarat Titans (GT) coach Ashish Nehra for helping Mohammed Siraj and Prasidh Krishna return to form in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}