{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opting-for-new-tax-regime-check-out-these-5-benefits-2710601-2025-04-17",
      "headline": "Opting for new tax regime? Check out these 5 benefitsThe revisions introduced under the new tax regime aim to make the new regime easier, cut down on paperwork, and minimise the confusion many individuals experience in filing their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-net-profit-revenue-final-dividend-rs-22-all-key-details-2710503-2025-04-17",
      "headline": "Infosys Q4 results: Profit drops 12%, final dividend set at Rs 22The IT major clocked revenue of Rs 40,925 crore for the March quarter, up 8% from Rs 37,923 crore a year ago. In constant currency terms, revenue grew 4.8% YoY but declined 3.5% sequentially."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-missing-disappeared-2025-no-public-listing-last-2-months-stock-market-investor-sentiment-2710498-2025-04-17",
      "headline": "No public listing in 2 months: Where have IPOs disappeared?Just nine companies have listed on the mainboard till April this year, compared to 25 in the same period last year, and most didn't even leave a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunscreen-faceoff-honasa-vs-hul-in-court-over-ad-claims-2710432-2025-04-17",
      "headline": "Sunscreen faceoff: Honasa vs HUL in court over ad claimsThe core of the argument is SPF, the sun protection factor which measures how well a sunscreen protects against harmful UV rays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vijay-kedia-10-red-flags-spot-potential-scam-companies-gensol-fraud-blusmart-shuts-down-2710438-2025-04-17",
      "headline": "Vijay Kedia warns of 10 red flags to spot a potential scam amid Gensol fraudInvestor and market expert Vijay Kedia has warned that Gensol is not the only company with problems amid the findings by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-techie-compares-life-with-rs-25-lakh-in-india-vs-100k-dollars-in-us-2710353-2025-04-17",
      "headline": "Rs 25 lakh in India or $100K in US? Bengaluru techie weighs in on what's betterChoosing to stay in India means staying close to family, celebrating festivals, and living within a culture you know well, said the tech professional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phonepe-rolls-out-upi-circle-simplifies-payments-for-family-and-friends-2710392-2025-04-17",
      "headline": "PhonePe rolls out UPI Circle, simplifies payments for family and friendsUPI Circle is a feature by NPCI (National Payments Corporation of India) where a primary user gives permission to a secondary user to make payments from their UPI account, within set limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-tuhin-kanta-pandey-gensol-fraud-job-is-to-find-and-punish-them-2710390-2025-04-17",
      "headline": "Sebi's job is to find and punish them: Tuhin Kanta Pandey on Gensol fraudThe Securities and Exchange Board of India (Sebi) released an interim order on April 15, stating that Gensol Engineering's promoters, brothers Anmol and Puneet Singh Jaggi, had diverted company funds for personal use. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meet-shalla-bal-julia-garners-silver-surfer-shines-in-2025s-fantastic-four-glbs-2710766-2025-04-18",
      "headline": "Meet Shalla-Bal: Julia Garner's Silver Surfer shines in 2025's fantastic fourJulia Garner stars as Shalla-Bal, a female Silver Surfer, in The Fantastic Four: First Steps. The 2025 reboot introduces Marvel's First Family to the MCU, with connections to future Avengers films.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-marias-announce-2025-north-american-tour-kicking-off-at-coachella-glbs-2710737-2025-04-17",
      "headline": "The Marías announce 2025 North American tour, kicking off at CoachellaThe Marías have announced their 2025 Submarine Tour, starting at Coachella. With festival stops, new music, and support from julie and Momma, the tour promises an unforgettable indie-pop experience.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/emily-in-paris-season-5-to-begin-filming-in-rome-in-may-with-full-cast-returning-2710732-2025-04-17",
      "headline": "Lily Collins to begin filming Emily in Paris Season 5 in Rome in MayProduction for 'Emily in Paris' Season 5 will kick off in Rome this May, before heading back to Paris. Lily Collins' Emily will explore new romantic dynamics with returning and new cast members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/thunderbolts-imax-tickets-sell-out-in-under-an-hour-across-us-cities-2710721-2025-04-17",
      "headline": "Thunderbolts IMAX tickets sell out in under an hour across US citiesMarvel fans eagerly snapped up free IMAX tickets for 'Thunderbolts' in under an hour in some major US cities. The film, featuring a team of antiheroes, premieres in India on May 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gossip-girl-star-michelle-trachtenbergs-death-linked-to-diabetes-complications-2710715-2025-04-17",
      "headline": "Gossip Girl star Michelle Trachtenberg's death linked to diabetes complicationsMichelle Trachtenberg, known for her roles in 'Buffy the Vampire Slayer' and 'Gossip Girl', has passed away. The NYC medical examiner confirmed the cause as complications from diabetes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-the-first-steps-trailer-out-pedro-pascal-vanessa-kirby-joseph-quinn-ebon-moss-bachrach-2710665-2025-04-17",
      "headline": "Fantastic Four trailer: Marvel's 1st family sets out to defend Earth from GalactusThe first trailer for 'Fantastic Four: The First Steps' introduces Marvel's First Family with a new twist. The film will arrive in theatres on July 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-to-play-bipasha-basu-like-role-in-no-entry-2-report-2710653-2025-04-17",
      "headline": "Tamannaah Bhatia to play Bipasha Basu-like role in No Entry 2: ReportActor Tamannaah Bhatia might have been approached to play one of the leads in Boney Kapoor's 'No Entry 2'. The film already features Varun Dhawan, Arjun Kapoor and Diljit Dosanjh as leads. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/asim-riaz-out-of-battleground-after-fight-with-abhishek-malhan-rubina-dilaik-2710629-2025-04-17",
      "headline": "Asim Riaz out of Battleground after fight with Abhishek Malhan, Rubina Dilaik?Asim Riaz has reportedly been removed from the reality show Battleground following a heated altercation with co-judges Abhishek Malhan and Rubina Dilaik. The incident escalated after an initial disagreement during the shoot, leading to the cancellation of filming for the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-ott-streaming-when-and-where-to-watch-mohanlal-prithviraj-sukumaran-film-jiohotstar-2710633-2025-04-17",
      "headline": "L2 Empuraan OTT release: When and where to watch Mohanlal, Prithviraj filmThe highly successful Malayalam film 'L2: Empuraan', directed by Prithviraj Sukumaran and starring Mohanlal, will soon be available for streaming. The film, which faced controversy over its depiction of communal riots, will be on JioHotstar from April 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-advance-booking-report-for-day-1-akshay-kumars-film-off-to-decent-start-at-box-office-2710628-2025-04-17",
      "headline": "Kesari 2 advance booking Day 1: Akshay Kumar's film off to decent start at box officeAkshay Kumar's latest release, 'Kesari 2', seems to be starting on a decent note, and if it receives good word-of-mouth, the film has great potential to finally bring Kumar back into the big leagues at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/daredevil-born-again-does-the-revival-deliver-and-is-season-two-worth-the-wait-2710586-2025-04-17",
      "headline": "Daredevil Born Again: Does the revival deliver, and is season two worth the wait?The revival of 'Daredevil: Born Again' brought a fresh storyline and new cast, sparking excitement among fans. As Matt Murdock's dual life unfolds, the series balanced action with deep character development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grimes-slams-beauty-standards-after-sephora-ad-interrupts-podcast-glbs-2710610-2025-04-17",
      "headline": "Grimes slams beauty standards after Sephora ad interrupts podcastGrimes slams Sephora ad interruption on Apple Podcasts, calling it a \"demonic AI wraith\" invading her peaceful moment. The singer voiced concerns about beauty standards, AI, and their impact on young women, especially her daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-rare-photo-with-daughter-jessemy-2710562-2025-04-17",
      "headline": "Rapper Badshah's rare photo with daughter Jessemy, seen yet?Rapper Badshah posted a rare picture with his daughter, Jessemy, on Instagram. Fans praised the father-daughter duo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-life-of-chuck-trailer-tom-hiddleston-chiwetel-ejiofor-headline-stephen-king-adaptation-mike-flanagan-2710501-2025-04-17",
      "headline": "The Life of Chuck trailer: Tom Hiddleston to headline this Stephen King adaptationNeon has unveiled the trailer for 'The Life of Chuck', a film adaptation of Stephen King's novella. Directed by Mike Flanagan, the movie stars Tom Hiddleston and is set for a June 6 release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-manchu-instagram-phone-number-compromised-calls-it-scary-2710510-2025-04-17",
      "headline": "Actor Lakshmi Manchu's Instagram, phone number compromised, calls it scaryLakshmi Manchu's Instagram account was hacked, prompting the actor to respond with a quirky message. She assured fans that if she needed money, she'd ask directly, adding her signature humour to the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/eijaz-khan-pavitra-punia-reunite-for-short-film-after-breakup-details-inside-2710477-2025-04-17",
      "headline": "Eijaz Khan, Pavitra Punia reunite for short film after breakup. Details hereActors Eijaz Khan and Pavitra Punia have reunited for a project after their breakup. Producer Dalljiet Kaur shares insights on their collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ben-affleck-on-jon-bernthals-the-punisher-i-wouldnt-tangle-with-him-glbs-2710489-2025-04-17",
      "headline": "Ben Affleck on Jon Bernthal's The Punisher: I wouldn't tangle with himBen Affleck praises Jon Bernthal's intense take on The Punisher in Daredevil: Born Again, saying he \"wouldn't tangle with him.\" While reflecting on Marvel's evolution, Affleck shares excitement for The Accountant 2 and his admiration for the darker tone Bernthal brings to Frank Castle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kian-bizarre-bb-review-bigg-boss-meets-backpacker-hostel-in-bts-jin-show-2710480-2025-04-17",
      "headline": "Kian's Bizarre B&B review: Bigg Boss meets backpacker hostel in this BTS' Jin showReleased-Tue Apr 08, 2025Kian's Bizarre B&B is an eccentric reality show blending quirky humour and heartwarming moments, as BTS's Jin and actor Ji Ye-eun join host Kian84 in a makeshift guesthouse. The show offers a light-hearted, less dramatic alternative to Bigg Boss, with bizarre challenges and unexpected Indian references."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/phule-movie-release-delay-journey-explained-controversy-caste-cinema-and-uncomfortable-truths-2710415-2025-04-17",
      "headline": "Caste, cinema and uncomfortable truths: Phule's delayed release journey explainedWhy has a film about India's two revolutionary thinkers upset the self-proclaimed caretakers of the Brahmin community? Did the caste-discrimination that Savitribai Phule and Jyotiba Phule fought against not exist in India? Is the country free from caste-based prejudices today? "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/active-shooter-reported-at-florida-state-university-injuries-students-faculty-emergency-2710720-2025-04-17",
      "headline": "Two killed, 4 injured in shooting at Florida State University, campus on lockdownA gunman opened fire near the student union at Florida State University on Thursday, killing two and injuring at least four others, prompting a campus lockdown, chaotic evacuation scenes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-firm-in-kyiv-kusum-healthcare-ukrainian-missile-russia-2710678-2025-04-17",
      "headline": "Russia denies attacking Indian pharma godown in Kyiv, blames Ukrainian missilesThe Russian embassy said that the \"most likely explanation\" for the fire at Indian pharma warehouse in Kyive is that \"one of Ukrainian air defence missiles fell on Kusum Healthcare's warehouse setting it on fire\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-tariff-war-trade-talks-us-china-products-xi-jinping-2710747-2025-04-17",
      "headline": "Trump optimistic about 'great deal' with China after slapping 245% tariffsDespite sharp exchanges between the US and Chinese leaders recently over the tariff issue, Donald Trump expressed confidence that the two nations would \"make a very good deal\". He also expressed optimism about trade discussions with the European Union."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/electric-led-acne-patches-are-viral-but-do-they-even-work-2710414-2025-04-17",
      "headline": "Electric acne patches look cool and are viral. But do they even work?Electric acne patches with light therapy are wearable patches that use LED light (mostly blue, red, or both) to 'kill acne-causing bacteria, reduce inflammation, and speed up healing'. Indian influencers are obsessed with them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/radford-university-on-lockdown-after-reports-of-active-shooter-nearby-glbs-2710768-2025-04-18",
      "headline": "Virginia's Radford University on lockdown after reports of active shooter nearbyAuthorities are searching for two suspects: a Black male with dreadlocks, wearing a white and yellow shirt, and another Black male in a green long-sleeved shirt."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-citizen-killed-after-hijacking-plane-in-belize-3-injured-report-glbs-2710760-2025-04-18",
      "headline": "Knife-wielding US citizen tries to hijack flight in Belize, shot dead mid-airThe assailant wanted to be taken out of the country and demanded more fuel for the plane, reported ABC News. He was shot by a passenger on board, police said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/jee-mains-result-2025-session-2-results-live-direct-link-here-2710484-2025-04-17",
      "headline": "JEE Mains Result 2025 Live: JEE Main Session 2 - What's the latest update on results?JEE Mains Result 2025 is expected to be declared soon on the official website, but the exact timing remains uncertain. The NTA has removed the final answer key from the official website without providing any explanation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-phoenix-ikner-florida-state-university-gunman-son-of-leon-county-deputy-glbs-2710771-2025-04-18",
      "headline": "Who is Phoenix Ikner? Florida State University gunman, son of Leon County DeputyTwo people were killed and at least five others have been hospitalised after Ikner opened fire at Florida State University. He has been taken into custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/royal-challengers-bengaluru-ipl-sues-uber-viral-ad-travis-head-delhi-high-court-2710387-2025-04-17",
      "headline": "RCB sues Uber over viral 'Hyderabaddie' ad featuring Travis HeadRCB, in its petition before the Delhi High Court, alleged that Uber disparaged its trademark in its YouTube ad, 'Baddies in Bengaluru ft. Travis Head'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gangster-happy-passia-punjab-grenade-attack-detained-in-us-exclusive-2710722-2025-04-17",
      "headline": "Gangster behind 14 attacks in Punjab and wanted by NIA detained in US: SourcesPassia had claimed responsibility for an attack in which a senior police officer's vehicle exploded near the Gumtala police post in Punjab's Amritsar in January 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-indias-quest-for-rafale-jets-for-navy-air-force-why-need-overrides-cost-2710519-2025-04-17",
      "headline": "In India's quest for Rafale jets for navy, air force, why need overrides costA deal for 26 Rafale Marine jets for the navy is expected this month even as the IAF reportedly eyes more Rafale aircraft for its depleting fleet"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tiffany-fong-elon-musk-controversy-x-tesla-ceo-cryptocurrency-influencer-baby-2710565-2025-04-17",
      "headline": "Meet Tiffany Fong, the influencer who refused to make a baby with Elon Musk Crypto influencer Tiffany Fong turned down Elon Musk's offer to have his child. Read on to know more about Fong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/buldhana-hair-loss-patients-now-losing-nails-2710654-2025-04-17",
      "headline": "After sudden baldness, people in this Maharashtra district now seeing nail lossIn Maharashtra's Buldhana, people who had been suffering from hair loss are now reportedly facing nail deformities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/newborn-kidnapped-from-safdarjung-hospital-delhi-police-crack-case-within-hours-2710717-2025-04-17",
      "headline": "Unable to conceive, woman fakes pregnancy, kidnaps newborn from Delhi hospitalThe accused, Pooja, escaped with the infant at around 3:17 pm, evading everyone's notice, according to the police. Her motive? She wanted to become a mother after having no luck conceiving during seven years of marriage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-slams-pakistan-army-chief-general-asim-munir-jammu-kashmir-jugular-veins-2710488-2025-04-17",
      "headline": "Illegal occupation: India slams Pak Army's 'Kashmir our jugular vein' commentPakistan Army Chief General Asim Munir's 'won't forget it' warning on Jammu and Kashmir drew a sharp reaction from India, with New Delhi urging Pakistan to hand over the 'illegally occupied territories,' referring to Pakistan-Occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/youll-know-what-kurkure-maggi-are-why-sc-move-on-clear-food-labels-is-big-2710533-2025-04-17",
      "headline": "'You'll know what Kurkure, Maggi are…': Why SC move on clear food labels is bigNutrition-labelling norms have been in the works in India for over a decade; now the top court has set a deadline for the government to fix and implement guidelines"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-will-jacks-jasprit-bumrah-ryan-rickelton-mi-beat-srh-2710736-2025-04-17",
      "headline": "IPL 2025, MI vs SRH: All-round Mumbai hammer Hyderabad as Wankhede springs surpriseMumbai Indians (MI) registered their third win of the Indian Premier League 2025 (IPL 2025), beating Sunrisers Hyderabad by four wickets in Match 33 at Wankhede Stadium in Mumbai. Will Jacks emerged as the star for MI with his all-round show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhars-strong-remarks-on-supreme-court-order-president-deadline-bills-2710485-2025-04-17",
      "headline": "Super Parliament: Vice President's no-holds-barred attack on Supreme CourtVice President Jagdeep Dhankhar expressed alarm at the judiciary stepping into roles reserved for the Executive and Legislature. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-gushes-over-italian-pm-georgia-meloni-says-i-like-her-very-much-glbs-2710769-2025-04-18",
      "headline": "'I like her very much': Trump gushes over Italian PM Giorgia MeloniMeloni's visit to Washington today had been highly anticipated, especially amid ongoing trade tensions between the United States and the European Union. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/phule-movie-release-delay-journey-explained-controversy-caste-cinema-and-uncomfortable-truths-2710415-2025-04-17",
      "headline": "Caste, cinema and uncomfortable truths: Phule's delayed release journey explainedWhy has a film about India's two revolutionary thinkers upset the self-proclaimed caretakers of the Brahmin community? Did the caste-discrimination that Savitribai Phule and Jyotiba Phule fought against not exist in India? Is the country free from caste-based prejudices today? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-get-land-99-paise-andhra-pradesh-visakhapatnam-nara-lokesh-it-hub-growth-promotion-2710238-2025-04-17",
      "headline": "21 acres for just 99 paise: Big land allotment to TCS as Andhra bets big on techThe cabinet of Andhra Pradesh cleared the proposal on Tuesday, stating that the project is expected to bring in an investment of around Rs 1,370 crore and create nearly 12,000 jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/blusmart-was-a-whiff-of-fragrance-cleantech-dirt-choked-it-sebi-ban-gensol-gaggi-brothers-diverting-funds-2710499-2025-04-17",
      "headline": "BluSmart was a whiff of fresh air, but cleantech dirt choked itFor customers left at the mercy of last-minute ride cancellations and whimsical drivers, BluSmart was a breath of fresh air. Its courteous drivers with squeaky-clean EVs will be missed as BluSmart, ironically, falls victim to the dirt of cleantech. It has become another lesson to the Byjus chapter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/waqf-act-hearing-supreme-court-order-no-changes-to-existing-rule-waqf-by-user-centre-2710421-2025-04-17",
      "headline": "No waqf appointments, changes to waqf by user till next hearing: Supreme CourtThe Centre assured the Supreme Court that no appointments would be made to Waqf boards. The new law makes it compulsory to include non-Muslims as its members."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-hardik-pandya-el-clasico-csk-2710757-2025-04-18",
      "headline": "IPL 2025: Hardik Pandya eager for CSK clash, praises MI bowlers for SRH winHardik Pandya expressed his eagerness to square off against Chennai Super Kings once again for the second El Clasico of the IPL 2025 season. CSK had beaten MI in the previous clash between both teams faced off earlier in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gujarat-titans-sign-dasun-shanaka-as-replacement-for-injured-glenn-phillips-2710755-2025-04-18",
      "headline": "IPL 2025: GT sign Dasun Shanaka as replacement for injured Glenn PhillipsGujarat Titans have signed Sri Lanka all-rounder Dasun Shanaka as a replacement for the injured Glenn Phillips for the remainder of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-ryan-rickleton-heinrich-klaasen-no-ball-controversy-2710749-2025-04-17",
      "headline": "How Heinrich Klaasen's wicketkeeping error gave Ryan Rickleton 2nd life in MI vs SRHHeinrich Klaasen's wicketkeeping error handed Ryan Rickleton a second life in the MI vs SRH clash on Thursday, April 17. Here's a look at why the delivery was called a no-ball and the law behind it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-will-jacks-jasprit-bumrah-ryan-rickelton-mi-beat-srh-2710736-2025-04-17",
      "headline": "IPL 2025, MI vs SRH: All-round Mumbai hammer Hyderabad as Wankhede springs surpriseMumbai Indians (MI) registered their third win of the Indian Premier League 2025 (IPL 2025), beating Sunrisers Hyderabad by four wickets in Match 33 at Wankhede Stadium in Mumbai. Will Jacks emerged as the star for MI with his all-round show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-pbks-bhuvneshwar-kumar-press-conference-2710723-2025-04-17",
      "headline": "IPL 2025: Bhuvneshwar Kumar comments on role of him and Josh Hazlewood at RCBBhuvneshwar Kumar explained his and Josh Hazlewood's role with RCB this season. Bhuvneshwar and Hazlewood have been leading the bowling attack for Bengaluru this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-distraught-after-throwing-away-good-start-against-srh-2710714-2025-04-17",
      "headline": "IPL 2025: Rohit Sharma distraught after throwing away good start against SRHMumbai Indians' (MI) opening batter Rohit Sharma looked distraught following his dismissal against Sunrisers Hyderabad (SRH) in Match 33 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-bhuvneshwar-kumar-saliva-ban-2710709-2025-04-17",
      "headline": "RCB's Bhuvneshwar Kumar forgot about saliva ban being lifted: Will use it vs PBKSBhuvneshwar Kumar revealed that he forgot about the saliva ban being lifted in the IPL 2025 and said he will use it in the RCB vs PBKS game. The ban taken off before the start of the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-travis-head-slowest-knock-memes-stats-2710694-2025-04-17",
      "headline": "MI vs SRH: Travis Head's slowest knock in IPL history triggers meme festPL 2025, MI vs SRH: Travis Head managed just 28 off 29 balls, a shadow of his usual aggressive self in Mumbai on Thursday. It was his slowest knock in IPL history as SunRisers Hyderabad huffed and puffed their way to 162 in 20 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-2nd-fastest-to-1000-ipl-runs-during-his-slowest-knock-2710679-2025-04-17",
      "headline": "MI vs SRH: Travis Head 2nd fastest to 1000 IPL runs on day of his slowest knockSunrisers Hyderabad (SRH) opener Travis Head became the second fastest to complete 1000 runs in IPL history in terms of balls faced on the day he played his slowest knock against Mumbai Indians (MI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-shares-story-behind-garden-me-nahi-ghoomna-dialogue-2710657-2025-04-17",
      "headline": "Rohit Sharma shares story behind iconic 'Garden me nahi ghoomna' dialogueIndia captain Rohit Sharma has opened up on his famous 'Koi Garden me nahi ghoomega' dialogue and revealed what prompted him to say that on the field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-rohit-sharma-impact-player-fans-reaction-2710658-2025-04-17",
      "headline": "Rohit Sharma a permanent impact player? Fans unhappy with MI team combinationIPL 2025, MI vs SRH: A section of Mumbai Indians fans have expressed their disappointment with the five-time champions using their star player, Rohit Sharma, as an Impact Sub. More often than not, the former captain has played as Impact Sub. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-bhuvneshwar-kumar-saliva-ban-2710709-2025-04-17",
      "headline": "RCB's Bhuvneshwar Kumar forgot about saliva ban being lifted: Will use it vs PBKSBhuvneshwar Kumar revealed that he forgot about the saliva ban being lifted in the IPL 2025 and said he will use it in the RCB vs PBKS game. The ban taken off before the start of the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-travis-head-slowest-knock-memes-stats-2710694-2025-04-17",
      "headline": "MI vs SRH: Travis Head's slowest knock in IPL history triggers meme festPL 2025, MI vs SRH: Travis Head managed just 28 off 29 balls, a shadow of his usual aggressive self in Mumbai on Thursday. It was his slowest knock in IPL history as SunRisers Hyderabad huffed and puffed their way to 162 in 20 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-2nd-fastest-to-1000-ipl-runs-during-his-slowest-knock-2710679-2025-04-17",
      "headline": "MI vs SRH: Travis Head 2nd fastest to 1000 IPL runs on day of his slowest knockSunrisers Hyderabad (SRH) opener Travis Head became the second fastest to complete 1000 runs in IPL history in terms of balls faced on the day he played his slowest knock against Mumbai Indians (MI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-shares-story-behind-garden-me-nahi-ghoomna-dialogue-2710657-2025-04-17",
      "headline": "Rohit Sharma shares story behind iconic 'Garden me nahi ghoomna' dialogueIndia captain Rohit Sharma has opened up on his famous 'Koi Garden me nahi ghoomega' dialogue and revealed what prompted him to say that on the field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-rohit-sharma-impact-player-fans-reaction-2710658-2025-04-17",
      "headline": "Rohit Sharma a permanent impact player? Fans unhappy with MI team combinationIPL 2025, MI vs SRH: A section of Mumbai Indians fans have expressed their disappointment with the five-time champions using their star player, Rohit Sharma, as an Impact Sub. More often than not, the former captain has played as Impact Sub. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-captaincy-pakistan-cricket-iftikhar-ahmed-2710648-2025-04-17",
      "headline": "Mohammad Rizwan best choice for Pakistan captaincy at the moment: Iftikhar AhmedIftikhar Ahmed has shown his support to under-fire ODI captain Mohammad Rizwan and feels he is the best option for captaincy at the moment. Rizwan has been under heavy criticism after the Pakistan's poor Champions Trophy campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-jasprit-bumrah-fitness-hardik-pandya-2710621-2025-04-17",
      "headline": "Don't worry, Bumrah is fine: Hardik Pandya on MI pacer's fitness in IPL 2025Mumbai Indians captain Hardik Pandya has said that there are no worries about Jasprit Bumrah's fitness ahead of the clash against Sunrisers Hyderabad. Bumrah missed the initial few games for MI this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-mi-vs-srh-today-match-wankhede-updates-2710599-2025-04-17",
      "headline": "MI vs SRH Highlights: All-round Will Jacks powers Mumbai to winIPL 2025, Mumbai Indians (MI) vs SunRisers Hyderabad (SRH) live score and updates: An all-round performance from Will Jacks has helped MI secure their third win of the campaign. Jacks scored 36 runs and picked up 2 wickets on a sluggish track as Hyderabad's woes continue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fans-slam-rajasthan-royals-for-continuous-backing-riyan-parag-2710587-2025-04-17",
      "headline": "Misplaced trust in Riyan Parag? Fans slam RR for continuous backing of young starRajasthan Royals' (RR) fans slammed their team management for continuously backing the youngster Riyan Parag despite his failure to repay team's trust time and again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-virgil-van-dijk-contract-extension-2710592-2025-04-17",
      "headline": "After Mohamed Salah, Liverpool extend Virgil van Dijk's contract till 2027After Mohamed Salah, Liverpool have extended Virgil Van Dijk's contract at the club beyond this season. Van Dijk will remain at Liverpool until 2027 as he signed his new deal on Thursday, April 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/golf-pga-tour-suspends-wesley-bryan-over-liv-backed-event-glbs-2710570-2025-04-17",
      "headline": "Golf: PGA Tour suspends Wesley Bryan over LIV-backed eventGolf star Wesley Bryan was suspended from the PGA Tour for participating in 'The Duels: Miami,' a LIV Golf-backed creator event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-arshdeep-singh-role-seniority-trolling-2710544-2025-04-17",
      "headline": "Since coming to PBKS, been feeling like a senior in team: Arshdeep SinghPBKS pacer Arshdeep Singh has said that apart from his first season at the franchise, he has felt like a senior in the squad. Arshdeep has been leading Punjab's attack since joining the team in 2019.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mabppe-champions-league-real-madrid-vs-arsenal-booed-santiago-bernabeu-2710494-2025-04-17",
      "headline": "Santiago Bernabeu jeers at Kylian Mbappe: The Frenchman's numbers roar backKylian Mbappe's Champions League night ended in heartbreak as Arsenal dismantled Real Madrid and a section of the Bernabeu jeered their star. But football is rarely a solo show — and Mbappe can't carry the crown alone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-virgil-van-dijk-contract-extension-2710592-2025-04-17",
      "headline": "After Mohamed Salah, Liverpool extend Virgil van Dijk's contract till 2027After Mohamed Salah, Liverpool have extended Virgil Van Dijk's contract at the club beyond this season. Van Dijk will remain at Liverpool until 2027 as he signed his new deal on Thursday, April 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/golf-pga-tour-suspends-wesley-bryan-over-liv-backed-event-glbs-2710570-2025-04-17",
      "headline": "Golf: PGA Tour suspends Wesley Bryan over LIV-backed eventGolf star Wesley Bryan was suspended from the PGA Tour for participating in 'The Duels: Miami,' a LIV Golf-backed creator event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-arshdeep-singh-role-seniority-trolling-2710544-2025-04-17",
      "headline": "Since coming to PBKS, been feeling like a senior in team: Arshdeep SinghPBKS pacer Arshdeep Singh has said that apart from his first season at the franchise, he has felt like a senior in the squad. Arshdeep has been leading Punjab's attack since joining the team in 2019.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mabppe-champions-league-real-madrid-vs-arsenal-booed-santiago-bernabeu-2710494-2025-04-17",
      "headline": "Santiago Bernabeu jeers at Kylian Mbappe: The Frenchman's numbers roar backKylian Mbappe's Champions League night ended in heartbreak as Arsenal dismantled Real Madrid and a section of the Bernabeu jeered their star. But football is rarely a solo show — and Mbappe can't carry the crown alone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/suruchi-singh-shooter-issf-world-cup-lima-saurabh-choudhary-2710490-2025-04-17",
      "headline": "Teenage shooter Suruchi Singh leads India's medal rush in Peru World Cup ISSF World Cup 2025: A day after winning the 10m air pistol gold medal, Suruchi Singh, an 18-year-old from Haryana, combined with Saurabh Chaudhary to win the 10m air pistol mixed team in Lima. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-sacramento-kings-part-ways-with-gm-monte-mcnair-following-play-in-loss-to-mavericks-glbs-2710487-2025-04-17",
      "headline": "NBA: Sacramento Kings part ways with GM Monte McNair following Play-In loss to MavericksThe Sacramento Kings have officially parted ways with general manager Monte McNair. This decision comes just hours after the team's 120-106 loss to the Dallas Mavericks in the NBA Play-in tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-ishan-kishan-300-obsession-not-fixated-2710464-2025-04-17",
      "headline": "Ishan Kishan not fixated on SRH's 300-run dreamDespite Sunrisers Hyderabad's open ambition to breach the 300-run barrier, Ishan Kishan insists there's no obsession with the number. For him, the priority remains team performance over milestones or individual landmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-bcci-assistant-coach-sacking-scapegoat-fans-reaction-2710469-2025-04-17",
      "headline": "Abhishek Nayar made scapegoat? Sacking of India assistant coach shocks fansThe sacking of Abhishek Nayar, India's assistant coach, just eight months into his tenure has not gone down well with a section of fans. The former Mumbai all-rounder has become the first casualty of the BCCI's review meeting following India's disastrous Test tour of Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-captaincy-delhi-capitals-template-2710461-2025-04-17",
      "headline": "Axar Patel relishing DC captaincy in IPL 2025: I don't go by the templateDelhi Capitals captain Axar Patel is enjoying his captaincy, especially after leading his side to the top of the IPL 2025 points table following a thrilling Super Over victory over Rajasthan Royals at the Arun Jaitley Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-munaf-patel-bcci-fine-viral-video-heated-argument-umpire-2710423-2025-04-17",
      "headline": "BCCI penalises Delhi Capitals bowling coach Munaf Patel. Here's whyIPL 2025: Delhi Capitals bowling coach Munaf Patel was seen arguing with the fourth umpire from near the boundary rope during the team's thrilling win over Rajasthan Royals on Wednesday, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-dodgers-vs-rockies-treasure-performs-tommy-edman-shares-unforgettable-moment-glbs-2710402-2025-04-17",
      "headline": "MLB Dodgers vs Rockies: Treasure performs, Tommy Edman shares unforgettable momentKorean pride and baseball passion came together at Dodger Stadium during the Los Angeles Dodgers' 8-7 win over the Colorado Rockies on Wednesday night, April 16. South Korean boy band Treasure ignited the crowd at Centerfield Plaza. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-fan-wheelchair-selfie-airport-video-2710396-2025-04-17",
      "headline": "Watch: MS Dhoni stops to take selfie with fan in wheelchair amid airport securityIPL2025: Chennai Super Kings captain MS Dhoni took time out to meet and greet a fan in a wheelchair while heading out of an airport. Dhoni's heartwarming gesture has been appreciated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-match-preview-predicted-xi-weather-prediction-2710389-2025-04-17",
      "headline": "MI vs SRH, Match preview: Mount 300 in-sight as heavy-hitting sides faceoffIPL 2025, MI vs SRH Match Preview: With both teams packed with explosive hitters and eyeing momentum, MI vs SRH at Wankhede could turn into a run-fest. If the stars align, IPL 2025 might just witness its first 300-run innings on April 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-women-contract-jess-jonassen-tess-flintoff-2710340-2025-04-17",
      "headline": "Jess Jonassen left out, Flintoff earns maiden Cricket Australia women's contractCricket Australia (CA) has unveiled its new 18-player women's national contract list for the 2025-26 season. Veteran all-rounder Jess Jonassen has been left out of the updated list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-heats-dominate-bulls-while-mavericks-edge-out-kings-glbs-2710343-2025-04-17",
      "headline": "NBA Play-in tournament: Heat dominate Bulls while Mavericks edge out KingsThe Dallas Mavericks and the Miami Heat kept their chances alive for the playoffs after winning their respective games on Wednesday night, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-mumbai-indians-batter-naman-dhir-press-conference-2710326-2025-04-17",
      "headline": "Hardik, Pollard have helped me stay calm under pressure: Naman DhirIPL 2025, MI vs SRH: In the pre-match press conference, Naman Dhir said that Hardik Pandya and Kieron Pollard have helped him learn the art of staying calm under pressure while batting at No.6 and 7.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}