{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/loan-fraud-case-ed-issues-lookout-notice-against-anil-ambani-2764968-2025-08-01",
      "headline": "Loan fraud case: ED issues lookout notice against Anil AmbaniA lookout circular has been issued against Anil Ambani at the request of the Enforcement Directorate (ED), preventing him from travelling abroad without court permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-buy-a-car-without-taking-loan-heres-how-you-can-do-it-2764705-2025-08-01",
      "headline": "Planning to buy a car without taking loan? Here's how you can do itThink you need a big salary or bank loan to own a car? Think again. A thoughtful plan, regular savings, and side gigs helped one man save Rs 7.1 lakh in three years, all without borrowing a rupee. Here's how you can do it too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/pnb-housing-finance-ltd-share-crash-18-percent-today-4-month-low-reason-md-ceo-resign-girish-kousgi-2764659-2025-08-01",
      "headline": "Explained: Why PNB Housing Finance Ltd shares crashed 18% todayPNB Housing Finance Ltd share crash: The steep fall followed days of weak performance. Over the past five days, the stock has lost 19.59%, and in the last month, it has dropped 26.53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-tax-rules-coming-soon-how-the-income-tax-bill-2025-could-impact-you-2764621-2025-08-01",
      "headline": "New tax rules coming soon. How the Income Tax Bill 2025 could impact youThe new law aims to make income tax rules easier to understand, reduce legal disputes, and help people comply with tax rules more easily. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sebi-upcoming-ipo-proposal-equity-dilution-25-percent-rule-report-2764605-2025-08-01",
      "headline": "Sebi may relax IPO float norms for big firms to just 2.5% equity: ReportAt present, Sebi rules say that any company with a post-issue capital of more than Rs 1 lakh crore must offer 5% equity and raise at least Rs 5,000 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/ed-investigates-anil-ambani-in-loan-fraud-case-summoned-on-august-5-2764523-2025-08-01",
      "headline": "ED investigates Anil Ambani in loan fraud case, summoned on August 5The Enforcement Directorate (ED) has summoned Anil Ambani for questioning on August 5 in the national capital. This is in connection with an investigation into an alleged loan fraud of Rs 12,500 crore. The development follows multiple searches the ED carried out at 35 locations in Mumbai, targeting business entities linked to the Anil Ambani group under the Prevention of Money Laundering Act (PMLA). The probe agency's action is also based on findings from a separate investigation by the Securities and Exchange Board of India (SEBI). A key point in the investigation is an alleged diversion of funds, with the transcript stating, \"The development actually came after the SEBI shared with the enforcement directorate the findings of a separate probe that launched into the alleged diversion of 10,000 crore by the Reliant infrastructure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summon-loan-fraud-news-august-5-questioning-enforcement-directorate-sebi-report-findings-2764568-2025-08-01",
      "headline": "Why has ED summoned Anil Ambani on August 5Anil Ambani, chairman and managing director of Reliance Group, has been summoned by the Enforcement Directorate (ED) for questioning on August 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-168-points-lower-nifty-below-24800-hul-gains-4-percent-2764538-2025-08-01",
      "headline": "Sensex opens 168 points lower, Nifty below 24,800; HUL gains 4%The S&P BSE Sensex was down by 150.77 points to 81,034.81, while the NSE Nifty50 lost 62.50 points to 24,705.85 as of 9:47 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-new-tariff-rate-69-countries-august-7-us-news-trade-deal-india-syria-eu-china-canada-2764532-2025-08-01",
      "headline": "Trump's new tariffs hit 69 nations: See who pays most and least from August 7The new order on tariffs will take effect from August 7 and will range from 10% to 41%, depending on the country, while others not mentioned in the list will face a default import duty of 10%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/womens-workforce-participation-is-very-low-kalpana-viswanath-ceo-safetipin-2764307-2025-07-31",
      "headline": "Women's workforce participation is very low; Kalpana Viswanath, CEO SafetipinIn a powerful discussion on women's rights and safety, a call was made for systemic change over waiting for patriarchal mindsets to shift. 'We just need the right to walk safely without looking over our shoulders,' one speaker emphasised, highlighting that safety is a right, not a form of protection. The conversation revealed that women hold less than 2% of jobs in the burgeoning gig economy, a stark contrast to their participation in the traditional economy. The panel also explored how urban infrastructure and product design often have a male-as-norm bias, from the height of bus handrails to the lack of pockets in women's clothing. The dialogue touched upon the 'pink tax' in transportation, where trip-chaining results in higher travel costs for women. The need for an enabling environment, including better public transport and services, was stressed as crucial for women's economic and social participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fenesta-cmo-susmita-nag-discusses-gender-bias-in-hiring-within-professional-workspaces-2764268-2025-07-31",
      "headline": "Fenesta CMO Susmita Nag discusses gender bias in hiring within professional workspacesA discussion highlights the stark reality for women in India's corporate sector, where they make up only 18% of the workforce in top NSE-listed companies. A woman leader recounted her early career in the late 90s, where she was told the company 'don't hire girls' and faced a lack of basic facilities like restrooms and proper safety gear in a factory setting. Another speaker addressed the issue of tokenism on corporate boards, suggesting that having three or more women in a group forms a cohort, whereas one is mere tokenism. The conversation delved into unconscious biases in hiring, noting that women's resumes are scrutinised for marital status more often than men's. The speakers emphasised that while policies like flexi-working exist, they can lead to subtle penalties and that a fundamental mindset shift, beyond just policy changes, is crucial for true gender equity in the workplace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-delayed-check-your-status-in-these-2-easy-ways-2764267-2025-07-31",
      "headline": "ITR refund delayed? Check your status in these 2 easy waysUsually, if your return is e-verified, the refund is credited within four to five weeks. But if you're still waiting, you can easily check your refund status online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lead-from-the-front-pallavi-shroff-on-breaking-barriers-building-legacies-2764235-2025-07-31",
      "headline": "Lead from the front: Pallavi Shroff on breaking barriers, building legaciesSpeaking at the India Today Woman Summit 2025, Pallavi S Shroff, Managing Partner, Shardul Amarchand Mangaldas said that when she began her practice in 1981, there were barely four or five women arguing cases in court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India set to be 3rd largest economy: Minister after Trump's 'dead economy' jabThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-296-points-lower-nifty-below-24800-hul-up-4-2764181-2025-07-31",
      "headline": "Sensex ends 296 points lower, Nifty below 24,800; HUL up 4%The S&P BSE Sensex was down by 296.28 points to end at 81,185.58, while the NSE Nifty50 lost 86.70 points to close at 24,768.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-how-avoiding-a-rs-5000-splurge-every-month-can-make-you-a-crorepati-2764129-2025-07-31",
      "headline": "CA explains how avoiding a Rs 5,000 splurge every month can make you a crorepatiYoung professionals often burn out chasing income, yet let their money idle. A Chartered Accountant suggests ditching one Rs 5,000 splurge a month and letting compounding turn it into crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indian-farm-market-is-coming-in-between-india-and-us-tariff-negotiations-2764038-2025-07-31",
      "headline": "Behind the delayed US-India trade deal: A standoff over farmsAt the centre of the friction is a long-standing issue that has repeatedly stalled negotiations between the two countries: agriculture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/donald-trump-us-25-percent-tariff-on-india-impact-stock-market-sectors-explained-2764076-2025-07-31",
      "headline": "Trump's 25% tariffs: These stocks and sectors are in the firing lineBoth the main indices on Dalal Street fell sharply in early trade, and despite recovering by noon, the mood remains tense after Washington's move threatened to upend trade flows across key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/6-indian-firms-sanctioned-by-us-all-you-need-to-know-2764015-2025-07-31",
      "headline": "Who are the 6 Indian firms sanctioned by the US and what's at stake?Six Indian firms have been sanctioned by the US for allegedly importing Iranian petrochemicals. Here's all you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-now-open-update-your-past-itr-mistakes-for-ay-2021-22-and-2022-23-2764013-2025-07-31",
      "headline": "ITR-U now open: Update your past ITR mistakes for AY 2021-22 and 2022-23The Income Tax Department has now made it possible to file updated returns (ITR-U) for Assessment Years (AY) 2021-22 and 2022-23 using the ITR-1 and ITR-2 forms. This move aims to help people fix any errors or income details they may have missed earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-25-percent-tariff-which-sectors-most-impacted-gems-jewellery-2764005-2025-07-31",
      "headline": "Trump's 25% tariffs: Which sectors should brace for impact?US President Donald Trump announced a 25% tariff on Indian exports starting August 1.  An additional penalty was also announced for India's continued oil purchases from Russia, which has added more uncertainty for businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-down-today-stock-market-fall-why-reasons-us-tariff-it-shares-ril-adani-port-decline-2763979-2025-07-31",
      "headline": "Sensex falls 500 points: Why is stock market down todayHeavyweight stocks fell in early trade. The S&P BSE Sensex fell over 575 points in early trade to 80,907.34, while the NSE Nifty50 dropped 185 points to 24,670.15 by 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-15-detailed-report-ahaan-panday-film-remains-unbothered-by-new-releases-son-of-sardaar-2-and-dhadak-2-2765113-2025-08-02",
      "headline": "Saiyaara box office Day 15: Ahaan Panday's film remains unbothered by new releases'Saiyaara' didn't seem to be affected by 'Son of Sardaar 2' and 'Dhadak 2' at the box office. The film will be entering the Rs 300 crore club by the end of its third weekend in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-vs-dhadak-2-box-office-collection-day-1-detailed-report-ajay-devgn-film-earns-twice-2765105-2025-08-02",
      "headline": "Son of Sardaar 2 vs Dhadak 2 box office Day 1: Ajay Devgn's film earns twiceBoth 'Son of Sardaar 2' and 'Dhadak 2' have received mixed reviews from the audience and critics. The films also faced 'Saiyaara', opening to a single-digit figure at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-kalabhavan-nawas-found-dead-at-kochi-hotel-2765102-2025-08-02",
      "headline": "Malayalam actor Kalabhavan Nawas found dead at Kochi hotelActor Kalabhavan Nawas had reportedly gone to his hotel room to bring his luggage while checking out. However, the hotel staff found him dead in the room when they went up to check on him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/flaco-jimenez-accordion-king-who-made-tejano-global-dies-at-86-glbs-2765069-2025-08-02",
      "headline": "Flaco Jimenez, accordion king who made Tejano global, dies at 86Flaco Jimenez, Grammy-winning accordionist, brought global recognition to Tejano and conjunto music through his genre-blending style and iconic  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-returns-as-spider-man-in-brand-new-day-first-look-at-new-suit-glbs-2765060-2025-08-02",
      "headline": "Spider-Man: Brand New Day teaser released as Tom Holland swings back into actionTom Holland returns in Spider-Man: Brand New Day. Sony teases a new suit, real-world filming in Glasgow, and direction by Shang-Chi's Destin Daniel Cretton.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-reacts-to-winning-first-national-award-for-jawan-2764923-2025-08-01",
      "headline": "Overwhelmed SRK calls National Award responsibility to show truth, not finishing lineActor Shah Rukh Khan wrote a heartfelt note on winning the Best Actor in a Leading Role Award for 'Jawan' at the 71st National Film Awards. He shared the award with actor Vikrant Massey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-reacts-to-anthony-hopkins-hanibal-spoof-of-her-face-wrap-brand-2764942-2025-08-01",
      "headline": "Kim Kardashian reacts to Anthony Hopkins Hanibal spoof of her face wrap brandActor Anthony Hopkins humorously wore a SKIMS face wrap resembling his Hannibal Lecter mask. He joked about feeling younger in the viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-rao-thanks-shah-rukh-khan-anirudh-national-award-win-chaleya-best-playback-singer-2764973-2025-08-01",
      "headline": "Shilpa Rao thanks Shah Rukh Khan, Anirudh as she wins National Award for ChaleyaSinger Shilpa Rao thanked actor Shah Rukh Khan after winning the Best Playback Singer Award at the 71st National Award. She won the award for the romantic track - 'Chaleya' from 'Jawan'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/janki-bodiwala-dedicates-national-award-to-team-vash-calls-director-her-god-2764984-2025-08-01",
      "headline": "Janki Bodiwala dedicates National Award to team Vash, calls director her godJanki Bodiwala won the Best Supporting Actor award at the 71st National Film Awards for her impactful role in the Gujarati film 'Vash', marking a major milestone in her career. She shared the honour with Malayalam actor Urvashi and hopes this win will inspire more female-led stories in regional cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-dedicates-national-award-win-to-marginalised-privileged-sharing-it-with-shah-rukh-khan-2764959-2025-08-01",
      "headline": "Vikrant Massey dedicates National Award to marginalised, lucky sharing it with SRKVikrant Massey has won his first National Award for his powerful role in the film '12th Fail'. He expressed heartfelt gratitude and dedicated the honour to marginalised people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sudipto-sen-best-director-the-kerala-story-national-film-awards-2023-2764957-2025-08-01",
      "headline": "The Kerala Story's Sudipto Sen reacts to Best Director win at National AwardsSudipto Sen won the Best Director for 'The Kerala Story' at the 71st National Film Awards. The film's portrayal of ISIS recruitment sparked debate but gained widespread public support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-gets-a-certificate-ahead-of-august-14-release-2764948-2025-08-01",
      "headline": "Rajinikanth's Coolie gets A certificate ahead of August 14 releaseRajinikanth's upcoming film 'Coolie', directed by Lokesh Kanagaraj, earned an A certificate. Featuring a stellar cast and Aamir Khan's special cameo, the film is highly anticipated for its high-octane sequences and will release on August 14 in multiple languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-calls-her-first-national-award-as-best-actress-deeply-personal-2764951-2025-08-01",
      "headline": "Rani Mukerji calls her first National Award as Best Actress deeply personalRani Mukerji won her first National Award for 'Mrs Chatterjee vs Norway' after 30 years in films. She dedicated the award to all mothers and thanked her fans for their love and support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tehran-trailer-john-abraham-battles-enemies-across-borders-in-action-packed-drama-2764940-2025-08-01",
      "headline": "Tehran trailer: John Abraham battles enemies across borders in action-packed dramaJohn Abraham's upcoming film 'Tehran' is a gripping spy thriller inspired by real events, with a trailer that teases intense action, political drama, and a high-stakes mission. The film, co-starring Manushi Chhillar, will premiere on Zee5 on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-winners-2025-who-won-best-actor-best-film-check-full-list-2764941-2025-08-01",
      "headline": "71st National Film Awards: Best Actor, Best Film and more. Full winners' list hereThe 71st National Film Awards were announced in New Delhi, honouring excellence across Indian cinema with Shah Rukh Khan and Vikrant Massey sharing Best Actor and Rani Mukerji winning Best Actress. Check out the full winners' list here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-and-vikrant-massey-share-national-award-for-best-actor-rani-mukerji-wins-best-actress-2764907-2025-08-01",
      "headline": "Vikrant Massey-SRK share National Award for Best Actor, Rani Mukerji wins Best ActressVikrant Massey and Shah Rukh Khan won Best Actor for '12th Fail' and 'Jawan' respectively at the 71st National Film Awards. Rani Mukerji bagged Best Actress for her role in 'Mrs Chatterjee vs Norway'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kathal-a-jackfruit-mystery-wins-national-film-award-for-best-hindi-feature-2764898-2025-08-01",
      "headline": "Sanya Malhotra's Kathal wins Best Hindi Feature at National Film Awards 2025'Kathal: A Jackfruit Mystery' won Best Hindi Feature at the 71st National Film Awards, announced on August 1. The film was praised for its unique storytelling, strong performances, and socially relevant message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janhvi-kapoor-ishaan-khatter-homebound-to-close-indian-film-festival-of-melbourne-2025-2764739-2025-08-01",
      "headline": "Janhvi Kapoor-Ishaan Khatter's Homebound to close Indian Film Festival of MelbourneAfter a successful premiere at Cannes, 'Homebound' starring Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor will close the Indian Film Festival of Melbourne (IFFM) 2025. Directed by Neeraj Ghaywan, the film explores friendship, ambition, and the emotional cost of change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-sikandar-failure-ar-murugadoss-says-mother-tongue-films-tap-his-potential-2764853-2025-08-01",
      "headline": "After Sikandar failure, AR Murugadoss says mother-tongue films tap his potentialDirector AR Murugadoss highlights the importance of making films in one's mother-tongue, citing challenges in translating cultural nuances and emotions when working with other languages. His statement comes after the failure of Salman Khan's 'Sikandar'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/good-step-trump-welcomes-report-of-india-possibly-halting-russian-oil-imports-glbs-2765071-2025-08-02",
      "headline": "Good step: Trump welcomes reports of India possibly halting Russian oil importsThe US has exerted geopolitical pressure on countries continuing to purchase Russian oil, as part of its intensified efforts to curb Moscow's revenue streams amid the ongoing war in Ukraine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gunfight-underway-with-3-lashkar-terrorists-in-jks-kulgam-2764971-2025-08-01",
      "headline": "Operation Akhal: Terrorist killed in gunfight with security forces in J&KOne TRF terrorist was killed, and two others are trapped in an ongoing gunfight with security forces in Jammu and Kashmir's Kulgam district. The encounter is part of Operation Akhal following inputs about terrorists linked to the Pahalgam attack.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-submarines-already-under-watch-no-response-needed-russian-lawmaker-glbs-2765082-2025-08-02",
      "headline": "Enough nuke submarines to control two: Russian lawmaker after Trump's moveRussia dismisses Trump's submarine move, claiming US subs are already tracked. Moscow urges calm as tensions rise amid fears of direct conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/supper-clubs-are-having-a-moment-and-its-not-just-about-the-food-2764790-2025-08-02",
      "headline": "Supper clubs are having a moment, and it's not just about the foodSupper clubs, a rising trend in the food scene, are all about turning strangers into dinner companions over delicious food and laid-back conversations. There's something special about sharing a table, discovering new flavours, and chatting without pressure; it brings people together in the most effortless way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-v-england-oval-test-mohammed-siraj-jasprit-bumrah-absence-2765081-2025-08-02",
      "headline": "No Jassi bhai, no problem: Workhorse Siraj steps up for India againENG vs IND, 5th Test: India looked adrift on a gloomy day at The Oval. No Bumrah, no early breakthroughs, no rhythm. Ben Duckett and Zak Crawley were tearing into an attack that seemed toothless. But then, Mohammed Siraj stepped in. The man who's quietly carried India's pace load this series stepped up and swung the momentum in India's favour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-engineer-ashok-kumar-panda-vigilance-raid-raja-kishore-jena-cash-gold-luxury-properties-2765057-2025-08-02",
      "headline": "Luxury flats, prime properties: Vigilance raid uncovers Odisha engineer's empireA raid on a Bhubaneswar engineer led to the discovery of two four-storey buildings, seven flats, four commercial properties and nine high-value plots in and around the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-slaps-fellow-passenger-having-panic-attack-on-mumbai-kolkata-indigo-flight-handed-over-to-security-officials-2765044-2025-08-01",
      "headline": "Caught on camera: Man slaps fellow passenger having panic attack on IndiGo flightIn the video, the man was seen slapping the passenger unprovoked. The man having a panic attack was being helped by air hostesses when he was suddenly slapped by the accused. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/is-raj-thackerays-stagecraft-with-mva-another-prep-for-maharashtras-political-reset-2764220-2025-07-31",
      "headline": "Is Raj Thackeray's stagecraft with MVA another prep for Maharashtra's political reset?After the show of strength with Uddhav Thackeray, the MNS chief is set to join forces with key leaders of the Opposition bloc at the PWP's foundation day rally on August 2\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/story-of-the-crash-of-flight-ai-171-and-a-very-flighty-investigative-report-air-india-ahmedabad-2764682-2025-08-01",
      "headline": "Story of the crash of Flight AI 171 and a very flighty investigative reportThe Boeing 787 Dreamliner, which was on its way to London, crashed into the BJ Medical College hostel building in Ahmedabad within minutes of take-off on June 12. The tragedy left 260 people dead. Within a month of the AAIB's preliminary investigation report on the crash appearing to have settled blame on the cockpit crew, a veteran pilot shattered the silence with a striking analysis that turned the investigation on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-kalabhavan-nawas-found-dead-at-kochi-hotel-2765102-2025-08-02",
      "headline": "Malayalam actor Kalabhavan Nawas found dead at Kochi hotelActor Kalabhavan Nawas had reportedly gone to his hotel room to bring his luggage while checking out. However, the hotel staff found him dead in the room when they went up to check on him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/malegaon-case-witness-turns-hostile-says-officials-forced-him-to-name-yogi-adityanath-rss-leaders-2765075-2025-08-02",
      "headline": "Forced to name Yogi Adityanath, RSS leaders in Malegaon case: Hostile witnessMilind Joshirao alleged that he was subjected to custodial torture and pressured to implicate RSS leaders and Uttar Pradesh Chief Minister Yogi Adityanath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-winners-2025-who-won-best-actor-best-film-check-full-list-2764941-2025-08-01",
      "headline": "71st National Film Awards: Best Actor, Best Film and more. Full winners' list hereThe 71st National Film Awards were announced in New Delhi, honouring excellence across Indian cinema with Shah Rukh Khan and Vikrant Massey sharing Best Actor and Rani Mukerji winning Best Actress. Check out the full winners' list here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-said-that-white-house-should-be-asked-the-question-if-us-president-donald-trump-should-get-the-nobel-peace-prize-2764881-2025-08-01",
      "headline": "What India said on White House's call for Nobel Peace Prize for TrumpWhite House has claimed that the global peace deals brokered by Trump average to one per month and has reiterated the call for the Nobel Peace Prize to be awarded to the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-spacex-launches-crew-11-astronauts-on-six-month-mission-to-space-2764886-2025-08-01",
      "headline": "SpaceX launches Crew-11 astronauts on six-month mission to spaceThe Crew-11 mission ferried four astronauts to the International Space Station (ISS) for a science and technology expedition. The crew includes Nasa astronauts Zena Cardman and Mike Fincke, Japan Aerospace Exploration Agency (JAXA) astronaut Kimiya Yui, and Roscosmos cosmonaut Oleg Platonov."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-woman-looteri-dulhan-arrested-for-marrying-eight-men-extorting-lakhs-of-rupees-2765073-2025-08-02",
      "headline": "Nagpur's 'looteri dulhan' arrested for marrying 8 men, extorting lakhs of rupeesPolice said Samira Fatima used social media websites to identify her victims and lure them for marriage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/video/sink-city-gurugram-who-is-responsible-for-millennium-citys-civic-mess-2764905-2025-08-01",
      "headline": "'Sink city' Gurugram: Who is responsible for Millennium City's civic mess?This India Today special campaign for change focusses on the civic collapse in Gurgaon, the Millennium City. Residents, who have invested significantly in luxury properties, find themselves navigating a city plagued by infrastructural failure, especially during monsoons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-511-01-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-orders-two-nuclear-submarines-to-be-positioned-near-russia-after-dmitry-medvedevs-threat-2765015-2025-08-01",
      "headline": "Trump sends nuclear submarines near Russia after Putin aide's 'dead hand' threatUS President Trump announced on social media that two nuclear submarines have been deployed near Russia in response to foolish and inflammatory statements by Dimitry Medvedev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/shaadi-without-strings-and-gen-z-is-grabbing-the-chance-to-party-2764265-2025-07-31",
      "headline": "Shaadi without strings, and Gen Z is grabbing the chance to partyThe events mimic real marriages in decorations, rituals, baraat, mehendi and even sangeet, but there's no legal or religious binding—only pure fun\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-school-principal-arrested-for-assaulting-nursery-student-over-radhe-radhe-greeting-2765080-2025-08-02",
      "headline": "Chhattisgarh principal arrested for assaulting student over 'Radhe Radhe' greetingA 3.5-year-old girl was allegedly subjected to physical punishment by the principal of a private school for greeting her with \"Radhe-Radhe\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-flags-cisf-takeover-of-rajya-sabha-government-sources-call-them-marshals-2765078-2025-08-02",
      "headline": "Congress flags 'CISF takeover' of Rajya Sabha, government sources call them marshalsGovernment sources dismissed the claims, clarifying that the personnel present inside the Rajya Sabha were not part of any new or external security operation but were existing marshals drawn from the CISF, assigned to manage proceedings in the House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-orders-firing-of-labour-stats-chief-after-weak-july-jobs-report-release-glbs-2765061-2025-08-02",
      "headline": "Trump fires labour statistics chief Erika McEntarfer after weak July jobs reportPresident Trump accused BLS Commissioner Erika McEntarfer, a Biden appointee, of manipulating employment data and fired her after weak July jobs numbers and major revisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-15-detailed-report-ahaan-panday-film-remains-unbothered-by-new-releases-son-of-sardaar-2-and-dhadak-2-2765113-2025-08-02",
      "headline": "Saiyaara box office Day 15: Ahaan Panday's film remains unbothered by new releases'Saiyaara' didn't seem to be affected by 'Son of Sardaar 2' and 'Dhadak 2' at the box office. The film will be entering the Rs 300 crore club by the end of its third weekend in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-vs-dhadak-2-box-office-collection-day-1-detailed-report-ajay-devgn-film-earns-twice-2765105-2025-08-02",
      "headline": "Son of Sardaar 2 vs Dhadak 2 box office Day 1: Ajay Devgn's film earns twiceBoth 'Son of Sardaar 2' and 'Dhadak 2' have received mixed reviews from the audience and critics. The films also faced 'Saiyaara', opening to a single-digit figure at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-kalabhavan-nawas-found-dead-at-kochi-hotel-2765102-2025-08-02",
      "headline": "Malayalam actor Kalabhavan Nawas found dead at Kochi hotelActor Kalabhavan Nawas had reportedly gone to his hotel room to bring his luggage while checking out. However, the hotel staff found him dead in the room when they went up to check on him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/flaco-jimenez-accordion-king-who-made-tejano-global-dies-at-86-glbs-2765069-2025-08-02",
      "headline": "Flaco Jimenez, accordion king who made Tejano global, dies at 86Flaco Jimenez, Grammy-winning accordionist, brought global recognition to Tejano and conjunto music through his genre-blending style and iconic  \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-prasidh-krishna-reaction-joe-root-spat-2765109-2025-08-02",
      "headline": "Didn't expect that reaction: Prasidh on fiery moment with good mate RootPrasidh Krishna said that he wasn't expecting a big reaction from Joe Root after their verbal spat on Day 2 of the Oval Test on Friday, August 1. Prasidh and Root had a war of words as the umpires had to intervene to solve the matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-son-heung-min-leaves-tottenham-hotpsur-thomas-frank-2765095-2025-08-02",
      "headline": "Son Heung-Min announces decision to leave Tottenham: Need a new environmentSon Heung-Min has announced his decision to leave Tottenham Hotspur this summer ahead of the start of the new Premier League campaign. Son is a legend at the club, having joined them in 2015. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-joe-root-spat-prasidh-krishna-marcus-trescothick-2765086-2025-08-02",
      "headline": "Root vs Krishna: England batting coach plays down heated exchangeENG vs IND: England batting coach Marcus Trescothick opened up on the verbal volleys between Joe Root and Prasidh Krishna on Day 2 of the fifth Test at the Kennington Oval in London. Trescothick also commented on the interesting send-off that Akash Deep gave to Ben Duckett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-prasidh-krishna-on-indias-bowling-plan-in-2nd-session-at-oval-2765056-2025-08-02",
      "headline": "How clumsy India fought back after poor start with ball? Prasidh Krishna revealsIndia fast bowler Prasidh Krishna revealed how they scripted a comeback in the second session on Day 2 of the fifth Test against England at the Oval after an aggressive opening stand between Ben Duckett and Zak Crawley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-v-england-oval-test-mohammed-siraj-jasprit-bumrah-absence-2765081-2025-08-02",
      "headline": "No Jassi bhai, no problem: Workhorse Siraj steps up for India againENG vs IND, 5th Test: India looked adrift on a gloomy day at The Oval. No Bumrah, no early breakthroughs, no rhythm. Ben Duckett and Zak Crawley were tearing into an attack that seemed toothless. But then, Mohammed Siraj stepped in. The man who's quietly carried India's pace load this series stepped up and swung the momentum in India's favour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-mohammed-siraj-day-2-yashasvi-jaiswal-2765042-2025-08-02",
      "headline": "Lion-hearted Siraj, brave Jaiswal inspire Indian fightback in spicy Oval TestIndia vs England, 5th Test: Mohammed Siraj and Prasidh Krishna's efforts with the ball and Yashasvi Jaiswal's brisk second-innings fifty helped India overcome a poor morning session and edge ahead in a thrilling Test at Oval in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-kl-rahul-umpire-prasidh-root-sledging-2765023-2025-08-01",
      "headline": "Want us to keep quiet? Watch KL Rahul argue with umpire to back Prasidh vs RootIndia vs England: Day 2 of the final Anderson-Tendulkar Trophy Test saw intense sledging between Indian fast bowlers and England players. KL Rahul argued with umpire Kumar Dharmasena, who was seen warning Prasidh Krishna for a verbal duel with Joe Root. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-afghanistan-uae-asia-cup-schedule-tri-series-2764998-2025-08-01",
      "headline": "Pakistan, Afghanistan, UAE to play T20I tri-series to prepare for Asia CupPakistan, Afghanistan, and the UAE will play a T20I tri-series in Sharjah from August 29 to September 7, 2025. Each team plays the others twice in a double round-robin, with the top two meeting in the final on September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-mohammed-siraj-heart-oval-2764991-2025-08-01",
      "headline": "Siraj earns praise for fiery Oval spell: His heart is bigger than anyone else'sEngland vs India, 5th Test: Mohammed Siraj delivered a fiery bowling spell to lead India's comeback in the final Test at The Oval. Siraj bowled eight overs in a gritty post-lunch session on Day 2 in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-asia-cup-oval-test-england-vs-india-2764975-2025-08-01",
      "headline": "Did India rest Jasprit Bumrah from Oval Test with Asia Cup as bigger priority?ENG vs IND: India has released Jasprit Bumrah from the squad ahead of the fifth and final Test at The Kennington Oval in London. According to a BCCI source, the decision was made with an eye on managing his workload, as Bumrah is expected to feature in the upcoming Asia Cup.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-matt-henry-mitchell-santner-2764947-2025-08-01",
      "headline": "New Zealand wipe out Zimbabwe in 1st Test, take 1-0 series leadZIM vs NZ: New Zealand secured a 1-0 lead in the series after beating Zimbabwe by nine wickets in the opening game at the  Queens Sports Club in Bulawayo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-kl-rahul-umpire-prasidh-root-sledging-2765023-2025-08-01",
      "headline": "Want us to keep quiet? Watch KL Rahul argue with umpire to back Prasidh vs RootIndia vs England: Day 2 of the final Anderson-Tendulkar Trophy Test saw intense sledging between Indian fast bowlers and England players. KL Rahul argued with umpire Kumar Dharmasena, who was seen warning Prasidh Krishna for a verbal duel with Joe Root. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-afghanistan-uae-asia-cup-schedule-tri-series-2764998-2025-08-01",
      "headline": "Pakistan, Afghanistan, UAE to play T20I tri-series to prepare for Asia CupPakistan, Afghanistan, and the UAE will play a T20I tri-series in Sharjah from August 29 to September 7, 2025. Each team plays the others twice in a double round-robin, with the top two meeting in the final on September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-mohammed-siraj-heart-oval-2764991-2025-08-01",
      "headline": "Siraj earns praise for fiery Oval spell: His heart is bigger than anyone else'sEngland vs India, 5th Test: Mohammed Siraj delivered a fiery bowling spell to lead India's comeback in the final Test at The Oval. Siraj bowled eight overs in a gritty post-lunch session on Day 2 in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-asia-cup-oval-test-england-vs-india-2764975-2025-08-01",
      "headline": "Did India rest Jasprit Bumrah from Oval Test with Asia Cup as bigger priority?ENG vs IND: India has released Jasprit Bumrah from the squad ahead of the fifth and final Test at The Kennington Oval in London. According to a BCCI source, the decision was made with an eye on managing his workload, as Bumrah is expected to feature in the upcoming Asia Cup.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-matt-henry-mitchell-santner-2764947-2025-08-01",
      "headline": "New Zealand wipe out Zimbabwe in 1st Test, take 1-0 series leadZIM vs NZ: New Zealand secured a 1-0 lead in the series after beating Zimbabwe by nine wickets in the opening game at the  Queens Sports Club in Bulawayo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-prasidh-krishna-joe-root-video-fight-2764934-2025-08-01",
      "headline": "Oval Test: Nice guy Joe Root loses his cool after verbal volley with Prasidh KrishnaEngland vs India, 5th Test: Joe Root lost his cool after fast bowler Prasidh Krishna sledged him during the second session on Day 2. The Indian bowlers were fired up after being taken to the cleaners in the first session on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-aakash-deep-faces-flak-for-send-off-to-ben-duckett-in-oval-test-2764890-2025-08-01",
      "headline": "Unnecessary? Aakash Deep faces flak for send-off to Ben Duckett in Oval TestIndia fast bowler Akash Deep is facing flak for making unnecessary physical contact with England batter Ben Duckett after dismissing him on Day 2 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-224-batting-collapse-atkinson-5-wickets-day-2-oval-test-2764810-2025-08-01",
      "headline": "34 balls, 6 runs, 4 wickets: India's lower-order blown away on Day 2 morningEngland needed just 34 balls to dismantle the remaining four Indian wickets on a lively second morning at The Oval, bundling the visitors out for a modest 224 — the lowest first-innings total of the series so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-rahane-dropped-west-zone-duleep-trophy-bcci-zonal-format-2764789-2025-08-01",
      "headline": "End of the road for Pujara, Rahane: Legends left out of Duleep Trophy squadVeteran Indian cricketers Cheteshwar Pujara and Ajinkya Rahane have been left out of the West Zone Duleep Trophy squad. This decision could turn out to be a big hit on their Test careers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2  Highlights: Jaiswal fifty extends India's lead to 52 at StumpsIndia (IND) vs England (ENG), 5th Test, Day 2  Highlights: Yashasvi Jaiswal scored a 44-ball half-century as India extended their lead to 52 at Stumps on the second day. Gus Atkinson and Josh Tongue picked up a wicket apiece. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-rahane-dropped-west-zone-duleep-trophy-bcci-zonal-format-2764789-2025-08-01",
      "headline": "End of the road for Pujara, Rahane: Legends left out of Duleep Trophy squadVeteran Indian cricketers Cheteshwar Pujara and Ajinkya Rahane have been left out of the West Zone Duleep Trophy squad. This decision could turn out to be a big hit on their Test careers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2  Highlights: Jaiswal fifty extends India's lead to 52 at StumpsIndia (IND) vs England (ENG), 5th Test, Day 2  Highlights: Yashasvi Jaiswal scored a 44-ball half-century as India extended their lead to 52 at Stumps on the second day. Gus Atkinson and Josh Tongue picked up a wicket apiece. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-run-out-game-changer-oval-test-aakash-chopra-2764643-2025-08-01",
      "headline": "Shubman Gill's suicidal run-out was game-changer in Oval Test: Aakash ChopraAakash Chopra has weighed in on Shubman Gill's run-out on Day 1 of the fifth Test between India and England at The Oval, describing it as a game-changing moment that could potentially alter the course of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-oval-london-weather-conditions-2764651-2025-08-01",
      "headline": "Oval Test weather report: Will rain affect playing conditions on Day 2?India vs England: The weather played a massive role on Day 1 of the final Test match at The Oval. 6 wickets fell as India struggled to cope up with the movement in overcast conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/galatasaray-break-turkish-transfer-record-to-sign-victor-osimhen-from-napoli-2764604-2025-08-01",
      "headline": "Galatasaray break Turkish transfer record to sign Victor Osimhen from NapoliGalatasaray have pulled off a stunning coup by signing Nigerian striker Victor Osimhen from Napoli in a record-breaking deal, the club confirmed on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-raj-shamani-suicidal-thoughts-2764583-2025-08-01",
      "headline": "I had suicidal thoughts: Chahal breaks silence on divorce sagaYuzvendra Chahal has finally opened up on his divorce with Dhanashree Verma. The spinner spoke about the saga in details on a podcast, explaining his side of the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-west-indies-1st-t20i-report-saim-ayub-nawaz-2764570-2025-08-01",
      "headline": "Saim Ayub, Nawaz star for Pakistan as West Indies' horror run continuesWest Indies' poor run in T20 Internationals continued as they slipped to their sixth consecutive defeat, going down by 14 runs against Pakistan in the opening match at Lauderhill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-salman-agha-controversy-pakistan-cricket-board-refute-rift-2764555-2025-08-01",
      "headline": "Shaheen Afridi-Salman Agha controversy: Pakistan refute rift between top starsThe Pakistan Cricket Board (PCB) on Thursday dismissed rumours of a rift involving pacer Shaheen Shah Afridi, captain Salman Ali Agha, and head coach Mike Hesson, labelling the allegations as fabricated and defamatory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mca-honours-sunil-gavaskar-sharad-pawar-statues-wankhede-cricket-museum-2764546-2025-08-01",
      "headline": "Sunil Gavaskar, Sharad Pawar to be honoured with life-size statues at MCA museumLegendary India batter Sunil Gavaskar and veteran cricket administrator Sharad Pawar will be immortalised with life-size statues at the entrance of the upcoming Mumbai Cricket Association (MCA) museum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-seamer-chris-woakes-injured-shoulder-oval-injury-replacement-debate-2764525-2025-08-01",
      "headline": "England seamer Woakes injured; Stokes unlikely to get replacementIndia vs England 5th Test: England will be sweating over Chris Woakes' injury going into the Day 2 of the final Test match at The Oval. Will Woakes be allowed a replacement?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-shoulder-injury-final-test-oval-gus-atkinson-key-wickets-2764514-2025-08-01",
      "headline": "Not looking good: England sweat on Chris Woakes' injury in Oval TestENG vs IND, 5th Test: Gus Atkinson shared an update on Chris Woakes, who walked off the park in the Oval Test after injuring his shoulder while trying to stop the ball from going to the boundary."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}