{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uk-insurer-aviva-found-guilty-in-ud-26-million-fake-invoice-scandal-in-india-report-2590627-2024-08-30",
      "headline": "UK's Aviva found guilty in $26 million fake invoice scandal in India: ReportBritish insurer Aviva has been accused of violating regulations in India by using fake invoices and secret cash payments to bypass commission limits for sales agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-air-india-merger-check-impact-on-ticket-bookings-flight-operations-and-more-2590615-2024-08-30",
      "headline": "Vistara-Air India merger: Check impact on ticket bookings, flight operations and moreVistara-Air India merger: Travelers can expect expanded services and improved connectivity. Read on to see how this change will impact your bookings, flight operations, and travel experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-vistara-merger-likely-to-be-finalised-on-november-12-2590580-2024-08-30",
      "headline": "No Vistara flight bookings from September 3 ahead of merger with Air IndiaVistara-Air India merger: Starting from September 3, 2024, customers will no longer be able to book Vistara flights for travel on or after November 12, 2024. Bookings for these routes will be redirected to Air India's website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-ipo-allotment-status-step-by-step-guide-gmp-today-2590555-2024-08-30",
      "headline": "Premier Energies IPO allotment: Step-by-step guide to check status Premier Energies IPO allotment: Investors can check their Premier Energies IPO allotment status online via the BSE website or Kfin Technologies Limited, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-mukesh-ambani-bullish-on-reliances-growth-no-word-on-jio-retail-ipos-2590174-2024-08-29",
      "headline": "RIL AGM: Mukesh Ambani bullish on Reliance's growth; no word on Jio, Retail IPOsMukesh Ambani was bullish on the conglomerate's growth and said that Reliance was on track to more than double in size before the end of this decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shah-rukh-khan-debuts-on-hurun-india-rich-list-with-rs-7300-crore-net-worth-2590133-2024-08-29",
      "headline": "Shah Rukh Khan enters Hurun India Rich List with Rs 7,300 crore net worthKnown for his recent hits like 'Jawan' and 'Pathaan', Khan's wealth isn't just from his successful film career but also from his stakes in the IPL team, Kolkata Knight Riders, which have significantly increased in value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-end-higher-driven-record-high-gains-in-ril-stock-2590085-2024-08-29",
      "headline": "Sensex, Nifty end higher driven by gains in RIL stock The S&P BSE Sensex added 349.05 points to end at 82,134.61, while the NSE Nifty50 gained 99.60 points to close at 25,151.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-live-updates-reliance-retail-in-top-5-globally-in-terms-of-stores-mukesh-ambani-2590067-2024-08-29",
      "headline": "RIL AGM: Reliance retail in top 5 globally in terms of stores The company also ranks among the top ten retailers worldwide in terms of market capitalisation and is in the top twenty for the number of employees."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-pm-modi-letter-rape-laws-annapurna-devi-union-minister-kolkata-trainee-doctor-case-2591174-2024-08-31",
      "headline": "Centre on Mamata Banerjee's letter to PM: Strict laws on rape already thereUnion Minister Annapurna Devi wrote to West Bengal Chief Minister Mamata Banerjee, asking her to implement the existing stringent central legislations on rape \"in letter and spirit\" amid outrage over the rape and murder of a trainee doctor in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-yogi-adityanath-red-caps-jab-exclusive-interview-caste-census-lok-sabha-results-2591180-2024-08-31",
      "headline": "Akhilesh Yadav on Yogi Adityanath's 'red caps' dig: Those who don't have hair...Samajwadi Party chief Akhilesh Yadav hit back at Uttar Pradesh Chief Minister Yogi Adityanath's remarks on his party's symbolic red cap, saying those who do not have hair should also wear it sometimes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/champai-soren-jharkhand-ex-chief-minister-joins-bjp-jmm-hemant-soren-government-spying-claims-2591168-2024-08-31",
      "headline": "Joined BJP after coming to know I was being 'snooped on': Champai SorenFormer Jharkhand Chief Minister Champai Soren, who joined the BJP with his son, accused the Hemant Soren-led government of keeping track of his movements, and called it a \"shameful act\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brazilian-judge-supreme-court-x-suspension-starlink-row-feud-elon-musk-2591178-2024-08-31",
      "headline": "Brazilian judge orders suspension of X amid feud with Elon MuskA Brazilian Supreme Court judge ordered the suspension of Elon Musk's X after the tech billionaire did not comply with a court-mandated deadline to identify a legal representative in the South American country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/cyclone-in-arabian-sea-baffles-meteorologists-it-hasnt-happened-in-48-years-2590971-2024-08-30",
      "headline": "Cyclone in Arabian Sea baffles meteorologists. It hasn't happened in 48 yearsThe western Arabian Sea is usually inhospitable to cyclone formation due to cooler sea temperatures and dry air from the Arabian Peninsula."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jharkhand-government-hemant-soren-transgender-community-health-officer-2591179-2024-08-31",
      "headline": "In a first, Jharkhand appoints transgender as community health officerAmir Mahato, who completed her nursing training in Jharkhand's Sambalpur village, was among the 365 candidates appointed under the National Health Mission. Her appointment letter was given by Chief Minister Hemant Soren."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mahayuti-alliance-tensions-shivaji-statue-collapse-assembly-polls-maharashtra-mva-opposition-2591197-2024-08-31",
      "headline": "Cracks emerged in Mahayuti alliance even before Shivaji statue collapseEven before the collapse of Chhatrapati Shivaji Maharaj's statue in Maharashtra's Sindhudurg, cracks had already begun to widen between allies of the ruling Mahayuti alliance over various issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-man-kills-mentally-unwell-mother-posts-photo-instagram-rajkot-2591136-2024-08-31",
      "headline": "Gujarat man kills mother, posts photo on social media: 'Sorry mom, I kill you'The accused, Nilesh Gosai, used to live with his mother in Gujarat's Rajkot. The two used to have frequent arguments and physical altercations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/emergency-movie-kangana-ranaut-sikh-comunity-indira-gandhi-bhindranwale-2591108-2024-08-30",
      "headline": "Why Kangana Ranaut's 'Emergency' is facing backlash from Sikh groups across IndiaSikh organisations across India are demanding a ban on Kangana Ranaut's film Emergency, claiming it misrepresents their community and distorts history. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-protest-west-bengal-mamata-banerjee-bjp-trinamool-dharna-rg-kar-medical-college-2591199-2024-08-31",
      "headline": "Mamata Banerjee to lead protest today seeking death penalty for Kolkata rape accusedMamata Banerjee will lead statewide protests by Trinamool Congress today demanding capital punishment for the accused and stricter central laws following the rape and murder of a trainee doctor in Kolkata hospital.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-rohan-bopanna-into-mens-and-mixed-doubles-pre-quarters-yuki-bhambri-advances-2591200-2024-08-31",
      "headline": "US Open: Bopanna into men's and mixed doubles pre-quarters, Bhambri advancesIndia's Rohan Bopanna advanced to the pre-quarter finals in both men's and mixed doubles events of the US Open 2024 with resounding victories. On the other hand, Yuki Bhambri also progressed to third round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/nit-trichy-students-protest-victim-shaming-woman-student-sexual-misconduct-2591113-2024-08-31",
      "headline": "NIT Trichy student harassed in hostel room, protest erupts over 'victim-shaming'The students of the National Institute of Technology, Trichy, staged a protest accusing the authorities and police of victim-shaming after a student was sexually harassed inside her hostel room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-flood-india-slams-us-media-house-for-factually-incorrect-cnn-report-2591079-2024-08-30",
      "headline": "India slams US media's 'factually incorrect' report on Bangladesh floodThe report claimed that dozens of people in Feni -- which is only a few miles from the Indian border -- have blamed New Delhi for releasing water from the Dumbur dam in Tripura. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/evm-vvpat-data-matched-no-discrepancy-election-commission-2591114-2024-08-31",
      "headline": "No discrepancies in data of EVM-VVPAT data matched so far: Poll panelAfter the Lok Sabha elections, applications seeking checking of results and matching and confirmation of data were received from only eight out of 543 constituencies. Out of these eight, four have been checked so far and all have proved correct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-frances-tiafoe-vs-ben-shelton-marathon-grigor-dimitrov-taylor-fritz-2591196-2024-08-31",
      "headline": "Frances Tiafoe outlasts compatriot Ben Shelton in Friday matinee blockbusterUS Open 2024: 20th seed Frances Tiafoe defeated compatriot Ben Shelton in a four-hour marathon at the Arthur Ashe Stadium on Friday. The two Americans put on a show for the packed crowd. Meanwhile, Taylor Fritz and Grigor Dimitrov eased into the fourth round in men's singles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncp-sharad-pawar-refuses-z-plus-security-delhi-police-union-home-ministry-2591159-2024-08-31",
      "headline": "Sharad Pawar refuses Z-plus security, says will first assess threat perceptionThe Union Home Ministry had accorded him a Z-plus security cover, which would comprise 58 Central Reserve Police Force (CRPF) commandos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/aurangzeb-killed-brother-dara-shikoh-death-mughal-empire-history-2590412-2024-08-30",
      "headline": "When Aurangzeb got his brother Dara Shikoh beheaded over his religious beliefsDespite his brilliance as a poet, writer, and philosopher, Dara Shikoh could not seize the throne. Aurangzeb, with his ruthless ambition, claimed the 'Peacock Throne' instead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ysrcp-hidden-camera-scandal-girls-washroom-tdp-government-andhra-college-hostel-inquiry-2591186-2024-08-31",
      "headline": "Government failure: Jagan Reddy's party on hidden camera in girls' hostel toiletAmid outrage over the discovery of a hidden camera in the girls' washroom at an engineering college hostel in Andhra Pradesh's Krishna district, the YSRCP slammed the TDP, blaming it for the incident due to government failure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-3-full-schedule-medal-events-rubina-francis-sheetal-devi-2591144-2024-08-31",
      "headline": "India at Paralympics, Day 3 Full Schedule: Shooters, Sheetal Devi in actionThe shooters will be under the spotlight as India look to continue their medal rush at the Paris Paralympics 2024 on August 31, Saturday. Apart from the shooters, Archer Sheetal Devi and Sarita will be looking to progress in the elimination rounds. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/pinarayi-vijayan-letter-jaishankar-return-body-of-man-died-drone-attack-russia-ukraine-border-2591181-2024-08-31",
      "headline": "Make efforts to return body of man killed in Ukraine: Pinarayi Vijayan to JaishankarKerala Chief Minister Pinarayi Vijayan urged External Affairs Minister S Jaishankar to expedite exports to repatriate the body of Sandeep Chandran, who died in a drone attack on the Russia-Ukraine border."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/speeding-trailer-breaks-highway-fence-in-jaipur-falls-on-tractor-video-rajasthan-2591082-2024-08-30",
      "headline": "Video: Speeding trailer breaks highway fence in Jaipur, falls on tractorA major road accident took place in Rajasthan's Jaipur when a trailer crashed from expressway culvert onto a tractor running on the road down below."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-mlas-memorandum-delhi-president-murmu-aap-arvind-kejriwal-government-dismissal-2591177-2024-08-31",
      "headline": "Delhi BJP MLAs meet President, seek AAP government's dismissal, party hits backA delegation of Delhi BJP MLAs submitted a memorandum to President Droupadi Murmu, seeking the dismissal of the AAP government in the national capital. The AAP slammed the BJP, saying it had accepted defeat before next year's Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-minto-bridge-repair-work-closed-monday-september-morning-heavy-rain-2591176-2024-08-31",
      "headline": "Delhi's Minto Bridge shut for repairs till September 2 morningBoth carriageways at Delhi's Minto Bridge, which has been witnessing frequent flooding this monsoon, will remain closed from 10 pm on Friday till Monday (September 2) at 7 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-avani-lekhara-gold-medal-10-m-air-rifle-standing-sh1-event-2591019-2024-08-30",
      "headline": "Avani Lekhara focused on winning more medals for India at Paris ParalympicsIndian shooter Avani Lekhara has claimed that she is aiming to win more medals at the Paris Paralympics after claiming gold on Friday, August 30. Avani won gold in the women's 10m Air Rifle Standing SH1 event on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-being-part-of-kalki-2-prabhas-nag-ashwin-kalki-2898-ad-sequel-2591162-2024-08-31",
      "headline": "Actor Nani on being part of 'Kalki 2': Would love to be in a Prabhas film Telugu actor Nani, in an interview with IndiaToday.in, addressed the speculations about his role in Nag Ashwin's 'Kalki 2'. The movie stars Prabhas, Amitabh Bachchan and Deepika Padukone in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-special-gift-richa-chadha-ali-fazal-daughter-malti-marie-2591149-2024-08-30",
      "headline": "Watch: Priyanka Chopra sends special gift for Richa Chadha-Ali Fazal's daughterPriyanka Chopra gave a special gift to Richa Chadha and Ali Fazal's newborn daughter. Richa shared a glimpse of the gift on her Instagram story. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/khushbu-sundar-hema-committee-report-allegations-malayalam-cinema-2591132-2024-08-30",
      "headline": "Khushbu Sundar reacts to Hema Committee reportActor-politician Khushbu Sundar, in an exclusive conversation with India Today, shared her thoughts on the Hema Committee report findings.  She said the report's findings came as a huge shock to her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-sudhanshu-pandey-fans-are-observing-vrats-to-make-me-come-back-to-anupamaa-2591112-2024-08-30",
      "headline": "Sudhanshu Pandey: Fans are observing 'vrats' to bring me back to AnupamaaActor Sudhanshu Pandey, in an exclusive interview with Indiatoday.in, spoke about his decision to quit 'Anupamaa.' The actor shared how he never expected this development to create such an uproar. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gus-atkinson-eng-vs-sl-lords-test-hundred-honours-board-2591211-2024-08-31",
      "headline": "Gus Atkinson on 'surreal' achievement of century at Lord's: 'Hasn't sunk in yet'England fast bowler Gus Atkinson revealed that he never thought to get his name on the Lord's honours board as a batter following his maiden Test ton against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-rohan-bopanna-into-mens-and-mixed-doubles-pre-quarters-yuki-bhambri-advances-2591200-2024-08-31",
      "headline": "US Open: Bopanna into men's and mixed doubles pre-quarters, Bhambri advancesIndia's Rohan Bopanna advanced to the pre-quarter finals in both men's and mixed doubles events of the US Open 2024 with resounding victories. On the other hand, Yuki Bhambri also progressed to third round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-frances-tiafoe-vs-ben-shelton-marathon-grigor-dimitrov-taylor-fritz-2591196-2024-08-31",
      "headline": "Frances Tiafoe outlasts compatriot Ben Shelton in Friday matinee blockbusterUS Open 2024: 20th seed Frances Tiafoe defeated compatriot Ben Shelton in a four-hour marathon at the Arthur Ashe Stadium on Friday. The two Americans put on a show for the packed crowd. Meanwhile, Taylor Fritz and Grigor Dimitrov eased into the fourth round in men's singles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-3-full-schedule-medal-events-rubina-francis-sheetal-devi-2591144-2024-08-31",
      "headline": "India at Paralympics, Day 3 Full Schedule: Shooters, Sheetal Devi in actionThe shooters will be under the spotlight as India look to continue their medal rush at the Paris Paralympics 2024 on August 31, Saturday. Apart from the shooters, Archer Sheetal Devi and Sarita will be looking to progress in the elimination rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-india-shooters-avani-lekhara-gold-mona-agarwal-manish-narwal-preeti-pal-2591175-2024-08-31",
      "headline": "Shooters lead medal charge on Paralympics Day 2, Preeti Pal scripts historyIndian shooters dominated Day 2 of the Paris Paralympics, with Avani Lekhara's gold, Mona Agarwal's bronze, and Manish Narwal's silver, while Preethi Pal made history by winning India's first-ever track medal in the women's 100m T35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-coco-gauff-elina-svitolina-third-round-comeback-win-quarterfinals-2591173-2024-08-31",
      "headline": "Coco Gauff clinches comeback win vs Svitolina to secure US Open QFCoco Gauff overcame a shaky start to defeat Elina Svitolina 3-6, 6-3, 6-3 in the US Open third round, displaying resilience and skill to advance to the quarterfinals, defending her Grand Slam title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-second-test-gus-atkinson-olly-stone-lead-kamindu-mendis-lords-2591167-2024-08-31",
      "headline": "All-round Gus Atkinson, pacers rattle Sri Lanka on Day 2Kamindu Mendis' resilient 74 couldn't prevent Sri Lanka from conceding a hefty first-innings lead to England, as Olly Stone and Gus Atkinson's pace brilliance put the hosts in a commanding position on Day 2 at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-third-round-paula-badosa-qinwen-zheng-flushing-meadows-2591158-2024-08-30",
      "headline": "US Open: Paula Badosa overcomes Elena-Gabriela Ruse test, Qinwen Zheng advancesPaula Badosa came from a set a down to defeat Elena-Gabriela Ruse to make it to the 4th round of the US Open 2024. Qinwen Zheng made it to the next round with a commanding performance Jule Niemeier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/parvej-khan-distance-runner-doping-ban-four-years-ncaa-circuit-2591153-2024-08-30",
      "headline": "Indian distance runner Parvej Khan handed provisional 4-year doping banTop Indian middle-distance runner Parvej Khan faces a provisional suspension after failing a dope test. The 19-year-old, celebrated for his NCAA success, could face up to a four-year ban if found guilty of doping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-manav-thakkar-sharath-kamal-u-mumba-vs-chennai-lions-2591104-2024-08-30",
      "headline": "Manav Thakkar beats Sharath Kamal as U Mumba thump Chennai Lions 8-7Manav Thakkar's thrilling win over Achanta Sharath Kamal led U Mumba TT to an 8-7 victory against Chennai Lions, securing second place in the Ultimate Table Tennis 2024 league standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sachin-tendulkar-paralympics-avani-lekhara-mona-agarwal-preeti-pal-congratulations-post-2591077-2024-08-30",
      "headline": "Sachin Tendulkar congratulates Paralympics stars via heartfelt postSachin Tendulkar congratulated India's Paralympics 2024 medalists, including Avani Lekhara, Mona Agarwal, Manish Narwal, and Preethi Pal, applauding their outstanding performances and calling their achievements a proud moment for the nation on the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-second-test-gus-atkinson-olly-stone-lead-kamindu-mendis-lords-2591167-2024-08-31",
      "headline": "All-round Gus Atkinson, pacers rattle Sri Lanka on Day 2Kamindu Mendis' resilient 74 couldn't prevent Sri Lanka from conceding a hefty first-innings lead to England, as Olly Stone and Gus Atkinson's pace brilliance put the hosts in a commanding position on Day 2 at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-third-round-paula-badosa-qinwen-zheng-flushing-meadows-2591158-2024-08-30",
      "headline": "US Open: Paula Badosa overcomes Elena-Gabriela Ruse test, Qinwen Zheng advancesPaula Badosa came from a set a down to defeat Elena-Gabriela Ruse to make it to the 4th round of the US Open 2024. Qinwen Zheng made it to the next round with a commanding performance Jule Niemeier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/parvej-khan-distance-runner-doping-ban-four-years-ncaa-circuit-2591153-2024-08-30",
      "headline": "Indian distance runner Parvej Khan handed provisional 4-year doping banTop Indian middle-distance runner Parvej Khan faces a provisional suspension after failing a dope test. The 19-year-old, celebrated for his NCAA success, could face up to a four-year ban if found guilty of doping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-manav-thakkar-sharath-kamal-u-mumba-vs-chennai-lions-2591104-2024-08-30",
      "headline": "Manav Thakkar beats Sharath Kamal as U Mumba thump Chennai Lions 8-7Manav Thakkar's thrilling win over Achanta Sharath Kamal led U Mumba TT to an 8-7 victory against Chennai Lions, securing second place in the Ultimate Table Tennis 2024 league standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sachin-tendulkar-paralympics-avani-lekhara-mona-agarwal-preeti-pal-congratulations-post-2591077-2024-08-30",
      "headline": "Sachin Tendulkar congratulates Paralympics stars via heartfelt postSachin Tendulkar congratulated India's Paralympics 2024 medalists, including Avani Lekhara, Mona Agarwal, Manish Narwal, and Preethi Pal, applauding their outstanding performances and calling their achievements a proud moment for the nation on the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-suffers-injury-scare-shreyas-iyer-sarfaraz-fail-in-buchi-babu-2591063-2024-08-30",
      "headline": "Suryakumar Yadav suffers injury scare, Shreyas, Sarfaraz fail in Buchi BabuSuryakumar Yadav suffered a major injury scare ahead of the Duleep Trophy as he got a knock while fielding in the Buchi Babu tournament for Mumbai during their match against TNCA XI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/mona-agarwal-paralympics-shooting-bronze-kids-husband-accident-struggles-2591053-2024-08-30",
      "headline": "Mona Agarwal reacts on Paralympics bronze win: Did it for my kidsMona Agarwal revealed her struggles of balancing motherhood and athletic ambition in a recent interview, highlighting how these challenges fueled her determination to win a bronze medal at the 2024 Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-avani-lekhara-gold-medal-10-m-air-rifle-standing-sh1-event-2591019-2024-08-30",
      "headline": "Avani Lekhara focused on winning more medals for India at Paris ParalympicsIndian shooter Avani Lekhara has claimed that she is aiming to win more medals at the Paris Paralympics after claiming gold on Friday, August 30. Avani won gold in the women's 10m Air Rifle Standing SH1 event on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-final-mohun-bagan-vs-northeast-united-livestreaming-details-all-you-need-to-know-2590985-2024-08-30",
      "headline": "Mohun Bagan vs NorthEast United, Durand Cup 2024 final: All you need to knowDefending champions Mohun Bagan will be aiming to extend their record run in the Durand Cup but face a stiff test from NorthEast United in Kolkata in the final on Saturday, August 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/manu-bhaker-avani-lekhara-paralympics-shooting-gold-congratulates-post-2590982-2024-08-30",
      "headline": "Manu Bhaker congratulates Avani Lekhara for Paralympics goldManu Bhaker congratulated Avani Lekhara for her gold at the Paris Paralympics and acknowledged Mona Agarwal's bronze, highlighting their achievements in the 10m Air Rifle Standing SH1 event with a heartfelt post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-manish-narwal-silver-10m-air-pistol-sh1-second-games-medal-2590929-2024-08-30",
      "headline": "Paralympics: Shooter Manish Narwal wins silver in Paris, 2nd medal at the GamesShooter Manish Narwal has brought India's 4th medal at the Paris Paralympics 2024 with a silver in the Men's 10m Air Pistol SH1 Final on Friday, August 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aaron-ramsdale-southampton-premier-league-transfer-hagrid-harry-potter-announcement-2590921-2024-08-30",
      "headline": "Watch: Aaron 'Hagrid' Ramsdale completes Southampton transfer from ArsenalAaron Ramsdale's Southampton move was announced with a fun nod to his Wembley appearance as Hagrid. The former Arsenal goalkeeper, now a Saint, re-created the iconic look in a humorous video, delighting fans with the announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-kevin-de-bruyne-in-romelu-lukaku-out-as-belgium-announce-squad-2590897-2024-08-30",
      "headline": "Nations League: Kevin de Bruyne in, Romelu Lukaku out as Belgium announce squadKevin de Bruyne has found himself back in the Belgium squad, while Romelu Lukaku was omitted for the upcoming Nations League matches during the international break in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/manu-bhaker-avani-lekhara-paralympics-shooting-gold-congratulates-post-2590982-2024-08-30",
      "headline": "Manu Bhaker congratulates Avani Lekhara for Paralympics goldManu Bhaker congratulated Avani Lekhara for her gold at the Paris Paralympics and acknowledged Mona Agarwal's bronze, highlighting their achievements in the 10m Air Rifle Standing SH1 event with a heartfelt post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-manish-narwal-silver-10m-air-pistol-sh1-second-games-medal-2590929-2024-08-30",
      "headline": "Paralympics: Shooter Manish Narwal wins silver in Paris, 2nd medal at the GamesShooter Manish Narwal has brought India's 4th medal at the Paris Paralympics 2024 with a silver in the Men's 10m Air Pistol SH1 Final on Friday, August 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aaron-ramsdale-southampton-premier-league-transfer-hagrid-harry-potter-announcement-2590921-2024-08-30",
      "headline": "Watch: Aaron 'Hagrid' Ramsdale completes Southampton transfer from ArsenalAaron Ramsdale's Southampton move was announced with a fun nod to his Wembley appearance as Hagrid. The former Arsenal goalkeeper, now a Saint, re-created the iconic look in a humorous video, delighting fans with the announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-kevin-de-bruyne-in-romelu-lukaku-out-as-belgium-announce-squad-2590897-2024-08-30",
      "headline": "Nations League: Kevin de Bruyne in, Romelu Lukaku out as Belgium announce squadKevin de Bruyne has found himself back in the Belgium squad, while Romelu Lukaku was omitted for the upcoming Nations League matches during the international break in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-preethi-pal-womens-100m-bronze-muzaffarnagar-profile-2590889-2024-08-30",
      "headline": "Inspired by Paralympics videos, sprinter Preethi wins India's first track medalParis Paralympics: Preethi Pal, 23, won bronze in the women's 100m T35 event on Friday, August 30. At 17, she watched videos of the Paralympic Games on social media and set out to achieve her dreams. In Paris, she won India's first track and field medal in the Paris 2024 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-uefa-nations-league-portugal-squad-goalless-euro-2590886-2024-08-30",
      "headline": "Ronaldo named in Portugal's Nations League mix despite goalless EuroCristiano Ronaldo has been named in Portugal's UEFA Nations League squad, despite a recent goal drought. The 39-year-old remains the national team's highest scorer with 130 goals in 209 appearances, highlighting his enduring influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-barbados-royals-entertain-fans-with-unique-celebration-in-wcpl-2024-final-2590826-2024-08-30",
      "headline": "Watch: Barbados entertain fans with unique celebration in WCPL final WCPL 2024: Barbados Royals' players pulled off a unique celebration during their final against the Trinbago Knight Riders on Thursday at the Brian Lara Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-bash-in-berlin-2024-livestreaming-full-match-card-uber-arena-2590874-2024-08-30",
      "headline": "WWE Bash in Berlin 2024 livestreaming details: Full Match card and moreThe WWE Bash In Berlin Premium Live Event is all set to take centre stage with a stacked match card. Cody Rhodes will face Kevin Owens with the WWE title on the line while Gunther will be aiming to make it a sweet return back to Europe. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}