{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-voluntary-buyouts-knowledge-ads-teams-ai-investment-voluntary-exit-programme-mention-report-2739707-2025-06-12",
      "headline": "Google offers buyout plans amid AI-focused overhaul: ReportGoogle is now giving some employees the option to leave the company with a severance package. This is being called a \"voluntary exit programme\", as per reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dalal-street-falls-nearly-1-percent-us-china-trade-middle-east-tensions-stock-market-falling-sensex-down-700-points-2739681-2025-06-12",
      "headline": "Dalal Street dips nearly 1 percent on global trade and geopolitical concernsStock market today: The fall occurred despite markets erasing early losses as the S&P BSE Sensex fell by 911 points to 81,603.95 and the NSE Nifty50 lost 288.75 points to 24,854.45 by 2:29 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-tighten-remittance-rules-bar-offshore-time-deposits-report-2739671-2025-06-12",
      "headline": "India to tighten remittance rules, bar offshore time deposits: ReportThe Reserve Bank of India (RBI) will amend regulations to prevent overseas transfers from being used to park money in time deposits or other interest-bearing accounts abroad, one of the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-expected-20-june-2025-financial-aid-indian-farmers-2739652-2025-06-12",
      "headline": "PM-Kisan 20th instalment: When will farmers get the next Rs 2,000?This scheme provides income support of Rs 6,000 a year to eligible farmers. The money is paid in three equal parts of Rs 2,000, directly into the farmers' bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dollar-dream-vs-reality-why-rs-80-lakh-in-us-salary-not-as-big-as-it-sounds-purchasing-power-parity-rs-23-lakhs-india-equals-rs-80-lakhs-us-salary-2739606-2025-06-12",
      "headline": "Dollar dream vs reality: Why Rs 80 lakh in US salary not as big as it soundsRs 23 lakh in India can go as far as Rs 80 lakh in the US when it comes to daily living costs. An upcoming author reveals the impact of Purchasing Power Parity (PPP) on salary comparisons between India and the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-rises-over-usd-100-million-after-apology-to-donald-trump-2739577-2025-06-12",
      "headline": "Elon Musk's net worth jumps after apology to Donald TrumpElon Musk's net worth increased by $191 million, reaching $411.4 billion after his public apology to President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-income-tax-notice-types-of-income-tax-notices-here-is-how-to-deal-with-it-2739551-2025-06-12",
      "headline": "Got an income tax notice? Don't panic, here's how to deal with itFor many honest taxpayers, the unexpected arrival of an income tax notice in their inbox can trigger anxiety. However, most of them are often routine and manageable. This article explains what these notices really mean, why they're sent, and what you should do if one lands your way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ai-market-growth-17-billion-2027-talent-tech-investments-2739539-2025-06-12",
      "headline": "India's AI market to triple by 2027 with strong talent and tech growthThe report, titled \"India's AI Leap: BCG Perspective on Emerging Challengers,\" indicates that the country is set to become one of the fastest-growing AI economies globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-shares-slide-up-to-10-percent-after-government-dismisses-mdr-rumours-2739518-2025-06-12",
      "headline": "Paytm shares slide up to 10% after government dismisses MDR rumoursPaytm shares fell sharply in early trade after the government rejected reports suggesting the return of merchant discount rate (MDR) charges on UPI transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tanla-platforms-shares-jump-13-percent-today-check-whats-driving-the-rally-2739510-2025-06-12",
      "headline": "Tanla Platforms shares jump 13% today. Check what's driving the rallyTanla Platforms share price: At around 10:10 am, shares of the company were trading 9.96% higher at Rs 684.20 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-nearly-90-percent-ready-on-market-access-in-fta-talks-says-piyush-goyal-2739489-2025-06-12",
      "headline": "India, EU nearly 90% ready on market access in FTA talks, says Piyush GoyalPiyush Goyal also underlined the political backing behind the deal, referring to the meeting between Prime Minister Narendra Modi and European Commission President Ursula von der Leyen in New Delhi on 28 February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-100-points-lower-nifty-below-25200-infosys-down-1-percent-2739486-2025-06-12",
      "headline": "Sensex, Nifty erase early losses to trade in green; IT stocks limit gainsThe S&P BSE Sensex was up by 89.24 points to 82,604.38, while the NSE Nifty50 added 31.45 points to 25,163.80 as of 9:27 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/btss-suga-to-be-discharged-from-military-service-on-june-21-2739693-2025-06-12",
      "headline": "After BTS's Jimin and Jungkook, ARMY awaits Suga's returnK-pop's biggest boyband BTS is all set to reunite, as every member except for Suga has been discharged from the mandatory military service. Suga will be discharged later this month.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-to-release-indian-version-of-shakiras-hips-dont-lie-read-details-2739619-2025-06-12",
      "headline": "Diljit Dosanjh hints at desi Hips Don't Lie collaboration with Shakira. WatchSinger Diljit Dosanjh hinted at the possibility of a collaboration with pop sensation Shakira for the Indian version of her song 'Hips don't lie'. The duo met at the Met Gala earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-she-cant-imagine-ddlj-2-kuch-kuch-hota-hai-sequels-no-one-wants-to-know-what-happens-after-the-train-left-2739668-2025-06-12",
      "headline": "Kajol rules out DDLJ 2: No one wants to know what happens after train leftKajol recently shared her thoughts on possible sequels to her iconic films 'Dilwale Dulhania Le Jayenge' and 'Kuch Kuch Hota Hai'. She feels that some love stories are best left as they are. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-didnt-have-identity-got-show-because-of-me-navjot-singh-sidhu-2739639-2025-06-12",
      "headline": "Kapil Sharma didn't have identity, got show because of me: Navjot Singh SidhuFormer cricketer Navjot Singh Sidhu revealed that he played a key role in helping Kapil Sharma land his big break. He also opened up about the real reason behind his participation in 'Bigg Boss' back in 2012.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-teaser-vivek-ranjan-agnihotri-brings-chilling-story-with-powerhouse-performers-2739642-2025-06-12",
      "headline": "The Bengal Files teaser: A chilling story with powerhouse performersIn 'The Bengal Files' teaser, you see a glimpse of all the prominent characters in the film. It further promises a rigid, dark and unsettling tone for the film directed and written by Vivek Ranjan Agnihotri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-venkatesh-trivikram-srinivas-director-line-up-confirms-naga-vamsi-2739626-2025-06-12",
      "headline": "Venkatesh first, Jr NTR next: Producer confirms director Trivikram's line-upAmid growing speculation about his next collaborations, director Trivikram Srinivas' long-time associate and producer Naga Vamsi has officially clarified the filmmaker's upcoming line-up on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-family-host-jackson-wang-dinner-rakesh-roshan-2739624-2025-06-12",
      "headline": "Hrithik Roshan and family host Jackson Wang for dinner. See picActor Hrithik Roshan and his family invited Korean singer Jackson Wang for a dinner on June 11. Rakesh Roshan shared a picture from the dinner on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-fan-tries-to-break-into-jungkooks-house-hours-after-military-discharge-2739621-2025-06-12",
      "headline": "BTS fan tries to break into Jungkook's house hours after military dischargeA BTS fan was arrested for unlawfully entering Jungkook's residence following his military discharge. The singer was officially discharged on Wednesday after an 18-month-long mandatory service. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalpika-ganesh-threw-plates-body-shamed-staff-at-hyderabad-prism-pub-police-2739601-2025-06-12",
      "headline": "Telugu actor Kalpika threw plates, body-shamed staff at Hyderabad pub: PoliceTelugu actor Kalpika Ganesh is facing legal action after an incident at Prism Pub in Gachibowli, Hyderabad. The case was registered following complaints of misbehaviour and property damage in a dispute over her birthday celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-is-a-fan-of-bollywood-tollywood-films-no-one-makes-movies-like-that-2739572-2025-06-12",
      "headline": "Ed Sheeran is a fan of Bollywood, Tollywood films: No one makes movies like thatSinger Ed Sheeran confessed that he is a fan of Bollywood and Tollywood films. He replied to a fan and wrote how the aren't any films like them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-declares-love-for-croatia-in-new-bts-pics-from-tu-meri-main-tera-sets-2739552-2025-06-12",
      "headline": "Kartik Aaryan declares love for Croatia in new BTS pics from Tu Meri Main Tera setsActor Kartik Aaryan gave a glimpse into the shooting of his upcoming film, 'Tu Meri Main Tera Main Tera Tu Meri'. Also starring Ananya Panday, the film is being shot in Croatia. He shared the behind-the-scenes photos on his Instagram account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-or-alia-kapoor-fans-spot-name-twist-in-alia-bhatts-latest-cannes-vlog-2739543-2025-06-12",
      "headline": "Alia Bhatt or Alia Kapoor? Fans spot name twist in Alia Bhatt's latest Cannes vlogAlia Bhatt's Cannes vlog sparked buzz after fans spotted a hotel message addressing her as 'Alia Kapoor', hinting at a possible name change post-marriage. While she still uses Bhatt professionally, the moment has stirred speculation online.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-shares-first-details-about-stranger-things-animated-spin-off-in-your-dreams-2739534-2025-06-12",
      "headline": "Netflix shares first details about Stranger Things animated spin-off, In Your DreamsNetflix shared an update on the animated spin-off of Stranger Things, titled, 'Stranger Things: Tales from '85' at the Annecy Film Festival on Wednesday. The first look of its award-contender 'In Your Dreams' was also shown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/the-summer-i-turned-pretty-season-3-trailer-love-drama-final-choices-in-finale-2739535-2025-06-12",
      "headline": "The Summer I Turned Pretty Season 3 trailer: Love, drama, final choices in finaleJenny Han's The Summer I Turned Pretty returns for season 3. The show is set to explore the love triangle one final time at Cousins Beach. Will it be Jeremiah or Conrad? Let's have a closer look at what the trailer features."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-is-driven-by-women-director-on-critics-calling-film-sexist-2739540-2025-06-12",
      "headline": "Housefull 5 is driven by women: Director on critics calling film sexist'Housefull 5' director Tarun Mansukhani rejected the claims of having a sexist story and misogynist male characters in his film. In an interview, he called the men in the story 'flawed', and shared that women are the ones driving the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diana-penty-cocktail-re-release-curious-to-know-what-gen-z-thinks-2739536-2025-06-12",
      "headline": "Diana Penty on Cocktail's re-release: Curious to know what Gen-Z thinks'Cocktail', the popular romantic drama from 2012, has been re-released in theatres across India, rekindling fond memories for many. Actress Diana Penty shared her thoughts on the film's lasting appeal and its reception by younger audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-hera-pheri-3-dont-quit-tshirt-akshay-kumar-2739513-2025-06-12",
      "headline": "Paresh Rawal steps out in Don't Quit t-shirt amid Hera Pheri 3 exit. PicActor Paresh Rawal's \"Don't Quit\" t-shirt caught everyone's attention amid news of his exit from 'Hera Pheri 3'. Fans are speculating whether it was a subtle message or just a coincidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nikita-roy-trailer-sonakshi-sinha-arjun-rampal-confront-evil-in-supernatural-thriller-2739509-2025-06-12",
      "headline": "Nikita Roy trailer: Sonakshi, Arjun Rampal confront evil in supernatural thrillerThe trailer of 'Nikita Roy' starring Sonakshi Sinha, Arjun Rampal, and Paresh Rawal is out. The film will release in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shankar-mani-ratnam-last-few-films-flop-game-changer-thug-life-2739225-2025-06-12",
      "headline": "The worrying form of legendary directors Shankar and Mani RatnamLegendary directors Shankar and Mani Ratnam changed the landscape of Tamil cinema with their creations. However, their recent outings have been marred by harsh criticism, especially because of poor screenwriting."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/london-bound-air-india-plane-crashes-near-sardar-vallabhbhai-pate-ahmedabad-airport-what-we-know-so-far-boeing-2739717-2025-06-12",
      "headline": "London-bound Air India flight crashes near Ahmedabad airport: What we know so farAn Air India flight bound for London crashed shortly after take-off from the Sardar Vallabhbhai Patel International Airport in Ahmedabad on Thursday afternoon. The aircraft, a Boeing 787-8 Dreamliner operating as Air India 171, was carrying 242 people, including 230 passengers and 12 crew members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/visuals-black-smoke-near-ahmedabad-airport-after-plane-crashes-2739687-2025-06-12",
      "headline": "Visuals: Smoke near Ahmedabad airport after Air India plane crashes during take-offAn Air India plane, with 242 passengers on board, crashed at Ahmedabad airport while taking off. Seven fire tenders are at the spot. Visuals have emerged showing the extent of the damage, with dark smoke billowing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-in-breach-of-non-proliferation-duties-global-nuclear-watchdog-iaeas-board-declares-first-in-20-years-2739684-2025-06-12",
      "headline": "Iran not in compliance with nuclear obligations: UN nuclear watchdogThe IAEA's 35-nation Board of Governors declared Iran in breach of its non-proliferation obligations, for the first time in almost 20 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-army-chief-asim-munir-washington-military-parade-invite-michael-kurilla-praise-india-reaction-2739506-2025-06-12",
      "headline": "In military parade invite to Pak army chief and General's praise, an old US gamePakistani Army Chief General Asim Munir confirmed his presence at the US military parade in Washington on June 14, sources said. During the trip, he is also expected to meet with officials from the State Department and the Pentagon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/fuel-leak-delays-indian-astronaut-shubhanshu-shukla-launch-the-science-behind-using-liquid-oxygen-2739567-2025-06-12",
      "headline": "Indian astronaut's launch delayed: The fuel leak dilemma explainedEngineers discovered the leak during a routine seven-second \"hot fire\" test of the Falcon 9 rocket's booster stage, about 12 hours prior to the launch time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-eyes-implement-33-per-cent-reservation-women-quota-delimitation-south-tamil-nadu-census-2029-lok-sabha-elections-2739631-2025-06-12",
      "headline": "Centre planning 33% reservation for women ahead of 2029 Lok Sabha polls: SourcesThe Narendra Modi-led central government is expecting to roll out a 33 per cent reservation for women ahead of the 2029 Lok Sabha elections, sources told India Today TV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-sonam-mangalsutra-left-homestay-helped-cops-2739417-2025-06-12",
      "headline": "Sonam left behind mangulsutra at homestay and key lead in honeymoon murder caseSonam Raghuvanshi left behind her 'mangalsutra' at a Meghalaya homestay, giving police the first clue in the murder of her husband Raja Raghuvanshi during their honeymoon. Five people, including her boyfriend, are now in custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sirajganj-rabindranath-tagore-ancestral-home-museum-vandalised-by-mob-closed-entry-probe-2739538-2025-06-12",
      "headline": "Rabindranath Tagore's house attacked in Bangladesh, BJP slams Yunus governmentA mob vandalised the historic Rabindra Kacharibari in Bangladesh's Sirajganj district, which is an ancestral mansion of Nobel laureate Rabindranath Tagore. The BJP has slammed the Muhammad Yunus government over the incident in which a mob attacked the auditorium on the mansion premises and assaulted its director."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bhopal/story/bhopal-railway-overbridge-sharp-turn-flawed-design-sparks-row-madhya-pradesh-2739574-2025-06-12",
      "headline": "Bhopal bridge with 90-degree turn stumps people, officials defend designA new railway overbridge in Bhopal has stirred controversy due to its sharp 90-degree turn, raising safety concerns among locals. Officials cite land constraints and metro station proximity as reasons for the unusual design.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-influencer-kamal-kaur-bhabhi-found-dead-in-car-bathinda-medical-university-parking-lot-2739571-2025-06-12",
      "headline": "Punjab influencer found dead in car in Bathinda, gangster link emergesPunjab-based influencer Kanchan Kumari, aka Kamal Kaur, was found dead in a car at Bathinda's Adesh University. Murder is suspected, with possible links to a prior threat from Canada-based terrorist Arsh Dalla.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalpika-ganesh-threw-plates-body-shamed-staff-at-hyderabad-prism-pub-police-2739601-2025-06-12",
      "headline": "Telugu actor Kalpika threw plates, body-shamed staff at Hyderabad pub: PoliceTelugu actor Kalpika Ganesh is facing legal action after an incident at Prism Pub in Gachibowli, Hyderabad. The case was registered following complaints of misbehaviour and property damage in a dispute over her birthday celebration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/villas-plots-gold-cars-telangana-executive-engineer-arrested-after-anti-corruption-bureau-raids-2739549-2025-06-12",
      "headline": "Villa, 19 plots, 3 buildings, cars: Telangana engineer held in anti-corruption raidsAn engineer with Telangana's irrigation department was arrested by the Anti-Corruption Bureau for amassing assets disproportionate to his known income, including multiple apartments and land, across the state. According to sources, he was previously associated with the Kaleshwaram Lift Irrigation Project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sobhita-dhulipala-and-naga-chaitanya-stun-at-akhil-zainab-reception-pics-2739491-2025-06-12",
      "headline": "Sobhita Dhulipala and Naga Chaitanya stun at Akhil-Zainab reception. PicsActors Sobhita Dhulipala and Naga Chaitanya stole the spotlight at Akhil Akkineni and Zainab Ravdjee's wedding reception in Hyderabad. Pictures from the event show the duo posing with the newlyweds along with their Akkineni family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-students-limbo-worried-parents-us-tightens-rules-foreign-enrolment-trump-america-visa-education-2738736-2025-06-12",
      "headline": "As US visa woes mount, Indian students now look beyondWith mounting visa hurdles and erratic US policy shifts under the Trump administration, Indian students are seemingly moving away from the American dream even as parents push to prioritise safety and stability. Experts say emotional and financial strain is prompting a shift away from higher education in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asked-pm-modi-to-stop-hasina-from-reaching-out-to-bangladesh-he-said-muhammad-yunus-2739368-2025-06-11",
      "headline": "Yunus asked PM Modi to help stop Hasina speeches, got 'can't control it' replyWhen asked whether India was doing what Bangladesh expected, Muhammad Yunus responded without hesitation: \"No.\" He confirmed that Bangladesh had written to the Indian government requesting Hasina's extradition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dangerous-place-trump-orders-withdrawal-us-troops-middle-east-iran-iraq-israel-tensions-nuclear-2739459-2025-06-12",
      "headline": "Dangerous place: Trump orders US pullback from Middle East amid Iran tensionsThe decision comes against the backdrop of heightened tensions in the Middle East as talks between the US and Iran over its rapidly advancing nuclear program appear to have hit an impasse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-income-tax-notice-types-of-income-tax-notices-here-is-how-to-deal-with-it-2739551-2025-06-12",
      "headline": "Got an income tax notice? Don't panic, here's how to deal with itFor many honest taxpayers, the unexpected arrival of an income tax notice in their inbox can trigger anxiety. However, most of them are often routine and manageable. This article explains what these notices really mean, why they're sent, and what you should do if one lands your way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/perseverance-rover-captures-breathtaking-view-of-martian-moon-deimos-2739545-2025-06-12",
      "headline": "Perseverance rover captures breathtaking view of Martian moon DeimosPerseverance's camera employed its maximum long-exposure setting of 3.28 seconds for each of 16 individual frames. These were combined onboard into a single composite image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gyanesh-kumar-chief-election-commissioner-poll-rigging-voters-list-electoral-rolls-preparation-rigorous-transparent-rahul-gandhi-2739531-2025-06-12",
      "headline": "Most transparent: Poll body chief defends electoral rolls prep amid rigging claimChief Election Commissioner Gyanesh Kumar defended the electoral rolls preparation in India at an event in Sweden, saying it is one of the world's most rigorous and transparent. His statement came amid allegations of fudging voter data and poll rigging by the Opposition, including Congress MP Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-card-5-million-dollars-permanent-us-residency-wait-list-is-open-website-visa-2739442-2025-06-12",
      "headline": "Trump Card, offering path to US residency for $5 million, now open for applicantsThe fine print of Donald Trump's social media post suggests that the Gold Card doesn't guarantee anyone US citizenship but is only a 'beautiful road in gaining access to the Greatest Country.' Trump has maintained that he would not need Congress's approval as the 'Gold Card' does not grant citizenship to the buyers, only a path to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shankar-mani-ratnam-last-few-films-flop-game-changer-thug-life-2739225-2025-06-12",
      "headline": "The worrying form of legendary directors Shankar and Mani RatnamLegendary directors Shankar and Mani Ratnam changed the landscape of Tamil cinema with their creations. However, their recent outings have been marred by harsh criticism, especially because of poor screenwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-nikhil-siddhartha-the-india-house-set-accident-many-injured-2739483-2025-06-12",
      "headline": "Water tank burst floods Ram Charan-Nikhil's The India House set, many injuredA major accident happened on the sets of Ram Charan's maiden production, 'The India House', starring Nikhil Siddhartha. An assistant cameraperson and many other crew members sustained injuries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shiva-temple-vandalised-tensions-erupt-west-bengal-maheshtala-arrest-2739482-2025-06-12",
      "headline": "Clashes, stones thrown in Bengal's Maheshtala over temple vandalism; 40 arrestedViolence broke out in South 24 Parganas, West Bengal, after a Shiva temple was allegedly vandalised over a shop construction dispute. Stones were pelted, vehicles torched, and Section 163 was imposed as police made 40 arrests.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-south-africas-batting-on-day-1-sparks-debate-2739497-2025-06-12",
      "headline": "WTC Final: Timid or outclassed? South Africa's batting on Day 1 sparks debateAUS vs SA, WTC Final: South Africa squandered a strong start in the big final in London as their batters showed a lack of intent, drawing criticism from former players like Matthew Hayden and Dale Steyn. Despite Kagiso Rabada's five-wicket haul, Australia ended Day 1 on top. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-2-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739683-2025-06-12",
      "headline": "WTC Final 2025 Day 2: Onus on Bavuma, David to rescue South AfricaAustralia vs South Africa WTC Final 2025 Day 2 Live: After a terrific start by Australia with the new ball, the onus is now on captain Temba Bavuma and David Beddingham to bail their team out of trouble. South Africa are trailing by 169 runs in 1st innings and will resume their innings on 43/4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-kl-rahul-karun-nair-message-bcci-video-2739685-2025-06-12",
      "headline": "Watch: Rahul's heartwarming message to comeback man Nair before England TestsKL Rahul has sent a special message to Karun Nair ahead of his Test comeback after seven years. Karun Nair is expected to play his return game during the first Test between India and England at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-dale-steyn-on-mitchell-starc-2739664-2025-06-12",
      "headline": "Starc's big match temperament in WTC Final leaves Steyn in aweDale Steyn hailed Mitchell Starc's ability to turn up when it matters the most and explained the reason behind the Aussie's success in the big games."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/gael-monfils-hits-back-at-abusive-bettors-after-stuttgart-open-loss-2739661-2025-06-12",
      "headline": "Gael Monfils hits back at angry bettors: We both know I'm s**t, yet you bet on meGael Monfils responded strongly to abusive social media comments following his Stuttgart Open defeat. He condemned racial abuse and urged trolls to keep his family out of their anger."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-marnus-labuschagne-batting-intent-kevin-pietersen-2739625-2025-06-12",
      "headline": "Labuschagne makes Pietersen frustrated: Not there to leave ball all dayKevin Pietersen was left frustrated by Marnus Labuschagne's batting intent on Day 1 of the World Test Championship final between Australia and South Africa on Wednesday, June 11. Labuschagne was timid with his approach and left a lot of deliveries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-gets-called-self-obsessed-for-having-prince-engraving-on-bat-2739602-2025-06-12",
      "headline": "Gill gets called 'self-obsessed' by fans for having 'Prince' engraving on batStar India batter Shubman Gill is being called 'self-obsessed' by fans for having 'Prince' engraved on his bat. Gill is set to use his new bat in the England series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-recalls-rcbs-painful-18-year-wait-for-ipl-trophy-in-emotional-video-2739560-2025-06-12",
      "headline": "AB de Villiers recalls RCB's painful 18-year wait for IPL trophy in emotional videoLegendary South Africa batter AB de Villiers recalled Royal Challengers Bengaluru's (RCB) emotional journey to maiden Indian Premier League (IPL)  triumph in an emotional video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-beau-webster-ricky-ponting-2739547-2025-06-12",
      "headline": "Webster looked completely ready in WTC Final: Ponting praises all-rounderRicky Ponting praised Beau Webster for his vital knock during Day 1 of the World Test Championship final on Wednesday, June 11. Webster top scored for Australia to power them to 212 runs as he saw them through a rough period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-gautam-gambhir-shubman-gill-huddle-talk-squad-2739530-2025-06-12",
      "headline": "Start fighting every ball: Shubman Gill, Gautam Gambhir huddle talk before England TestsIndia coach Gautam Gambhir and captain Shubman Gill inspired the full squad ahead of the England tour with some pep talk. The Indian team is set to embark on a new era under the leadership of Gambhir and Gill in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-goes-past-sachin-tendulkar-in-elite-list-after-gutsy-fifty-in-wtc-final-2739521-2025-06-12",
      "headline": "Steve Smith goes past Sachin Tendulkar in elite list after gutsy fifty in WTC FinalStar Australia batter Steve Smith went past legendary India batter Sachin Tendulkar in the list of most fifty plus scores in the history of knockout matches of ICC tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-south-africas-batting-on-day-1-sparks-debate-2739497-2025-06-12",
      "headline": "WTC Final: Timid or outclassed? South Africa's batting on Day 1 sparks debateAUS vs SA, WTC Final: South Africa squandered a strong start in the big final in London as their batters showed a lack of intent, drawing criticism from former players like Matthew Hayden and Dale Steyn. Despite Kagiso Rabada's five-wicket haul, Australia ended Day 1 on top. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-recalls-rcbs-painful-18-year-wait-for-ipl-trophy-in-emotional-video-2739560-2025-06-12",
      "headline": "AB de Villiers recalls RCB's painful 18-year wait for IPL trophy in emotional videoLegendary South Africa batter AB de Villiers recalled Royal Challengers Bengaluru's (RCB) emotional journey to maiden Indian Premier League (IPL)  triumph in an emotional video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-beau-webster-ricky-ponting-2739547-2025-06-12",
      "headline": "Webster looked completely ready in WTC Final: Ponting praises all-rounderRicky Ponting praised Beau Webster for his vital knock during Day 1 of the World Test Championship final on Wednesday, June 11. Webster top scored for Australia to power them to 212 runs as he saw them through a rough period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-gautam-gambhir-shubman-gill-huddle-talk-squad-2739530-2025-06-12",
      "headline": "Start fighting every ball: Shubman Gill, Gautam Gambhir huddle talk before England TestsIndia coach Gautam Gambhir and captain Shubman Gill inspired the full squad ahead of the England tour with some pep talk. The Indian team is set to embark on a new era under the leadership of Gambhir and Gill in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-goes-past-sachin-tendulkar-in-elite-list-after-gutsy-fifty-in-wtc-final-2739521-2025-06-12",
      "headline": "Steve Smith goes past Sachin Tendulkar in elite list after gutsy fifty in WTC FinalStar Australia batter Steve Smith went past legendary India batter Sachin Tendulkar in the list of most fifty plus scores in the history of knockout matches of ICC tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-south-africas-batting-on-day-1-sparks-debate-2739497-2025-06-12",
      "headline": "WTC Final: Timid or outclassed? South Africa's batting on Day 1 sparks debateAUS vs SA, WTC Final: South Africa squandered a strong start in the big final in London as their batters showed a lack of intent, drawing criticism from former players like Matthew Hayden and Dale Steyn. Despite Kagiso Rabada's five-wicket haul, Australia ended Day 1 on top. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}