{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-250-points-higher-nifty-above-25800-eternal-it-shares-up-2851005-2026-01-13",
      "headline": "Sensex opens over 250 points higher, Nifty above 25,800; Eternal up 3%Sensex opens over 250 points higher, Nifty above 25,800; Eternal up 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-price-rally-2026-record-highs-buy-or-wait-what-should-investors-know-2850998-2026-01-13",
      "headline": "Gold rally is not stopping soon. But is buying at record levels a good idea?On Tuesday, gold prices eased slightly after hitting a new lifetime high a day earlier. Spot gold slipped 0.4% to $4,576.79 per ounce at around 07:04 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-closes-today-should-you-bid-amid-heavy-demand-bccl-gmp-latest-2850982-2026-01-13",
      "headline": "Bharat Coking Coal IPO closes today: Should investors bid for BCCL on last day?Bharat Coking Coal IPO opened for subscription on January 9, 2026, and will close today, January 13, 2026. The allotment is expected to be finalised on January 14, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/alphabet-crosses-usd-4-trillion-market-cap-as-ai-push-boosts-investor-sentiment-2850906-2026-01-12",
      "headline": "Alphabet crosses $4 trillion market cap as AI push boosts investor sentimentThe milestones mark a remarkable change in investor sentiment for Alphabet, with its stock surging about 65% in 2025, outperforming its peers on Wall Street's elite group of stocks, the so-called Magnificent Seven."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-rises-sees-3-month-high-at-133-in-december-up-from-071-in-november-2850671-2026-01-12",
      "headline": "India's retail inflation hits 3-month high of 1.33% in DecemberIndia's retail inflation rose to 1.33% in December from 0.71% in November, as the decline in food prices slowed, government data showed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-302-points-nifty-above-25750-as-market-snaps-losing-streak-2850647-2026-01-12",
      "headline": "Sensex jumps 302 points, Nifty above 25,750 as market snaps losing streakAt the close, the Sensex settled at 83,878.17, up 301.93 points, while the Nifty ended at 25,790.25, gaining 106.95 points.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-is-it-time-for-capital-gains-clarity-and-gst-relief-for-real-estate-2850602-2026-01-12",
      "headline": "Budget 2026: Is it time for capital gains clarity, and GST relief for real estate?As the countdown to Budget 2026 begins, real estate players are seeking clarity on capital gains taxation and GST relief to support long-term growth and investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rebounds-over-800-points-how-stock-market-staged-a-sharp-comeback-2850593-2026-01-12",
      "headline": "Sensex rebounds over 800 points from day's low: 4 things investors need to knowThe recovery capped one of the most volatile trading days in recent weeks and came after intense selling pressure had pushed markets into oversold territory during the morning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-know-the-cost-of-missing-the-july-31-itr-deadline-2850573-2026-01-12",
      "headline": "Income tax return filing: Know the cost of missing the July 31 ITR deadlineFiling your income tax return after July 31 can cost more than you expect. From late fees and interest to delayed refunds and lost tax benefits, missing the ITR deadline makes compliance more expensive and restrictive for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-latest-gmp-subscription-status-and-all-other-details-2850585-2026-01-12",
      "headline": "Bharat Coking Coal IPO: Latest GMP, subscription status and what it signalsFor now, the subscription data and GMP suggest that the Bharat Coking Coal IPO remains one of the most closely watched offerings, with sentiment clearly tilted towards a strong debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-smarter-tax-slabs-matter-more-than-big-cuts-2850549-2026-01-12",
      "headline": "Budget 2026: Why smarter tax slabs matter more than big cutsAs nominal incomes rise, taxpayers drift into higher brackets without any improvement in real purchasing power. This bracket creep amounts to a quiet tightening of tax burden, dampening consumption without any explicit policy decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-nearly-3000-points-in-6-days-what-is-really-driving-the-sell-off-2850534-2026-01-12",
      "headline": "Sensex down nearly 3,000 points in 6 days: What's really driving the sell-offThe past six days have been a reminder that markets do not move in straight lines. When uncertainty rises and confidence weakens, even strong long-term stories can go through uncomfortable phases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-employers-can-address-new-labour-codes-take-home-salary-and-build-employee-trust-2850519-2026-01-12",
      "headline": "How employers can address New labour code's take-home salary and build employee trustFor employers, the reform means more disciplined salary design and tighter governance. Compensation structures that previously leaned heavily on allowances now require rebalancing. Finance leaders will need to review salary templates, update payroll logic, and ensure CTCs align with the wage definition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-tumble-key-reasons-why-stock-market-is-falling-today-2850467-2026-01-12",
      "headline": "Sensex tumbles over 600 points: 3 reasons why the stock market is fallingAt around 11:48 am, the Sensex was trading at 82,937.81, down 638.43 points, while the Nifty stood at 25,494.30, lower by 189 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-record-levels-what-next-investors-buy-sell-explained-2850457-2026-01-12",
      "headline": "Gold, silver prices at record levels: What should investors expect next?With prices at record highs, the real question for investors is not what gold and silver have done, but whether this rally is merely pausing or setting up for another leg higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-price-selling-pressure-explained-2850443-2026-01-12",
      "headline": "Explained: Why HDFC Bank shares remain under selling pressureAs of 10:24 am, shares of the private lender were trading at Rs 932.80, down Rs 6.20, or 0.66 per cent, adding to losses seen over recent sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-day-2-gmp-key-dates-2850428-2026-01-12",
      "headline": "Bharat Coking Coal IPO day 2: Check GMP, key dates and should you invest?For investors, the Bharat Coking Coal IPO appears to be a play on listing gains and medium-term stability rather than a deep long-term value bet at current valuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-india-latest-rates-buy-sell-key-details-2850423-2026-01-12",
      "headline": "Gold, silver prices near record highs: Should you buy now or wait?In India, gold prices remain firm while silver continues to see sharper ups and downs. These levels have made buyers cautious, especially those looking at jewellery purchases or small investments rather than short-term trading."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-25700-as-dalal-streets-weak-run-continues-2850405-2026-01-12",
      "headline": "Sensex, Nifty fall for 6th straight day as D-Street's turbulent run continuesAt around 9:21 am, the Sensex was trading at 83,252.86, down 323.38 points, or 0.39 per cent, while the Nifty stood at 25,592.60, lower by 90.70 points. Losses were broad-based, reflecting rising investor caution amid persistent domestic concerns and unsettled global cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-delay-concerns-notice-taxpayers-2850401-2026-01-12",
      "headline": "Income tax refund delays: Why many taxpayers are still waitingComplaints over refunds stuck at the \"processing\" stage have been trending across social media platforms and grievance portals, bringing renewed attention to the pace of return processing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-box-office-day-4-prabhas-film-slips-sees-sharp-drop-in-india-2850994-2026-01-13",
      "headline": "The Raja Saab box office Day 4: Prabhas' film slips, sees sharp drop in India The box office performance of Prabhas' latest horror-comedy, The Raja Saab, declined sharply on its fourth day, with a 71 per cent drop in earnings compared to Sunday. The film continues to draw mixed occupancy rates across various regions and languages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aap-womens-wing-raises-concerns-toxic-film-teaser-obscene-scenes-karnataka-2850997-2026-01-13",
      "headline": "Yash's Toxic under fire over 'obscene' teaser, AAP Women's wing alerts censor board The Aam Aadmi Party's women's wing in Karnataka has filed a complaint with the state women's commission, objecting to scenes in the teaser of Yash's upcoming film Toxic: A Fairytale for Grown Ups, and called for its removal from public platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhurandhar-2-vs-toxic-ranveer-singh-yash-box-office-battle-movie-machismo-2850940-2026-01-13",
      "headline": "How Dhurandhar 2-Toxic collision will spark an epic battle of machismo 'Dhurandhar 2' vs 'Toxic', two action giants. two radically different brands of machismo. And one explosive March collision the box office isn't ready for. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-defends-hypermasculine-films-but-calls-for-more-women-centric-stories-2850989-2026-01-13",
      "headline": "Emraan Hashmi defends hypermasculine films but calls for more women-centric stories Emraan Hashmi has shared a take on the success of hypermasculine films like Animal, saying audience identification often outweighs online backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-is-prabhas-film-a-case-of-taking-the-telugu-audience-for-granted-2850953-2026-01-13",
      "headline": "The Raja Saab: Is Prabhas' film a case of taking the Telugu audience for granted? Prabhas' starrer The Raja Saab directed by Maruthi brings an uncomfortable conversation about audience trust in Telugu cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-celebrates-friend-sneha-ramchander-wedding-new-york-ranveer-singh-2850973-2026-01-13",
      "headline": "Deepika Padukone is all smiles as bridesmaid at her best friend's NYC wedding Deepika Padukone's presence at her friend Sneha Ramchander's wedding in New York, accompanied by Ranveer Singh, drew attention online as new photos from the ceremony circulated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amid-haq-praise-yami-gautam-recalls-being-unwelcomed-in-bollywood-in-old-interview-2850970-2026-01-13",
      "headline": "Amid Haq praise, Yami Gautam recalls being unwelcomed in Bollywood in old interview As Haq earns widespread acclaim, a throwback interview of Yami Gautam has resurfaced in which she spoke about feeling unwelcomed in Bollywood. The actor also credited her family and husband Aditya Dhar for standing by her through the most difficult phases of her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-reacts-to-fan-comment-on-his-home-after-farah-khan-vlog-2850965-2026-01-13",
      "headline": "Vir Das reacts to fan comment on his home after Farah Khan vlog: Made my lady happy Vir Das melted hearts after sharing a fan's comment praising the simplicity of his home following Farah Khan's visit for her vlog. Calling the moment special, the comedian said the appreciation made his wife Shivani very happy as they prefer a simple, unfancy life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blake-shelton-addresses-divorce-rumours-with-gwen-stefani-2850962-2026-01-13",
      "headline": "We're still together: Blake Shelton addresses divorce rumours with Gwen Stefani Blake Shelton has shut down ongoing rumours about trouble in his marriage with Gwen Stefani, calling out the repetitive cycle of online gossip and misleading images."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/joe-keerys-djo-tops-billboard-global-200-end-of-beginning-becomes-biggest-song-2850959-2026-01-13",
      "headline": "Joe Keery's Djo tops Billboard Global 200, End of Beginning becomes biggest song Joe Keery's track 'End of Beginning' climbs to the top of the Billboard Global 200 for the first time, marking a significant milestone as streaming figures soar following the Stranger Things finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-actor-jason-shah-opens-up-on-film-censor-woes-read-what-he-said-2850914-2026-01-12",
      "headline": "Jana Nayagan actor Jason Shah opens up on film's censor woes. Read what he said Jason Shah, who features in Vijay's 'Jana Nayagan', reacted to the censorship row surrounding the film. He also expressed his views on freedom of expression linked to technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/taha-shah-badussha-marathi-film-paro-on-the-official-oscars-eligibility-list-2850828-2026-01-12",
      "headline": "Taha Shah Badussha's Marathi film Paro on the official Oscars Eligibility List Taha Shah Badussha's 'Paro – The Untold Story of Bride Slavery' has been enlisted at the 98th Academy Awards. The film has been listed on the Oscars Eligibility List."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-shares-hindu-wedding-pics-kriti-lifts-traditional-phoolon-ki-chaddar-2850879-2026-01-12",
      "headline": "Nupur Sanon shares Hindu wedding pics; Kriti lifts traditional phoolon ki chaddar Kriti Sanon broke norms at sister Nupur's Hindu wedding to Stebin Ben, by lifting the flower canopy held by brothers. The picture surfaced on Nupur's social media post.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/prashant-tamang-wife-martha-daughter-pay-last-respects-to-late-singer-watch-2850868-2026-01-12",
      "headline": "Prashant Tamang's wife Martha, daughter pay last respects to late singer. Watch Prashant Tamang's wife Martha Aley and daughter paid tearful last respects to the late singer. Prashant was the winner in the singing reality show 'Indian Idol 3'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/julia-roberts-gets-standing-ovation-at-golden-globes-thanks-audience-watch-video-2850839-2026-01-12",
      "headline": "Julia Roberts gets standing ovation at Golden Globes, thanks audience. Watch video Julia Roberts received a standing ovation at the Golden Globes 2026. She was among the presenters at the awards event among Priyanka Chopra, Mila Kunis, Pamela Anderson, Orlando Bloom, Miley Cyrus and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaate-hue-lamhon-song-launch-border-2-patriotism-soldier-sacrifice-2850844-2026-01-12",
      "headline": "Border 2 unveils Jaate Hue Lamhon at special event with naval officers. Watch The song 'Jaate Hue Lamhon', newly reimagined for the film Border 2, was launched at an event held at the United Services Club in Mumbai on January 12, attended by cast, crew, and Naval Officers, featuring live musical performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahhi-vij-jay-bhanushali-part-ways-co-parenting-amid-speculation-nadim-nadz-2850821-2026-01-12",
      "headline": "Wonder the world we live in: Arpita Khan slams rumours linking Mahhi Vij to Nadim Following her recent separation from Jay Bhanushali, Mahhi Vij addressed rumours and public scrutiny regarding her friendship with Nadim Nadz, with support from Arpita Khan and Ankita Lokhande."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/taapsee-pannu-on-early-self-doubt-why-will-someone-make-me-the-heroine-2850797-2026-01-12",
      "headline": "Taapsee Pannu on early self-doubt: Why will someone make me the heroine Taapsee Pannu recalled the insecurities about her beauty when she started her career. She regretted beating herself with \"self-doubt\" instead of enjoying the process.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-golden-exhibition-mumbai-solo-album-fan-event-2850800-2026-01-12",
      "headline": "Jungkook's GOLDEN: The Moments exhibition wraps on a high note in Mumbai Mumbai hosts BTS Jungkook's first solo album exhibition, GOLDEN: The Moments. The event highlights India's growing passion for immersive K-pop experiences and fan culture."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-iran-tariffs-india-impact-chabahar-port-2850990-2026-01-13",
      "headline": "Trump imposes 25% tariff on Iran trade: How will it affect India?India faces a complex challenge as US President Donald Trump imposes a 25% tariff on countries trading with Iran, directly impacting New Delhi's economic and strategic interests. This move threatens to strain India-US relations and disrupt key trade and energy partnerships with Tehran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-communist-party-of-china-first-high-level-meeting-delhi-office-galwan-clash-2850980-2026-01-13",
      "headline": "Chinese Communist Party delegation visits BJP office, 1st meet since Galwan clashA Communist Party of China delegation visited the BJP headquarters in Delhi and held talks with senior party leaders, marking the first formal party-to-party engagement between the two sides since the 2020 Galwan Valley clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-hang-26-year-old-in-first-reported-execution-over-anti-ayatollah-khamenei-protests-erfan-soltani-hanging-death-sentence-2850856-2026-01-12",
      "headline": "Iran to hang 26-year-old in first reported execution over anti-Khamenei protestsA 26-year-old protester, Erfan Soltani, arrested last week, is now facing an imminent death sentence. Activists and rights groups are warning that his case could set a precedent for executions aimed at deterring further anti-regime protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/germany-announces-visa-free-transit-for-indian-passport-holders-during-pm-modi-chancellor-merz-talks-2850743-2026-01-12",
      "headline": "Germany announces visa-free transit for Indian passport holdersThe visa-free transit facility means that Indian travellers passing through German airports en route to another country will no longer need to apply for a separate transit visa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-is-prabhas-film-a-case-of-taking-the-telugu-audience-for-granted-2850953-2026-01-13",
      "headline": "The Raja Saab: Is Prabhas' film a case of taking the Telugu audience for granted?Prabhas' starrer The Raja Saab directed by Maruthi brings an uncomfortable conversation about audience trust in Telugu cinema."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-sees-seasons-low-of-3-degrees-as-bitter-cold-wave-sweeps-capital-2851000-2026-01-13",
      "headline": "Delhi sees season's coldest morning at 3 degrees; red alert in Punjab, HaryanaDelhi and large parts of north India experienced the coldest morning of the season, with temperatures plunging to near-freezing levels and weather agencies issuing high-level alerts. The severe cold wave, accompanied by dense fog and frost, has disrupted daily life and raised concerns over crop damage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-donald-trump-greenland-denmak-elite-forces-sas-arctic-navy-seal-jaeger-corps-frogmen-sirius-dog-sled-patrol-2850833-2026-01-13",
      "headline": "The elite ice warriors that are waiting for US forces in GreenlandUS President Donald Trump mocked Denmark's defence of Greenland as \"two dogs and a sledge\", but reports suggest that SAS-style Arctic forces could be ready to confront American forces in a region where temperatures can dip as low as -50 degrees Celsius."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/apple-google-gemini-ai-siri-upgrade-ai-partnership-openai-challenge-glbs-2850960-2026-01-13",
      "headline": "Apple, Google strike Gemini deal to power revamped SiriThe deal announced Monday marks a major vote of confidence for Google. Its technology already drives much of Samsung's \"Galaxy AI,\" but the Siri deal unlocks a large market with Apple's installed base of more than two billion active devices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-thirupparamkundram-rise-of-the-sacred-sthala-tradition-part-13-336-12-01-2026",
      "headline": "Time, Tide & Tamil Part 13 | Thirupparam-kundram: Rise of the Sacred Sthala TraditionThirupparamkundram, very much in the news these days, is where it all began, literally and metaphorically: Bhakti got localised with sacred sites and attendant pilgrimages. And this is now a legal and political journey too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-embassy-iran-travel-advisory-warning-leave-tehran-anti-khamenei-protests-2850968-2026-01-13",
      "headline": "Flaunt American passport or else...: US warns citizens to leave protest-hit IranThe US embassy in Iran has urged its citizens to leave the country immediately amid widespread protests against the Islamic Republic's clerical leadership. It warned that displaying an American passport or any links to the US could lead to detention by Iranian authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aap-womens-wing-raises-concerns-toxic-film-teaser-obscene-scenes-karnataka-2850997-2026-01-13",
      "headline": "Yash's Toxic under fire over 'obscene' teaser, AAP Women's wing alerts censor boardThe Aam Aadmi Party's women's wing in Karnataka has filed a complaint with the state women's commission, objecting to scenes in the teaser of Yash's upcoming film Toxic: A Fairytale for Grown Ups, and called for its removal from public platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rickshaw-puller-beaten-to-death-in-feni-autorickshaw-stolen-glbs-2850964-2026-01-13",
      "headline": "Hindu auto driver beaten to death in Bangladesh, 12th killing in 42 daysSamir Kumar Das, 28, worked as an autorickshaw driver in the Dagonbhuiyan area of Feni district. Police said that the attackers fled with the vehicle after the assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/king-trump-proves-india-choice-westminster-system-right-opinion-american-governance-machinery-checks-balances-comedy-2850669-2026-01-12",
      "headline": "King Trump proves India's choice of Westminster system rightNow and then, there are calls to replace India's parliamentary system with a US-style presidency. But Donald Trump's tenure shows how fragile American checks and balances can be."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protests-live-updates-ayatollah-ali-khamenei-speech-tehran-violence-deaths-detention-arrests-donald-trump-iran-israel-unrest-economic-crisis-live-2850355-2026-01-12",
      "headline": "Live: Exiled crown prince Reza Pahlavi calls on Trump to back Iran protestersIran Protest News Live Updates: Iran is facing one of its gravest crises since 1979 as nationwide protests intensify, with rights groups reporting nearly 600 deaths and more than 10,000 arrests amid an internet blackout. Opposition figures, including Reza Pahlavi, have urged US President Donald Trump to actively support protesters, while rallies in London and Los Angeles echoed calls for regime change. Ukrainian President Volodymyr Zelenskyy framed the unrest as a strategic blow to Russia. Tehran denies protester tolls, blames foreign-backed \"terrorists\", signals readiness for talks with Washington, and has staged pro-government rallies as security forces tighten control. Stay with IndiaToday.in for the latest and live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-celebrates-friend-sneha-ramchander-wedding-new-york-ranveer-singh-2850973-2026-01-13",
      "headline": "Deepika Padukone is all smiles as bridesmaid at her best friend's NYC weddingDeepika Padukone's presence at her friend Sneha Ramchander's wedding in New York, accompanied by Ranveer Singh, drew attention online as new photos from the ceremony circulated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-retirement-announcement-australia-cricket-wpl-2026-snub-indw-vs-ausw-last-match-2850975-2026-01-13",
      "headline": "After WPL snub, Australia captain Alyssa Healy announces shock retirement from cricketAustralia captain Alyssa Healy has announced her retirement ahead of the India series. The decision follows weeks of reflection and comes weeks after the veteran wicketkeeper-batter went unsold at the WPL auction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/india-space-power-bank-pslv-c62-mission-takeme2space-orbital-data-centre-server-room-2850339-2026-01-12",
      "headline": "Not just DRDO satellite, India lost a comic server as PSLV failsAn Indian startup revealed an exclusive plan to build a massive server room in the stars. This cosmic power bank would have allowed satellites to plug in and process data in real time. However, the mission failed due to technical glitches during the rocket launch. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fed-chair-jerome-powell-criminal-probe-political-backlash-us-justice-department-glbs-2850954-2026-01-13",
      "headline": "US Justice Department opens criminal investigation into Fed Chair Jerome PowellThe DOJ has opened a criminal investigation into US Federal Reserve Chair Jerome Powell over his testimony on Fed building renovations. Powell said the move is an attempt to pressure the central bank on interest rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-century-or-no-food-for-week-fans-special-promise-ind-vs-nz-vadodara-odi-mohammad-kaif-2850971-2026-01-13",
      "headline": "Virat Kohli century or no food for a week: Kaif amazed by fan's faith in India starMohammed Kaif highlighted Virat Kohli's unmatched aura after a fan vowed to go hungry without a century. Kohli then fell just short of a hundred while guiding India's chase against New Zealand in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protest-internet-blackout-kill-switch-jamming-kills-starlink-elon-musk-china-russia-technology-help-2850566-2026-01-12",
      "headline": "Iran uses kill switch to jam Starlink as protests rage on. Did China or Russia help?As anti-Khamenei protests in Iran enter the third week, the Ayatollah's clerical regime has reportedly activated a military-grade \"kill switch\", which cut off Elon Musk's Starlink and plunged 80 million Iranians into digital darkness. Experts say the sophisticated jamming technology could likely have been supplied by Russia or China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-diabetes-economic-burden-11-4-trillion-second-highest-globally-study-2850813-2026-01-13",
      "headline": "How diabetes is draining India's economy, not just its healthIndia faces the world's second-highest economic burden from diabetes at $11.4 trillion. The findings come at a time when India is already carrying the world's largest diabetes load. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunil-grover-aamir-khan-mimicry-vir-das-happy-patel-leads-to-hilarious-office-mix-up-2850638-2026-01-12",
      "headline": "Sunil Grover's Aamir Khan mimicry leads to hilarious office mix-up. WatchA new promo for Happy Patel features Sunil Grover again impersonating Aamir Khan. This time, he managed to successfully fool Vir Das and others. The confusion led to a humorous misunderstanding that ended with Aamir himself being escorted from his own office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xabi-alonso-farewell-message-kylian-mbappe-real-madrid-parts-ways-social-media-post-2850967-2026-01-13",
      "headline": "Kylian Mbappe pens special farewell message for Xabi Alonso after Real Madrid exitKylian Mbappe paid an emotional tribute to Xabi Alonso after Real Madrid confirmed the manager's sudden exit. Alonso's short Bernabeu stint ended following the Spanish Super Cup defeat to Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-seeks-to-join-pakistan-saudi-arabia-defence-alliance-ankara-aided-islamabad-in-op-sindoor-bloomberg-2850857-2026-01-12",
      "headline": "Turkey in talks to join Pak-Saudi defence pact; Nato member eyeing Islamic Nato?Turkey is in advanced talks to join a newly signed collective defence pact with Pakistan and Saudi Arabia, according to a Bloomberg report. Is the Nato member eyeing an Islamic Nato, partnering Pakistan that has nukes and ballistic missiles and Saudi Arabia, which has financial clout?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ayush-badoni-india-call-up-gautam-gambhir-selection-controversy-2851004-2026-01-13",
      "headline": "Gautam Gambhir biased? Did Ayush Badoni deserve India ODI call-up Ayush Badoni earned his maiden call-up to Team India for the remaining ODIs against New Zealand. The selection has sparked criticism of head coach Gautam Gambhir, with accusations of favouritism from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-wayne-rooney-return-coaching-staff-michael-carrick-no-brainer-2850999-2026-01-13",
      "headline": "Wayne Rooney eyeing Manchester United return with Michael Carrick coaching link Wayne Rooney has opened the door to a Manchester United return as a coach. The club legend said joining Michael Carrick's interim setup would be a \"no-brainer\" if offered the opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hardik-singh-rai-india-hockey-world-cup-khel-ratna-hil-gc-2850928-2026-01-13",
      "headline": "Khel Ratna or not, Hardik Singh has eyes firmly on World Cup–Asian Games double With the World Cup and Asian Games on his mind, Hardik Singh wants to achieve the double and stand on the top step of the podium at both events this year. In an exclusive chat with India Today, the Indian vice-captain talks about playing for HIL GC, 2026 goals and more.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2026-indira-gandhi-indoor-stadium-world-championships-2850974-2026-01-13",
      "headline": "Lakshya Sen vs Ayush Shetty to kick off blockbuster badminton week in Delhi India Open 2026: Former champions lead India's charge as Lakshya Sen faces Ayush Shetty in a blockbuster opener, while teenage debutant Tanvi Sharma steps into the spotlight in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-retirement-announcement-australia-cricket-wpl-2026-snub-indw-vs-ausw-last-match-2850975-2026-01-13",
      "headline": "After WPL snub, Australia captain Alyssa Healy announces shock retirement from cricket Australia captain Alyssa Healy has announced her retirement ahead of the India series. The decision follows weeks of reflection and comes weeks after the veteran wicketkeeper-batter went unsold at the WPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-century-or-no-food-for-week-fans-special-promise-ind-vs-nz-vadodara-odi-mohammad-kaif-2850971-2026-01-13",
      "headline": "Virat Kohli century or no food for a week: Kaif amazed by fan's faith in India star Mohammed Kaif highlighted Virat Kohli's unmatched aura after a fan vowed to go hungry without a century. Kohli then fell just short of a hundred while guiding India's chase against New Zealand in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xabi-alonso-farewell-message-kylian-mbappe-real-madrid-parts-ways-social-media-post-2850967-2026-01-13",
      "headline": "Kylian Mbappe pens special farewell message for Xabi Alonso after Real Madrid exit Kylian Mbappe paid an emotional tribute to Xabi Alonso after Real Madrid confirmed the manager's sudden exit. Alonso's short Bernabeu stint ended following the Spanish Super Cup defeat to Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-sack-xabi-alonso-spanish-super-cup-final-barcelona-2850907-2026-01-12",
      "headline": "Real Madrid part ways with Xabi Alonso after Spanish Super Cup final loss Spanish giants Real Madrid have decided to part ways with manager Xabi Alonso by mutual agreement. The club announced its decision just a day after Madrid's Spanish Super Cup loss against bitter rivals Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-rcb-vs-up-warriorz-grace-harris-85-match-report-2850904-2026-01-12",
      "headline": "WPL 2026: Warriorz meltdown in front Grace Harris blitz, RCB make it two in two Grace Harris' blitz and disciplined bowling effort ensured that RCB made it two in two in the WPL 2026 as they crushed a hapless UP Warriorz side on Monday, January 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/anti-bangladesh-sentiment-in-india-bcb-bcci-t20-world-cup-2850901-2026-01-12",
      "headline": "Bangladesh willing to play T20 World Cup in Pakistan: Bangladesh Sports advisorBangladesh sports advisor Asif Nazrul has stressed that it is impossible for their national cricket team to play T20 World Cup matches in India. Nazrul has stated that India he will not send the team to play matches in a country that has anti-Bangladesh sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-icc-t20-world-cup-bcci-2850847-2026-01-12",
      "headline": "Bangladesh backtracks hours after anti-India statement, await ICC responseT20 World Cup: Bangladesh backtracked hours after making a provocative anti-India statement on January 12. After the country's sports advisor claimed that the ICC had acknowledged the team's security concerns, the Bangladesh Cricket Board said in an official statement that it is still awaiting a formal response from the world body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-icc-rejects-bangladesh-cricket-board-claim-security-concerns-2850815-2026-01-12",
      "headline": "ICC rejects claim it validated Bangladesh's security concerns in India: SourcesThe ICC has rejected claims that it has validated Bangladesh's security concerns in India, sources told India Today on Monday, January 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devdutt-padikkal-history-karnataka-beat-mumbai-reach-vijay-hazare-semifinal-2850766-2026-01-12",
      "headline": "Devdutt Padikkal scripts history as Karnataka beat Mumbai to reach semifinalDevdutt Padikkal created history by becoming the first batter to score 700 runs in multiple Vijay Hazare Trophy seasons as Karnataka knocked out Mumbai via the VJD method to reach the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-live-score-today-match-rcb-vs-up-warriorz-updates-navi-mumbai-smriti-mandhana-meg-lanning-2850776-2026-01-12",
      "headline": "RCB vs UP Warriorz Highlights: Harris blitz helps Bengaluru thrash WarriorzRoyal Challengers Bengaluru (RCB) vs UP Warriorz (UPW) WPL Highlights: A brilliant innings from Grace Harris sees RCB in cruise control of this chase as UP Warriorz struggle to stem the run flow in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-leeds-new-logo-northern-superchargers-kavya-maran-2850711-2026-01-12",
      "headline": "North England turns orange! Kavya Maran's Sunrisers Leeds unveil logoSunrisers Leeds have officially unveiled their new logo after the acquisition of Northern Superchargers was completed. Headingley will be used as the home ground for Sunrisers Leeds in the upcoming season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kc-cariappa-retires-indian-cricket-ipl-domestic-career-2850720-2026-01-12",
      "headline": "KC Cariappa, former IPL spinner, announces retirement from Indian cricketKC Cariappa, known for his mystery spin and stints with multiple IPL franchises, has announced his retirement from Indian cricket. The leg-spinner shared the news through an emotional post on social media, reflecting on his professional journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-engaged-girlfriend-sophie-shine-2850728-2026-01-12",
      "headline": "Shikhar Dhawan announces engagement to girlfriend Sophie Shine in heartfelt Insta postShikhar Dhawan has announced his engagement to girlfriend Sophie Shine with a heartwarming Instagram post on Monday, January 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/saeed-ajmal-icc-t20-world-cup-bcci-bcb-2850710-2026-01-12",
      "headline": "ICC dominated by Indians, no point in its existence: Ex-Pakistan spinnerFormer Pakistan spinner Saeed Ajmal has lambasted the International Cricket Council. In a provocative statement, Ajmal has said that the ICC is dominated by Indians and there is no point in its existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-retired-out-bbl-t20-world-cup-hopes-2850697-2026-01-12",
      "headline": "Embarrassment for Mohammad Rizwan, Pakistan batter gets retired out in BBLMohammad Rizwan's BBL journey endured a new low as he was retired out during the clash between Melbourne Renegades and Sydney Thunder on Monday, January 12. Rizwan was taken off from batting as Will Sutherland came in as his replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-nabi-snaps-bangladesh-reporter-over-questions-on-mustafizur-ipl-row-2850666-2026-01-12",
      "headline": "Mohammad Nabi snaps at Bangladesh reporter over questions on Mustafizur IPL rowVeteran Afghanistan all-rounder Mohammad Nabi lost his cool at a Bangladesh reporter after being asked an unwarranted question about the IPL controversy involving Mustafizur Rahman and Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wojciech-szczesny-smoking-leaked-lamine-yamal-instagram-live-real-madrid-vs-fc-barcelona-2850656-2026-01-12",
      "headline": "Watch: Lamine Yamal leaks another Szczesny smoking clip after Super Cup winLamine Yamal accidentally went live from Barcelona's dressing room and briefly caught Wojciech Szczesny smoking after the Super Cup final win over Real Madrid. The clip was quickly cut but spread rapidly online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-matches-behind-closed-doors-navi-mumbai-municipal-elections-security-concerns-2850646-2026-01-12",
      "headline": "WPL games to have no spectators during Navi Mumbai municipal elections: ReportTwo Women's Premier League matches will be held without spectators this week due to the Navi Mumbai municipal corporation elections on January 15. The decision follows concerns over security as police resources are diverted for election duties, and ticket sales haven't gone live for matches on January 14, 15, and 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-walks-the-talk-shreyas-iyer-praise-2850640-2026-01-12",
      "headline": "Virat Kohli walks the talk: Shreyas Iyer praises India icon's consistencyIND vs NZ: Shreyas Iyer praised Virat Kohli's consistency after the latter's composed 93 guided India to a four-wicket win over New Zealand. Kohli also crossed 28,000 international runs and climbed to second on the all-time list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-player-curfew-ashes-drinking-saga-report-2850622-2026-01-12",
      "headline": "England players face curfew after drinking saga during Ashes: ReportThe England and Wales Cricket Board is reportedly considering introducing a player curfew, among other measures, as it looks to address culture concerns following recent off-field controversies in the humiliating Ashes tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-badoni-replaces-washington-sundar-india-squad-new-zealand-odis-2850596-2026-01-12",
      "headline": "Ayush Badoni gets maiden ODI call-up, replaces injured Washington SundarIndian selectors have named uncapped youngster Ayush Badoni as the replacement for all-rounder Washington Sundar, who has been ruled out of the ODI series against New Zealand after suffering a rib injury in the series opener in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harshit-rana-cut-out-noise-trolls-ajinkya-rahane-reveals-kkr-training-2850591-2026-01-12",
      "headline": "Harshit Rana's mantra to cut out noise: Rahane reveals how pacer battles trollsAjinkya Rahane revealed how Harshit Rana battled social media trolling during a difficult IPL phase. The KKR captain said the pacer cut out the noise and responded with decisive all-round performances for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hassan-eisakhil-mohammad-nabi-first-father-son-pair-batting-top-tier-t20-league-2850571-2026-01-12",
      "headline": "Nabi, Eisakhil become first father-son duo to bat together in top-tier T20 leagueHassan Eisakhil played a memorable knock for Noakhali Express in the Bangladesh Premier League, batting alongside his father Mohammad Nabi to become the first father-son pair to share the crease in a top-tier T20 league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-batting-mastery-praised-kyle-jamieson-india-vs-new-zealand-2850543-2026-01-12",
      "headline": "Virat Kohli is on a different level, you can't contain greats like him: Kyle JamiesonNew Zealand all-rounder Kyle Jamieson admitted he could only stand back in admiration of Virat Kohli's mastery, saying the Indian great operates on a different level, one where elite batters inevitably find a way to dominate, no matter how hard bowlers try to rein them in."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}