{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-digital-form-16-a-game-changer-for-salaried-taxpayers-2725775-2025-05-16",
      "headline": "ITR filing 2025: Is digital Form 16 a game-changer for salaried taxpayers?Digital Form 16 is an electronic version of the traditional Form 16. It's generated directly from the TRACES portal, which is managed by the Income Tax Department. This means all your salary details, TDS, and tax-saving deductions are recorded accurately and match what the government sees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-clears-187-startups-for-tax-relief-heres-what-it-means-2725727-2025-05-16",
      "headline": "Government clears 187 startups for tax relief. Here's what it meansTo qualify, the start-up must be recognised by the Department for Promotion of Industry and Internal Trade (DPIIT). It should be a private limited company or a limited liability partnership and its turnover should not cross Rs 100 crore in any year since incorporation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-extend-rally-on-possible-rs-50000-crore-budget-boost-should-you-buy-sell-or-hold-2725720-2025-05-16",
      "headline": "Defence stocks extend rally on possible budget boost. What should investors do?The NSE Nifty India Defence index surged over 5% intraday on Friday. Cochin Shipyard and GRSE have been leading the charge, with the latter gaining a stunning 30% since May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/singtel-offloads-12-percent-stake-in-bharti-airtel-in-154-billion-deal-2725693-2025-05-16",
      "headline": "Singtel offloads 1.2% stake in Bharti Airtel in $1.54 billion dealSingtel, which has been an investor in Airtel for over 20 years, said its stake would drop to 28.3%, valued at around S$48 billion, from 29.5% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/blaming-nris-wont-solve-indias-housing-problem-says-investor-heres-why-2725672-2025-05-16",
      "headline": "Blaming NRIs won't solve India's housing problem, says investor. Here's whyNRIs earn in strong currencies like US dollars, pounds, or euros. So when they convert that money to rupees, they can afford much more. A house that seems expensive to someone in India may feel quite reasonable to someone earning abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/cochin-shipyard-grse-shares-rally-up-to-12-percent-why-are-these-defence-stocks-rising-2725671-2025-05-16",
      "headline": "Cochin Shipyard, GRSE rally up to 12%: Why are these defence stocks rising?Cochin Shipyard jumped 12.51% to Rs 2,039 on the BSE at around 11:47 am, extending its rally for a sixth straight session. GRSE climbed 11.10% intraday to Rs 2,510, taking its cumulative gains to over 30% since announcing results post-market on May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stop-us-travel-turkey-tourism-boycott-us-deal-missile-ace-investor-shankar-sharma-2725670-2025-05-16",
      "headline": "Stop all bookings to America, warns ace investor as Indians ditch TurkeyTourism to Turkey and Azerbaijan has already taken a major hit, especially after reports that Pakistan used Turkish-made drones in its recent strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-to-open-may-20-check-gmp-expected-listing-gains-2725648-2025-05-16",
      "headline": "Borana Weaves IPO to open May 20: Check GMP, expected listing gainsAccording to grey market trends, the IPO is commanding a premium of Rs 55 per share, suggesting potential listing gains of over 25% for successful applicants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-stock-in-focus-today-sebi-probe-stake-sale-japan-sbmc-2725615-2025-05-16",
      "headline": "Explained: Why Yes Bank shares are in focus todayYes Bank stock: The shares fell over 1% in early trade but later recovered to trade in the green. At the start of the day, Yes Bank shares opened at Rs 21.50, slightly below Thursday's close of Rs 21.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-offers-zero-tariff-bilateral-trade-deal-to-us-report-2725614-2025-05-16",
      "headline": "Pakistan offers zero-tariff bilateral trade deal to US: ReportThe development comes shortly after US President Donald Trump claimed credit for brokering a ceasefire between India and Pakistan, following four days of intense cross-border hostilities involving drones and missile strikes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-reunites-with-the-legendary-actor-robert-de-niro-at-cannes-2725762-2025-05-16",
      "headline": "The legends reunite: Anupam Kher, Rober De Niro in a picture perfect Cannes momentIndian actor Anupam Kher reunited with his 'Silver Linings Playbook' co-star and long-time friend, Hollywood legend Robert De Niro, at the 78th Cannes Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/dd-next-level-review-santhanam-prem-anand-gautham-menon-dhilluku-dhuddu-2725776-2025-05-16",
      "headline": "DD Next Level review: Few gags aside, Santhanam's film is mostly tortureReleased-Fri May 16, 2025DD Next Level movie review: Director Prem Anand's 'DD Next Level', starring Santhanam, Selvaraghavan and Geethika Tiwary, is a horror movie spoof. Barring a few fun gags, the film is replete with outdated fart jokes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tourist-family-ott-release-when-and-where-to-watch-sasikumar-simran-film-2725722-2025-05-16",
      "headline": "Tourist Family OTT Release: When and where to watch Sasikumar-Simran's film'Tourist Family', the emotional Tamil drama, is set to stream on JioHotstar from May 31 after a successful theatrical run. The film made history as the first small-budget Tamil movie to be screened in the UK's prestigious SUPERSCREEN format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-sings-dum-maaro-dum-to-baby-matara-in-cute-nani-over-mozart-moment-2725773-2025-05-16",
      "headline": "Neena Gupta sings Dum Maaro Dum to baby Matara in cute 'Nani over Mozart' momentActor Neena Gupta was seen singing 'Dum Maaro Dum' to her granddaughter Matara in a heartwarming moment shared by Masaba Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-announces-new-podcast-pushes-for-meaningful-conversations-and-honest-answers-2725766-2025-05-16",
      "headline": "Karan Johar pushes for 'meaningful conversations and honest answers' in new podcastFilmmaker Karan Johar has now turned into a podcaster with a new stint. He announced that he would be rooting for 'meaningful conversations' in a refreshing move after hosting a gossip show, 'Koffee With Karan', for years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/michael-jordon-attends-tom-cruise-mission-impossible-the-final-reckoning-london-screening-2725763-2025-05-16",
      "headline": "Michael Jordon attends Tom Cruise's Mission Impossible screening, share warm momentActors Michael B Jordon and Tom Cruise embraced at 'Mission: Impossible - The Final Reckoning' premiere in London. Jordon shared the heart-warming moment on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhotra-tamannaah-bhatia-vvan-release-in-may-2026-2725748-2025-05-16",
      "headline": "Sidharth Malhotra, Tamannaah Bhatia's Vvan set for summer release. Check dateSidharth Malhotra and Tamannaah Bhatia's 'Vvan' to release in theatres on May 15, 2026. The makers shared a post on social media and announced the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-makes-influencer-niharika-nms-dream-come-true-at-mi-8-premiere-2725694-2025-05-16",
      "headline": "Tom Cruise makes influencer Niharika NM's 'dream come true' at MI 8 premiereActor Tom Cruise made Indian influencer Niharika NM's 'dream come true'. The latter shared a glimpse of her meeting with the Hollywood actor from the MI 8 premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-those-still-branding-alia-bhatt-with-nepotism-are-idiotic-2725711-2025-05-16",
      "headline": "Karan Johar says those still branding Alia Bhatt with nepotism are 'idiotic' Filmmaker Karan Johar once again defended Alia Bhatt against those who call her a product of nepotism in the film industry. He also talked about the backlash that his film 'Nadaaniyan' received for launching another star-kid. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-slams-netflix-prime-video-content-theyre-worse-than-television-2725681-2025-05-16",
      "headline": "Anurag Kashyap slams Netflix, Prime Video content: They're worse than televisionFilmmaker Anurag Kashyap voiced his disappointment with the Indian streaming giants, calling them 'worse than television.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-war-2-update-on-jr-ntrs-42nd-birthday-you-have-no-idea-2725679-2025-05-16",
      "headline": "Hrithik Roshan hints at big War 2 update on Jr NTR's 42nd birthday: You have no ideaIt's almost mid 2025, and we need more updates on Ayan Mukerji's highly-anticipated movie 'War 2'. Fret not, Hrithik Roshan just dropped a post hinting at a massive update on the film on Jr NTR's 42nd birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/armaan-malik-requests-punjab-police-for-gun-license-in-now-deleted-video-2725659-2025-05-16",
      "headline": "YouTuber Armaan Malik requests Punjab police for gun licence in now-deleted videoYouTuber and ex-Bigg Boss contestant Armaan Malik sparked controversy after posting a video requesting a gun licence from Punjab Police, citing threats to his life. Later, he deleted the video. He claimed that despite legal efforts, he and his family continue to face danger without adequate protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/putul-director-indira-dhar-to-unveil-debut-bollywood-film-cannes-film-festival-2025-2725666-2025-05-16",
      "headline": "Director of Oscar-nominated film Putul to unveil her next at Cannes Film FestivalAcclaimed filmmaker Indira Dhar is making her Bollywood debut with 'Echoes of Valour', a poignant biopic set in an Indian Army family.  The film's first look and title will be unveiled at the Cannes Film Festival 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/anupam-kher-makes-red-carpet-debut-at-cannes-2025-with-tanvi-the-great-2725627-2025-05-16",
      "headline": "Anupam Kher makes Cannes debut ahead of Tanvi The Great premiere. WatchAnupam Kher made his Cannes debut ahead of the premiere of his film, 'Tanvi the Great'. He shared a heartfelt message on Instagram embracing his Hindi roots and urging everyone to follow their dream despite struggles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-bhumi-pednekar-spoke-about-her-too-big-lips-people-pay-lakhs-to-get-it-done-2725656-2025-05-16",
      "headline": "Bhumi Pednekar's old clip about 'too big lips' resurfacesActor Bhumi Pednekar's old interview in which she reacted to criticism regarding her looks has surfaced online. The actor spoke about how people comment on her lips. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gagan-arora-on-choosing-jewel-thief-and-breaking-out-of-college-boy-roles-2725360-2025-05-16",
      "headline": "Gagan Arora on choosing Jewel Thief, and breaking out of 'college boy' rolesActor Gagan Arora is on a mission to break stereotypes with the diverse roles he's been embracing. In an exclusive interview with India Today, the 31-year-old, who shot to fame with 'College Romance', shared that he's been fighting and working relentlessly each day to prove his versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/patralekhaa-says-desperation-for-work-anxiety-made-her-do-bold-role-in-love-games-2725650-2025-05-16",
      "headline": "Patralekhaa says desperation for work, anxiety made her do bold role in Love GamesBollywood actor Patralekhaa admitted taking on a bold role in Vikram Bhatt's 'Love Games' due to desperation for work and anxiety issues. She made her Bollywood debut with 'CityLights' in 2014. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-babil-khan-viral-video-bashing-bollywood-felt-terrible-as-a-parent-2725647-2025-05-16",
      "headline": "Karan Johar reacts to Babil Khan's viral video: I felt terribleBabil Khan's emotional video stirred widespread attention and concern in the Indian film industry, prompting reactions from family and peers alike. Karan Johar  reacted to the video and expressed his empathy as a parent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajal-aggarwal-joins-nitesh-tiwari-ramayana-as-mandodari-opposite-yash-ravana-2725626-2025-05-16",
      "headline": "Kajal Aggarwal joins Nitesh Tiwari's Ramayana, to play Ravana's wife MandodariKajal Aggarwal has been cast as Mandodari in Nitesh Tiwari's highly awaited 'Ramayana'. She will play Mandodari, opposite Yash's Ravana. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-army-warfare-expert-operation-sindoor-india-military-superior-pakistan-china-air-defence-2725651-2025-05-16",
      "headline": "Chinese, Pak air defence systems no match for India's BrahMos: US warfare expertOperation Sindoor: Colonel (Retd) John Spencer said India demonstrated both offensive and defensive superiority during Operation Sindoor, sending a message that it can hit 'anywhere in Pakistan, anytime'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-offering-financial-aid-to-terror-outfits-imf-must-rethink-loan-to-nation-rajnath-singh-at-bhuj-airbase-2725709-2025-05-16",
      "headline": "Pak to give Rs 14 crore to Masood Azhar, IMF must rethink loan: Rajnath SinghRajnath Singh, speaking at the Bhuj airbase, claimed that Pakistan has announced financial aid to rebuild the terror infrastructure of Lashkar-e-Taiba and Jaish-e-Mohammed in Muridke and Bahawalpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-deputy-pm-foreign-minister-ishaq-dar-prey-to-own-fake-news-fact-checked-by-pak-media-2725750-2025-05-16",
      "headline": "Pak deputy PM falls prey to Pakistani propaganda, fact-checked by own mediaIn a stunning self-goal, Pakistan's Deputy PM Ishaq Dar quoted a fake headline from a digitally altered frontpage of British newspaper, The Daily Telegraph. Ironically, the fake page had been promoted by the Pakistani establishment's disinformation brigade. Adding to Dar's embarrassment, the farce was also fact-checked by the Pakistani media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/frenemies-india-afghanistan-taking-again-jaishankar-taliban-pakistan-conflict-2725710-2025-05-16",
      "headline": "Why frenemies India and Afghanistan are talking againOn Friday, S Jaishankar spoke with his Afghan counterpart. It was the first political-level contact between India and Afghanistan since the Taliban seized power. In this edition of The Lowdown, we explain India's past relationship with the Taliban and how the latest development indicates a new bend in the topsy-turvy path to Kabul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trumps-desert-stormy-daniels-hot-heavy-and-steamy-qatar-khosla-ka-ghosla-india-pakistan-war-2725658-2025-05-16",
      "headline": "Trump's Desert Stormy hot, heavy and steamyFrom gorgeous trade deals to sheikhing it with a man with bounty on his head, Trump's geopolitics, driven by a shrinking lexicon and fixation on wealth, turns global affairs into a flashy, hot and heavy spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-samachar-bahubali-shah-arrested-gstv-ed-enforcement-money-laundering-2725688-2025-05-16",
      "headline": "Owner of Gujarat's largest daily arrested by ED in money laundering caseThe Enforcement Directorate's arrest of Gujarat Samachar owner Bahubali Shah in a money laundering case has triggered a political storm, with the Congress and AAP accusing the BJP of using central agencies to suppress critical voices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-military-action-all-party-foreign-tour-army-2725633-2025-05-16",
      "headline": "India to mount diplomatic offensive on Pak, send MPs to brief countriesA delegation of MPs from all political parties will begin an outreach tour after May 22 to brief foreign nations on the recent India-Pakistan conflict and India's stance, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/former-fbi-chief-james-comey-assassination-threat-donald-trump-8647-post-2725603-2025-05-16",
      "headline": "Ex-FBI chief under scanner for 'murder threat' to Trump after '8647' postJames Comey, who was fired by Trump during his first term, has deleted the post after he faced severe backlash from Republicans and members of Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-says-shakiras-wardrobe-malfunction-affected-his-met-gala-entry-2725582-2025-05-16",
      "headline": "Diljit Dosanjh says Shakira's wardrobe malfunction affected his Met Gala entryDiljit Dosanjh recently opened up about Shakira's unexpected wardrobe malfunction just before her Met Gala appearance this year. In a newly released YouTube vlog, the singer shared behind-the-scenes moments from his debut at the prestigious event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-live-jammu-and-kashmir-operation-sindoor-indian-army-loc-border-2725566-2025-05-16",
      "headline": "Op Sindoor took out enemies in the time it takes to have breakfast: Rajnath SinghIndia Pakistan Conflict Live Updates: Today marks the sixth day since India and Pakistan reached an understanding to cease hostilities, bringing an end to the heightened military tensions that had escalated following the April 22 Pahalgam terrorist attack and India's subsequent retaliatory Operation Sindoor. Following a meeting between the Directors General of Military Operations (DGMOs) of India and Pakistan after the ceasefire, both armies firmed up the arrangement to halt military actions. The Indian Army said it will pursue confidence-building measures to reduce the 'alertness level' in line with the understanding. Stay tuned to IndiaToday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/dr-rooma-sinha-completes-1000-robotic-gynaecological-surgeries-india-2725696-2025-05-16",
      "headline": "Inside the OR: Meet the Indian doctor behind 1,000 robotic surgeriesDr Rooma Sinha becomes the first Indian gynaecologist to complete over 1,000 robotic surgeries. She opens about robotic surgery and how it can empower women to focus on their health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-budget-additional-allocation-weapons-technology-operation-sindoor-2725581-2025-05-16",
      "headline": "Defence budget may get Rs 50,000-crore push amid Operation SindoorThe additional spending will be directed towards the purchase of weapons and ammunition, as well as technology, following Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-under-fire-as-us-military-strategist-slams-1-billion-imf-bailout-for-pak-glbs-2725568-2025-05-16",
      "headline": "US military strategist slams Trump admin over $1 billion IMF bailout for PakEx-Pentagon adviser Michael Rubin slammed the IMF's $1B bailout to Pakistan, calling it aid to a \"terror-addled, pro-China regime.\" He said it undermines Trump, bails out China, and rewards Pakistan's terrorism-linked actions against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-turkey-drones-azerbaijan-drones-congress-bjp-amit-malviya-prime-minister-modi-s-jaishankar-2725607-2025-05-16",
      "headline": "Congress can't align with people's sentiments on Turkey, slams BJP, party hits backWhile the BJP slammed the Congress for evading questions on calls to boycott Turkey and Azerbaijan over their support to Pakistan, the Congress hit back, stating that decisions on diplomatic ties should be clarified by the government, not the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/thank-trump-for-peace-kashmiri-waiter-told-me-in-doha-white-house-secretary-glbs-2725541-2025-05-16",
      "headline": "My waiter from Kashmir said...: Trump aide Karoline Leavitt's tweet goes viralWhite House Press Secretary Karoline Leavitt credited President Trump for brokering an India-Pakistan ceasefire, citing a Kashmiri waiter's gratitude, despite Indian officials denying US involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-covid-19-wave-spreads-in-asia-infections-rise-in-hong-kong-and-singapore-glbs-2725563-2025-05-16",
      "headline": "New Covid-19 wave spreads in Asia, infections rise in Hong Kong and SingaporeCovid-19 cases are rising sharply in Hong Kong and Singapore, with health officials warning of a new wave across Asia. According to reports, the increase may be an indication of declining immunity, with authorities urging people to ensure they are vaccinated. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-man-lies-on-funeral-pyre-halts-mother-cremation-over-silver-bangles-rajasthan-2725620-2025-05-16",
      "headline": "Son halts mother's cremation in Jaipur, lies on pyre over silver banglesIn Jaipur, a man laid on his mother's funeral pyre, halting the cremation over a dispute about her silver bangles. The incident caused a two-hour delay and was caught on video.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kerala-woman-drives-caravan-to-ladakh-with-family-of-7-shares-videos-of-dream-journey-2725683-2025-05-16",
      "headline": "Kerala woman drives caravan to Ladakh with family, shares videos of dream journeyThe videos show the family engaging in heartwarming activities - sharing meals, cleaning the caravan, chatting, and enjoying the journey together as they cruise through diverse landscapes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/scorched-cities-why-india-urgently-needs-a-national-heatwave-action-plan-2724762-2025-05-16",
      "headline": "Why India urgently needs a national heatwave action planTemperatures have been projected to reach 45°C in certain areas of Rajasthan. The impact of urban heat islands will contribute to major health risks in cities like Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/in-a-first-jaishankar-holds-first-ever-call-with-taliban-foreign-minister-glbs-2725562-2025-05-16",
      "headline": "In a 1st, Jaishankar speaks to Taliban minister, welcomes J&K attack condemnationIn the first political-level contact between India and Afghanistan since the Taliban seized power in Kabul in August 2021, External Affairs Minister S Jaishankar spoke with the country's acting Foreign Minister over the phone and thanked him for condemning the Pahalgam attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-chandrayaan-5-india-is-readying-with-japan-and-what-will-it-do-on-the-moon-2725705-2025-05-16",
      "headline": "Chandrayaan-5: What is India planning to do on the Moon with Japan?Approved by the Indian government in March 2025, Chandrayaan-5 is a joint venture between the Indian Space Research Organisation (Isro) and the Japan Aerospace Exploration Agency (JAXA). "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajat-patidar-rcb-captaincy-virat-kohli-confidence-deserve-it-2725781-2025-05-16",
      "headline": "Rajat Patidar opens up on Virat Kohli's influence during RCB captaincy shiftRajat Patidar opened up on the pressure of leading RCB in IPL 2025 and how Virat Kohli's faith in him gave the young skipper confidence to take charge and steer the team towards a strong campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-shubman-gill-wasim-jaffer-india-captain-2725740-2025-05-16",
      "headline": "Bumrah automatic choice as captain, Shubman vice-captain: Wasim JafferWasim Jaffer said that Jasprit Bumrah should be appointed as the new Indian Test captain, replacing Rohit Sharma, who recently retired from the purest format. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-will-jacks-india-return-instagram-story-mumbai-indians-2725706-2025-05-16",
      "headline": "Will Jacks confirms India return with special post as MI get major boostWill Jacks shared a photo from his flight to Mumbai, confirming his return for the remainder of IPL 2025 and handing Mumbai Indians a timely boost as other overseas stars continue to opt out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-lancashire-derbyshire-county-championship-2725684-2025-05-16",
      "headline": "James Anderson returns to competitive cricket, named in Lancashire County squadFormer England fast bowler James Anderson has returned to competitive cricket after Lancashire named him in the squad for their county match against Derbyshire at the Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-laliga-team-effort-not-lamine-yamal-alone-hansi-flick-2725662-2025-05-16",
      "headline": "Hansi Flick credits Barcelona's LaLiga title to team effort, not Yamal aloneHansi Flick has transformed a youthful Barcelona side into LaLiga champions, but he insists their triumph is down to unity, discipline, and teamwork — not just the breakout brilliance of Lamine Yamal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-johnson-overseas-players-lives-safety-india-2725654-2025-05-16",
      "headline": "Lives, safety most important: Johnson asks overseas players to skip IPLIPL 2025: With the tournament resuming on May 17, former fast bowler Mitchell Johnson said that foreign players shouldn't go back to India keeping their safety in mind. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-starc-delhi-capitals-not-returning-remainder-of-season-reports-2725634-2025-05-16",
      "headline": "Mitchell Starc opts against returning to India for remainder of IPL 2025: ReportsMitchell Starc is reportedly not going to return for the remainder of IPL 2025, leaving Delhi Capitals without their pace spearhead at a crucial stage. His absence comes as a major setback as the team pushes for a spot in the playoffs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-india-test-captain-jasprit-bumrah-drs-2725624-2025-05-16",
      "headline": "DRS: Who should be India's next Test captain after Rohit's retirement?Rohit Sharma's retirement from Test cricket has created a significant leadership void in the Indian team. In this edition of the Democratic Review System, we explore the potential captaincy options India can consider ahead of their Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-rain-bengaluru-chinnaswamy-2725606-2025-05-16",
      "headline": "Swim David: Watch RCB star enjoy rainy evening in Bengaluru before IPL resumptionIPL 2025: Australian batter Tim David enjoyed the rainy weather in Bengaluru as he was seen swimming on the ground covers at the M Chinnaswamy Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ravindra-jadeja-test-captaincy-india-2725588-2025-05-16",
      "headline": "Ashwin joins Test captaincy debate, backs his spin twin to lead India for 2 yearsFormer India spinner R. Ashwin has weighed in on the India Test captaincy debate, backing his spin twin Ravindra Jadeja to lead the men's Test team for the next two years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-casper-ruud-italian-open-record-2725580-2025-05-16",
      "headline": "Jannik Sinner in elite company with Big 3 after hammering Casper RuudItalian Open 2025: Jannik Sinner put on a dominating performance after beating Casper Ruud 6-0, 6-1 in the quarterfinal. He will next face Tommy Paul in the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-starc-delhi-capitals-not-returning-remainder-of-season-reports-2725634-2025-05-16",
      "headline": "Mitchell Starc opts against returning to India for remainder of IPL 2025: ReportsMitchell Starc is reportedly not going to return for the remainder of IPL 2025, leaving Delhi Capitals without their pace spearhead at a crucial stage. His absence comes as a major setback as the team pushes for a spot in the playoffs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-india-test-captain-jasprit-bumrah-drs-2725624-2025-05-16",
      "headline": "DRS: Who should be India's next Test captain after Rohit's retirement?Rohit Sharma's retirement from Test cricket has created a significant leadership void in the Indian team. In this edition of the Democratic Review System, we explore the potential captaincy options India can consider ahead of their Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-rain-bengaluru-chinnaswamy-2725606-2025-05-16",
      "headline": "Swim David: Watch RCB star enjoy rainy evening in Bengaluru before IPL resumptionIPL 2025: Australian batter Tim David enjoyed the rainy weather in Bengaluru as he was seen swimming on the ground covers at the M Chinnaswamy Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ravindra-jadeja-test-captaincy-india-2725588-2025-05-16",
      "headline": "Ashwin joins Test captaincy debate, backs his spin twin to lead India for 2 yearsFormer India spinner R. Ashwin has weighed in on the India Test captaincy debate, backing his spin twin Ravindra Jadeja to lead the men's Test team for the next two years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-casper-ruud-italian-open-record-2725580-2025-05-16",
      "headline": "Jannik Sinner in elite company with Big 3 after hammering Casper RuudItalian Open 2025: Jannik Sinner put on a dominating performance after beating Casper Ruud 6-0, 6-1 in the quarterfinal. He will next face Tommy Paul in the semis. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}