{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-275-in-january-under-new-cpi-base-year-2024-2867214-2026-02-12",
      "headline": "Retail inflation at 2.75% in January as India shifts to new CPI base year 2024The data, released by the Ministry of Statistics and Programme Implementation, reflects a major statistical overhaul aimed at making India's inflation measure more representative of current consumption patterns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-india-90-year-old-man-sold-policy-maturing-in-20124-systemic-gaps-fraud-2867205-2026-02-12",
      "headline": "A 90-year-old man was sold a 100-year policy. Why blaming the bank is not enoughHandcrafted ByOur Editors A 90-year-old man was sold an insurance policy maturing in 2124. The case sounds bizarre. But instances of mis-selling like this are painfully common across the country. The bank resolved the matter after a viral social media post. The harder question is why blaming the bank alone is not enough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-sinks-over-500-points-nifty-tumbles-as-ai-panic-sinks-it-stocks-2867194-2026-02-12",
      "headline": "Sensex sinks over 500 points, Nifty tumbles as AI panic sinks IT stocksThe benchmark BSE Sensex fell 559 points to close at 85,674.92, while the Nifty 50 slipped below the psychologically important 25,900 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-air-india-write-to-government-over-cabin-crew-fatigue-rules-fia-letter-dgca-2867151-2026-02-12",
      "headline": "Aviation body writes to government as it bids to tighten cabin crew fatigue ruleThe Federation of Indian Airlines (FIA) has asked the government to dilute parts of the draft rules. The industry body represents IndiGo and Air India, and has raised concerns that the changes may create operational and cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-infosys-wipro-it-stocks-crack-under-global-ai-pressure-nifty-it-falls-buying-chance-2867130-2026-02-12",
      "headline": "IT stocks crack under global AI pressure. Is this a buying chance?The Nifty IT index fell 4.67% by 12 PM, hitting a four-month low. The selloff wiped out nearly Rs 1.3 lakh crore in combined market value in a single session. The IT pack on the Sensex was also down nearly 5%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cpi-retail-inflation-calculation-food-prices-less-weight-rent-accomodation-bigger-role-2867071-2026-02-12",
      "headline": "Inflation data reset: Why your groceries will matter less than your rentOnion or tomato prices will no longer dominate inflation headlines. With rent and services gaining weight, the new data reset could quietly shape your EMIs, savings returns and everyday financial decisions. Read on to understand what has changed and why it matters for your wallet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-sharp-fall-is-it-a-good-opportunity-to-buy-2867032-2026-02-12",
      "headline": "Gold, silver cool off after sharp correction. Is it a good chance to buy?Gold and silver have corrected sharply after record highs. Is this the right time to buy or a warning sign? Here is a simple breakdown of what it means for you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-donald-trump-narendra-modi-new-delhi-washington-2867027-2026-02-12",
      "headline": "India-US trade deal to benefit local industries: New Delhi envoy to WashingtonIndian ambassador to the United States, Vinay Kwatra, in an exclusive interview with India Today, said that the newly-reached trade deal between India and the US will benefit the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosy-tcs-wipro-tech-mahindra-it-stocks-falling-today-key-reasons-explained-2867009-2026-02-12",
      "headline": "Infosys, TCS, Wipro tumble up to 5%: Why are IT stocks falling today?From US jobs data to mounting AI disruption fears, here is a clear breakdown of what triggered today's IT sell-off and what investors should watch next."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-400-points-nifty-tank-it-shares-selloff-ai-wall-street-2866997-2026-02-12",
      "headline": "Sensex down 500 points: Why is stock market falling today?The S&P BSE Sensex was down by 515.63 points to 83,718.01, while the NSE Nifty50 lost 132.85 points to 25,821.00 as of 11:39 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-270-points-lower-nifty-below-26000-infosys-down-it-stockks-tumble-2866986-2026-02-12",
      "headline": "Sensex, Nifty open lower as IT stocks tank over global selloff; Infosys down 4%The S&P BSE Sensex was down by 360.77 points to 83,872.87, while the NSE Nifty50 lost 99.70 points to 25,854.15 as of 9:21 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-mis-selling-rules-banks-refund-customers-dark-patterns-third-party-products-2026-insurance-ulip-2866966-2026-02-12",
      "headline": "RBI finally takes note of mis-selling, banks to refund if complaint is provedOver the past few years, concerns have been raised about customers being pushed into buying insurance, mutual funds or other third-party products without fully understanding them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rolls-royce-ceo-meets-pm-modi-in-delhi-discusses-plans-to-scale-up-india-ops-2866918-2026-02-12",
      "headline": "Rolls-Royce CEO meets PM in Delhi, discusses plans to scale up India opsRolls-Royce CEO Tufan Erginbilgic met Prime Minister Narendra Modi in Delhi to discuss plans to substantially expand the British engineering giant's operations in India in line with the government's Viksit Bharat vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-hire-3000-roles-india-credit-suisse-takeover-triggers-job-cuts-switzerland-glbs-2866915-2026-02-12",
      "headline": "UBS to hire 3,000 roles in India as Credit Suisse takeover triggers Swiss job cutsUBS bought Credit Suisse in a state-engineered rescue in 2023, leaving it as Switzerland's sole major banking group. It has said around 3,000 Swiss jobs will be cut, most likely later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-or-bitcoin-will-crypto-steal-the-spotlight-2866745-2026-02-11",
      "headline": "Gold, silver or Bitcoin? Will crypto steal the spotlightGold and silver have long been seen as safe havens for investors, a reliable store of value in uncertain times. But with the rise of Bitcoin and other cryptocurrencies, the question on everyone's mind is: could cryptos steal the spotlight?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pace-and-ease-of-doing-business-drive-tamil-nadus-edge-says-trb-rajaa-2866678-2026-02-11",
      "headline": "Pace and ease of doing business drive Tamil Nadu's edge, says TRB RajaaRajaa said that investors value policy continuity as much as fresh reforms, noting that Tamil Nadu has built trust by maintaining stable, industry-friendly rules across political regimes. He added that this continuity has strengthened global investor confidence in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ai-disruption-it-tech-financial-wealth-management-investors-tips-2866657-2026-02-11",
      "headline": "AI is disrupting more than just tech and IT stocks. What investors should knowThe panic around AI is now spreading across Wall Street, moving beyond tech to hit wealth management stocks as well. In this article, we break down what's happening and what retail investors should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-sbi-pnb-to-suryoday-small-finance-bank-a-look-at-latest-fd-rates-across-banks-2866648-2026-02-11",
      "headline": "From SBI, PNB to Suryoday Small Finance Bank: A look at latest FD rates across banksInterest rates vary widely depending on how long the money is locked in. In many cases, three-year and five-year deposits offer better returns than shorter tenures. At the same time, depositors should balance higher rates with factors such as bank safety, liquidity needs and their own financial goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-close-flat-it-stocks-fall-apollo-eicher-sbi-gains-us-india-trade-deal-2866619-2026-02-11",
      "headline": "Sensex, Nifty pause 3-day rally as IT stocks limit gains on D-StreetSensex, Nifty closed lower. Both indices had gained nearly 1.2% in the previous three sessions. The rally was driven by hopes around a possible U.S.-India trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ease-and-speed-of-doing-business-put-tamil-nadu-on-top-says-trb-rajaa-2866603-2026-02-11",
      "headline": "Ease and speed of doing business put Tamil Nadu on top, says TRB RajaaRajaa said Tamil Nadu's unique strength lies in being India's talent capital, adding that the state produces around 150,000 engineers and benefits from a strong talent pool built through heavy investment in education."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-reflects-on-ageing-admits-shed-rot-in-bed-without-work-2867455-2026-02-12",
      "headline": "Zeenat Aman reflects on ageing, admits she'd 'rot in bed' without work Zeenat Aman opened up about ageing at 74 and shared why work still gives her purpose, peace of mind and something to look forward to. The veteran actor also joked about what she'd do if projects ever dried up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adrian-lester-on-working-with-game-of-thrones-actor-emilia-clarke-in-ponies-2867442-2026-02-12",
      "headline": "Adrian Lester on working with Game of Thrones actor Emilia Clarke in Ponies Actor Adrian Lester opened up about working with Emilia Clarke in Cold War spy series Ponies, and what made her process stand out. He also talked about the show's fresh tone, strong writing, and why the series feels different from typical spy dramas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-teaser-controversy-calls-for-censor-board-review-2867423-2026-02-12",
      "headline": "Yash's Toxic shouldn't be judged by teaser, says KFCC president Jayamala Karnataka Film Chamber of Commerce president Dr. Jayamala has called for restraint and highlighted the importance of waiting for censor board review before forming opinions amid Toxic: A Fairy Tale for Grown-Ups row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/oromeo-vishal-bhardwaj-instagram-post-reflecting-note-love-violence-shahid-kapoor-triptii-dimri-2867427-2026-02-12",
      "headline": "Ahead of O'Romeo, Vishal Bhardwaj writes of his capacity for love and violence Director Vishal Bhardwaj expressed great pride and gratitude ahead of O' Romeo's theatrical release. In an emotional note, the filmmaker shared personal insights behind the making of the film and acknowledged the dedication of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/abishan-jeevinth-announces-new-film-with-soundarya-rajinikanth-after-success-of-with-love-2867384-2026-02-12",
      "headline": "Director Abishan, Soundarya Rajinikanth to team up again after With Love success After the recent success of With Love, Abishan Jeevinth shares plans for a new project with the film's producers, as the team celebrates positive reviews and strong box office performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-citadel-season-2-franchise-uncertainty-prime-video-2867385-2026-02-12",
      "headline": "Priyanka Chopra confirms Citadel Season 2, but the future looks uncertain Priyanka Chopra Jonas confirmed Citadel Season 2 is in development, but admitted she has no clarity on the franchise's future. The spy series continues despite mixed reviews, high costs and cancelled global spin-offs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-aisha-sharma-turns-author-hope-the-book-finds-you-when-you-need-it-most-2867120-2026-02-12",
      "headline": "Actor Aisha Sharma turns author: Hope the book finds you when you need it most Aisha Sharma is set to release her debut book, Bloom, featuring one hundred meditative reflections on self-love and strength. Drawing from personal experiences, the actor aims to offer reassurance to those facing burnout, encouraging readers to trust their inner compass and embrace vulnerability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/katie-holmes-mourns-dawsons-creek-co-star-james-van-der-beek-he-is-beloved-2867355-2026-02-12",
      "headline": "Katie Holmes mourns Dawson's Creek co-star James Van Der Beek: He is beloved Katie Holmes shared an emotional tribute for her Dawson's Creek co-star James Van Der Beek, who died following a colorectal cancer diagnosis. She praised his bravery and selflessness, expressing deep gratitude for their journey together while offering love to his wife and children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ginny-wedss-sunny-2-avinash-tiwary-medha-shankr-film-first-look-release-date-out-2867346-2026-02-12",
      "headline": "Ginny Wedss Sunny 2: Avinash Tiwary-Medha Shankr film's 1st look, release date out The romantic comedy sequel Ginny Wedss Sunny 2 brings a fresh cast and a new story. Actors Avinash Tiwary and Medha Shankr have stepped into the lead roles for the upcoming theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-reacts-to-news-of-wedding-with-dhanush-on-february-14-2867366-2026-02-12",
      "headline": "Exclusive I Mrunal Thakur reacts to news of wedding with Dhanush on February 14 We asked Mrunal Thakur if reports of her wedding with South superstar Dhanush were true, while she was promoting her new film, Do Deewane Seher Mein. Read how she reacted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sooraj-barjatya-sangamarmar-teaser-jiohotstar-family-drama-2867332-2026-02-12",
      "headline": "Sooraj Barjatya's Sangamarmar teaser out; Sourabh Raaj Jain, Sheen Dass lead cast Jio Studios announces Sangamarmar, a new family drama streaming soon on JioHotstar. The series highlights enduring relationships and emotional journeys across timelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nanis-the-paradise-exits-march-race-new-release-date-announced-2867326-2026-02-12",
      "headline": "Nani's The Paradise exits March race, new release date announced March 2026 was shaping up to be one of the biggest months for pan-India releases, but the line-up has now changed, with Nani's The Paradise moving out of the crowded window.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-jiohotstar-sonyliv-bandwaale-the-conjuring-last-rites-and-more-2867320-2026-02-12",
      "headline": "Prime Video, JioHotstar, SonyLiv: Bandwaale, The Conjuring and more This week's OTT lineup features diverse releases across Prime Video, JioHotstar and SonyLiv, including the drama Bandwaale and horror film The Conjuring: Last Rites."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-o-romeo-gets-a-rating-cbfc-mutes-words-trims-bloodshed-scenes-report-2867305-2026-02-12",
      "headline": "O' Romeo gets A rating; CBFC mutes words, trims bloodshed scenes: Report The Central Board of Film Certification has granted Shahid Kapoor's O' Romeo an 'A' certificate after the filmmakers made several edits. This included dialogue replacements and reductions in violent visuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-joins-atharvaa-muralis-idhayam-murali-makers-release-bts-video-2867209-2026-02-12",
      "headline": "Fahadh Faasil joins Atharvaa Murali's Idhayam Murali, makers release BTS video The makers of Atharvaa Murali's Tamil film Idhayam Murali have announced the inclusion of Fahadh Faasil in the film's cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-against-inflated-box-office-border-2-success-organic-bhushan-kumar-2867312-2026-02-12",
      "headline": "Sunny Deol against inflated box office, Border 2 success organic: Bhushan Kumar Border 2 producer Bhushan Kumar addressed box office number manipulation in the film industry. He celebrated the film's success and revealed Sunny Deol insisted on sharing only organic numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-reacts-to-srk-salmans-viral-pathaan-scene-nobody-is-indispensable-2867211-2026-02-12",
      "headline": "Aamir reacts to SRK-Salman's viral Pathaan scene: Nobody is indispensable Aamir Khan has addressed Shah Rukh Khan and Salman Khan's viral scene from Pathaan, and mentioned that younger stars like Ranbir Kapoor and Ranveer Singh are ready to lead. Dismissing the idea that superstars are vanishing, he praised the new generation's talent and their ability to succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-varun-dhawan-border-2-smile-became-a-meme-salman-khan-stepped-in-details-2867219-2026-02-12",
      "headline": "When Varun Dhawan's Border 2 smile became a meme, Salman Khan stepped in. Details Varun Dhawan opened up about the support he received from Salman Khan during intense social media criticism after the Border 2 trailer release. The actor elaborated on how Khan's personal praise after the film's success became a defining moment for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-releases-this-week-thalaivar-thambi-thalaimaiyil-the-night-agent-season-3-and-more-2867259-2026-02-12",
      "headline": "Netflix this week: Thalaivar Thambi Thalaimaiyil, The Night Agent S3 and more Netflix is set to release a diverse lineup this week, including the Tamil comedy-drama Thalaivar Thambi Thalaimaiyil and the much-awaited The Night Agent Season 3."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unverified-reporting-causes-public-anxiety-aviation-body-on-italy-report-blaming-pilot-for-air-india-crash-2867408-2026-02-12",
      "headline": "Incorrect, speculative: India on Italian report blaming pilot for Air India crashThe Aircraft Accident Investigation Bureau said the investigation is still ongoing, no final conclusions have been reached, and unverified reporting risks causing public anxiety and undermining the integrity of the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-mea-trump-video-pm-modi-destroy-political-career-remark-2867317-2026-02-12",
      "headline": "Trump said he doesn't want to destroy PM's career. India reacts to old videoUS President Trump made the bizarre remark about PM Modi's political career in October last year amid a strain in US-India ties over the trade deal and tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-namibia-t20-world-cup-2026-hardik-pandya-varun-chakravarthy-2867454-2026-02-12",
      "headline": "India crush Namibia in Delhi but spin woes remain ahead of Pakistan clashIndia secured their biggest victory in T20 World Cup history, beating Namibia by 93 runs at Arun Jaitely Stadium in Delhi. The win extended India's unbeaten streak to 11 matches in the tournament but exposed vulnerabilities against spin bowling ahead of the all-important clash against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-general-election-2026-live-updates-voting-percentage-polling-dhaka-july-charter-glbs-2866900-2026-02-12",
      "headline": "Live: BNP heading towards big victory, its chief Tarique Rahman wins Bogra-6Bangladesh General Election Live Updates: The vote counting process in Bangladesh's first general election after the fall of the Sheikh Hasina government has begun. Ballot counting has started after reports of sporadic violence and accusations of cheating. Votes were also cast on the July Charter, which, if approved, will give the next government the authority to make big changes to the country's Constitution and democratic system. The key fight is between the alliances led by the Bangladesh Nationalist Party (BNP) and the Jamaat-e-Islami. We have been bringing you live updates on the voting, reactions, and analyses from our trusted sources and reporters on the ground. Follow indiatoday.in for the latest updates on the voting and results process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-pm-narendra-modi-emergency-landing-facility-elf-lac-china-border-assam-himanta-biswa-sarma-2867175-2026-02-12",
      "headline": "Close to China border, India turns highway into runway for Rafales, GlobemastersPM Narendra Modi on Saturday is set to land on a 4.2-km Emergency Landing Facility carved out of a National Highway in Dibrugarh district of Assam. It isn't far from the Line of Actual Control (LAC) with China. The landing will mark the operationalisation of the Northeast's first highway airstrip, where Rafales, Sukhois and heavy-lift aircraft like Globemasters are expected to take part in a mega airshow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-prepare-pakistan-usman-tariq-ishan-kishan-explains-2867471-2026-02-12",
      "headline": "How are India preparing for Pakistan's Usman Tariq? Ishan Kishan explainsT20 World Cup 2026: India's wicketkeeper-batter, Ishan Kishan, and mystery spinner explain how they prepare for the bowlers they are going to face. They are set to face Pakistan next and will be up against the mystery-spinner, Usman Tariq for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dutch-telecom-giant-odido-hacked-names-telephone-numbers-e-mail-addresses-of-6-million-users-leaked-2867461-2026-02-12",
      "headline": "Dutch telecom giant Odido hacked; personal data of 6 million users compromisedDutch telecom major Odido confirmed a massive cyberattack that compromised personal data of over six million customers, including bank details and passport numbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsoft-ai-boss-mustafa-suleyman-says-ai-will-replace-most-white-collar-jobs-in-12-months-2867182-2026-02-12",
      "headline": "Microsoft AI boss says AI will replace most white-collar jobs in 12 monthsMicrosoft AI chief Mustafa Suleyman believes that AI could replace most white collar jobs including lawyers, accountants and more, within the next year. His comments come days after Anthropic's Claude Cowork shook the stocks of SaaS companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sturla-holm-laegrid-confession-biathlon-controversy-winter-olympics-2866985-2026-02-12",
      "headline": "Too late now to say sorry: Norwegian athlete cheats, plays victim, ruins the momentA moment to win the heart of the 'gold medal of his life' has found Sturla Holm Laegrid deliver one of the most bizarre and controversial athlete interviews of all time. By putting his partner in a rough spot and stealing the thunder from his teammate, Laegrid's words were right but delivered at the wrong moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tobacco-tycoons-son-shivam-mishra-released-on-personal-bond-of-rs-20000-argued-his-own-case-in-court-2867185-2026-02-12",
      "headline": "Lamborghini crash case: Four days to arrest Shivam Mishra, bail in 6 hoursDuring the hearing, Shivam appeared in court and argued his own case, and the judge questioned aspects of the police investigation and the notices served."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sham-election-staged-by-killer-fascist-yunus-sheikh-hasina-demands-cancellation-of-bangladesh-polls-2867323-2026-02-12",
      "headline": "Sham election by killer Yunus: Hasina seeks cancellation of Bangladesh pollsFormer Bangladesh PM Sheikh Hasina called the latest national election a \"sham,\" alleging widespread irregularities and extremely low voter turnout, and demanded its cancellation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-india-trade-deal-zero-tariffs-textiles-bangladesh-trump-piyush-goyal-2867176-2026-02-12",
      "headline": "Trade deal: Trump may cut tariffs on textiles to zero. But there's a catchA clause of zero tariffs on Bangladesh textile exports to the US in the trade deal left the Indian textile industry. However, Piyush Goyal has now given an important clarification. We explain the issue to you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-reacts-to-news-of-wedding-with-dhanush-on-february-14-2867366-2026-02-12",
      "headline": "Exclusive I Mrunal Thakur reacts to news of wedding with Dhanush on February 14We asked Mrunal Thakur if reports of her wedding with South superstar Dhanush were true, while she was promoting her new film, Do Deewane Seher Mein. Read how she reacted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-set-to-get-114-rafale-jets-as-rajnath-singh-led-defence-council-clears-rs-325-lakh-deal-sources-2867143-2026-02-12",
      "headline": "India to get 114 Rafale jets as government clears Rs 3.25 lakh crore deal: SourcesUnder the deal, nearly 80 per cent of the 114 Rafale jets are expected to be manufactured domestically, with indigenous content possibly reaching 60 per cent under the Make in India framework."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/trinamool-congress-mp-saugata-roy-june-malia-caught-giggling-amid-budget-debate-2867411-2026-02-12",
      "headline": "Trinamool MPs Saugata Roy, June Malia caught giggling amid Budget debateThis clip of TMC MPs Sougata Roy and June Malia giggling and chatting during Lok Sabha proceedings has caught the internet's attention. The moment surfaced while MP Chandrashekhar Azad was addressing the House."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-clings-to-speeding-cars-bonnet-in-shocking-road-rage-video-2867152-2026-02-12",
      "headline": "Bengaluru man clings to speeding car's bonnet in shocking road rage videoA man was dragged on the bonnet of a moving car in broad daylight in Bengaluru due to a road rage incident. This raised serious concerns over road safety and aggressive driving in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/greater-noida-boy-dies-during-mri-family-alleges-injection-overdose-2867436-2026-02-12",
      "headline": "Six-year-old dies during MRI scan in Noida, family alleges injection overdoseA six-year-old boy died after his condition deteriorated during an MRI scan at a private diagnostic centre in Greater Noida, with his family alleging he was given a heavy dose of injection. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/india-weather-update-tomorrow-western-disturbance-north-india-temperature-rise-2867395-2026-02-12",
      "headline": "Cold winds from north to reduce on Friday, Sun to feel strongerNorth India will see a shift in weather tomorrow as a western disturbance reduces cold winds. Devendra Tripathi predicts light mountain snow and filtered sunshine across the plains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/25-year-old-nurse-dies-nipah-virus-infection-west-bengal-first-fatality-recent-years-2867334-2026-02-12",
      "headline": "Bengal reports 1st Nipah death, 25-year-old nurse succumbs to virusA 25-year-old nurse died of Nipah virus complications at a private hospital in Barasat on Thursday evening, marking West Bengal's first Nipah-related death in recent history, even as she had recently tested negative but remained in critical condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/isha-ambani-nita-ambani-jewellery-2867371-2026-02-12",
      "headline": "New pics: Bold diamonds, big emeralds and Ambani-level glamNew viral pictures of Isha and Nita Ambani put the spotlight on their ogle-worthy jewellery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amendments-reflect-shared-understanding-government-on-us-making-tweaks-to-trade-deal-factsheet-2867222-2026-02-12",
      "headline": "US tweaks to trade deal factsheet reflect shared understanding, says governmentThe Ministry of External Affairs stated that the joint statement remains the framework for the proposed Interim Agreement on reciprocal and mutually beneficial trade, and both sides will now work toward implementing and finalising the agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-moon-base-alpha-mass-driver-ai-satellites-deep-space-ancient-alien-civilisations-2867183-2026-02-12",
      "headline": "Elon Musk wants to launch spacecraft from Moon to hunt for aliensElon Musk outlines exciting plans for Moonbase Alpha featuring mass drivers to launch AI satellites into deep space. The ambitious vision includes self-sustaining lunar cities and searches for remnants of ancient alien civilisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-election-news-bnp-jamaat-e-islami-awami-league-hindu-minority-hasina-awami-league-2866848-2026-02-12",
      "headline": "Jamaat's incredible jump: How an Islamist pariah took centre stage in BangladeshHandcrafted ByOur Editors From the shadows of a ban, the Shafiqur Rahman-led Bangladesh Jamaat-e-Islami has emerged at the centre stage. As Bangladesh votes today, the Jamaat, with an image makeover, is giving the Tarique Rahman-led BNP a tough fight. But what does it mean for India and Bangladeshi Hindus?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-clears-ipl-return-to-chinnaswamy-with-safety-conditions-2867487-2026-02-13",
      "headline": "Karnataka clears IPL return to Chinnaswamy stadium with strict safety conditions Karnataka cabinet clears IPL return to Chinnaswamy Stadium with 35,000 crowd cap and strict safety measures after Cunha report, months after tragic stampede halted cricket in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-prepare-pakistan-usman-tariq-ishan-kishan-explains-2867471-2026-02-12",
      "headline": "How are India preparing for Pakistan's Usman Tariq? Ishan Kishan explains T20 World Cup 2026: India's wicketkeeper-batter, Ishan Kishan, and mystery spinner explain how they prepare for the bowlers they are going to face. They are set to face Pakistan next and will be up against the mystery-spinner, Usman Tariq for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-namibia-t20-world-cup-2026-hardik-pandya-varun-chakravarthy-2867454-2026-02-12",
      "headline": "India crush Namibia in Delhi but spin woes remain ahead of Pakistan clash India secured their biggest victory in T20 World Cup history, beating Namibia by 93 runs at Arun Jaitely Stadium in Delhi. The win extended India's unbeaten streak to 11 matches in the tournament but exposed vulnerabilities against spin bowling ahead of the all-important clash against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-italy-win-frontpage-news-winter-olympics-relegated-2867450-2026-02-12",
      "headline": "Cricket on page 1? Italy coach hopes T20 World Cup win knocks off Winter Olympics T20 World Cup 2026: Italy achieved its first-ever T20 World Cup victory with a dominant win over Nepal in Mumbai. The landmark result could spark greater interest in cricket amidst Italy's Winter Olympics dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-gerhard-erasmus-usman-tariq-pakistan-t20-world-cup-2867445-2026-02-12",
      "headline": "Prep for Pakistan? Gerhard Erasmus gives India a taste of Usman Tariq's unorthodoxy IND vs NAM, T20 World Cup: Gerhard Erasmus' unorthodox spell stalled India's pursuit of a 250-plus total in Delhi, but his variations may have offered a timely preview of the sterner spin examination awaiting them against Pakistan and much-talked-about Usman Tariq in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-half-century-dylan-leicher-boundary-catch-t20-world-cup-2026-india-vs-namibia-2867426-2026-02-12",
      "headline": "Hardik Pandya's Delhi fireworks ends after Namibian player's sensational catch Hardik Pandya scored a brilliant 52 before being caught out by a stunning boundary catch from Dylan Leicher. The catch shifted momentum as Namibia's Gerhard Erasmus ran through India's middle order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ddca-clarifies-soft-drink-vendor-viral-video-refilling-bottles-arun-jaitley-stadium-2867396-2026-02-12",
      "headline": "DDCA breaks silence on soft drink vendor's viral video from Arun Jaitley Stadium DDCA responded to a viral video alleging vendors reusing already-poured soft drinks for resale at Arun Jaitley Stadium. The video had gone viral on social media, sparking widespread concerns for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-quickfire-t20-world-cup-india-vs-namibia-2867388-2026-02-12",
      "headline": "Sanju Samson dazzles briefly, but misses golden opportunity against Namibia T20 World Cup, IND vs NAM: Sanju Samson scored 22 runs off eight balls against Namibia but missed a golden opportunity to convert his start into a big score at the Arun Jaitley Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-returns-to-india-in-fun-mood-fans-turn-airport-into-selfie-festival-2867376-2026-02-12",
      "headline": "Virat Kohli returns to India in fun mood, fans turn airport into selfie festival Virat Kohli returned to India after a month in London, and was greeted by enthusiastic fans. Kohli has been out of action in the ODI series against New Zealand and will be next seen playing in the Indian Premier League 2026 (IPL 2026)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/popularity-stars-afghanistan-nepal-usa-in-t20-world-cup-rookie-teams-ongoing-tournament-2867369-2026-02-12",
      "headline": "Popularity follows stars of Afghanistan, Nepal, USA in T20 World Cup From Gurbaz to Lokesh, every thrilling on-field performance by underdogs has been rewarded with popularity on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-abhishek-sharam-stomach-illness-india-vs-pakistan-suryakumar-yadav-2867367-2026-02-12",
      "headline": "No Abhishek Sharma for India vs Pakistan game, hints captain Suryakumar Yadav T20 World Cup 2026: Abhishek Sharma missed India's game against Namibia in New Delhi due to a stomach-related illness. Captain Suryakumar Yadav hinted at the posssibility of the World No. 1 T20I batter missing the game against Pakistan on Sunday in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-italy-historic-win-over-nepal-anthony-mosca-justin-mosca-2867365-2026-02-12",
      "headline": "Pizza triumphs over momo: Italy's historic win in T20 World Cup sparks frenzyT20 World Cup: Italy registered a historic win in their maiden T20 World Cup, beating Nepal by ten wickets at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/italy-first-t20-world-cup-win-dominant-victory-nepal-wankhede-2867319-2026-02-12",
      "headline": "Benvuento Italy: Azurri make World Cup history, stun Nepal at WankhedeT20 World Cup, NEP vs Italy: Italy lit up Wankhede Stadium in Mumbai, defeating Nepal by 10 wickets and chasing down 124 with 44 balls to spare, securing their maiden victory in the history of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/boycott-20-afghanistan-players-psl-pull-out-rahmanullah-gurbaz-backlash-2867324-2026-02-12",
      "headline": "Boycott 2.0? Afghanistan players withdraw from PSL auction after Pakistan's backlashAfghanistan players pull out of PSL auction in third major boycott controversy to hit South Asian cricket in weeks, following similar political fallout over Mustafizur Rahman's IPL exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-2026-schedule-delay-election-clashes-stadium-availability-2867282-2026-02-12",
      "headline": "Why IPL 2026 schedule is yet to be released? BCCI breaks silenceThe BCCI hasn't yet released the schedule for IPL 2026, set to run from March 26 to May 31. The delay is attributed to potential clashes with upcoming Assembly elections in West Bengal, Tamil Nadu, and Assam, which could affect security arrangements and venue availability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-live-score-t20-world-cup-today-match-delhi-samson-suryakumar-2867285-2026-02-12",
      "headline": "IND vs NAM Highlights: India hammer Namibia by 93 runs to warm-up for Pakistan clashIndia (IND) vs Namibia (NAM) Highlights, T20 World Cup: India beat Namibia by 93 runs in New Delhi and went to the top of Group A. Ishan Kishan scored a fifty after which Varun Chakravarthy's three-wicket haul blew Namibia away. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-t20-world-cup-sanju-samson-washington-sundar-left-field-choice-2867236-2026-02-12",
      "headline": "Sanju Samson misses out? Ex-cricketer floats left-field Abhishek Sharma replacementT20 World Cup 2026: Former India wicketkeeper-batter Parthiv Patel suggests promoting Washington Sundar as opener in Abhishek Sharma's absence for India's February 12 match against Namibia. Sanju Samson, however, is likely to partner Ishan Kishan at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-most-expensive-psl-player-auction-pakistan-super-league-2026-2867206-2026-02-12",
      "headline": "Drafted as Australia's T20 World Cup cover, Steve Smith scripts PSL historySteve Smith set a new record as PSL's most expensive player after being signed by the Sialkot Stallions for PKR 14 crore in the league's first ever auction. PSL 11 will feature two new franchises, Sialkot and Hyderabad, and a change from draft to auction format, as over 100 players secured contracts ahead of the season starting March 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-tennis-hall-of-fame-tickets-2867178-2026-02-12",
      "headline": "Federer still the box office GOAT: Hall of Fame tickets sold out in 120 secondsIs Roger Federer the best-selling tennis player of all time? Tickets for his Hall of Fame induction ceremony sold out in just 2 minutes. This happened despite the organisation adding more tickets for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-afghanistan-mohammad-nabi-fined-icc-code-of-conduct-breach-t20-world-cup-2026-2867136-2026-02-12",
      "headline": "After argument during SA vs AFG, Mohammad Nabi fined for code of conduct breachMohammad Nabi was fined 15 percent of his match fee and given one demerit point after an argument with the umpires during Afghanistan's T20 World Cup 2026 Group D clash against South Africa in Ahmedabad. Nabi admitted his offence and accepted the sanction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-oman-t20-world-cup-2026-rathnayake-mendis-pallekele-2867168-2026-02-12",
      "headline": "SL vs OMA: Sri Lanka set for Australia challenge after hammering OmanT20 World Cup: A clinical performance with the bat from Kusal Mendis and Pavan Rathnayake, followed by disciplined bowling helped Sri Lanka make it two in two with a thumping win over Oman in Pallekele on Thursday, February 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-live-score-today-nepal-vs-italy-mumbai-2867158-2026-02-12",
      "headline": "Nepal vs Italy Highlights: Mosca brothers guide Italy to historic win in maiden World CupNepal (NEP) vs Italy (ITA) T20 World Cup 2026 Highlights: Italy have registered their maiden victory in World Cup history as Justin Mosca and Anthony Mosca guided them to a comprehensive ten-wicket victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-2026-west-indies-vs-england-harry-brook-press-conference-2867132-2026-02-12",
      "headline": "Defeated yet defiant: Harry Brook defends England's spin-playing abilitiesT20 World Cup 2026: Harry Brook defended England's ability to play spin in the sub-continent after their loss to West Indies in Mumbai on Wednesday, February 11. Brook also brushed aside concerns about Jofra Archer's form and the lessons they got from the first two games. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-india-vs-pakistan-t20-world-cup-2026-2867116-2026-02-12",
      "headline": "Ahead of India vs Pakistan, Babar Azam mercilessly mocked by ex-PAK starsT20 World Cup: Ahead of the India vs Pakistan clash in Colombo, Babar Azam was mercilessly mocked by Rashid Latif, Ahmed Shehzad and Mohammad Amir during a talkshow. Babar has struggled to impress during IND vs PAK games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-india-vs-pakistan-t20-world-cup-meeting-bangladesh-2867087-2026-02-12",
      "headline": "Not just India vs Pakistan. Bangladesh will also play in Colombo on Feb 15The International Cricket Council (ICC) has invited the heads of the Asian cricket nations to watch the India vs Pakistan match in Colombo. It is expected that ICC will also mediate the relationship between the boards during that game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-wi-t20-world-cup-west-indies-press-conference-2867060-2026-02-12",
      "headline": "When Sherfane Rutherford bats, bowlers are scared: Shai HopeT20 World Cup: West Indies captain Shai Hope heaped praised on Sherfane Rutherford for West Indies' exceptional win against England. The Windies not only put decent runs on board but also bowled England out in a chase-friendly venue as Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-harry-brook-backs-jofra-archer-mumbai-2867047-2026-02-12",
      "headline": "Smashed for 90 in 8, yet Archer finds support from England captain BrookT20 World Cup: England captain Harry Brook has backed Jofra Archer to bounce back after his expensive start to his T20 World Cup 2026 campaign. Archer has conceded more than 40 runs in the first two games of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-top-5-players-t20-world-cup-2866984-2026-02-12",
      "headline": "From JJ Smit to Jan Frylinck: 5 Namibia stars who can derail India's chargeT20 World Cup, IND vs NAM: JJ Smit, Ruben Trumpelmann and Jan Frylinck are among the Namibian cricketers who could pose a significant threat to India when the two teams meet in their group-stage clash on Thursday at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-match-preview-t20-world-cup-2866994-2026-02-12",
      "headline": "Hero entry delayed. Can India deliver in Delhi before clash with the main villain?T20 World Cup 2026, India vs Namibia preview: After a gritty survival drama in Mumbai, India moves to Delhi seeking a blockbuster opening act. With Sanju Samson in and Jasprit Bumrah returning, can the hero find his rhythm before the Colombo clash with the main villain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-t20-world-cup-selection-pakistan-prep-samson-bumrah-2867005-2026-02-12",
      "headline": "Namibia first, Pakistan already on mind: India's Sunday plans in motionT20 World Cup: India face Namibia tonight with one eye on Pakistan. Abhishek Sharma's fitness concerns force India to weigh up alternatives, while tactical experiments could shape their approach for the blockbuster clash."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}