{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/man-invested-rs-18000month-for-4-years-earned-less-than-fds-ca-explains-why-2771104-2025-08-14",
      "headline": "Man invested Rs 18,000/month for 4 years, earned less than FDs. CA explains whyThe investor believed he was on the right track. His funds showed a compound annual growth rate (CAGR) of 11%. But when he calculated his portfolio XIRR—the actual return on his money—it was just 6%. That's less than the 7% a fixed deposit would have paid over the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-credit-rating-improve-moodys-fitch-reason-inflation-forex-reserve-2771031-2025-08-14",
      "headline": "Pakistan's credit rating gets a lift from Moody's. Here's whyS&P Global Ratings raised Pakistan's rating to B- from CCC+ on July 24, while Fitch Ratings did the same in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-cheque-clear-rule-faster-october-4-few-hours-personal-finance-trending-news-money-tips-2771065-2025-08-14",
      "headline": "RBI's new rule: Cheques to clear in just hours starting this dateUnder the new rule, cheques will be scanned, presented, and cleared continuously during business hours, reducing the clearing cycle from the current T+1 days to just a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-cuts-minimum-balance-after-backlash-check-new-rules-and-penalties-2771058-2025-08-14",
      "headline": "ICICI Bank cuts minimum balance after backlash. Check new rules and penaltiesThe bank's decision comes after strong public criticism, particularly over the earlier increase in urban and metro monthly average balance levels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-share-price-market-debut-rs-153-nse-bse-opening-price-4-percent-listing-gain-2771045-2025-08-14",
      "headline": "JSW Cement shares list at 4% premium on stock market debut On the BSE, the shares opened at Rs 153, up 4.1%, while on the NSE they began trading at Rs 153.50, a gain of 4.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/muthoot-finance-shares-jump-10-percnt-to-hit-record-high-after-q1-results-should-you-buy-2771035-2025-08-14",
      "headline": "Muthoot Finance shares jump 10% to hit record high after Q1 results. Should you buy?The gold loan financing company has seen its stock lifted by strong quarterly performance, rising investor confidence, and positive brokerage recommendations. Shares of the company were trading 10.43% higher at Rs 2,772.55 on the BSE at 10:04 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-record-key-reasons-explained-2771025-2025-08-14",
      "headline": "Bitcoin surges past $124,000 to hit all-time high. What's fueling the rally?Bitcoin hit an all-time high of $124,000. Here's why Bitcoin surged past $124K and will it keep climbing?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-over-100-points-nifty-above-24650-infosys-leads-gains-2771019-2025-08-14",
      "headline": "Sensex, Nifty open higher as IT stocks rally; Infosys, Wipro among top gainersThe S&P BSE Sensex opened more than 100 points higher and was trading 51.75 points up at 80,591.66 around 9:25 am. The NSE Nifty50 rose 13.80 points to 24,633.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trade-with-us-impossible-gujarats-textile-industry-worried-50-per-cent-tariffs-levied-by-donald-trump-2770964-2025-08-14",
      "headline": "Gujarat's textile industry threatened by 50% US tariffs demands 10% export incentiveIndia's total textile exports to the US are valued at USD 10–12 billion annually, with Gujarat accounting for more than 15 per cent of that trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-real-estate-regulatory-body-acts-against-palais-royale-developer-over-rs-100-crore-dues-2770962-2025-08-14",
      "headline": "Mumbai regulatory body acts against Palais Royale developer over Rs 100 crore duesMahaRERA's adjudicating officer has now issued recovery warrants under Section 40(1) of the RERA Act, enabling the District Collector to recover the amount as arrears of land revenue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chief-economic-advisor-v-anantha-nageswaran-says-us-tariff-impact-will-be-temporary-2770946-2025-08-14",
      "headline": "US tariff impact will be temporary, private sector should step up: Chief economistChief Economic Advisor V Anantha Nageswaran attributed the growth slowdown in FY25, which saw a deceleration to 6.5 per cent from FY24's 9.2 per cent, to tight credit conditions and liquidity issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-revises-minimum-balance-for-savings-accounts-after-outrage-2770858-2025-08-13",
      "headline": "ICICI Bank lowers minimum balance for savings accounts after outrageThe new minimum average balance thresholds are as follows: Rs 15,000 for customers in metro and urban areas, Rs 7,500 for semi-urban customers, and Rs 2,500 for those in rural locations. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andhera-review-priya-bapat-namid-malhotra-shine-in-this-dim-series-2771122-2025-08-14",
      "headline": "Andhera review: Priya Bapat, Karanvir Malhotra shine in this dim seriesRelease Date:Thu Aug 14, 2025Prime Video's latest series, 'Andhera, starring Priya Bapat, Namit Malhotra, and Prajakta Koli, premiered on August 14. The serious blends supernatural horror with sci-fi ambition but falters due to an underdeveloped core idea and uneven storytelling. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-supreme-court-ruling-stray-dogs-shuts-door-voiceless-2771107-2025-08-14",
      "headline": "Sharmila Tagore says Supreme Court stray dog ruling shuts door on the voicelessVeteran Bollywood actor Sharmila Tagore is the latest public figure to speak out against the Supreme Court's ruling to relocate stray dogs from the Delhi-NCR region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/video-pankaj-tripathi-arrives-for-muhurat-puja-of-mirzapur-the-film-2771103-2025-08-14",
      "headline": "Video: Pankaj Tripathi arrives for Mirzapur The Film's muhurat pujaThe muhurat puja of 'Mirzapur The Film' was held on Wednesday at the Excel office in Mumbai. It was attended by Pankaj Tripathi, Ravi Kishan, Rasika Dugal, Ali Fazal, Shweta Tripathi, Shirya Pilgaonkar, Harshita Gaur, Jitendra Kumar and Divyenndu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactRelease Date:Thu Aug 14, 2025Coolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-aamir-khan-cameo-fanboy-moment-rajinikanth-hits-the-spot-lokesh-kanagaraj-2771073-2025-08-14",
      "headline": "Coolie: Aamir Khan's fanboy moment with Rajinikanth hits the spotAamir Khan's cameo in Rajinikanth's 'Coolie' has caught the attention of all. The actor impressed fans with his swag in the climax of the movie. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-x-review-hrithik-and-jr-ntr-action-thrills-story-sparks-debate-2771042-2025-08-14",
      "headline": "War 2 X review: Hrithik and Jr NTR's action thrills, but story sparks debateWar 2, starring Hrithik Roshan and Jr NTR, sparked mixed reactions. Praised for its action and visuals, but criticised for plot and VFX. Fans are divided."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shirodkar-car-hit-cityflo-bus-mumbai-company-denies-responsibility-2771028-2025-08-14",
      "headline": "Shilpa Shirodkar's car hit by bus, slams transport firm for shirking responsibilityActor Shilpa Shirodkar's car was struck by a Cityflo bus in Mumbai on Wednesday. The bus company denied liability despite police assistance in filing a complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-unveils-life-of-a-showgirl-album-cover-features-sabrina-carpenter-travis-kelce-2770990-2025-08-14",
      "headline": "Taylor Swift unveils Life of a Showgirl album, cover, and featuresPop sensation Taylor Swift shares details for her 12th studio album 'The Life of a Showgirl'. The former Eras tourmates will team up on the LP's title track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-x-review-rajinikanth-energy-nagarjuna-charm-win-over-fans-lokesh-kanagaraj-2771005-2025-08-14",
      "headline": "Coolie X review: Rajinikanth's energy and Nagarjuna's charm win fans overRajinikanth's 'Coolie' released in theatres today, and fans are in the mood to celebrate. Directed by Lokesh Kanagaraj, the theatres have turned into a carnival with fans rejoicing and dancing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/netflix-steve-trailer-cillian-murphy-reform-school-mental-health-2770907-2025-08-13",
      "headline": "Steve trailer: Cillian Murphy as headmaster fights his inner demons at reform schoolNetflix has released the official trailer for Steve, a drama starring Cillian Murphy as a headteacher fighting to save his reform school. The film explores deep mental health issues amid institutional challenges in the 1990s England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/antony-starr-farewell-note-final-sixth-season-the-boys-prime-video-homelander-2770903-2025-08-13",
      "headline": "Antony Starr shares farewell note ahead of final season of The BoysActor Antony Starr bid farewell to his role as Homelander in 'The Boys' in a heartfelt Instagram. He said the role helped him grow personally and creatively. The fifth and final season of 'The Boys' will be released in 2026.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-the-bengal-files-trailer-to-be-attached-with-war-2-coolie-2770855-2025-08-13",
      "headline": "Vivek Agnihotri's The Bengal Files trailer to be attached with War 2 and CoolieThe trailer for director Vivek Agnihotri's upcoming film 'The Bengal Files: Right to Life' will be attached to 'War 2' and 'Coolie'. Here's what we know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-hrithik-roshan-jr-ntr-request-fans-avoid-spoilers-yrf-spy-universe-ayan-mukerji-kiara-advani-2770839-2025-08-13",
      "headline": "Hrithik, Jr NTR urge fans to let War 2 be a secret to everyone: Spoilers are no funHrithik Roshan and Jr NTR appealed to fans to keep 'War 2' spoilers under wraps ahead of the film's release. Their request aims to preserve the film's thrilling experience for all viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-mourns-father-muhammad-aslam-death-instagram-post-final-goodbye-to-iron-man-2770800-2025-08-13",
      "headline": "Atif Aslam mourns father Muhammad Aslam's death: Final goodbye to my Iron manIn an emotional post, Pakistani singer Atif Aslam shared the news of his father Muhammad Aslam's death on Tuesday. His father, aged 77, died of health complications. Atif Aslam has sung several hit songs for both Pakistani and Indian films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/uttar-pradesh-government-praises-mahavatar-narsimha-cultural-revival-2770834-2025-08-13",
      "headline": "Uttar Pradesh government praises Mahavatar Narsimha for cultural revivalThe Uttar Pradesh government applauded 'Mahavatar Narsimha' for its cultural impact on Wednesday. Despite having a slow start, the film performed well at the global box office due to positive word of mouth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/niyati-joshi-exit-yeh-rishta-kya-kehlata-hai-swarna-goenka-farewell-2770836-2025-08-13",
      "headline": "Niyati Joshi exits Yeh Rishta Kya Kehlata Hai after 6 years: Nothing lasts foreverNiyati Joshi has bid an emotional goodbye to her role in Yeh Rishta Kya Kehlata Hai after six years. Her departure marks the end of a memorable chapter for fans and the show alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-cryptic-post-strong-women-with-mucles-mrunal-thakur-body-shaming-video-2770817-2025-08-13",
      "headline": "Get those muscles: Bipasha Basu shares cyptic post after viral Mrunal Thakur clipBipasha Basu shared an empowering Instagram story urging women to build strength. Her message challenges outdated views on women's physical power following Mrunal Thakur's body-shaming video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-rajinikanth-old-clip-aatank-hi-aatank-film-viral-coolie-2770691-2025-08-13",
      "headline": "Aamir Khan-Rajinikanth's old clip from Aatank Hi Aatank goes viral ahead of CoolieA clip from the 1995 film 'Aatank Hi Aatank' featuring actors Aamir Khan and Rajinikanth has gone viral. The film garnered the attention of social media users a day before the release of their much-anticipated film 'Coolie'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/fwice-seeks-clarification-from-badshah-over-dallas-event-pakistani-company-2770751-2025-08-13",
      "headline": "Film body seeks clarification from Badshah over Dallas event by Pakistani companyFWICE has written to Badshah seeking clarification on his Dallas concert sponsored by a Pakistani company. The move highlights tensions over cross-border collaborations amid rising national security concerns."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rules-framed-but-not-implemented-supreme-court-pulls-up-local-bodies-in-stray-dogs-matter-reserves-order-2771069-2025-08-14",
      "headline": "Rules made but not implemented: In stray dogs case, top court raps civic bodiesA three-judge bench of the Supreme Court reserved its order on petitions challenging its much-criticised August 11 verdict directing the rounding up of all animals in Delhi-NCR."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/perverse-and-wholly-unwarranted-supreme-court-cancels-bail-to-actor-darshan-in-renukaswamy-murder-case-2771063-2025-08-14",
      "headline": "Actor Darshan's bail cancelled, Supreme Court warns against 5-star treatmentThe Supreme Court cancelled Kannada actor Darshan's bail in Renukaswamy murder case, calling the Karnataka High Court order \"perverse\" and \"arbitrary.\" It warned against any special treatment in jail. Authorities were ordered to take him into custody expeditiously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactCoolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jangli-maharaj-road-pune-history-hot-mix-technology-pothole-free-indian-streets-pothole-plague-pmc-civil-engineering-2770138-2025-08-14",
      "headline": "How Pune's indestructible JM Road shames contractors, babus, netas alikeCan a road in India remain pothole-free for 50 years? A 2.5-km stretch in Pune, known as Jangli Maharaj Road, shines as an example of civic engineering amid the pan-India pothole plague. Built in 1976, the road came with a 10-year warranty and hasn't needed major repairs in all these years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/masked-robbers-loot-retired-justice-ramesh-gargs-indore-home-rakshabandhan-2771002-2025-08-14",
      "headline": "Chilling video of robbery at ex-judge's home, one loots, other ready to attackA gang of masked and armed burglars broke into retired Justice Ramesh Garg's Indore home, looting cash and valuables worth several lakh rupees with professional precision while the family was sleeping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cant-ignore-ground-reality-look-what-happened-in-pahalgam-supreme-courts-big-remark-on-jk-statehood-2771074-2025-08-14",
      "headline": "Can't ignore ground reality: On J&K statehood, top court points to PahalgamSupreme Court hears plea to restore Jammu & Kashmir statehood, stresses ground realities and cites Pahalgam attack. The centre asked to file a reply within 8 weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/pp405-hair-loss-treatment-dht-blocker-fast-hair-regrowth-2770768-2025-08-14",
      "headline": "Will this drug end baldness forever?PP405 is a new topical drug that targets the root cause of hair loss and reactivates dormant follicles. Its success could change hair loss treatment in India but awaits further clinical trials."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtras-jalgaon-lynching-suleman-rahim-khan-beaten-to-death-tension-police-case-2771114-2025-08-14",
      "headline": "Muslim man, 21, lynched in Maharashtra for speaking to minor girl at cafeA 21-year-old man, Suleman Rahim Khan, was beaten to death in Maharashtra's Jalgaon after being seen with a minor girl, sparking tension in the area. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-a-doctor-liver-health-exercise-diet-alcohol-awareness-hepatitis-testing-vaccination-2770692-2025-08-14",
      "headline": "I am a doctor and this is the single worst thing you can do to your liverOur liver doesn't get the respect it deserves. As unhealthy lifestyles rise, here's the single most harmful habit that can damage the second-largest organ in the body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indias-us-dependent-diamond-industry-shrivels-under-trump-tariffs-2770722-2025-08-13",
      "headline": "How India's US-dependent diamond industry shrivels under Trump tariffsThe United States—India's largest market for gems and jewellery—accounts for over $10 billion in exports, nearly 30 per cent of the industry's total global trade \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-delhi-red-alert-mumbai-yellow-alert-lucknow-schools-closed-himachal-flash-floods-2771016-2025-08-14",
      "headline": "Heavy rain batters Delhi-NCR, more showers may dampen long weekend plansDelhi-NCR rain: Severe waterlogging choked key stretches across Delhi and left several underpasses flooded ahead of Independence Day celebrations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/poultry-federation-amit-non-veg-row-in-maharashtra-a-demand-for-meat-sale-calendar-2771040-2025-08-14",
      "headline": "A demand for national meat sale calendar amid non-veg row in MaharashtraThe Poultry Federation of India has urged the Union Minister to introduce a meat sales calendar to avoid disputes and financial losses from meat bans during religious festivals and holidays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-fencing-underarmour-jyotika-rishika-olympics-2770996-2025-08-14",
      "headline": "Fencing sisters Jyotika and Rishika turn grit and guts into global recognitionFencers Jyotika Dutta and Rishika Khajuria have turned hard work and persistence into results. Their Under Armour deal is a milestone, showing that Indian fencing has talent, promise, and a brighter future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/apple-is-selling-truckloads-of-old-iphones-in-india-but-why-are-people-picking-them-over-new-androids-2770695-2025-08-13",
      "headline": "Why are people picking old iPhones in India over new Androids?According to IDC, the iPhone 16 as well as the iPhone 15 were the most shipped smartphone models in India in the first half of 2025. And then there are the iPhone 14 and iPhone 13, which continue to sell. So, why are old iPhones still selling despite new and faster Android smartphones are available in the market? We explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-developing-brain-in-teens-play-key-role-in-consent-for-sex-law-neuroscience-psychology-here-how-2769677-2025-08-14",
      "headline": "How developing brain in teens plays key role in consent for sexThe government has argued against reducing the age of consent for sex from 18 to 16. While there are legal arguments, neuroscience shows how a developing brain is wired for risk-taking and impulsive behaviour. How does this understanding of the brain tally with the age of consent debate?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-dmk-mla-kathiravans-kidney-stealing-remarks-spark-outrage-bjp-and-aiadmk-condemn-2771059-2025-08-14",
      "headline": "More kidneys needed for Rolls Royce: DMK MLA's remark sparks BJP, AIADMK outrageDMK MLA Kathiravan sparked outrage after a video showed him joking that he would need \"more kidneys\" to buy a Rolls Royce. BJP leader Annamalai and AIADMK chief Edapadi K Palanisamy slammed the remark, linking it to an alleged kidney theft racket involving his hospital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-x-review-hrithik-and-jr-ntr-action-thrills-story-sparks-debate-2771042-2025-08-14",
      "headline": "War 2 X review: Hrithik and Jr NTR's action thrills, but story sparks debateWar 2, starring Hrithik Roshan and Jr NTR, sparked mixed reactions. Praised for its action and visuals, but criticised for plot and VFX. Fans are divided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/from-prawns-mutton-to-fish-non-vegetarian-prasad-traditions-across-india-2770835-2025-08-14",
      "headline": "From prawns, mutton to fish: Non-vegetarian prasad traditions across IndiaAditya Thackeray recently mentioned that in some communities, prawns and fish are offered as 'prasad' during Navratri, illustrating how offerings can differ across regions and traditions.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-stray-dogs-full-order-adoption-relocation-key-takeaways-2771050-2025-08-14",
      "headline": "Begin by creating shelters for 5,000 dogs: 10 takeaways from court orderOn August 11, the Supreme Court directed civic bodies to remove all stray dogs from Delhi-NCR within eight weeks. A detailed 19-page order was published later. Here are the key takeaways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/e20-fuel-in-india-your-key-questions-answered-e20-fuel-india-pros-and-cons-2770948-2025-08-14",
      "headline": "E20 fuel in India: Your key questions answeredIndia's nationwide rollout of E20 fuel promises cleaner mobility and economic gains, but for older vehicles, it could mean reduced mileage, higher maintenance, and potential long-term wear and tear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/salt-and-sugar-for-babies-grandmas-all-for-both-science-isnt-2770592-2025-08-14",
      "headline": "Salt and sugar for babies? Grandma's all for both, science isn'tEven though doctors strongly advise no sugar and no salt for infants, many elderly caregivers find it hard to accept. But real care isn't about sticking to old habits, it's about understanding what's truly best for the baby."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/injured-elephant-storms-guwahati-street-smashes-parked-car-residents-look-on-viral-video-2771046-2025-08-14",
      "headline": "Injured elephant storms Guwahati street, smashes parked car. Watch viral videoAn injured elephant stormed a roadside in Guwahati and smashed a parked car as residents watched. A video of the incident has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/bromide-poisoning-chatgpt-advice-bromism-rare-case-us-hospital-2770837-2025-08-14",
      "headline": "Man asked ChatGPT about salt alternatives. It led to a rare, dangerous poisoningA 60-year-old man was hospitalised with bromide poisoning after replacing salt with sodium bromide following ChatGPT advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-warns-russia-severe-consequences-putin-refuses-ukraine-peace-deal-glbs-2770930-2025-08-14",
      "headline": "Trump warns Russia of very severe consequences if Putin blocks Ukraine dealThe US President's warning comes after a high-level virtual call between Trump, Zelenskyy, and European leaders, hosted by Germany, to outline non-negotiable positions ahead of the Alaska talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-supreme-court-ruling-stray-dogs-shuts-door-voiceless-2771107-2025-08-14",
      "headline": "Sharmila Tagore says Supreme Court stray dog ruling shuts door on the voicelessVeteran Bollywood actor Sharmila Tagore is the latest public figure to speak out against the Supreme Court's ruling to relocate stray dogs from the Delhi-NCR region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactRelease Date:Thu Aug 14, 2025Coolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-aamir-khan-cameo-fanboy-moment-rajinikanth-hits-the-spot-lokesh-kanagaraj-2771073-2025-08-14",
      "headline": "Coolie: Aamir Khan's fanboy moment with Rajinikanth hits the spotAamir Khan's cameo in Rajinikanth's 'Coolie' has caught the attention of all. The actor impressed fans with his swag in the climax of the movie. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-x-review-hrithik-and-jr-ntr-action-thrills-story-sparks-debate-2771042-2025-08-14",
      "headline": "War 2 X review: Hrithik and Jr NTR's action thrills, but story sparks debateWar 2, starring Hrithik Roshan and Jr NTR, sparked mixed reactions. Praised for its action and visuals, but criticised for plot and VFX. Fans are divided."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-responds-to-david-warners-surfboard-remark-ahead-of-ashes-2771119-2025-08-14",
      "headline": "Joe Root responds to David Warner's 'surfboard' remark ahead of Ashes 2025-26Star England batter Joe Root has responded to David Warner's remarks about his poor performances in Australia. Warner had said that Josh Hazlewood is going to give Root a tough time in Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-trade-to-csk-is-not-going-to-work-r-ashwin-2771075-2025-08-14",
      "headline": "Sanju Samson's trade to Chennai Super Kings is not going to work: R AshwinChennai Super Kings (CSK) spinner Ravichandran Ashwin has said that the trade deal between CSK and Rajasthan Royals (RR) may not come to fruition due to several factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-haryana-steelers-team-preview-swot-analysis-2771060-2025-08-14",
      "headline": "Defending champions Haryana Steelers eye back-to-back PKL titlesHaryana Steelers aim to become the second team to defend Pro Kabaddi League title. The squad faces challenges with defensive gaps and Naveen Kumar's injury concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-first-hundred-india-vs-england-1990-arjun-engagement-2771053-2025-08-14",
      "headline": "OTD: Sachin Tendulkar hits maiden international hundred at age of 17In August 1990, a 17-year-old Sachin Tendulkar announced his arrival against a daunting English side. He scored his first Test hundred in his 9th red-ball game for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dr-vece-paes-olympian-and-father-of-tennis-great-leander-paes-dies-at-80-2771036-2025-08-14",
      "headline": "Vece Paes, Olympian and father of tennis great Leander Paes dies at 80Dr Vece Paes, a former hockey player who won an Olympic medal in 1972, has died at the age of 80. Paes is also father to legendary tennis player Leander Paes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-uefa-super-cup-win-penalties-comeback-tottenham-2771020-2025-08-14",
      "headline": "PSG players celebrate special comeback after thrilling Super Cup win vs TottenhamParis Saint-Germain staged a late comeback to beat Tottenham Hotspur in the UEFA Super Cup final. The dramatic penalty shootout victory marks a historic first Super Cup win for the French club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-virat-kohli-phone-number-scam-rajat-patidar-2771008-2025-08-14",
      "headline": "When R Ashwin nearly got scammed into giving away Virat Kohli's phone numberRavichandran Ashwin narrowly avoided a scammer posing as Devon Conway. The scammer was asking for Virat Kohli's phone number after IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-fencing-underarmour-jyotika-rishika-olympics-2770996-2025-08-14",
      "headline": "Fencing sisters Jyotika and Rishika turn grit and guts into global recognitionFencers Jyotika Dutta and Rishika Khajuria have turned hard work and persistence into results. Their Under Armour deal is a milestone, showing that Indian fencing has talent, promise, and a brighter future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pakistan-cricket-team-decline-explained-mohammad-rizwan-2770986-2025-08-14",
      "headline": "Drop Babar Azam. But does it guarantee a Pakistan turnaround in ODIs?PAK vs WI: Babar Azam's poor form is a big concern, with his struggles continuing in recent matches. However, despite his current slump, he's still Pakistan's best option in the middle order, and replacing him could cause more problems for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dr-vece-paes-olympian-and-father-of-tennis-great-leander-paes-dies-at-80-2771036-2025-08-14",
      "headline": "Vece Paes, Olympian and father of tennis great Leander Paes dies at 80Dr Vece Paes, a former hockey player who won an Olympic medal in 1972, has died at the age of 80. Paes is also father to legendary tennis player Leander Paes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-uefa-super-cup-win-penalties-comeback-tottenham-2771020-2025-08-14",
      "headline": "PSG players celebrate special comeback after thrilling Super Cup win vs TottenhamParis Saint-Germain staged a late comeback to beat Tottenham Hotspur in the UEFA Super Cup final. The dramatic penalty shootout victory marks a historic first Super Cup win for the French club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-virat-kohli-phone-number-scam-rajat-patidar-2771008-2025-08-14",
      "headline": "When R Ashwin nearly got scammed into giving away Virat Kohli's phone numberRavichandran Ashwin narrowly avoided a scammer posing as Devon Conway. The scammer was asking for Virat Kohli's phone number after IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-fencing-underarmour-jyotika-rishika-olympics-2770996-2025-08-14",
      "headline": "Fencing sisters Jyotika and Rishika turn grit and guts into global recognitionFencers Jyotika Dutta and Rishika Khajuria have turned hard work and persistence into results. Their Under Armour deal is a milestone, showing that Indian fencing has talent, promise, and a brighter future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pakistan-cricket-team-decline-explained-mohammad-rizwan-2770986-2025-08-14",
      "headline": "Drop Babar Azam. But does it guarantee a Pakistan turnaround in ODIs?PAK vs WI: Babar Azam's poor form is a big concern, with his struggles continuing in recent matches. However, despite his current slump, he's still Pakistan's best option in the middle order, and replacing him could cause more problems for the team."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}