{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged 1,200 points todayAt the closing bell, the S&P BSE Sensex was down 1190.34 points at 79,043.74, while the NSE Nifty50 fell 360.75 points to 23,914.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-group-shares-gain-up-to-3-percent-in-early-trade-2641437-2024-11-28",
      "headline": "Sensex, Nifty open flat; Adani group shares gain up to 10% in early tradeThe S&P BSE Sensex lost 17.08 points to 80,217.00, while the NSE Nifty50 gained 8.05 points to 24,282.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-listing-share-price-does-latest-gmp-signal-a-strong-market-debut-2641423-2024-11-28",
      "headline": "Enviro Infra Engineers listing: Does latest GMP signal a strong market debut? Enviro Infra Engineers listing: The initial public offering (IPO) of Enviro Infra Engineers saw strong investor interest through its 3-day bidding process as it was oversubscribed by 89.90 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-shares-waaree-renewable-pcbl-vedanta-godrej-properties-2641402-2024-11-28",
      "headline": "Stocks to watch today: Adani, Waaree, PCBL, Vedanta, Godrej Properties Stocks to watch: In today's trade, shares of Adani Group, Waaree Renewable Technologies, Godrej Properties, Vedanta, and PCBL, among others, will be in focus due to various developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/this-is-a-hatchet-job-mahesh-jethmalani-on-adanis-us-indictment-2641154-2024-11-27",
      "headline": "This is a hatchet job: Mahesh Jethmalani on Adani's US indictmentIn an exclusive interview with India Today TV, senior advocate and former BJP Rajya Sabha MP Mahesh Jatmalani defended Gautam Adani and called the US indictment a 'hatchet job'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-share-price-rally-clarification-us-bribery-charges-should-you-buy-avoid-stocks-2641085-2024-11-27",
      "headline": "Adani shares rally after clarification on US bribery charges. Is the worst over? Adani Power shares closed 20% higher at Rs 525.30, Adani Total Gas gained 19.76% to Rs 694.25, and Adani Enterprises rose 11.56% to Rs 2,398.35. These were the top gainers among all the listed Adani Group companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-adani-group-stocks-rally-up-to-20-percent-2641039-2024-11-27",
      "headline": "Sensex, Nifty end higher as Adani stocks rally up to 20% The S&P BSE Sensex added 230.02 points to close at 80,234.08, while the NSE NIfty50 gained 82.20 points to end at 24,276.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-faces-cyberattack-fraudsters-steal-customer-data-demand-extortion-2641013-2024-11-27",
      "headline": "HDFC Life faces cyberattack: Fraudsters steal customer data, demand extortionThe breach occurred between November 19 and November 21, 2024 and the cybercriminals managed to steal personal information about HDFC Life's customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-18-percent-should-you-buy-now-or-wait-2640982-2024-11-27",
      "headline": "Ola Electric share price jumps 18%: Should you buy now or wait?The rally in Ola Electric shares followed the company's announcement of its new electric scooter lineup, which aims to make EVs more accessible across various segments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-chief-minister-suspense-devendra-fadnavis-eknath-shinde-ajit-pawar-meet-amit-shah-jp-nadda-bjp-2642016-2024-11-29",
      "headline": "Maharashtra still a cliffhanger as Mahayuti leaders return after key Delhi meetTop Mahayuti leaders met with Amit Shah in Delhi on Thursday night to discuss appointing the next Maharashtra Chief Minister amid a deadlock on who would assume the top post. Sources said the meeting revolved around cabinet berth allocations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-pollution-crisis-supreme-court-india-today-report-exposing-stubble-burning-eyewash-punjab-2641794-2024-11-28",
      "headline": "Supreme Court takes note of India Today report exposing stubble-burning eyewashThe court recorded that officials cannot permit farmers to burn stubble, and instructed the Punjab government to issue immediate instructions to prevent such practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-lawyer-reacts-to-dhanush-legal-notice-says-there-is-no-violation-2642013-2024-11-29",
      "headline": "Nayanthara's lawyer reacts to Dhanush's legal notice, says 'there is no violation' Nayanthara and Vignesh Shivan's legal team has responded to the notice filed by actor Dhanush. He had initiated a legal action against the couple's Netflix documentary for allegedly using unauthorised clips from his film, Naanum Rowdy Dhaan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-shreyas-iyer-priority-mend-ways-rishabh-pant-parth-jindal-exclusive-2641985-2024-11-28",
      "headline": "DC's priority was Shreyas, was ready to mend ways with Pant: Parth JindalRishabh Pant's record-breaking Rs 27 crore move to Lucknow Super Giants not only rewrote IPL history but also revealed behind-the-scenes drama, including Delhi Capitals' efforts to reconcile with their former captain during the auction frenzy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/image-of-female-spg-commando-pm-narendra-modis-security-goes-viral-2641808-2024-11-28",
      "headline": "Picture of woman commando next to PM Modi goes viral. What we knowAn image of a woman commando next to Prime Minister Narendra Modi has gone viral. With many speculating that the woman commando is a part of SPG (Special Protection Group), the identity of the woman officer, along with her branch of service, remains unknown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-prime-minister-anthony-albanese-on-social-media-ban-for-those-under-16-firms-have-responsibility-to-protect-kids-2642027-2024-11-29",
      "headline": "Australia PM on social media ban: Firms now have responsibility to protect kids Australia approved the social media ban for children under the age of 16 on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-nurse-attacked-in-hospital-with-machete-for-turning-down-marriage-proposal-incident-caught-on-cctv-2642022-2024-11-29",
      "headline": "Nurse attacked with machete in Karnataka hospital for rejecting marriage proposalA video of the incident showed the woman trying to fend off the attacker and save herself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-5-democratic-lawmakers-targeted-with-bomb-threats-on-thanksgiving-morning-2642024-2024-11-29",
      "headline": "5 Democratic lawmakers targeted with bomb threats on ThanksgivingUS Representatives Jim Himes, Jahana Hayes, John Larson and Joe Courtney, all from Connecticut, reported the threats in statements on Thanksgiving Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dua-lipa-steps-out-for-dinner-with-boyfriend-callum-turner-british-ahead-of-mumbai-concert-2641989-2024-11-28",
      "headline": "Dua Lipa steps out for dinner with boyfriend ahead of Mumbai concertSinger Dua Lipa is currently in India for her upcoming concert in Mumbai. Ahead of the performance, she was spotted out and about in the city with her boyfriend, Callum Turner. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-accuse-each-other-of-violating-truce-agreement-day-after-signing-pact-2642030-2024-11-29",
      "headline": "Israel, Hezbollah exchange ceasefire violation accusations on day 2 of truce Israel struck a facility used by Hezbollah to store mid-range rockets in southern Lebanon on Thursday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-man-sets-ather-electric-scooter-on-fire-outside-showroom-alleging-improper-servicing-of-repeated-complaints-2642018-2024-11-29",
      "headline": "Chennai man sets electric scooter ablaze outside showroom over improper serviceParthasarathy said that the electric scooter had persistent issues since the purchase, forcing him to visit the service centre multiple times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-joe-biden-on-donald-trumps-plan-to-impose-tariffs-on-mexico-says-can-screw-up-relationships-2642019-2024-11-29",
      "headline": "Biden on Trump's plan to impose tariffs on Mexico: Can screw up relationshipsJoe Biden said he was hoping that Donald Trump would rethink his plan to impose tariffs on Canada and Mexico. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajmer-sharif-dargah-petition-shivling-hindu-temple-rajasthan-khwaja-moinuddin-chishti-books-evidence-history-2641579-2024-11-28",
      "headline": "Was Ajmer Dargah a Shiva temple? What books, Hindu petitioner's evidence suggestA court in Rajasthan's Ajmer has issued notices to several authorities on a petition seeking a physical survey of Ajmer Dargah. The petitioner cited a book to say that the Ajmer Dargah was originally a Shiva temple. What does the book and other documents on the dargah of Khwaja Moinuddin Chishti suggest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-schools-colleges-to-reopen-from-today-after-13-day-gap-amid-fresh-violence-2642020-2024-11-29",
      "headline": "Schools, colleges in Manipur to reopen from today after 13-day gap amid violenceThe closure of educational institutions began on November 16, when violence erupted after a gunfight between security forces and suspected Kuki-Zo militants in Jiribam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/coimbatore-wild-tusker-enters-temple-premises-damages-shops-video-surfaces-2642015-2024-11-29",
      "headline": "Video: Wild elephant damages shops after entering temple premises in CoimbatoreThe same elephant has been sighted frequently near the temple premises over the past two months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-1st-hydrogen-powered-train-with-capacity-for-2638-passengers-to-run-between-jind-sonipat-stations-2642023-2024-11-29",
      "headline": "India's 1st hydrogen powered train to run between Jind, Sonipat stationsAlthough the hydrogen train does not have a name yet, the RDSO-designed model features 8 passenger coaches capable of carrying 2,638 passengers on a single trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aqi-amid-severe-pollution-this-delhi-home-maintains-aqi-of-10-15-with-15000-plants-2642025-2024-11-29",
      "headline": "Amid severe pollution, this Delhi home maintains AQI of 10-15 with 15,000 plantsUnlike typical homes, the property does not rely on paint or plaster. Traditional construction methods have been used, with bricks bound together by lime mortar instead of cement, and lime is employed in place of modern paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-power-demand-likely-to-break-record-this-winter-expected-to-surpass-6300-mw-2642026-2024-11-29",
      "headline": "Delhi's power demand likely to break record this winter, may cross 6,300 MWAccording to forecasts from the State Load Dispatch Centre (SLDC), the capital's electricity consumption could peak at over 6300 MW this season, surpassing the previous winter's high of 5,816 MW.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-indian-coast-guard-rescues-10-stranded-in-cuddalore-amid-cyclonic-weather-2642028-2024-11-29",
      "headline": "Indian Coast Guard rescues 10 stranded in Tamil Nadu amid cyclonic weatherSix fishermen were among the 10 people rescued by the Indian Coast Guard amid cyclonic weather in Cuddalore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-social-media-ban-for-children-under-16-years-2641841-2024-11-28",
      "headline": "Australia bans social media for children under 16, first country to do soThe law forces tech giants from Instagram and Facebook owner Meta to TikTok to stop minors logging in or face fines of up to A$49.5 million (USD32 million). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-to-launch-indias-first-ai-laboratory-to-space-aboard-pslv-xl-2641727-2024-11-28",
      "headline": "Isro to launch India's first AI laboratory to space aboard PSLV-XL Scheduled for December 4, the mission will be launched aboard the PSLV rocket, aiming to revolutionise space research by enabling real-time data processing in orbit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/treat-tirupati-as-sacred-not-a-business-says-pawan-kalyan-in-exclusive-2641863-2024-11-28",
      "headline": "Pawan Kalyan slams global silence on Hindu persecution: Why are activists mum?Speaking to India Today TV, Pawan Kalyan raised strong objection over the silence of the global community on the alleged Hindu persecution in Bangladesh. He also called for the setting up of a Sanatan Dharma Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/treat-tirupati-as-sacred-not-a-business-says-pawan-kalyan-in-exclusive-2641863-2024-11-28",
      "headline": "Pawan Kalyan slams global silence on Hindu persecution: Why are activists mum?Speaking to India Today TV, Pawan Kalyan raised strong objection over the silence of the global community on the alleged Hindu persecution in Bangladesh. He also called for the setting up of a Sanatan Dharma Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-man-accused-setting-vendor-on-fire-bail-due-slow-progress-of-case-bombay-high-court-2641990-2024-11-29",
      "headline": "Court grants bail to Maharashtra man accused of setting vada pav vendor on fireDespite various courts directing the prosecution to expedite the proceedings in the case twice, the bail order was passed as there was hardly any progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-lawyer-reacts-to-dhanush-legal-notice-says-there-is-no-violation-2642013-2024-11-29",
      "headline": "Nayanthara's lawyer reacts to Dhanush's legal notice, says 'there is no violation' Nayanthara and Vignesh Shivan's legal team has responded to the notice filed by actor Dhanush. He had initiated a legal action against the couple's Netflix documentary for allegedly using unauthorised clips from his film, Naanum Rowdy Dhaan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dua-lipa-steps-out-for-dinner-with-boyfriend-callum-turner-british-ahead-of-mumbai-concert-2641989-2024-11-28",
      "headline": "Dua Lipa steps out for dinner with boyfriend ahead of Mumbai concertSinger Dua Lipa is currently in India for her upcoming concert in Mumbai. Ahead of the performance, she was spotted out and about in the city with her boyfriend, Callum Turner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-soni-razdans-sweetest-birthday-wish-for-shaheen-bhatt-2641948-2024-11-28",
      "headline": "Alia Bhatt, Soni Razdan's sweetest birthday wish for Shaheen BhattAlia Bhatt's older sister, Shaheen Bhatt, celebrated her birthday on November 28. Alia and her mother, Soni Razdan, shared heartfelt birthday wishes for her.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/fan-requests-diljit-dosanjh-for-tickets-to-kolkata-show-singer-responds-2641933-2024-11-28",
      "headline": "Fan requests Diljit Dosanjh for tickets to Kolkata show, singer respondsA fan requested Diljit Dosanjh for tickets to his upcoming Kolkata concert. The singer, who is set to perform in the city on November 30, responded on X."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/delhi-capitals-kl-rahul-ipl-auction-ready-to-go-even-bigger-parth-jindal-exclusive-2642005-2024-11-28",
      "headline": "DC were ready to go even bigger for KL Rahul: Co-owner Parth Jindal explainsDelhi Capitals co-owner Parth Jindal revealed the franchise was prepared to exceed their Rs 14 crore bid for KL Rahul in the IPL 2025 mega auction, after losing out on top target Shreyas Iyer and a failed RTM for Rishabh Pant."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-final-d-gukesh-vs-ding-liren-live-streaming-details-singapore-2641991-2024-11-28",
      "headline": "World Chess Championship match, D Gukesh vs Ding Liren: When and where to watchAll eyes will be on D Gukesh as he will take on defending champion Ding Liren in Game 4 of the World Chess Championship in Singapore on Friday, November 29. Gukesh won Game 3 to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-shreyas-iyer-priority-mend-ways-rishabh-pant-parth-jindal-exclusive-2641985-2024-11-28",
      "headline": "DC's priority was Shreyas, was ready to mend ways with Pant: Parth JindalRishabh Pant's record-breaking Rs 27 crore move to Lucknow Super Giants not only rewrote IPL history but also revealed behind-the-scenes drama, including Delhi Capitals' efforts to reconcile with their former captain during the auction frenzy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-prithvi-shaw-auction-snub-delhi-capitals-parth-jindal-2641974-2024-11-28",
      "headline": "Prithvi Shaw is misunderstood, but IPL auction snub was needed: Parth JindalDelhi Capitals co-owner Parth Jindal feels that Prithvi Shaw needed a 'jolt' in his life in the form of the IPL 2025 Auction snub. Jindal also feels that Shaw is someone who is misunderstood as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-druban-test-marco-jansen-seven-wicket-haul-durban-2641934-2024-11-28",
      "headline": "South Africa in cruise control of Durban Test after Sri Lanka 42 all-outMarco Jansen's career-best 7/13 dismantled Sri Lanka for a record-low 42 runs, giving South Africa a dominant position in the Durban Test. The Proteas' fiery bowling and solid batting combined to crush Sri Lanka's hopes of a comeback."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-iga-swiatek-one-month-doping-ban-response-itia-2641920-2024-11-28",
      "headline": "Iga Swiatek breaks silence on 1-month doping ban: Worst experience of my lifeFormer World No.1 Iga Swiatek has opened up on the one-month doping ban she has accepted on Thursday, November 28, calling it the worst experience of her life. Swiatek accepted the ban after unknowingly consuming a banned substance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ipl-auction-review-podcast-rcb-virat-kohli-rishabh-pant-delhi-2641914-2024-11-28",
      "headline": "IPL mega auction review: Did RCB get it right this time?IPL mega auction review: Royal Challengers Bengaluru faced the stick for missing out on big buys, but it seems it was a conscious choice as they resisted the temptation of spending big on Day 1. Under Andy Flower and Dinesh Karthik, RCB made some smart buys throughout the two-day auction, impressing their fans. Barring the Will Jacks controversy, RCB did alright. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-sledging-room-podcast-perth-test-review-jasprit-bumrah-pat-cummins-2641910-2024-11-28",
      "headline": "Border-Gavaskar Trophy: Are Australia afraid of Jasprit Bumrah? India landed a stinging first punch in Perth, beginning the five-Test Border-Gavaskar Trophy on a high. India hammered Australia by 295 runs, handing the hosts their first-ever loss at the Optus Stadium in Perth. In the latest episode of the Sledging Room Podcast, we discuss the sweet start to the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-target-fifa-top-50-ranking-sports-minister-talent-academies-u17-world-cup-2641906-2024-11-28",
      "headline": "India should target FIFA Top 50 Rankings: Sports Minister sets high-targetIndia aims for a FIFA top 50 ranking in 10 years with grassroots football initiatives, including new academies and a focus on nurturing young talent. Collaborative efforts between AIFF and the Sports Ministry promise long-term development for Indian football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-3rd-odi-score-series-win-kamran-ghulam-2641903-2024-11-28",
      "headline": "Kamran Ghulam 103 inspires Pakistan's come-from-behind ODI series winZimbabwe vs Pakistan, 3rd ODI: Pakistan completed a come-from-behind series win, hammering Zimbabwe by 99 runs in the series finale. Kamran Ghulam's hundred and an all-round bowling attack helped Pakistan seal the series win on Friday, "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-iga-swiatek-one-month-doping-ban-response-itia-2641920-2024-11-28",
      "headline": "Iga Swiatek breaks silence on 1-month doping ban: Worst experience of my lifeFormer World No.1 Iga Swiatek has opened up on the one-month doping ban she has accepted on Thursday, November 28, calling it the worst experience of her life. Swiatek accepted the ban after unknowingly consuming a banned substance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ipl-auction-review-podcast-rcb-virat-kohli-rishabh-pant-delhi-2641914-2024-11-28",
      "headline": "IPL mega auction review: Did RCB get it right this time?IPL mega auction review: Royal Challengers Bengaluru faced the stick for missing out on big buys, but it seems it was a conscious choice as they resisted the temptation of spending big on Day 1. Under Andy Flower and Dinesh Karthik, RCB made some smart buys throughout the two-day auction, impressing their fans. Barring the Will Jacks controversy, RCB did alright. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-sledging-room-podcast-perth-test-review-jasprit-bumrah-pat-cummins-2641910-2024-11-28",
      "headline": "Border-Gavaskar Trophy: Are Australia afraid of Jasprit Bumrah? India landed a stinging first punch in Perth, beginning the five-Test Border-Gavaskar Trophy on a high. India hammered Australia by 295 runs, handing the hosts their first-ever loss at the Optus Stadium in Perth. In the latest episode of the Sledging Room Podcast, we discuss the sweet start to the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-target-fifa-top-50-ranking-sports-minister-talent-academies-u17-world-cup-2641906-2024-11-28",
      "headline": "India should target FIFA Top 50 Rankings: Sports Minister sets high-targetIndia aims for a FIFA top 50 ranking in 10 years with grassroots football initiatives, including new academies and a focus on nurturing young talent. Collaborative efforts between AIFF and the Sports Ministry promise long-term development for Indian football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-3rd-odi-score-series-win-kamran-ghulam-2641903-2024-11-28",
      "headline": "Kamran Ghulam 103 inspires Pakistan's come-from-behind ODI series winZimbabwe vs Pakistan, 3rd ODI: Pakistan completed a come-from-behind series win, hammering Zimbabwe by 99 runs in the series finale. Kamran Ghulam's hundred and an all-round bowling attack helped Pakistan seal the series win on Friday, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-modi-international-pv-sindhu-survives-scare-lakshya-breezes-into-quarters-2641895-2024-11-28",
      "headline": "Syed Modi International: PV Sindhu survives scare, Lakshya breezes into quartersPV Sindhu battled hard to overcome fellow Indian Ira Sharma in a three-game match to reach the Syed Modi International quarterfinals. Lakshya Sen breezed into the final 8 stage with a straight games win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/etihad-showcases-csk-partnership-with-new-a320neo-livery-2641858-2024-11-28",
      "headline": "Etihad Airways unveils CSK-themed livery on Airbus A320neoEtihad Airways, the national airline of the United Arab Emirates, has unveiled a new livery inspired by its partnership with Chennai Super Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-iga-swiatek-doping-ban-details-explained-prohibited-substance-2641870-2024-11-28",
      "headline": "Tennis star Iga Swiatek accepts one-month ban for failed dope test World No. 2 women's singles player Iga Swiatek accepted a one-match ban after a failed doping test in August 2024. The five-time Grand Slam champion tested positive for a prohibited substance -- trimetazidine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-asia-cup-schedule-livestreaming-details-squads-indian-cricket-team-2641867-2024-11-28",
      "headline": " U-19 Asia Cup 2024: Schedule, livestreaming and all you need to knowAsia's finest youngsters will be on show as the U-19 Asia Cup 2024 starts from Friday, November 29. India's young sensation Vaibhav Suryavanshi will be one of the stars on display during the tournament.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-siddarth-kaul-retirement-virat-kohli-u19-world-cup-ipl-2641843-2024-11-28",
      "headline": "Pacer Siddarth Kaul announces retirement: Time to call time on my career in IndiaFast bowler Siddarth Kaul announced his retirement from all forms of cricket, days after he went unsold in the IPL 2025 auction. Siddarth played a key role in India's U19 World Cup triumph in 2008 and went on to play 6 matches for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-adam-zampa-test-debut-galle-2641844-2024-11-28",
      "headline": "SL vs AUS: Adam Zampa eager to make Test debut for Australia in Sri Lanka tourAdam Zampa is pushing to make his Test debut during Australia's tour of Sri Lanka in late January 2025. The Sri Lanka tour could be the last chance Zampa will get to represent Australia in the Test arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-narendra-modi-anthony-albanese-border-gavaskar-trophy-australia-vs-india-2641824-2024-11-28",
      "headline": "PM Narendra Modi 'strongly rooting' for India to win series in Australia Prime Minister Narendra Modi backed the Indian Cricket Team to beat Australia in the ongoing five-match Test series between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-manchester-city-struggles-decoding-feyenoord-draw-premier-league-europe-2641809-2024-11-28",
      "headline": "Pep Guardiola on 'red alert' at Manchester City: Decoding club's strugglesManchester City's dominance has hit a shocking roadblock, with Pep Guardiola enduring his longest winless streak as a manager. Six games without victory have raised questions about injuries, tactical missteps, and the team's reliance on key players like Rodri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-siddarth-kaul-retirement-virat-kohli-u19-world-cup-ipl-2641843-2024-11-28",
      "headline": "Pacer Siddarth Kaul announces retirement: Time to call time on my career in IndiaFast bowler Siddarth Kaul announced his retirement from all forms of cricket, days after he went unsold in the IPL 2025 auction. Siddarth played a key role in India's U19 World Cup triumph in 2008 and went on to play 6 matches for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-adam-zampa-test-debut-galle-2641844-2024-11-28",
      "headline": "SL vs AUS: Adam Zampa eager to make Test debut for Australia in Sri Lanka tourAdam Zampa is pushing to make his Test debut during Australia's tour of Sri Lanka in late January 2025. The Sri Lanka tour could be the last chance Zampa will get to represent Australia in the Test arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-narendra-modi-anthony-albanese-border-gavaskar-trophy-australia-vs-india-2641824-2024-11-28",
      "headline": "PM Narendra Modi 'strongly rooting' for India to win series in Australia Prime Minister Narendra Modi backed the Indian Cricket Team to beat Australia in the ongoing five-match Test series between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-manchester-city-struggles-decoding-feyenoord-draw-premier-league-europe-2641809-2024-11-28",
      "headline": "Pep Guardiola on 'red alert' at Manchester City: Decoding club's strugglesManchester City's dominance has hit a shocking roadblock, with Pep Guardiola enduring his longest winless streak as a manager. Six games without victory have raised questions about injuries, tactical missteps, and the team's reliance on key players like Rodri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-hybrid-model-icc-meeting-shahid-afridi-2641801-2024-11-28",
      "headline": "Fully support Pakistan's stance on Champions Trophy hybrid model: Shahid AfridiShahid Afridi has offered his full support to Pakistan's stance of not accepting the hybrid model for the ICC Champions Trophy 2025. The tournament has been in limbo due to India's reluctance to travel to Pakistan for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marco-jansen-seven-wickets-sri-lanka-42-sa-vs-sl-durban-test-2641791-2024-11-28",
      "headline": "After IPL pay rise, Marco Jansen rattles Sri Lanka with career-best Test figuresSouth Africa vs Sri Lanka: Marco Jansen registered the joint second-best figures for a South African fast bowler in Tests. Jansen's 7 for 13 saw Sri Lanka getting bowled out for 42 on Thursday in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-pat-cummins-travis-head-steve-smith-2641790-2024-11-28",
      "headline": "AUS vs IND: Virat Kohli in Australia team? Cummins, Maxwell and Head answerVirat Kohli seems to have a lot of fans in the Australia camp as he Indian star was picked by many as a dream player to be in their squad. Kohli scored a fine hundred against Australia in the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-lowest-test-score-sa-vs-sl-durban-test-marco-jansen-south-africa-vs-sri-lanka-2641782-2024-11-28",
      "headline": "SA vs SL: Sri Lanka bowled out for 42, their lowest score in Test cricketSri Lanka got bundled out for their lowest score in the history of Test cricket as they got all out for 42 on Day 2 of the first Test against South Africa in Durban."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}