{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q2-gdp-growth-slows-lowest-in-six-quarters-2642308-2024-11-29",
      "headline": "India's Q2 GDP slows to 5.4%, hits 18-month low on weak consumptionThe weaker-than-expected GDP growth raises concerns about the sustainability of economic recovery, particularly as key sectors like manufacturing and mining face challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-nifty-closing-bell-q2-gdp-data-in-focus-2642284-2024-11-29",
      "headline": "Sensex, Nifty end higher as heavyweight stocks gain; Q2 GDP data in focusThe S&P BSE Sensex was up 759.05 points to 79,802.79 at the closing bell, while the NSE Nifty50 rose 216.95 points to 24,131.10. Both the indices had declined roughly 1.5% yesterday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-project-faqs-who-can-apply-qr-code-security-other-key-details-2642232-2024-11-29",
      "headline": "PAN 2.0 FAQs: Who can apply, QR code feature, and other key detailsPAN 2.0 is a government initiative combining PAN and TAN systems with a QR code for secure and quick identity verification, simplifying taxpayer registration and promoting a tech-driven tax ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebound-today-sensex-700-points-nifty-gains-key-factors-bull-run-dalal-street-2642204-2024-11-29",
      "headline": "Sensex surges 800 points: Key factors behind bull run on Dalal StreetStock market today: Sensex and Nifty regained their footing, driven by improved investor sentiment and stock-specific action. Read on to find out the key reasons behind today's rebound on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-ipo-stock-market-listing-should-you-hold-for-long-term-or-book-profit-now-2642133-2024-11-29",
      "headline": "Enviro Infra makes solid market debut: Should you hold or book profit?Enviro Infra IPO listing: Shares of Enviro Infra Engineers have dipped slightly following their strong listing, prompting investors to weigh whether to hold onto their shares or book profits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-gain-sharply-stock-market-key-factors-why-2642119-2024-11-29",
      "headline": "Adani Green, Adani Energy Solutions: Why these Adani Group stocks are gainingAdani Green Energy led the surge, rising 14.64% to hit Rs 1,247.55. Adani Energy Solutions followed, reaching a day's high of Rs 825.85. Most other Adani Group stocks also registered gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-stock-market-listing-49-percent-premium-ipo-price-2642108-2024-11-29",
      "headline": "Enviro Infra shares make strong debut, list at 49% premium over IPO priceEnviro Infra Engineers listing: The shares opened at Rs 220 on the NSE, marking a 48.64% jump from the IPO price of Rs 148. On the BSE, the stock listed at Rs 218, reflecting a 47.29% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-700-points-nifty-rises-adani-stocks-gain-2642097-2024-11-29",
      "headline": "Sensex rallies 700 points, Nifty above 24,000; Adani stocks surgeThe S&P BSE Sensex surged 663 points to reach 79,702.09 by 10:33 am, while the NSE Nifty50 climbed 154.60 points to trade at 24,084.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged 1,200 points todayAt the closing bell, the S&P BSE Sensex was down 1190.34 points at 79,043.74, while the NSE Nifty50 fell 360.75 points to 23,914.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-brics-currency-donald-trump-tariff-threat-us-dollar-dominance-us-india-relations-2643070-2024-12-01",
      "headline": "As Trump threatens 100% tariffs, where India stands on Brics currency vs dollarAs Donald Trump threatened 100% tariffs on Brics nations, including India, if they went ahead with developing its own currency to replace the US dollar, India has adopted a cautious approach to de-dollarisation even as Washington recently became New Delhi's leading trading partner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-mumbai-return-maharashtra-government-formation-bjp-finalises-chief-minister-devendra-fadnavis-ncp-shiv-sena-2643107-2024-12-01",
      "headline": "Eknath Shinde's comeback as Maharashtra in limbo, BJP finalises Chief MinisterBJP leader Raosaheb Danve hinted that the Maharashtra Chief Minister's name has been finalised, while a Shiv Sena leader said Eknath Shinde is expected to return to Mumbai today as government formation hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/there-will-be-no-alliance-arvind-kejriwal-rules-out-aap-congress-tie-up-for-delhi-assembly-polls-2643055-2024-12-01",
      "headline": "Jolt to INDIA bloc as Arvind Kejriwal says no to alliance for Delhi pollsAAP chief Arvind Kejriwal said that the party will not form any alliances for the upcoming Assembly polls in Delhi, delivering a setback to the opposition INDIA bloc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-pms-xi-2642970-2024-12-01",
      "headline": "IND vs AUS PM's XI Live: KL Rahul-Jaiswal get India off to a strong startIndia (IND) vs Australia (AUS) Prime Minister's XI warm-up game Live Updates: KL Rahul and Yashavi Jaiswal have come out to open for India in the chase vs Prime Minister's XI. Earlier, the hosts were bowled out for 240 in 43.1 overs as Harshit Rana picked up 4/44 in six overs. Akash Deep also picked up 2/58 in ten overs. Sam Konstas scored 107 while Hanno Jacobs also scored a crucial half century for PM's XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/lindt-who-indian-artisanal-chocolates-paul-and-mike-manam-soklet-chitram-are-stealing-the-show-one-bar-at-a-time-2643002-2024-12-01",
      "headline": "Lindt, who? Indian craft chocolates are stealing the show one bar at a timeWhy Indian craft chocolate brands deserve all the hype and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-live-updates-chennai-flooded-electrocuted-flight-ops-airport-reopens-puducherry-rain-2642962-2024-12-01",
      "headline": "Cyclone Fengal kills 3 in Chennai, Puducherry sees highest rainfall in 30 years Live UpdatesCyclone Fengal live: Cyclone Fengal made landfall near Puducherry, where 42 cm of rain was recorded, the highest in 30 years and also led to flooding at several places, including Chennai, where three people were electrocuted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-pm-xi-rohit-demotes-rahul-jaiswal-open-in-tour-game-2643078-2024-12-01",
      "headline": "Rohit Sharma demotes himself as KL Rahul-Jaiswal continue to open in tour-gameBorder-Gavaskar Trophy: Rohit Sharma did not open for India in the pink ball tour-game vs Australia PM XI. KL Rahul and Yashasvi Jaiswal continued to open in the pink-ball tour game against Australia's Prime Minister's XI at Manuka Oval, Canberra, on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-icc-chairman-ex-bcci-secretary-2643059-2024-12-01",
      "headline": "Jay Shah takes charge as ICC President amid Champions Trophy tug-of-warJay Shah officially assumed the role of Chairman of the International Cricket Council (ICC) amid ongoing disagreements between India and Pakistan regarding the venue for the 2025 Champions Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indias-love-for-chubby-kids-cradles-obesity-epidemic-baby-fat-diabetes-hypertension-2642867-2024-12-01",
      "headline": "India's love for golu-molu kids is feeding an epidemicMost Indians instinctively pull the cheeks of chubby babies. India's love for \"golu-molu\" kids is adding to the obesity epidemic. This is what's at the root of the love for overweight kids and how it is resulting in pre-onset diabetes and hypertension in teenagers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-bank-manager-saves-senior-citizen-couple-from-rs-30-lakh-cyber-fraud-2643076-2024-12-01",
      "headline": "Hyderabad bank manager saves elderly couple from Rs 30 lakh cyber fraudA vigilant State Bank of India (SBI) branch manager foiled a cyber scam targeting an elderly couple in Hyderabad's Lothukunta. Spotting signs of distress, he alerted police and prevented a Rs 30-lakh loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-journalist-munni-saha-mobbed-dhaka-karwan-bazar-detained-police-rescue-release-2643033-2024-12-01",
      "headline": "Video: Woman journalist mobbed in Dhaka, accused of being Indian agentBangladeshi TV journalist Munni Saha's car was intercepted by a group of people in Dhaka on Saturday. The mob accused her of being an Indian agent and a supporter of the former Hasina government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-update-judicial-panel-up-district-violence-mosque-survey-police-retired-judge-2643049-2024-12-01",
      "headline": "Judicial panel in Sambhal to probe violence that occurred over mosque surveyUnder tight security, a three-member judicial inquiry commission headed by a retired high court judge visited Sambhal and inspected the area where violence occurred over the survey of the Mughal-era Shahi Jama Masjid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-kolkata-concert-dil-luminati-tour-2643075-2024-12-01",
      "headline": "Diljit Dosanjh says 'korbo, lorbo, jeetbo re' at Kolkata concert, SRK respondsDiljit Dosanjh mesmerised Kolkata with his performance, embracing the local culture by quoting the KKR's anthem and expressing admiration for Rabindranath Tagore. The singer-actor also shared his love for Shah Rukh Khan, and the superstar has reacted to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/slow-aint-steady-in-retail-anymore-how-kiranas-are-fast-losing-out-to-q-comm-2642835-2024-11-30",
      "headline": "'Slow' ain't steady in retail anymore: How kiranas are fast losing out to Q-commAround Rs 10,820 crore worth of kirana sales are expected to shift to quick commerce in 2024, a study has indicated, as consumers embrace convenience\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-youtuber-ishan-sharma-video-of-san-francisco-zombie-like-people-2643087-2024-12-01",
      "headline": "Bengaluru YouTuber shares video of San Francisco's 'zombie-like people'In a post on X, Bengaluru-based YouTuber Ishan Sharma shared a video of 'zombie-like people' walking on the streets of San Francisco."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-justin-trudeau-florida-mar-a-lago-tariff-threat-canadian-mexican-imports-immigration-2643008-2024-12-01",
      "headline": "Thanks for dinner: Trudeau's all-smiles pic with Trump amid tariff hike threatCanadian Prime Minister Justin Trudeau and Donald Trump dined at the Mar-a-Lago residence in Florida despite the US President-elect threatening tariffs on Canadian and Mexican products over the drug crisis and illegal immigration across the US's borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/dj-ruchir-kulkarni-creator-viral-levitating-woh-ladki-jo-mashup-react-dua-lipa-performance-2643034-2024-12-01",
      "headline": "Dua Lipa performs Levitating X Woh Ladki Jo, mashup creator Ruchir reactsDua Lipa's recent concert in Mumbai featured a viral mashup of her song Levitating with Woh Ladki Jo, surprising and thrilling the audience. The man behind the mashup, Ruchir Kulkarni, expressed his joy on social media, calling it the greatest achievement of his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-ritika-sajdeh-reveal-their-sons-name-samaira-2643071-2024-12-01",
      "headline": "Rohit Sharma's wife Ritika Sajdeh reveals son's name in a cryptic Instagram storyIndia captain Rohit Sharma and wife Ritika Sajdeh revealed the name of their son through an Instagram story. The couple was recently blessed with a baby boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jharkhand-cabinet-expansion-eyes-december-9-special-session-2643018-2024-12-01",
      "headline": "Jharkhand cabinet likely to be expanded ahead of December 9 special sessionJharkhand Congress President Keshav Mahato Kamlesh on Sunday met Chief Minister Hemant Soren on Saturday to discuss the long-awaited cabinet expansion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tipu-sultan-a-complex-figure-politics-of-the-day-cherry-picks-facts-s-jaishankar-2642991-2024-12-01",
      "headline": "Tipu Sultan a complex figure, politics of the day cherry-picks facts: S JaishankarExternal Affairs Minister S Jaishankar noted that contemporary history writings have largely focused on Tipu Sultan's resistance to British colonial control, while glossing over the adverse sentiments he evokes in many regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-crew-member-dances-to-govinda-chalo-ishq-ladaye-with-colleague-viral-video-2643060-2024-12-01",
      "headline": "IndiGo crew member dances to Govinda's Chalo Ishq Ladaye with colleague in viral videoAn IndiGo crew member shared a video of herself dancing with a colleague to Govinda's hit song Chalo Ishq Ladaye on Instagram. The video has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-kash-patel-donald-trump-fbi-director-nominee-2642961-2024-12-01",
      "headline": "Meet Kash Patel, Trump's FBI director pick who vowed to shut agency 'on day one'Kash Patel, 44, is the son of Indian immigrants and has had a diverse career in law and national security. A fierce critic of the FBI, he has pledged sweeping reforms if confirmed as director of the federal agency. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/raj-kundra-gets-enforcement-directorate-ed-summons-raids-porn-racket-case-2642963-2024-12-01",
      "headline": "Raj Kundra gets ED summons days after raids in porn racket caseRaj Kundra was previously arrested in July 2021 by the Mumbai Police for allegedly producing and distributing pornographic content. The ED has issued summons to Kundra and others involved in the case, asking them to appear for questioning on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-us-indictment-adani-group-fraud-charges-andhra-pradesh-2642914-2024-11-30",
      "headline": "Gautam Adani responds to US fraud charges: Every attack makes us strongerThe Adani Group is facing allegations of corruption as US prosecutors accused Gautam Adani and others of orchestrating a USD 265 million bribery scheme to secure state energy contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-updates-day-54-highlights-salman-khan-weekend-ka-vaar-2643089-2024-12-01",
      "headline": "Bigg Boss 18 Day 54: Salman Khan warns Karanveer Mehra not to test his patienceIn this Weekend Ka Vaar episode of Bigg Boss 18, Salman Khan spoke to Chahat Pandey. Actor Aditi Sharma's guest appearance adds a light-hearted break to the intense evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-expresses-gratitude-as-jawan-wins-hearts-in-japan-my-love-and-thanks-2643079-2024-12-01",
      "headline": "SRK expresses gratitude as Jawan wins hearts in JapanBollywood icon Shah Rukh Khan extended his heartfelt thanks to Japanese fans after his film Jawan received post its release on November 29.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-kolkata-concert-dil-luminati-tour-2643075-2024-12-01",
      "headline": "Diljit Dosanjh says 'korbo, lorbo, jeetbo re' at Kolkata concert, SRK respondsDiljit Dosanjh mesmerised Kolkata with his performance, embracing the local culture by quoting the KKR's anthem and expressing admiration for Rabindranath Tagore. The singer-actor also shared his love for Shah Rukh Khan, and the superstar has reacted to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-tovino-thomas-wrap-up-shoot-for-prithivirajs-l2-empuraan-2643062-2024-12-01",
      "headline": "Mohanlal, Tovino Thomas wrap up shoot for Prithiviraj's L2: EmpuraanThe much-awaited sequel L2: Empuraan, directed by Prithviraj Sukumaran, has wrapped up its shooting phase. Starring Mohanlal and Tovino Thomas, the film is now set to enter post-production."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-sarfaraz-khan-kl-rahul-india-vs-prime-ministers-xi-2643093-2024-12-01",
      "headline": "Watch: Rohit Sharma hilariously punches wicketkeeper Sarfaraz as he misses ballIndia captain Rohit Sharma was seen hilariously punching Sarfaraz Khan during Day 2 of the warm-up fixture against Prime Minister's XI as he dropped down a regular take."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-pm-xi-rohit-demotes-rahul-jaiswal-open-in-tour-game-2643078-2024-12-01",
      "headline": "Rohit Sharma demotes himself as KL Rahul-Jaiswal continue to open in tour-gameBorder-Gavaskar Trophy: Rohit Sharma did not open for India in the pink ball tour-game vs Australia PM XI. KL Rahul and Yashasvi Jaiswal continued to open in the pink-ball tour game against Australia's Prime Minister's XI at Manuka Oval, Canberra, on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-ritika-sajdeh-reveal-their-sons-name-samaira-2643071-2024-12-01",
      "headline": "Rohit Sharma's wife Ritika Sajdeh reveals son's name in a cryptic Instagram storyIndia captain Rohit Sharma and wife Ritika Sajdeh revealed the name of their son through an Instagram story. The couple was recently blessed with a baby boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-australia-opener-ian-redpath-dies-at-the-age-of-83-2643064-2024-12-01",
      "headline": "Former Australia opener Ian Redpath dies at the age of 83Former Australia batter Ian Redpath has died at the age of 83. Redpath played 66 Tests and five ODIs in an international career that ran from 1964 to 1976.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jay-shah-icc-chief-bcci-secretary-2642930-2024-12-01",
      "headline": "Jay Shah takes charge as ICC chief: After stellar BCCI stint, what lies ahead? Jay Shah, who has helped Indian cricket scale new heights during his tenure as the BCCI secretary, has take charge as the chairman of the ICC after Greg Barclay opted not to seek a third term. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-icc-chairman-ex-bcci-secretary-2643059-2024-12-01",
      "headline": "Jay Shah takes charge as ICC President amid Champions Trophy tug-of-warJay Shah officially assumed the role of Chairman of the International Cricket Council (ICC) amid ongoing disagreements between India and Pakistan regarding the venue for the 2025 Champions Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-pm-xi-vs-india-sam-konstas-hits-blazing-hundred-in-impressive-audition-before-pink-ball-test-2643058-2024-12-01",
      "headline": "Konstas hits blazing hundred in impressive audition before Pink Ball TestAustralia youngster Sam Konstas hit a blazing hundred in the the Prime Minister XI's match vs India. Konstas stood tall at one end and hit a 90-ball hundred as wickets fell on the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-jasprit-bumrah-india-vs-prime-ministers-xi-canberra-2643046-2024-12-01",
      "headline": "Watch: Virat Kohli faces Jasprit Bumrah in nets on sidelines of warm up gameStar India batter Virat Kohli was seen facing Jasprit Bumrah in the nets as India opted to field first on Day 2 of the warm up fixture against Prime Minister's XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hockey-india-league-hardik-singh-named-captain-up-rudras-hil-2643045-2024-12-01",
      "headline": "Hardik Singh named captain of UP Rudras in upcoming HILStar India midfielder Hardik Singh will lead UP Rudras in the upcoming season of the Hockey India League (HIL). The Lucknow franchise, owned by Yadu Sports, have assembled a strong squad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hayley-matthews-stars-as-melbourne-renegades-win-maiden-wbbl-title-2643044-2024-12-01",
      "headline": "Hayley Matthews stars as Melbourne Renegades win maiden WBBL titleMelbourne Renegades won their maiden WBBL title in a thrilling final against the Brisbane Heat on Sunday, December 1. Hayley Matthews starred with both ball and bat to secure a memorable victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa20-establishing-itself-as-no-2-league-below-incredible-ipl-graeme-smith-2643042-2024-12-01",
      "headline": "SA20 establishing itself as No 2 league below 'incredible' IPL: SmithSA20 has solidified its place as the second-most prominent T20 cricket league globally, following the Indian Premier League (IPL), according to league commissioner Graeme Smith. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-pm-xi-vs-india-sam-konstas-hits-blazing-hundred-in-impressive-audition-before-pink-ball-test-2643058-2024-12-01",
      "headline": "Konstas hits blazing hundred in impressive audition before Pink Ball TestAustralia youngster Sam Konstas hit a blazing hundred in the the Prime Minister XI's match vs India. Konstas stood tall at one end and hit a 90-ball hundred as wickets fell on the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-jasprit-bumrah-india-vs-prime-ministers-xi-canberra-2643046-2024-12-01",
      "headline": "Watch: Virat Kohli faces Jasprit Bumrah in nets on sidelines of warm up gameStar India batter Virat Kohli was seen facing Jasprit Bumrah in the nets as India opted to field first on Day 2 of the warm up fixture against Prime Minister's XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hockey-india-league-hardik-singh-named-captain-up-rudras-hil-2643045-2024-12-01",
      "headline": "Hardik Singh named captain of UP Rudras in upcoming HILStar India midfielder Hardik Singh will lead UP Rudras in the upcoming season of the Hockey India League (HIL). The Lucknow franchise, owned by Yadu Sports, have assembled a strong squad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hayley-matthews-stars-as-melbourne-renegades-win-maiden-wbbl-title-2643044-2024-12-01",
      "headline": "Hayley Matthews stars as Melbourne Renegades win maiden WBBL titleMelbourne Renegades won their maiden WBBL title in a thrilling final against the Brisbane Heat on Sunday, December 1. Hayley Matthews starred with both ball and bat to secure a memorable victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa20-establishing-itself-as-no-2-league-below-incredible-ipl-graeme-smith-2643042-2024-12-01",
      "headline": "SA20 establishing itself as No 2 league below 'incredible' IPL: SmithSA20 has solidified its place as the second-most prominent T20 cricket league globally, following the Indian Premier League (IPL), according to league commissioner Graeme Smith. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-ind-vs-aus-warm-up-match-canberra-rohit-batting-position-2643020-2024-12-01",
      "headline": "Rohit Sharma lists himself at No.5 vs PM XI: Will Rahul open in Pink Ball Test?Border-Gavaskar Trophy: India captain Rohit Sharma listed himself at No.5 in line-up of the pink ball warm-up game vs Prime Minister's XI. Could that be an indication of the captain sacrificing his position in the Adelaide Test?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharmas-hilarious-exchange-with-fans-goes-viral-before-pink-ball-test-2643015-2024-12-01",
      "headline": "Rohit Sharma's hilarious exchange with fans goes viral before Pink Ball TestBorder-Gavaskar Trophy: India captain Rohit Sharma was hounded by fans in Canberra for his autograph and selfies. The incident brought out a hilarious reaction from the India captain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-coach-luis-enrique-urges-psg-to-stay-resilient-after-frustrating-draw-2643013-2024-12-01",
      "headline": "Coach Luis Enrique urges PSG to stay resilient after frustrating drawParis St Germain manager Luis Enrique lamented his team's failure to convert chances in Saturday's Ligue 1 draw with Nantes, despite dominating possession, and stressed the need for persistence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-2nd-test-day-1-report-shadman-fifty-2642999-2024-12-01",
      "headline": "Shadman hits fifty, West Indies drop 3 catches on rain-truncated day 1The opening day of the second Test between Bangladesh and the West Indies at Sabina Park was marred by rain and a wet outfield, with just 30 overs of play possible. Despite early setbacks, Bangladesh managed to finish at 69 for 2, thanks to a gritty half-century by opener Shadman Islam and three dropped catches by the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-josh-hazlewood-miss-impact-day-night-adelaide-test-2642937-2024-12-01",
      "headline": "Why Australia will miss Josh Hazlewood badly in Adelaide Test  Border-Gavaskar Trophy: Fast bowler Josh Hazlewood played a crucial role for Australia in the Day-Night Tests, but would not be a part of their setup against India at the Adelaide Oval. Will Australia miss Hazlewood in the Adelaide Test?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/barcelona-vs-las-palmas-hansi-flick-slams-disconnected-team-after-1-2-loss-2642992-2024-12-01",
      "headline": "Barcelona vs Las Palmas: Hansi Flick slams disconnected team after 1-2 lossFC Barcelona head coach Hansi Flick accepted that his team is going through a form slump. Speaking after their loss vs Las Palmas, Flick said that his team looked disconnected in transitions and played a very bad game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-vs-liverpool-pep-guardiola-test-arne-slot-anfield-premier-league-top-of-the-table-2642940-2024-12-01",
      "headline": "Guardiola set for Liverpool challenge to turn Manchester City's fate aroundManchester City's form slump turned their clash with in-form Liverpool into a decisive test for Pep Guardiola, whose job security and title hopes now rest on reversing a six-game winless streak against the Premier League leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gautam-gambhir-stint-india-coach-should-not-be-judged-too-soon-ajay-jadeja-2642982-2024-12-01",
      "headline": "Don't judge Gautam Gambhir's performance as India coach yet: Ajay JadejaFormer India batsman Ajay Jadeja believes it is premature to criticise Gautam Gambhir's effectiveness as India coach because he has only been in the position for six months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-josh-hazlewood-miss-impact-day-night-adelaide-test-2642937-2024-12-01",
      "headline": "Why Australia will miss Josh Hazlewood badly in Adelaide Test  Border-Gavaskar Trophy: Fast bowler Josh Hazlewood played a crucial role for Australia in the Day-Night Tests, but would not be a part of their setup against India at the Adelaide Oval. Will Australia miss Hazlewood in the Adelaide Test?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/barcelona-vs-las-palmas-hansi-flick-slams-disconnected-team-after-1-2-loss-2642992-2024-12-01",
      "headline": "Barcelona vs Las Palmas: Hansi Flick slams disconnected team after 1-2 lossFC Barcelona head coach Hansi Flick accepted that his team is going through a form slump. Speaking after their loss vs Las Palmas, Flick said that his team looked disconnected in transitions and played a very bad game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-vs-liverpool-pep-guardiola-test-arne-slot-anfield-premier-league-top-of-the-table-2642940-2024-12-01",
      "headline": "Guardiola set for Liverpool challenge to turn Manchester City's fate aroundManchester City's form slump turned their clash with in-form Liverpool into a decisive test for Pep Guardiola, whose job security and title hopes now rest on reversing a six-game winless streak against the Premier League leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gautam-gambhir-stint-india-coach-should-not-be-judged-too-soon-ajay-jadeja-2642982-2024-12-01",
      "headline": "Don't judge Gautam Gambhir's performance as India coach yet: Ajay JadejaFormer India batsman Ajay Jadeja believes it is premature to criticise Gautam Gambhir's effectiveness as India coach because he has only been in the position for six months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-ind-vs-aus-r-ashwin-ravindra-jadeja-pujara-2642973-2024-12-01",
      "headline": "India will never get someone as good as Jadeja or R Ashwin: PujaraIndia do not have a replacement for Ravichandran Ashwin and Ravindra Jadeja, said Cheteshwar Pujara. Pujara called the duo legends of the game and said that they have contributed a lot to the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-joe-root-most-runs-4th-innings-sachin-tendulkar-test-record-2642969-2024-12-01",
      "headline": "Joe Root breaks Sachin Tendulkar's 4th innings Test record in ChristchurchStar batter Joe Root surpassed Indian legend Sachin Tendulkar to become the highest run-scorer in the fourth innings of Test cricket. Root achieved this milestone during England's dominant eight-wicket victory over New Zealand in the first Test at Hagley Oval.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-pms-xi-2642970-2024-12-01",
      "headline": "IND vs AUS PM's XI Live: KL Rahul-Jaiswal get India off to a strong startIndia (IND) vs Australia (AUS) Prime Minister's XI warm-up game Live Updates: KL Rahul and Yashavi Jaiswal have come out to open for India in the chase vs Prime Minister's XI. Earlier, the hosts were bowled out for 240 in 43.1 overs as Harshit Rana picked up 4/44 in six overs. Akash Deep also picked up 2/58 in ten overs. Sam Konstas scored 107 while Hanno Jacobs also scored a crucial half century for PM's XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/1st-test-england-beat-new-zealand-carse-bethell-brook-christchurch-2642964-2024-12-01",
      "headline": "1st Test: Carse 10-wicket haul, Bethell fifty helps England beat New ZealandEngland chased down their 104 victory target on the fourth day of the first Test against New Zealand on Sunday to claim a convincing eight-wicket victory and take a 1-0 lead in the three-match series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}