{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-turns-to-barter-trade-to-dodge-sanctions-swaps-grain-for-chinese-cars-2787713-2025-09-15",
      "headline": "Russia turns to barter trade to dodge sanctions, swaps grain for Chinese carsEven as Russia builds warm ties with China and India, the return of barter shows just how far the war in Ukraine has distorted trading relationships for the world's biggest producer of natural resources, three decades after the 1991 collapse of the Soviet Union ushered in Russian economic integration with the West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/last-chance-to-file-itr-2025-step-by-step-online-filing-process-explained-2787567-2025-09-15",
      "headline": "Last chance to file ITR 2025: Step-by-step online filing process explainedThe clock is ticking! Today is the final chance for taxpayers to file their ITR for AY 2025–26. Missing the deadline could mean penalties. Here's a quick guide to file online before midnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-coming-to-table-trump-aide-navarrros-big-claim-day-ahead-of-trade-talks-in-delhi-2787651-2025-09-15",
      "headline": "India coming to table: Trump aide Navarro's big claim ahead of Delhi trade talksIndia and the US will hold fast-tracked trade talks in New Delhi on Tuesday after White House trade adviser Peter Navarro said India is \"coming to the table,\" weeks after Washington imposed tariffs on Indian exports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-close-cautious-ahead-of-us-fed-meet-gst-20-seen-as-growth-trigger-2787628-2025-09-15",
      "headline": "Markets close flat ahead of US Fed meet, GST 2.0 driving consumption boostA cautious session kept Indian equities flat, with investors eyeing the US Fed's decision. Experts, however, expect GST 2.0 reforms to drive domestic consumption and benefit core sectors such as FMCG and banking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-119-points-lower-nifty-below-25100-titan-down-1-percent-2787607-2025-09-15",
      "headline": "Sensex ends 119 points lower, Nifty below 25,100; Titan down 1%The S&P BSE Sensex was down by 118.96 points to end at 81,785.74, while the NSE Nifty50 lost 44.80 points to end at 25,069.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-extension-glitch-income-tax-portal-what-to-do-september-15-2787597-2025-09-15",
      "headline": "Income tax portal faces glitch on last day of ITR filing. Here's what to doAs the September 15, 2025 deadline ticks away, users have been facing serious issues like very slow page loading, errors in uploading forms, and repeated system failures while submitting their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-gen-z-is-changing-money-habits-explains-financial-advisor-2787518-2025-09-15",
      "headline": "How Gen-Z is changing money habits, explains financial advisorGen-Z is shaking up traditional money habits. From saving to investing and spending on experiences, this generation is rewriting the rules of wealth. A financial advisor explains how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-relief-insurance-policyholders-tax-cut-benefit-hospital-bills-2787519-2025-09-15",
      "headline": "Can GST relief on insurance turn first-time buyers into long-term policyholders?For millions of families who hesitated to buy insurance because of the extra tax burden, the recent GST reforms could be a turning point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2025-deadline-know-penalties-and-benefits-you-lose-for-missing-the-due-date-2787482-2025-09-15",
      "headline": "ITR 2025 deadline: Know penalties and benefits you lose for missing the due dateThe deadline to file Income Tax Returns (ITR) for 2025 is here, and missing it can cost more than just a late fee. From penalties to lost tax perks, here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-deadline-today-september-15-how-much-to-pay-and-penalty-for-delay-2787458-2025-09-15",
      "headline": "Advance tax deadline today: How much to pay and penalty for delayThe second instalment of advance tax for financial year 2026 is due on 15 September. Here's what individuals need to pay, who is liable, and the consequences of missing the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/value-stocks-to-buy-on-dalal-street-top-picks-auto-psu-railways-nbfc-bajaj-finance-2787450-2025-09-15",
      "headline": "Looking for value-based stocks to buy on Dalal Street? Here are the top picksExperts believe the current market offers good opportunities, especially in sectors that have seen recent corrections and are expected to benefit from domestic demand, GST reforms, and a good monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-completes-ustaad-bhagat-singh-shoot-makers-release-video-2787749-2025-09-15",
      "headline": "Pawan Kalyan completes Ustaad Bhagat Singh shoot, makers release videoPawan Kalyan wrapped his portions for the much-anticipated action entertainer 'Ustaad Bhagat Singh', with the makers releasing a celebratory video from the set. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-slams-actors-for-making-producers-pay-for-trainers-cooks-live-kitchen-2787718-2025-09-15",
      "headline": "Aamir Khan slams actors for making producers pay for trainers and cooksActor Aamir Khan, who is also a producer, has opened up about a trend that he finds extremely strange and unfair. He called out actors who ask producers to pay for personal staff and luxuries in a recent interview. 'When will this stop?', he quipped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tesher-reacts-jalebi-baby-replaces-pakistan-anthem-during-asia-cup-2025-match-2787727-2025-09-15",
      "headline": "Rapper Tesher reacts as Jalebi Baby replaces Pakistan anthem during Asia Cup matchIndia vs Pakistan Asia Cup match in Dubai turned into a talking point after Tesher's hit song 'Jalebi Baby' was accidentally played instead of Pakistan's national anthem, creating a viral moment on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-shares-hera-pheri-3-shoot-update-talks-bond-with-priyadarshan-2787700-2025-09-15",
      "headline": "Paresh Rawal shares Hera Pheri 3 shoot update, talks bond with PriyadarshanParesh Rawal has confirmed his return to 'Hera Pheri 3', reuniting with Akshay Kumar and Suniel Shetty, with filming set to begin early next year. The actor addressed his earlier exit, saying he returned the signing amount with interest and maintained a strong bond with director Priyadarshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-reacts-fans-calling-deserving-national-award-shah-rukh-khan-2787729-2025-09-15",
      "headline": "Manoj Bajpayee reacts to fans calling him more deserving of National Award than SRKActor Manoj Bajpayee, in an exclusive interview, spoke about losing the National Award to Shah Rukh Khan. He dismissed the entire debate as a 'loser conversation.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nagma-mirajkars-eviction-from-bigg-boss-19-is-a-lesson-for-influencers-2787673-2025-09-15",
      "headline": "Nagma Mirajkar's eviction from Bigg Boss 19 is a lesson for influencersHaving a massive social media following is not a sure-shot guarantee of success in 'Bigg Boss 19' or in life. The eviction of Nagma Mirajkar, who has over 8 million Instagram followers, is proof of that. Here's how her eviction is a lesson for influencers aspiring to come on the reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/composer-gv-prakash-on-turning-down-raayan-role-wont-betray-dhanush-even-in-films-2787696-2025-09-15",
      "headline": "Composer GV Prakash on turning down Raayan role: Won't betray Dhanush even in filmsGV Prakash, who has scored several of Dhanush's films, revealed he turned down a key role in the actor-director's third outing, 'Raayan'. The two are now awaiting the release of 'Idli Kadai'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-birthday-emotional-post-son-aarav-bhatia-is-proud-sidekick-moment-for-star-father-2787685-2025-09-15",
      "headline": "Akshay Kumar's son Aarav turning 23 is a proud sidekick moment for star fatherAkshay Kumar celebrated his son Aarav's 23rd birthday with a special note on Instagram. The actor reflected on fatherhood and his son's growth. Kumar is currently promoting 'Jolly LLB 3', set for release on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lily-collins-new-york-fashion-week-health-debate-2787654-2025-09-15",
      "headline": "Emily In Paris' Lily Collins flaunts flat abs, leaves Internet worried about healthLily Collins' appearance at New York Fashion Week has sparked debate about her health. While a section of fans complimented her flat abs, others pointed out that she looks 'unhealthy'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-emotional-message-flood-victims-punjab-watch-2787669-2025-09-15",
      "headline": "Badshah's emotional message for flood victims in Punjab. WatchRapper Badshah sent a powerful message to flood victims in Punjab. He paused to address the crisis and how the state will bounce back soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/real-kashmir-football-club-zeeshan-ayyub-manav-kaul-lead-inspiring-sports-drama-2787630-2025-09-15",
      "headline": "Real Kashmir Football Club: Zeeshan Ayyub-Manav Kaul lead inspiring sports dramaActors Zeeshan Ayyub and Manav Kaul star in 'Real Kashmir Football Club', a series inspired by the true story of Kashmir's first professional football team. The show highlights resilience, teamwork, and passion as two men and a group of rookies chase their sporting dreams against the odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-wrong-paris-review-this-love-story-is-glossy-cheeky-and-worth-the-ride-2787455-2025-09-15",
      "headline": "The Wrong Paris review: This love story is glossy, cheeky, and worth the rideRelease Date:Fri Sep 12, 2025'The Wrong Paris', starring Miranda Cosgrove, Pierson Fode, is currently streaming on Netflix. Is the one-hour, 49-minute movie worth a watch? This review is all you need to find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-son-linga-dance-heartfelt-moment-idli-kadai-audio-launch-event-2787608-2025-09-15",
      "headline": "Dhanush dances with son Linga, enjoys heartfelt moment at Idli Kadai event. WatchDhanush and his youngest son, Linga, danced on stage at the 'Idli Kadai' audio launch in Chennai. The actor-director performed a song with composer GV Prakash on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-calls-yogita-bihani-a-worthy-bahu-after-her-stunning-new-look-2787583-2025-09-15",
      "headline": "Archana Puran Singh calls Yogita Bihani a worthy bahu after her stunning new lookAaryamann Sethi's family celebrated in style as fiancee Yogita Bihani debuted a trendy haircut, triggering playful banter and glowing praise from parents Archana Puran Singh and Parmeet Sethi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-shinchan-became-india-most-loved-naughty-cartoon-japanese-cartoon-2787540-2025-09-15",
      "headline": "How Shinchan became India's most loved naughty Japanese cartoonFrom banned cartoon to cultural icon, here's why 'Shinchan' still makes Indian viewers laugh, relate and rewind after two decades on TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-cameo-kd-the-devil-dhruva-sarja-sanjay-dutt-2787531-2025-09-15",
      "headline": "Kichcha Sudeep will appear in a cameo in KD The Devil, makers confirmKannada star Kichcha Sudeep will be seen in a guest appearance in the upcoming film 'KD: The Devil', which stars Dhruva Sarja and Sanjay Dutt. The film, directed by Prem, features an ensemble cast and the announcement was made by KVN Productions onsocial media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/too-much-with-kajol-twinkle-khanna-trailer-salman-khan-karan-johar-2787541-2025-09-15",
      "headline": "Too Much trailer: Kajol, Twinkle Khanna bring Bollywood's wild side backAre you ready for another celebrity chat show? If yes, then 'Too Much with Kajol and Twinkle Khanna' should be on your watchlist. Here's why?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/selena-gomez-upset-only-murders-in-the-building-gets-emmy-2025-snub-2787505-2025-09-15",
      "headline": "Selena Gomez upset as Only Murders in the Building gets Emmy 2025 snubSelena Gomez made her first red carpet appearance with fiance Benny Blanco at the 2025 Emmys. The couple shared sweet moments as her show missed out on a win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-actor-teja-sajja-names-srk-as-dream-collaborator-discusses-new-project-2787548-2025-09-15",
      "headline": "Mirai actor Teja Sajja names SRK as dream collaborator, discusses new projectTelugu actor Teja Sajja expressed interest in Hindi cinema while choosing to stay based in Hyderabad. In an exclusive interview with India Today, he praised dubbed films and hopes to work with Shah Rukh Khan in future projects."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/when-bihar-progresses-congress-and-rjd-get-busy-insulting-the-state-pm-modi-rips-into-bidi-bihar-remark-2787694-2025-09-15",
      "headline": "When Bihar progresses, Congress, RJD insult state: PM slams 'bidi-Bihar' remarkAddressing a rally in Purnea, PM Modi hit out at RJD and Congress, saying that the opposition parties start heaping insults on Bihar as soon as the state shows signs of progress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-fire-official-handshake-controversy-vs-india-asia-cup-2787723-2025-09-15",
      "headline": "Pakistan suspends top official, cites failure to act on handshake row: SourcesThe PCB has reportedly suspended its Director of International Cricket Operations following Pakistan's loss to India in the 2025 Asia Cup, citing his failure to address the handshake controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deal-reached-with-china-on-company-people-want-to-save-trump-hints-on-tiktok-deal-2787732-2025-09-15",
      "headline": "Trump hints at TikTok deal with China, says young people will be very happyUS President Donald Trump hinted that a deal has been reached to resolve TikTok's ownership issues and will discuss details with Chinese President Xi Jinping on Friday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bmw-driver-took-finance-ministry-official-to-own-hospital-20-km-away-victims-son-2787517-2025-09-15",
      "headline": "BMW driver took my husband to hospital 19 km away despite appeals: Victim's wifeThe victim, Navjot Singh, Deputy Secretary in the Department of Economic Affairs, was returning from Bangla Sahib Gurdwara with his wife Sandeep Kaur on Sunday afternoon when their motorcycle was hit by a speeding BMW near Dhaula Kuan on Ring Road. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-launched-at-rs-1050-lakh-arenas-new-flagship-suv-2787693-2025-09-15",
      "headline": "Maruti Suzuki Victoris launched at Rs 10.50 lakh, Arena's new flagship SUVMaruti Suzuki has launched the Victoris at Rs 10.50 lakh, a new flagship mid-size SUV in its Arena lineup, combining advanced features, multiple powertrains, and top-notch safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-coming-to-table-trump-aide-navarrros-big-claim-day-ahead-of-trade-talks-in-delhi-2787651-2025-09-15",
      "headline": "India coming to table: Trump aide Navarro's big claim ahead of Delhi trade talksIndia and the US will hold fast-tracked trade talks in New Delhi on Tuesday after White House trade adviser Peter Navarro said India is \"coming to the table,\" weeks after Washington imposed tariffs on Indian exports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-amoebic-meningoencephalitis-brain-eating-amoeba67-cases-18-deaths-revised-figures-2787603-2025-09-15",
      "headline": "Kerala confirms 67 brain-eating amoeba cases, 18 deaths so far this yearKerala has confirmed 67 cases and 18 deaths due to brain-eating amoeba this year, according to revised figures. Health Minister Veena George prompted urgent water safety and preventive measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/deadline-september-20-why-mapping-bengals-voters-is-a-race-against-time-2786444-2025-09-12",
      "headline": "Deadline September 20, why mapping Bengal's voters is a race against timeThe EC's Special Intensive Revision, tallying 2002 and 2025 rolls, is daunting as West Bengal has 75,000-80,000 booths, with the number set to rise this year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-cricket-asia-cup-drama-handshake-2787586-2025-09-15",
      "headline": "The lost handshake: Theatrics and optics beat cricket at Asia CupThe Indian cricket team's refusal to shake hands with Pakistan after their Asia Cup turned the spotlight away from the game, forcing fans and players alike to confront the uneasy intersection of politics and play. The question remains: at what cost?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-marathon-race-finish-video-2787571-2025-09-15",
      "headline": "Greatest-ever finish in marathon? World Athletics Championship race stuns fansWorld Athletics Championships: Was it a marathon or 100m sprint? Photo-finish at the men's event leaves fans stunned in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/will-scrap-bihar-sir-exercise-if-any-illegality-found-in-election-commissions-methodology-supreme-court-2787576-2025-09-15",
      "headline": "Will scrap Bihar SIR exercise if...: Supreme Court's big warning to poll panelThe Supreme Court warned it will scrap Bihar's electoral roll revision if any illegality is detected, while setting October 7 for final arguments on the Election Commission's contested methodology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-ravi-floods-lahore-after-40-years-indus-waters-treaty-iwt-history-pakistan-punjab-badshahi-mosque-2787553-2025-09-15",
      "headline": "India's Ravi floods Lahore after 40 years amid Indus treaty suspensionThe River Ravi returned to Lahore after almost 40 years, causing severe floods, and reminding the Pakistani city of its historical connection to the river. The floods of August and September exposed vulnerabilities from unchecked urban development and ecological neglect. This came even as India kept the Indus Waters Treaty in abeyance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/new-pixel-and-iphone-are-here-so-is-the-beginning-of-an-end-for-smartphones-2787476-2025-09-15",
      "headline": "New Pixel and iPhone are here, so is the beginning of an end for smartphonesAfter close to 20 years of glorious run, smartphones as technology have become stagnant and are ripe to be replaced with something else. At least that is the impression the latest Google Pixels and Apple iPhones offer given how incremental they are with their updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-smokes-inside-ac-coach-passengers-confront-her-in-viral-video-2787695-2025-09-15",
      "headline": "Woman smokes inside AC coach, passengers confront her in viral videoA video of a woman smoking inside an AC train coach and arguing with co-passengers has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-leaders-condemn-centre-advisory-barring-sikh-pilgrimages-to-pakistan-amid-cricket-ties-2787716-2025-09-15",
      "headline": "Double standards: Punjab uproar over Sikh pilgrimage ban amid cricket resumptionAn advisory restricting Sikh pilgrimage groups from visiting Pakistan for Guru Nanak Dev Ji's Prakash Purab has drawn sharp criticism from Punjab leaders, raising concerns over religious freedom, especially when the restriction coincides with the resumption of sporting ties between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-migration-protesters-unite-the-kingdom-rally-uk-enjoy-food-spices-brought-indian-afghan-street-food-london-tommy-robinson-2787580-2025-09-15",
      "headline": "Anti-immigrant UK protesters surrender to Indian bhajia loveAround 1.5 lakh protesters gathered in London on Saturday for the 'Unite the Kingdom' anti-immigration rally. But amid the chants to \"reclaim the country\", some demonstrators took a pause to grab some Indian street food, sparking online debate about their contradicting stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/india-engineering-education-innovation-employability-challenges-ai-upskilling-2787624-2025-09-15",
      "headline": "India produces the most engineers in the world, but where are the Innovators?India produces millions of engineering graduates yearly but struggles with innovation and employability. Systemic reforms and stronger industry ties are needed to harness this potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/your-zodiac-sign-has-changed-the-calendar-is-2000-years-out-of-date-2787600-2025-09-15",
      "headline": "Your zodiac sign is out of date by 2,000 years. Here's the scienceModern astronomy tools show that many people's true astronomical sign could differ from their familiar zodiac sign by several days or even an entirely different sign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-pcb-match-referee-removal-pycroft-mohsin-naqvi-2787604-2025-09-15",
      "headline": "Pakistan demands removal of match referee after India's handshake snubAsia Cup: Pakistan Cricket Board has demanded the removal of match referee Andy Pycroft, alleging violation of ICC Code of Conduct in match against India. The controversy erupted after Indian players refused to shake hands with the Pakistan side."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-extension-glitch-income-tax-portal-what-to-do-september-15-2787597-2025-09-15",
      "headline": "Income tax portal faces glitch on last day of ITR filing. Here's what to doAs the September 15, 2025 deadline ticks away, users have been facing serious issues like very slow page loading, errors in uploading forms, and repeated system failures while submitting their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-earthquake-nagaon-hospital-nurses-shield-newborns-cctv-footage-viral-2787340-2025-09-15",
      "headline": "Caught on CCTV: Brave nurses in Assam hospital shield babies during strong quakeThe CCTV footage was captured at around 4.40 pm in the Aditya Nursing Home, Nagaon, showing the two nurses immediately coming to the aid of the babies as the earthquake struck. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/r-vaishali-wins-fide-womens-grand-swiss-qualifies-for-candidates-2787728-2025-09-15",
      "headline": "R Vaishali wins Women's Grand Swiss for 2nd consecutive time, qualifies for CandidatesGrand Swiss 2025: R Vaishali of India scripted history by becoming the first player to defend her title in the prestigious tournament. With her win, the Chennai Grandmaster also secured her place in the Candidates next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indians-in-uk-are-patriotic-british-journalist-andre-gold-viral-post-amid-anti-immigration-stir-2787543-2025-09-15",
      "headline": "Indians in UK are patriotic: British journalist's viral post amid anti-immigration stirBritish journalist Andrew Gold wrote about his encounter with an Indian restaurant owner, which led him to say that Indians in the UK are patriotic. The post comes after London witnessed its largest-ever protests against immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-cm-siddaramaiah-if-there-was-equality-in-hinduism-why-would-anyone-convert-christianity-islam-bjp-conversion-2787542-2025-09-15",
      "headline": "Why would anyone convert if Hinduism had equality: Siddaramaiah's remarks draw ireKarnataka Chief Minister Siddaramaiah's remark on Hinduism and conversions triggered a political storm, with Opposition leaders, including R Ashoka and Chalavadi Narayanswamy, accusing him of dividing communities and pursuing political gains."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-avoids-handshake-pakistan-captain-asia-cup-2025-2787764-2025-09-15",
      "headline": "Asia Cup: Suryakumar Yadav to continue Pakistan handshake snub, say sourcesIndia captain Suryakumar Yadav will continue to avoid shaking hands with Pakistan captain Salman Ali Agha in Asia Cup 2025. The two teams are likely to meet in the Super 4s stage on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-no-handshake-pakistan-skip-presentation-ceremony-sunil-gavaskar-reaction-2787755-2025-09-15",
      "headline": "Sunil Gavaskar on handshake snub: Pakistan skipping ceremony made no differenceFormer India captain Sunil Gavaskar downplayed the controversy over no handshakes after India's Asia Cup win against Pakistan, saying that Pakistan captain Salman Ali Agha's absence from the presentation ceremony did not make any difference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-suryakumar-yadav-no-handshake-vs-pak-asia-cup-2025-2787744-2025-09-15",
      "headline": "Sourav Ganguly hails India's 'no handshake' call vs Pakistan: Terror must stopSourav Ganguly praised India captain Suryakumar Yadav's decision to not shake hands with Pakistan players during the Asia Cup 2025 fixture. India skipper snubbed handshakes with his Pakistan counterpart and dedicated the win to Pahalgam terrorist attack victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-axar-lead-india-to-asia-cup-2025-win-over-pakistan-2787741-2025-09-15",
      "headline": "Axar Patel wins dressing room's impact player award for all-round heroicsStar all-rounder Axar Patel was named the Indian dressing room's Impact Player after his all-round heroics powered India to a commanding win over Pakistan in their Asia Cup group-stage clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/r-vaishali-wins-fide-womens-grand-swiss-qualifies-for-candidates-2787728-2025-09-15",
      "headline": "R Vaishali wins Women's Grand Swiss for 2nd consecutive time, qualifies for CandidatesGrand Swiss 2025: R Vaishali of India scripted history by becoming the first player to defend her title in the prestigious tournament. With her win, the Chennai Grandmaster also secured her place in the Candidates next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-fire-official-handshake-controversy-vs-india-asia-cup-2787723-2025-09-15",
      "headline": "Pakistan suspends top official, cites failure to act on handshake row: SourcesThe PCB has reportedly suspended its Director of International Cricket Operations following Pakistan's loss to India in the 2025 Asia Cup, citing his failure to address the handshake controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-pcb-match-referee-removal-pycroft-mohsin-naqvi-2787604-2025-09-15",
      "headline": "Pakistan demands removal of match referee after India's handshake snubAsia Cup: Pakistan Cricket Board has demanded the removal of match referee Andy Pycroft, alleging violation of ICC Code of Conduct in match against India. The controversy erupted after Indian players refused to shake hands with the Pakistan side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-cricket-casual-contracts-allen-conway-williamson-t20-world-cup-2026-2787590-2025-09-15",
      "headline": "Kane Williamson among New Zealand players to sign casual deals for T20 World Cup 2026Five key New Zealand cricketers have signed casual contracts for the 2025-26 season. These agreements ensure their availability and support ahead of the ICC T20 World Cup in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-cricket-asia-cup-drama-handshake-2787586-2025-09-15",
      "headline": "The lost handshake: Theatrics and optics beat cricket at Asia CupThe Indian cricket team's refusal to shake hands with Pakistan after their Asia Cup turned the spotlight away from the game, forcing fans and players alike to confront the uneasy intersection of politics and play. The question remains: at what cost?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-fire-official-handshake-controversy-vs-india-asia-cup-2787723-2025-09-15",
      "headline": "Pakistan suspends top official, cites failure to act on handshake row: SourcesThe PCB has reportedly suspended its Director of International Cricket Operations following Pakistan's loss to India in the 2025 Asia Cup, citing his failure to address the handshake controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-pcb-match-referee-removal-pycroft-mohsin-naqvi-2787604-2025-09-15",
      "headline": "Pakistan demands removal of match referee after India's handshake snubAsia Cup: Pakistan Cricket Board has demanded the removal of match referee Andy Pycroft, alleging violation of ICC Code of Conduct in match against India. The controversy erupted after Indian players refused to shake hands with the Pakistan side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-cricket-casual-contracts-allen-conway-williamson-t20-world-cup-2026-2787590-2025-09-15",
      "headline": "Kane Williamson among New Zealand players to sign casual deals for T20 World Cup 2026Five key New Zealand cricketers have signed casual contracts for the 2025-26 season. These agreements ensure their availability and support ahead of the ICC T20 World Cup in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-cricket-asia-cup-drama-handshake-2787586-2025-09-15",
      "headline": "The lost handshake: Theatrics and optics beat cricket at Asia CupThe Indian cricket team's refusal to shake hands with Pakistan after their Asia Cup turned the spotlight away from the game, forcing fans and players alike to confront the uneasy intersection of politics and play. The question remains: at what cost?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}