{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-5-key-things-to-know-before-investing-price-band-lot-size-2713378-2025-04-23",
      "headline": "Ather Energy IPO: 5 key things to know before investingAther Energy's IPO will open for public subscription on Monday, April 28, 2025 and will close on April, 30, 2025, while anchor investors will get their allotment on April, 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-to-cut-time-at-doge-may-tesla-profit-falls-71-percent-protest-us-tariff-china-trade-2713341-2025-04-23",
      "headline": "Elon Musk says he'll spend 'less time at DOGE' as Tesla profits fall 71%DOGE, a government body aimed at cutting public spending, has been a major focus for Musk over the past several months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forgot-to-declare-your-tax-regime-choice-to-employer-here-what-happens-2713335-2025-04-23",
      "headline": "Forgot to declare your tax regime choice to employer? Here's what happensIf the old regime is better for you, and you have invested heavily under Section 80C, but don't inform your employer, more tax might be deducted from your salary during the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-operations-100-percent-tariff-anxiety-customers-cfo-vaibhav-taneja-earnings-call-2713329-2025-04-23",
      "headline": "'100% tariffs create anxiety': Tesla says still weighing when to enter IndiaTesla has lobbied India for years to cut its sky-high duties, with Elon Musk calling them among the steepest in the world. Despite no breakthrough yet, Tesla has recently leased showroom space and listed over two dozen job openings in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-ipo-plan-pause-public-listing-delay-amid-market-volatility-uncertainty-report-2713325-2025-04-23",
      "headline": "LG Electronics delays IPO amid market uncertainty: ReportThe South Korean company has told its advisers that it might postpone the IPO of its Indian unit. The reported pause in plans comes at a time when Dalal Street is seeing ups and downs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blusmart-hires-grant-thornton-for-forensic-audit-after-sebi-probe-2713306-2025-04-23",
      "headline": "BluSmart hires Grant Thornton for forensic audit after Sebi probe: ReportBluSmart, which operates over 8,000 EV taxis and has a strong presence in cities like Delhi, Mumbai, and Bengaluru, had to suspend services last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-issues-a-new-directive-for-banks-to-curb-digital-fraud-move-to-new-domain-by-october-2025-details-here-2713300-2025-04-23",
      "headline": "RBI issues a new directive for banks to curb digital fraud. Details hereTo fight online fraud, the RBI had earlier announced the plan to introduce exclusive domains for banks and financial institutions. Now, that plan is taking shape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-india-metro-cities-should-you-invest-insights-yellow-metal-rates-2713281-2025-04-23",
      "headline": "Gold price falls from all-time high. Check latest prices in IndiaGold prices had been rising earlier due to a weaker US dollar and ongoing trade tension between the United States and China. However, the sentiment changed after a more positive message from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-2025-e-pay-tax-feature-check-step-by-step-process-to-pay-tax-in-minutes-2713280-2025-04-23",
      "headline": "Income Tax 2025: Check step-by-step process to pay tax in minutesWhether you're a salaried individual, a business owner, or a freelancer, this digital facility helps with paying your taxes right from the comfort of your home, without the need to stand in long queues or fill out tedious forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-check-price-band-opening-date-gmp-key-details-2713256-2025-04-23",
      "headline": "Ather Energy IPO: Check opening date, price band and other key detailsAther Energy IPO: The subscription window will open on Monday, April 28, and close on Wednesday, April 30. Ahead of this, allocation to anchor investors is scheduled for Friday, April 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-share-price-jumps-q4-results-brokerage-views-buy-hold-or-sell-2713235-2025-04-23",
      "headline": "HCLTech shares jumps nearly 7% after Q4 results. Should you buy, hold or sell?The IT major reported a net profit of Rs 4,307 crore for Q4FY25, marking an 8% year-on-year increase. Revenue from operations rose 6% YoY to Rs 30,246 crore. Read to know if you should buy, sell, or hold the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-at-rs-4000-dollar-by-2026-jp-morgan-shares-view-2713228-2025-04-23",
      "headline": "Gold at $4,000 by next year? Here's what JP Morgan saysJP Morgan sees gold averaging $3,675 per ounce by the fourth quarter of 2025 and noted that prices could reach the $4,000 mark sooner if investor and central bank demand remains strong."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reacts-to-pahalgam-terror-attack-2713372-2025-04-23",
      "headline": "Not a tragedy we can move past: Priyanka Chopra mourns Pahalgam attack victimsPriyanka Chopra voiced her outrage over the recent terrorist attack in Pahalgam that claimed 26 lives, including two foreigners. She expressed her condolences to the grieving families and stated that the tragedy should shake human conscience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/15-years-on-dill-mill-gayye-creator-admits-armaan-riddhima-had-toxic-relationship-2713350-2025-04-23",
      "headline": "15 years on, Dill Mill Gayye creator admits Armaan-Riddhima had toxic relationship'Dill Mill Gayye' creator Siddharth P Malhotra spoke to us in an exclusive interview about the show's mass appeal, the possibility of having part two, and the sorry state of Hindi television today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-host-ramya-subramanian-slams-brand-for-ai-generated-voiceover-misuse-2713343-2025-04-23",
      "headline": "Tamil actor-host Ramya Subramanian slams brand for AI-generated voiceover misuseTamil actor, host and health coach Ramya Subramanian slammed a wellness brand for misusing her video with an AI-generated voiceover. She warned them of legal action over the unauthorised content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-opens-up-on-playing-age-appropriate-roles-ill-do-good-roles-as-i-get-older-2713290-2025-04-23",
      "headline": "Nani on playing age-appropriate roles: I'll do good roles as I get olderTelugu star Nani opened up about embracing age-appropriate roles while promoting 'HIT: The Third Case'. The actor said he looks forward to playing powerful characters like Amitabh Bachchan's 'Sarkar' as he grows older."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jyothika-was-first-choice-for-mohanlals-thudarum-before-shobana-says-director-2713332-2025-04-23",
      "headline": "Jyothika was first choice for Mohanlal's Thudarum before Shobana, says directorActor Mohanlal reunited with Shobana after two decades in 'Thudarum'. But director Tharun revealed that Jyothika was initially approached for the role, which didn't materialise due to date issues.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/thunderbolts-x-reactions-fans-call-it-one-of-the-best-mcu-films-by-a-landslide-2713324-2025-04-23",
      "headline": "Thunderbolts X reactions: Fans call it 'one of the best MCU films by a landslide'Marvel's 'Thunderbolts' received overwhelmingly positive early reviews, with audiences applauding its unique approach. The film's shift in tone and standout performances set it apart as a significant entry in the MCU."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-lil-uzi-vert-hospitalised-in-nyc-report-2713279-2025-04-23",
      "headline": "Rapper Lil Uzi Vert hospitalised in NYC: ReportRapper Lil Uzi Vert was hospitalised in New York City after emergency services responded to a call for a 'sick person,' as reported by TMZ."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mammootty-alia-bhatt-sunny-deol-more-celebs-rally-for-justice-after-pahalgam-attack-2713311-2025-04-23",
      "headline": "Mammootty, Alia, Sunny Deol, more celebs rally for justice after Pahalgam attackSeveral movie stars from across the country, including Alia Bhatt, Kareena Kapoor Khan, Allu Arjun, Nagarjuna Akkineni and Vicky Kaushal, among others, shared notes after the Pahalgam attack, tagging PM Modi and demanding justice for the victims. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-begins-shooting-for-rahul-dholakias-historical-political-drama-2713316-2025-04-23",
      "headline": "Saif Ali Khan begins shooting for Rahul Dholakia's historical political dramaDays ahead of the release of 'Jewel Thief', actor Saif Ali Khan has begun filming for his next film, a historical political drama. It is being directed by 'Raees' fame Rahul Dholakia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-half-brother-rahul-bhatt-says-she-is-paani-kam-chai-in-front-of-pooja-bhatt-2713276-2025-04-23",
      "headline": "Alia Bhatt's half-brother Rahul says she is 'paani kam chai' in front of PoojaRahul Bhatt, son of filmmaker Mahesh Bhatt, claimed that his half-sister Alia Bhatt's talent doesn't compare to that of Pooja Bhatt. He described Pooja as the most talented and morally grounded among them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-12-detailed-report-sunny-deol-film-rs-22-crore-away-from-rs-100-crore-2713274-2025-04-23",
      "headline": "Jaat box office Day 12: Sunny Deol's film Rs 22 crore away from Rs 100 croreSunny Deol's 'Jaat' has slowed down at the box office, but it is not out of the race. The film is slowly inching towards the benchmark of Rs 100 crore, but it will be interesting to see how long it takes to achieve the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-body-double-slammed-bollywood-rejected-war-2-over-low-remuneration-2713273-2025-04-23",
      "headline": "Jr NTR's body double slams Bollywood after rejecting War 2 over low remunerationJr NTR's body double, Eshwar Harris, revealed that he turned down 'War 2' after he was offered a meagre salary. He also slammed Bollywood for offering to pay less. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-reunites-with-omg-2-director-amit-rai-for-next-untitled-shooting-bihar-2713268-2025-04-23",
      "headline": "Pankaj Tripathi reunites with OMG 2 director Amit Rai for next untitledActor Pankaj Tripathi has reunited with 'OMG 2' director Amit Rai' for his next untitled. The shooting has begun in Bihar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-chitranshi-dhyani-reacts-to-emotional-cafe-video-gross-invasion-of-privacy-2713245-2025-04-23",
      "headline": "Gross invasion of privacy: Actor Chitranshi Dhyani reacts to emotional cafe videoActor Chitranshi Dhyani has condemned a serious breach of privacy after a private video capturing her in a vulnerable moment at a café surfaced online. She described the leak as a \"gross invasion of privacy.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-5-detailed-report-akshay-kumar-film-steady-on-weekdays-rs-50-crore-not-far-2713219-2025-04-23",
      "headline": "Kesari 2 box office Day 5: Akshay's film steady on weekdays, Rs 50 crore not farAkshay Kumar's 'Kesari Chapter 2' is doing decent business at the box office. The film's steady pace during the weekdays is a good sign of its future, with 'Jaat' still working well at the ticket window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-recreates-90s-magic-with-her-dance-on-le-gayi-le-gayi-watch-2713200-2025-04-23",
      "headline": "Karisma Kapoor recreates 90s magic with her dance on 'Le Gayi Le Gayi'. WatchActor Karisma Kapoor recreated 90s magic with her dance on 'Le Gayi Le Gayi' from the film, 'Dil Toh Pgal Hai'. A video from the event has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-demands-ruthless-action-for-pahalgam-attack-punish-them-for-7-lifetimes-2713208-2025-04-23",
      "headline": "Punish them for 7 lifetimes: Anupam Kher demands action for Pahalgam attackActor Anupam Kher, a Kashmiri, condemned the Pahalgam attack in a video on social media. A visibly emotional and furious Kher requested PM Modi and Amit Shah to not spare the terrorists this time. He called the attack beyond barbaric, and mentioned the wife of one of the victims, whose photo is going viral on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-film-body-shine-tom-chaco-warning-drug-use-misconduct-row-2713205-2025-04-23",
      "headline": "One last chance: Kerala film body warns Shine Tom Chacko amid misconduct rowThe Film Employees Federation of Kerala (FEFKA) issued a final warning to actor Shine Tom Chacko. He was accused of substance abuse and misconduct by fellow actor Vincy Aloshious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-nyweide-child-actor-in-noah-and-an-invisible-sign-dies-at-24-2713190-2025-04-23",
      "headline": "Sophie Nyweide, child actor in Noah and An Invisible Sign, dies at 24Actor Sophie Nyweide died on April 14, her family's obituary confirmed. Her family wrote that she self-medicated and refused to take medical help."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-sketches-of-terrorists-released-security-agencies-2713282-2025-04-23",
      "headline": "Photo of terrorists who killed 26 Pahalgam tourists releasedThe attackers, members of The Resistance Front - an offshoot of the banned terror group Lashkar-e-Taiba, opened fire on tourists in the popular Baisaran meadow, killing 26 and leaving several injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-vows-justice-pahalgam-victims-families-bharat-wont-bend-to-terror-2713380-2025-04-23",
      "headline": "Bharat won't bend to terror: Amit Shah assures families of Pahalgam victimsHome Minister Amit Shah laid floral wreaths on the bodies of the Pahalgam terror attack victims. He also met their families and assured them of justice."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorists-religion-hindu-targeted-kanpur-man-pune-businessman-recite-kalma-send-government-message-2713318-2025-04-23",
      "headline": "Pahalgam terrorists asked UP man to recite Islamic verse, shot him, then told wife...The terrorists asked if the couple were Muslim and demanded they recite the Kalma. When they failed to respond, they shot the husband. The wife pleaded to be killed too, but the gunmen refused."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahlgam-terror-attack-mastermind-saifullah-kasuri-abu-musa-trf-let-pakistan-jammu-kashmir-lashkar-e-taiba-2713287-2025-04-23",
      "headline": "Who's Pahalgam attack mastermind, who led the TRF strike? Explained in 5 pointsA group of terrorists opened fire on tourists in Pahalgam, Kashmir, on Tuesday, killing 26 people. While the group was reportedly led by Asif Fauji, Lashkar-e-Taiba's Saifullah Kasuri is believed to have planned the attack. The Resistance Front claimed responsibility for the attack. Here's all about Kasuri, Fauji and the TRF in five big points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-kashmir-full-list-of-victims-released-2713232-2025-04-23",
      "headline": "US-based techie, IAF official among 26 killed in attack. Who were the victims?Authorities have released the names of the victims who lost their lives in the Pahalgam terror attack, acknowledging for the first time that 26 were killed in the massacre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-terrorist-attack-video-shows-exact-moment-terrorists-attacked-tourists-in-jk-2713197-2025-04-23",
      "headline": "Mobile phone video captures moment terror struck meadows of PahalgamIndia Today has accessed the exact moment when terrorists belonging to The Resistance Front—an offshoot of proscribed terror group Lashkar-e-Taiba (LeT)—opened fire on tourists at the popular Baisaran meadow in Pahalgam on Tuesday afternoon, killing 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-comes-days-after-pak-army-chiefs-kashmir-our-jugular-vein-comment-2713371-2025-04-23",
      "headline": "Pahalgam attack comes days after Pak Army chief's 'Kashmir our jugular vein' commentThe Resistance Front (TRF), an offshoot of the banned Pakistan-based Lashkar-e-Taiba (LeT) terror group, claimed responsibility for the attack in a social media message."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/pahalgam-terror-attack-bengaluru-karnataka-man-wife-and-son-spared-trf-terrorists-jammu-kashmir-2713367-2025-04-23",
      "headline": "Kept shooting him for 3 minutes: Mother-in-law of Bengaluru man killed in PahalgamA resident of Karnataka's Bengaluru, Bharath Bhushan was shot dead in a terrorist attack in Jammu and Kashmir's Pahalgam after being asked his religion. The terrorists spared his wife and three-year-old son."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-kashmir-army-survivors-crying-viral-video-trf-lashkar-2713214-2025-04-23",
      "headline": "We're Indian Army, soldier assures as boy screams: Scenes of panic in PahalgamTerrified after being shot at by terrorists clad in camouflage, just like Army soldiers who arrived at the scene, some survivors began sobbing and pleading for their lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-jammu-kashmir-terror-attack-pm-modi-security-meeting-lashkar-trf-deaths-eyewitness-amit-shah-rahul-gandhi-2713170-2025-04-23",
      "headline": "Top Lashkar commander planned Pahalgam carnage that left 26 dead: SourcesThe Pahalgam attack, the biggest terror strike on civilians since the 26/11 attacks, occurred when terrorists dressed in fatigues opened fire on tourists in Baisaran meadow. Following the attack, PM Modi returned to Delhi to take stock of the situation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/exodus-of-guests-heartbreaking-omar-abdullah-as-tourists-leave-jk-after-attack-2713319-2025-04-23",
      "headline": "Exodus of guests heartbreaking: Omar Abdullah amid panic, scramble to leave J&KOmar Abdullah, reacting to the mass exodus of tourists from Jammu and Kashmir after the Pahalgam attack, said it was heartbreaking."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-jammu-and-kashmir-condolences-tourists-lives-concerned-pakistan-reaction-response-2713264-2025-04-23",
      "headline": "Concerned at tourist deaths, extend condolences: Pak reacts to Pahalgam attackResponding to media queries concerning the attack, the Pakistan Foreign Office said it is concerned at the loss of tourists' lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modis-plane-avoids-pak-airspace-while-returning-from-saudi-after-jk-attack-2713215-2025-04-23",
      "headline": "PM's plane used Pak airspace to Saudi, avoided it while returning after J&K attackPM Modi's plane avoided Pakistan airspace as he flew back to Delhi, cutting short his Saudi Arabia trip after the terror attack in J&K."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/were-ashamed-sorry-that-it-happened-in-kashmir-mehbooba-mufti-on-pahalgam-terror-attack-2713336-2025-04-23",
      "headline": "We're ashamed, sorry that it happened in Kashmir: Mehbooba Mufti on terror attackPDP chief Mehbooba Mufti stated that the Pahalgam attack was not only an act of terrorism against the people but also a direct assault on Kashmiriyat and their collective identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-terror-attack-india-today-on-ground-zero-exclusive-choppers-screen-meadow-where-terrorists-unleashed-horror-2713222-2025-04-23",
      "headline": "India Today in Pahalgam: Choppers screen meadow where terrorists unleashed horrorThe India Today team is the first media network to reach ground zero, a day after terrorists killed 26 people in Pahalgam's Baisaran. The video shows the exact place where the terror attack occurred on Tuesday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-plan-maximize-casualties-terrorists-bodycam-tourists-sniper-fire-baisaran-location-slow-response-2713238-2025-04-23",
      "headline": "Pahalgam attack: Terrorists wore body cams, segregated tourists, then shot themPreliminary probe revealed the terrorists chose Baisaran due to the absence of security forces, making rescue ops slow and casualties high. They wore helmet-mounted cameras and filmed the entire assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/kashmir-pahalgam-terror-attack-invisible-wounds-trauma-ptsd-survivors-guilt-2713345-2025-04-23",
      "headline": "Pahalgam terror attack: The invisible wounds of PTSD, survivor's guiltWhile the physical wounds of the injured are being treated after the Pahalgam terror attack, a deeper, less visible trauma lingers: the psychological impact on survivors, especially children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terror-attack-pahalgam-killed-injured-security-forces-terrorists-2712876-2025-04-22",
      "headline": "Live: Don't view Pahalgam terror attack through communal lens, says Mehbooba MuftiTerror Attack In Pahalgam Live Updates: In a rare terror attack on tourists in Jammu and Kashmir on Tuesday, 26 people died. Several tourists were also injured. Terrorists attacked a group of tourists visiting Baisaran valley in Pahalgam in Jammu and Kashmir, officials said. According to initial inputs, unidentified gunmen opened fire on the tourists who had gone for a trekking trip. Prime Minister Narendra Modi landed in Delhi this morning after cutting short his Saudi Arabia visit in view of the Pahalgam terrorist attack in Kashmir. He is likely to hold a Cabinet meeting today. Several top leaders have condemned the attack. Stay tuned with indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-hc-justices-mlas-in-srinagar-kashmir-during-pahalgam-tourist-attack-2713262-2025-04-23",
      "headline": "Kerala High Court judges, MLAs narrowly escape amid Kashmir terror attackThree High Court judges and four MLAs from Kerala had a narrow escape during a terror attack in Pahalgam, Kashmir, that claimed 26 lives, including a Malayali. All dignitaries were reported safe, and the state launched support measures for affected Malayalis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/pahalgam-terror-attack-chennai-tourist-eyewitness-account-gunshots-bodies-jammu-and-kashmir-let-pakistan-2713356-2025-04-23",
      "headline": "Heard five gunshots: Chennai tourist recounts narrow escape from Pahalgam attackA Chennai tourist recounts how she narrowly escaped the terror attack in Jammu and Kashmir's Pahalgam. She described what she witnessed and how she was taken to safety. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/endogamy-genetic-health-cardiac-diseases-abortions-marriage-within-communities-disorders-2712841-2025-04-23",
      "headline": "Is endogamy behind cardiac diseases, abortions, arthritis in Indians?Marrying within communities is prevalent in India, which has increased the risk of population-specific diseases. Educating people, encouraging them to undergo genetic screening, and government interventions are necessary to manage the rising genetic diseases."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-and-kashmir-first-image-one-of-terrorists-tourists-opened-fire-exclusive-2713184-2025-04-23",
      "headline": "Pahalgam massacre: First photo of terrorist wielding AK-47 surfaces after attackTwenty-six people were killed after terrorists opened fire on a group of tourists at Baisaran meadow in Jammu and Kashmir's Pahalgam at around 2:30 PM on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dgca-issues-advisory-as-internet-slams-airlines-for-hiked-fares-from-srinagar-2713330-2025-04-23",
      "headline": "DGCA issues advisory amid online complaints of high Srinagar air faresDGCA issued an advisory today urging airlines to boost frequency post-Pahalgam attack. The step comes after social media users slammed airlines for hiked fares from Srinagar to major cities across India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/flight-data-shows-pakistan-deploying-military-assets-to-bases-near-j-k-glbs-2713153-2025-04-23",
      "headline": "Has Pak deployed military assets to bases near J&K after Pahalgam attack?After the attack in Pahalgam, there is chatter on social media about Pakistan moving military aircraft to its bases in the north near Lahore and Rawalpindi. Several users have also posted screenshots from a flight tracking website showing the movement of PAF aircraft."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pole-vaulter-dev-meena-breaks-own-national-record-but-falls-short-of-asian-championships-qualifying-mark-2713370-2025-04-23",
      "headline": "Pole vaulter Dev Meena breaks national record at Federation Cup 2025Pole vaulter Dev Meena broke the national record for a second time this season but fell short of the Asian Championships qualifying mark of 5.51m set by the Athletics Federation of India (AFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-cant-give-any-more-excuses-says-ambati-rayudu-2713340-2025-04-23",
      "headline": "Rishabh Pant can't give any more excuses, needs to come up the order: Ambati RayuduFormer India cricketer turned commentator Ambati Rayudu has urged Rishabh Pant to come up the order and stop giving any excuses. Pant walked to bat at number seven against Delhi Capitals (DC) just for the second time in his IPL career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-lsg-captain-failures-explainer-2713320-2025-04-23",
      "headline": "Rishabh Pant under pressure: What's going wrong for LSG captain in IPL 2025?IPL 2025: Rishabh Pant has always thrived when high on confidence. But at LSG, he appears jaded and burdened. His body language tells the story — frustration, indecision, and hesitation. He's trying too hard and not backing his natural instincts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-cricket-with-pakistan-shreevats-goswamis-plea-to-bcci-after-pahalgam-attack-2713310-2025-04-23",
      "headline": "'No cricket with Pakistan': Shreevats Goswami's plea to BCCI after Pahalgam attackFormer Indian cricketer Shreevats Goswami has urged the BCCI (Board of Control for Cricket in India) to bring an end to all cricketing relations with Pakistan in the aftermath of the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-batting-no7-anil-kumble-2713303-2025-04-23",
      "headline": "Pant's frustration shows he was wronged by LSG management: Anil KumbleFormer India captain Anil Kumble questioned the decision to send Rishabh Pant to bat at No. 7, saying the LSG skipper's visible frustration showed he was wronged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-players-to-wear-black-armbands-pahalgam-terror-attack-2713265-2025-04-23",
      "headline": "IPL 2025: Players to wear black armbands to pay homage to Pahalgam attack victimsThe BCCI (Board of Control for Cricket in India) will be paying tribute to the victims of the Pahalgam terror attack during Match 41 of the Indian Premier League 2025 (IPL 2025) between Sunrisers Hyderabad and Mumbai Indians (MI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-beat-aston-villa-pep-guardiola-reaction-2713254-2025-04-23",
      "headline": "Manchester City beat Villa: Guardiola calls season bad despite UCL hopes aliveManchester City secured a late winner against Aston Villa to boost their hopes of Champions League qualification next season, but Pep Guardiola admitted the team has had a 'bad' season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/looking-forward-to-having-a-positive-2nd-half-to-our-season-srh-assistant-coach-simon-helmot-2713252-2025-04-23",
      "headline": "Looking forward to having a positive 2nd half to our season: SRH assistant coachSunrisers Hyderabad (SRH) assistant coach Simon Helmot is hoping for their team to make a turnaround in the second half of the Indian Premier League 2025 (IPL 2025). The Pat Cummins-led side is reeling at ninth spot with two wins from seven matches and will next take on Mumbai Indians in their home den. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-mi-mumbai-indians-batter-tilak-varma-press-conference-2713234-2025-04-23",
      "headline": "IPL 2025: MI always believed that we could turn things around, says Tilak VarmaMumbai Indians batter Tilak Varma said the MI dressing room remained confident of making a comeback despite a difficult start to the IPL 2025 season. Mumbai, who had lost four of their first five matches, have now won three in a row and appear to be gaining momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-srh-vs-mi-team-news-hyderabad-conditions-2713227-2025-04-23",
      "headline": "SRH vs MI: Hungry Hyderabad up for revenge against in-form MumbaiIPL 2025, SRH vs MI Prediction: Sunrisers Hyderabad (SRH) will take on Mumbai Indians (MI) in Match 41 of the Indian Premier League 2025 (IPL 2025) as they will be up for revenge against the five-time champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-beat-aston-villa-pep-guardiola-reaction-2713254-2025-04-23",
      "headline": "Manchester City beat Villa: Guardiola calls season bad despite UCL hopes aliveManchester City secured a late winner against Aston Villa to boost their hopes of Champions League qualification next season, but Pep Guardiola admitted the team has had a 'bad' season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/looking-forward-to-having-a-positive-2nd-half-to-our-season-srh-assistant-coach-simon-helmot-2713252-2025-04-23",
      "headline": "Looking forward to having a positive 2nd half to our season: SRH assistant coachSunrisers Hyderabad (SRH) assistant coach Simon Helmot is hoping for their team to make a turnaround in the second half of the Indian Premier League 2025 (IPL 2025). The Pat Cummins-led side is reeling at ninth spot with two wins from seven matches and will next take on Mumbai Indians in their home den. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-mi-mumbai-indians-batter-tilak-varma-press-conference-2713234-2025-04-23",
      "headline": "IPL 2025: MI always believed that we could turn things around, says Tilak VarmaMumbai Indians batter Tilak Varma said the MI dressing room remained confident of making a comeback despite a difficult start to the IPL 2025 season. Mumbai, who had lost four of their first five matches, have now won three in a row and appear to be gaining momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-srh-vs-mi-team-news-hyderabad-conditions-2713227-2025-04-23",
      "headline": "SRH vs MI: Hungry Hyderabad up for revenge against in-form MumbaiIPL 2025, SRH vs MI Prediction: Sunrisers Hyderabad (SRH) will take on Mumbai Indians (MI) in Match 41 of the Indian Premier League 2025 (IPL 2025) as they will be up for revenge against the five-time champions. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}