{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-canada-tensions-hit-trade-leaving-business-owners-in-a-bind-2622688-2024-10-24",
      "headline": "India-Canada tensions hit trade, leaving business owners in a bindTotal trade between both nations since 2021, was at roughly $6 billion, increased to $9 billion in 2022, but dropped to $8 billion in 2023 as per data from the consulate general of India on commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-mukesh-ambani-nvidia-jensen-huang-partner-to-build-large-scale-ai-infrastructure-in-india-2622561-2024-10-24",
      "headline": "Reliance, Nvidia partner to build large-scale AI infrastructure in IndiaThe partnership will see Reliance deploying Nvidia's latest GB 200 supercomputer technology to build a massive AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-date-expectations-double-investors-wealth-listing-over-rs-3000-latest-gmp-2622558-2024-10-24",
      "headline": "Waaree Energies IPO to double investors wealth? Here is what we knowWith the latest grey market premium (GMP) suggesting a sharp increase, Waaree Energies IPO is expected to deliver substantial returns to investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-fmcg-stocks-hul-nestle-india-top-losers-2622526-2024-10-24",
      "headline": "Sensex, Nifty end flat as FMCG stocks fall; HUL, Nestle India top losersThe S&P BSE Sensex was down 16.82 points to 80,065.16 at the closing bell, while the NSE Nifty50 ended 36.10 points lower at 24,399.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-platform-fee-hike-details-share-price-falls-q2fy25-results-brokerage-2622510-2024-10-24",
      "headline": "Not a rumour: Zomato clarifies on platform fee hike, shares tumble 4%In its statement, Zomato highlighted that the information about the fee hike was sourced directly from its public mobile application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nvidia-ceo-jensen-huang-ai-plans-in-india-making-ai-and-exporting-intelligence-2622492-2024-10-24",
      "headline": "Nvidia CEO's AI Plans in India: Making AI and exporting intelligenceHe pointed out that India possesses the crucial elements needed for AI development: data, energy resources, and infrastructure, that can be created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-aims-for-expanded-growth-in-india-through-new-partnerships-2622409-2024-10-24",
      "headline": "Nvidia CEO Jensen Huang aims for growth in India through new partnershipsIndia is seen as a key player in the AI market, with its population of 1.4 billion increasingly adopting AI across various sectors such as agriculture, education, and manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-share-allotment-status-multibagger-listing-gmp-key-details-2622393-2024-10-24",
      "headline": "Waaree Energies share allotment: GMP signals multibagger listing, details hereWaaree Energies IPO share allotment: The IPO was open for subscription from October 21 to October 23, offering shares within a fixed price range of Rs 1,427-1,503 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hindalco-industries-share-price-falls-7-percent-early-trade-today-explained-2622344-2024-10-24",
      "headline": "Explained: Why Hindalco shares plunged over 7% in early trade todayHindalco Industries share price: By around 12:38 am, shares of Hindalco Industries were trading at Rs 683.50, reflecting a 4.73% decrease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepak-builders-engineers-ipo-allotment-check-status-gmp-expected-listing-gains-2622334-2024-10-24",
      "headline": "Deepak Builders & Engineers IPO allotment: Check status, expected listing gainsDeepak Builders & Engineers allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-rally-outlook-in-near-term-foreign-brokerage-clsa-explains-expet-view-2622306-2024-10-24",
      "headline": "Zomato shares fall 2%: Here's what brokerage firm CLSA says Zomato recently received board approval for a qualified institutional placement (QIP) to raise up to $1 billion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kpit-technologies-shares-tank-10-percent-what-shoul-investors-do-buy-dip-expert-view-2622290-2024-10-24",
      "headline": "KPIT Technologies share price tanks 10%: Time to buy the dip?KPIT Technologies stock price: Analysts are concerned that the company's growth could settle closer to 18%, which indicates a slower pace compared to recent performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-nifty-foreign-investors-selling-pressure-2622282-2024-10-24",
      "headline": "Sensex, Nifty trade flat as FII selling pressure hurts investor sentimentsThe S&P BSE Sensex was up just 9.75 points at 90,091.73 at 10:20 am, while the NSE Nifty50 fell 7.25 points to trade at 24,428.25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hul-shares-drop-over-5-percent-after-weak-q2-results-what-should-investors-do-buy-sell-hold-2622267-2024-10-24",
      "headline": "HUL shares drop over 5% after weak Q2 results: Buy, sell, or hold?HUL's standalone net profit for Q2 FY25 dropped by 4% to Rs 2,612 crore, down from Rs 2,717 crore reported in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-allotment-online-guide-check-status-expected-listing-gains-gmp-2622249-2024-10-24",
      "headline": "Waaree Energies IPO allotment: Step-by-step guide to check statusWaaree Energies IPO allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wazirx-transfers-175-million-dollars-in-cypto-to-240000-lakh-wallets-many-linked-to-china-2622077-2024-10-23",
      "headline": "WazirX transfers $175 million in cypto to 2.40 lakh wallets, many linked to ChinaDespite WazirX's public claim of ending their contract with Liminal after the hack, they continued using Liminal's services for several months. Liminal also criticised WazirX for lacking transparency, contrasting it with Radiant Capital, which handled a similar incident more openly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fiis-indian-markets-exodus-china-stimulus-dalal-street-diwali-sparkle-2621958-2024-10-23",
      "headline": "Is China stealing Dalal Street's Diwali sparkle as foreign investors exit India?With Diwali around the corner, foreign investors are betting on China's stimulus and withdrawing from India. What does this FII exodus mean for the Indian stock market?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-erase-gains-volatility-dalal-street-2621863-2024-10-23",
      "headline": "Sensex, Nifty erase gains to end lower as volatility disrupts Dalal StreetThe S&P BSE Sensex ended 138.74 points lower at 80,081.98, while the NSE Nifty50 fell 36.60 points to 24,435.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-share-price-gains-today-brokerages-optimistic-about-growth-2621850-2024-10-23",
      "headline": "Hyundai Motor shares gain after weak listing. When is the right time to buy? Hyundai Motor India share price: Despite Hyundai Motor India's underwhelming market listing, several brokerages remain optimistic about the long-term prospects of the automaker, pointing to solid growth potential, both in domestic and export markets"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-gmp-rises-on-final-day-check-subscription-details-2621797-2024-10-23",
      "headline": "Waaree Energies IPO: GMP rises on final day, check subscription details Waaree Energies IPO: The grey market premium (GMP) for Waaree Energies suggests a potential listing gain of nearly 95%, with the company commanding a premium of Rs 1,415 in the unofficial market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/severe-cyclonic-storm-dana-starts-landfall-process-at-odisha-coast-2622860-2024-10-25",
      "headline": "Heavy rain batters Odisha coast, trees uprooted as Cyclone Dana makes landfall Live UpdatesThe coastal districts of Odisha continued to witness extremely heavy rain and gusty winds reaching speeds of 110 km/h as the severe cyclonic storm Dana made landfall after midnight on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-border-disengagement-standoff-eastern-ladakh-lac-deal-army-2622893-2024-10-25",
      "headline": "Disengagement begins in Ladakh days after India-China border breakthrough: SourcesA tent and several temporary structures have been removed from both sides of the India-China border. Indian soldiers are retreating to the west of the Charding Nala and Chinese soldiers are moving back to the east."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-vehicle-attack-soldiers-injured-gulmarg-jammu-kashmir-terrorists-2622736-2024-10-24",
      "headline": "2 civilians, 2 soldiers killed as terrorists attack Army vehicle in J&KAn Army vehicle was attacked by terrorists near Botpathri, which is 5 kilometres from the Line of Control (LOC)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/ajit-pawar-yugendra-in-baramati-maharashtra-polls-ncp-sharad-pawar-2622730-2024-10-24",
      "headline": "Sharad Pawar's grandnephew to take on uncle Ajit in BaramatiThe Nationalist Congress Party (SP) has announced the candidature of Yugendra Pawar against his uncle and Maharashtra Deputy Chief Minister Ajit Pawar from Baramati in the Maharashtra Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/nia-sharma-blasted-for-a-vaginal-tightening-pill-ad-is-it-even-safe-2622313-2024-10-25",
      "headline": "Nia Sharma blasted for a vaginal tightening pill ad. Is it even safe?With the focus on sexual wellness constantly increasing, vaginal tightening pills seem to be the new talk of the town. But are they worth considering? Here's what experts have to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/reliance-jio-cinema-disney-hotstar-merger-domain-url-anonymous-owner-interview-2622702-2024-10-24",
      "headline": "Meet the secret superstar who outsmarted Reliance and secured JioHotstar.com\"Registering the domain was a combination of luck and foresight. I discussed it with a few friends when I read about the buzz around a JioCinema and Hotstar merger. They scoffed at the idea. But I went ahead and registered it.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/justin-trudeau-canada-immigration-cut-temporary-housing-prices-economy-2622815-2024-10-24",
      "headline": "Justin Trudeau announces 'temporary' cut in intake of immigrants to CanadaCanadian Prime Minister Justin Trudeau announced a temporary reduction in immigration for the next two years to address economic and housing pressures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/cyclone-dana-trees-uprooted-structures-damaged-makes-landfall-odisha-2622917-2024-10-25",
      "headline": "Trees uprooted, structures damaged as Cyclone Dana makes landfall in OdishaCoastal districts of Odisha and parts of West Bengal were hit hard by Severe Cyclonic Storm Dana, which made landfall late Thursday night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/singer-bruce-springsteen-donald-trump-georgia-rally-kamala-harris-us-presidential-election-2622892-2024-10-25",
      "headline": "At Kamala Harris's rally, singer Bruce Springsteen calls Trump 'American tyrant'Singer Bruce Springsteen threw his weight behind Democratic presidential nominee Kamala Harris and slammed her Republican rival Donald Trump, calling him an \"American tyrant\", who \"did not understand this country\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-becomes-2nd-indian-after-viswanathan-anand-to-reach-2800-elo-rating-2622845-2024-10-24",
      "headline": "Arjun Erigaisi becomes 2nd Indian after Vishy Anand to reach 2800 Elo ratingIndia's Arjun Erigaisi became only the second Indian chess player after Viswanathan Anand to reach a live Elo rating of 2800. Erigaisi has been in tremendous form and recently played a huge part in India's historic gold in the Chess Olympiad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prithviraj-chavan-nana-patole-congress-list-maharashtra-assembly-elections-2622784-2024-10-24",
      "headline": "Prithviraj Chavan, Nana Patole in Congress's first list of 48 candidatesCongress on Thursday announced the first list with 48 candidates, which features senior leaders Nana Patole and Prithviraj Chavan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-wife-mridula-says-mother-in-law-hasnt-accepted-her-even-after-19-years-of-marriage-2622801-2024-10-24",
      "headline": "Pankaj Tripathi's wife says mother-in-law hasn't 'accepted' her even after yearsActor Pankaj Tripathi and his wife, Mridula, were still in school when they fell in love with each other. Their love story was not without some filmy drama and real struggles. Mridula talked about the same in an interview recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-sanjiv-khanna-chief-justice-of-india-dy-chandrachud-november-11-2622765-2024-10-24",
      "headline": "Justice Sanjiv Khanna is next Chief Justice of India, to take charge on Nov 11Justice Sanjiv Khanna will assume office as the 51st Chief Justice of India on November 11 and will have a term of nearly seven months till May 13, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/dy-chandrachud-relaxes-degree-requirement-supreme-court-accreditation-journalists-2622633-2024-10-24",
      "headline": "Now, you do not need a law degree to be a Supreme Court correspondentJournalists who do not have a legal background can now apply for accreditation as a Supreme Court correspondent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-dana-1600-pregnant-women-moves-health-centres-odisha-given-birth-chief-minister-mohan-charan-majhi-2622897-2024-10-25",
      "headline": "Cyclone Dana: 1,600 pregnant women moved to health centres in Odisha, give birthOdisha Chief Minister Mohan Charan Majhi reported that evacuees are currently staying in 6,008 cyclone shelters, where they are receiving food, medicine, water, and other essential supplies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-manu-bhaker-overcame-her-failures-at-tokyo-2020-2622621-2024-10-24",
      "headline": "How Manu Bhaker overcame her failures at Tokyo 2020For turnaround champion Manu Bhaker, Paris 2024 was more than about just Olympic medals, it was as much about exorcising the demons of Tokyo 2020"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/cyclone-dana-landfall-damage-trees-uprooted-severe-storm-havoc-parts-odisha-video-2622877-2024-10-25",
      "headline": "Watch: Trees uprooted as Cyclone Dana causes destruction in OdishaScenes of uprooted trees could be seen in a trail of destruction in Odisha's Dhamara as gusty winds and heavy rain continued to lash parts of the state following the landfall of Cyclone Dana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-war-room-chief-justice-of-india-dy-chandrachud-retirement-2622880-2024-10-25",
      "headline": "Supreme Court's War Room: Chief Justice of India's parting gift to nationIndia Today TV visited the War Room, which was set up under the supervision of Chief Justice of India DY Chandrachud and boasts state-of-the-art technology at its disposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-lifetime-leadership-ban-lifted-cricket-australia-2622895-2024-10-25",
      "headline": "David Warner's lifetime leadership ban lifted by Cricket AustraliaDavid Warner's lifetime ban on leadership after the ball-tampering scandal in the 2018 Cape Town Test against South Africa has been reversed. The review panel found that Warner had met all the criteria for the ban to be lifted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/2024-jharkhand-assembly-elections-how-bunty-and-babli-have-livened-up-jharkhands-poll-discourse-2622668-2024-10-24",
      "headline": "How Bunty and Babli have livened up Jharkhand's poll discourseThe con-artist couple of the 2005 Bollywood blockbuster have become a metaphor for both vile deception and superhit success ahead of the assembly polls"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/cyclone-dana-landfall-odisha-west-bengal-heavy-rain-violent-waves-purba-medinipur-2622864-2024-10-25",
      "headline": "Watch: Heavy rain, violent waves in Bengal's Purba Medinipur after Dana landfallHeavy rain, gusty winds of over 100 kilometres per hour and violent waves on the sea coast were witnessed in Purba Medinipur in West Bengal after severe cyclonic storm Dana made landfall in the early hours of Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/recalled-envoy-sanjay-verma-person-of-interest-nijjar-killing-india-canade-ties-2622686-2024-10-24",
      "headline": "Recalled envoy on how he found out he was 'person of interest' in Nijjar killingAmbassador Sanjay Kumar Verma spoke in detail about how he found himself declared a 'person of interest' in the killing of Khalistani terrorist Hardeep Singh Nijjar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-houston-rally-beyonce-knowles-appear-democratic-nominee-us-presidential-election-2622869-2024-10-25",
      "headline": "Singer Beyoncé to appear with Kamala Harris at Houston Democratic rally todayKamala Harris is appearing in Texas, a Republican stronghold, to support Democratic Senate candidate Colin Allred, who trails Republican Ted Cruz in the polls, and talk about abortion rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-pushpa-3-director-sukumar-end-credits-2622936-2024-10-25",
      "headline": "Allu Arjun to return for Pushpa 3? Wait for the end-credits, says producerAllu Arjun's long-pending Pushpa 2: The Rule is all set to release in theatres on December 5. The film's producer hinted at Pushpa 3 at the recently held press meet in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-emotional-cries-kanguva-event-2-and-half-years-since-my-theatrical-release-2622913-2024-10-25",
      "headline": "Suriya gets emotional at Kanguva event: Been 2 years since my theatrical releaseActor Suriya broke down at the Hyderabad pre-release event of his upcoming film, Kanguva. He thanked the Telugu audience for their overwhelming love for the re-release of his film, Surya S/O Krishnan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/justin-timberlake-postpones-forget-tomorrow-world-tour-health-issues-bronchitis-laryngitis-2622844-2024-10-24",
      "headline": "Singer Justin Timberlake postpones tour dates due to health issuesSinger Justin Timberlake has postponed six shows from his Forget Tomorrow World Tour to recover from bronchitis and laryngitis. He updated fans about his health with a post on social media. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fardeen-khan-transformation-shirtless-pics-hrithik-roshan-riteish-deshmukh-housefull-5-akshay-kumar-2622827-2024-10-24",
      "headline": "Fardeen Khan's stunning transformation gets Hrithik Roshan's seal of approvalActor Fardeen Khan posted pictures from the sets of Housefull 5 while flaunting his physical transformation. He received love from Hrithik Roshan and Riteish Deshmukh. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-dinesh-karthik-2622933-2024-10-25",
      "headline": "Rohit Sharma got out to a ball that he should not have: Karthik IND vs NZ: Dinesh Karthik said that Rohit Sharma shouldn't have got out in the manner he did against Tim Southee on Day 1 of the Pune Test against Tom Latham's New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/maria-sharapova-bryan-brothers-elected-into-tennis-hall-of-fame-2622915-2024-10-25",
      "headline": "Sharapova, American twin Bryan brothers elected into Tennis Hall of FameFive-time singles Grand Slam champion Maria Sharapova and American twins Bob and Mike Bryan were named to the International Tennis Hall of Fame's Class of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-sanjay-manjrekar-2622862-2024-10-25",
      "headline": "Rohit Sharma is temperamentally brilliant, but defence is a concern: ManjrekarIND vs NZ: Rohit Sharma failed to open his account in the first innings of the Pune Test after Tim Southee dismissed him. Sanjay Manjrekar praised Rohit for his temperament, but advised him to work on his defence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-test-form-concern-2622904-2024-10-25",
      "headline": "Intent vs Runs: Rohit Sharma's form a cause of concern for IndiaIndia captain Rohit Sharma's intent has been the focus throughout the country's home Test season in 2024. But with intent taking precedence over runs, is Rohit Sharma's form a point of concern ahead of the Australia series?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-jose-mourinho-red-card-fenerbahce-1-1-manchester-united-2622901-2024-10-25",
      "headline": "Jose Mourinho sent off as Fenerbahce hold Manchester United to drawJose Mourinho received a red card but his Fenerbahçe team still held his former club Manchester United to a 1-1 draw in the Europa League on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-lifetime-leadership-ban-lifted-cricket-australia-2622895-2024-10-25",
      "headline": "David Warner's lifetime leadership ban lifted by Cricket AustraliaDavid Warner's lifetime ban on leadership after the ball-tampering scandal in the 2018 Cape Town Test against South Africa has been reversed. The review panel found that Warner had met all the criteria for the ban to be lifted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-2nd-test-pune-luke-ronchi-press-conference-comments-2622855-2024-10-24",
      "headline": "Pune pitch caught batters off-guard: New Zealand assistant coach Luke RoonchiNew Zealand assistant coach Luke Ronchi pointed out that the pitch's unpredictability meant that batters might not feel entirely settled during their innings in Pune. Ronchi said that with balls jumping and skidding from the same length, the pitch caught them off-guard.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/calling-washington-sundar-ashwins-successor-a-little-premature-sanjay-manjrekar-2622853-2024-10-24",
      "headline": "Calling Washington Sundar Ashwin's successor a little premature: ManjrekarShould India consider Washington Sundar as the long-time replacement for Ravichandran Ashwin? Sanjay Manjrekar does not think so. Manjrekar believes that it is a little premature to compare Washi Sundar's abilities with the legendary spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-steelers-trounce-jaipur-pink-panthers-register-first-win-of-the-season-2622848-2024-10-24",
      "headline": "Haryana Steelers trounce Jaipur Pink Panthers, register first win of the seasonHaryana Steelers clinched their first win of Pro Kabaddi Season 11, defeating Jaipur Pink Panthers 37-25. Vinay's Super 10 and solid team defence dominated the contest, securing a commanding lead early and maintaining control throughout Hyderabad's GMCB Indoor Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luton-town-hit-back-at-racist-abuse-against-elijah-adebayo-2622847-2024-10-24",
      "headline": "Luton hits back at racist abuse against Elijah Adebayo: We know who you areLuton Town Football Club has issued a strong and defiant statement in response to the latest incident of racist abuse targeted at their striker, Elijah Adebayo. The club has dared the perpetrator to come out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-lifetime-leadership-ban-lifted-cricket-australia-2622895-2024-10-25",
      "headline": "David Warner's lifetime leadership ban lifted by Cricket AustraliaDavid Warner's lifetime ban on leadership after the ball-tampering scandal in the 2018 Cape Town Test against South Africa has been reversed. The review panel found that Warner had met all the criteria for the ban to be lifted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-2nd-test-pune-luke-ronchi-press-conference-comments-2622855-2024-10-24",
      "headline": "Pune pitch caught batters off-guard: New Zealand assistant coach Luke RoonchiNew Zealand assistant coach Luke Ronchi pointed out that the pitch's unpredictability meant that batters might not feel entirely settled during their innings in Pune. Ronchi said that with balls jumping and skidding from the same length, the pitch caught them off-guard.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/calling-washington-sundar-ashwins-successor-a-little-premature-sanjay-manjrekar-2622853-2024-10-24",
      "headline": "Calling Washington Sundar Ashwin's successor a little premature: ManjrekarShould India consider Washington Sundar as the long-time replacement for Ravichandran Ashwin? Sanjay Manjrekar does not think so. Manjrekar believes that it is a little premature to compare Washi Sundar's abilities with the legendary spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-steelers-trounce-jaipur-pink-panthers-register-first-win-of-the-season-2622848-2024-10-24",
      "headline": "Haryana Steelers trounce Jaipur Pink Panthers, register first win of the seasonHaryana Steelers clinched their first win of Pro Kabaddi Season 11, defeating Jaipur Pink Panthers 37-25. Vinay's Super 10 and solid team defence dominated the contest, securing a commanding lead early and maintaining control throughout Hyderabad's GMCB Indoor Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luton-town-hit-back-at-racist-abuse-against-elijah-adebayo-2622847-2024-10-24",
      "headline": "Luton hits back at racist abuse against Elijah Adebayo: We know who you areLuton Town Football Club has issued a strong and defiant statement in response to the latest incident of racist abuse targeted at their striker, Elijah Adebayo. The club has dared the perpetrator to come out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-becomes-2nd-indian-after-viswanathan-anand-to-reach-2800-elo-rating-2622845-2024-10-24",
      "headline": "Arjun Erigaisi becomes 2nd Indian after Vishy Anand to reach 2800 Elo ratingIndia's Arjun Erigaisi became only the second Indian chess player after Viswanathan Anand to reach a live Elo rating of 2800. Erigaisi has been in tremendous form and recently played a huge part in India's historic gold in the Chess Olympiad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-withdraws-india-from-world-championship-writes-to-uww-about-govt-interference-2622843-2024-10-24",
      "headline": "WFI withdraws India from World Championship, writes to UWW about govt interferenceWFI withdraws Indian team from the World Championship, citing government interference in its autonomy. Wrestlers remain entangled in legal battles, with suspended federation governance adding chaos ahead of the Tirana event. Athletes bear the brunt amidst unresolved administrative disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-test-lack-of-water-bottles-on-hot-pune-afternoon-leaves-fans-angry-2622833-2024-10-24",
      "headline": "2nd Test: Lack of water bottles on hot Pune afternoon leaves fans angryA delay in the arrival of packaged water bottles caused a melee at the MCA Stadium during the second India-New Zealand Test. Fans raised slogan against the Maharashtra Cricket Association for which the host association apologised in Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-hilarious-response-to-warners-retirement-reverse-call-for-india-series-2622816-2024-10-24",
      "headline": "Pat Cummins hilarious response to Warner's retirement reverse call for India seriesPat Cummins gives a hilarious response to David Warner's recent comments on reversing his retirement to feature in five-match Test series between Australia and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-will-follow-indias-bowling-blueprint-in-pune-test-luke-ronchi-2622800-2024-10-24",
      "headline": "New Zealand will follow India's bowling blueprint in 2nd Test: RonchiNew Zealand will follow India's bowling blueprint in the Pune Test match, said New Zealand assistant coach Luke Ronchi. India bowled out New Zealand for 259 runs in 79.1 overs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-round-india-beat-new-zealand-by-59-runs-in-1st-womens-odi-in-ahmedabad-2622767-2024-10-24",
      "headline": "All-round India beat New Zealand by 59 runs in 1st women's ODI in AhmedabadIndia beat New Zealand by 59 runs in 1st women's ODI match to take 1-0 lead in the 3-match series. Deepti Sharma was adjudged as the Player of the Match for her all-round show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-3rd-test-will-be-decided-by-small-margins-predicts-jamie-smith-2622764-2024-10-24",
      "headline": "Rawalpindi Test will be decided by small margins, predicts Jamie SmithWicketkeeper-batter Jamie Smith believes that the third and final Test match between England and Pakistan will be decided by small margins. Smith bailed England out of a batting collapse on Day 1 of the final Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-stays-back-in-stadium-for-batting-practice-after-day-1-in-pune-2622760-2024-10-24",
      "headline": "Watch: Virat Kohli stays back in stadium for batting practice in PuneSenior India batter Virat Kohli stayed back after Day 1 of the Pune Test match for some batting practice. Spectators lauded the batter for his incredible ethics even at the age of 35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-will-follow-indias-bowling-blueprint-in-pune-test-luke-ronchi-2622800-2024-10-24",
      "headline": "New Zealand will follow India's bowling blueprint in 2nd Test: RonchiNew Zealand will follow India's bowling blueprint in the Pune Test match, said New Zealand assistant coach Luke Ronchi. India bowled out New Zealand for 259 runs in 79.1 overs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-round-india-beat-new-zealand-by-59-runs-in-1st-womens-odi-in-ahmedabad-2622767-2024-10-24",
      "headline": "All-round India beat New Zealand by 59 runs in 1st women's ODI in AhmedabadIndia beat New Zealand by 59 runs in 1st women's ODI match to take 1-0 lead in the 3-match series. Deepti Sharma was adjudged as the Player of the Match for her all-round show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-3rd-test-will-be-decided-by-small-margins-predicts-jamie-smith-2622764-2024-10-24",
      "headline": "Rawalpindi Test will be decided by small margins, predicts Jamie SmithWicketkeeper-batter Jamie Smith believes that the third and final Test match between England and Pakistan will be decided by small margins. Smith bailed England out of a batting collapse on Day 1 of the final Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-stays-back-in-stadium-for-batting-practice-after-day-1-in-pune-2622760-2024-10-24",
      "headline": "Watch: Virat Kohli stays back in stadium for batting practice in PuneSenior India batter Virat Kohli stayed back after Day 1 of the Pune Test match for some batting practice. Spectators lauded the batter for his incredible ethics even at the age of 35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-stands-and-applauds-washington-sundars-7-wicket-haul-in-pune-2622759-2024-10-24",
      "headline": "Gautam Gambhir stands and applauds Washington Sundar's 7-wicket haul in PuneGautam Gambhir stood up to applaud Washington Sundar's 7-wicket haul in Pune as the off-spinner registered his career-best figures against New Zealand in the 2nd Test.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rawalpindi-and-multan-test-pitch-similar-sajid-talks-about-spinners-paradise-2622731-2024-10-24",
      "headline": "Rawalpindi and Multan Test pitch similar? Sajid talks about spinners' paradiseSajid Khan opened up about the similarities between Rawalpindi and Multan pitches. While it was easier to get wickets in Multan, Sajid revealed that he had to work his way through by varying the pace to get wickets in the 3rd Test in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-washington-sundar-gautam-gambhir-masterstroke-2622721-2024-10-24",
      "headline": "Seven-star Washington Sundar: How Gautam Gambhir's punt turned into a masterstrokeIndia vs Zealand, 2nd Test: Washington Sundar was a surprise inclusion to India's playing XI in Pune. Seizing the opportunity, the off-spinner, playing a Test after three years, turned the team management's punt into a mastestroke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-washington-sundar-sets-indian-record-in-dream-comeback-at-pune-test-2622713-2024-10-24",
      "headline": "In Stats: Washington Sundar sets Indian record in dream comeback at Pune TestWashington Sundar relished a stunning comeback in the Indian Test team with a 7-fer in the first innings of the Pune Test. The spinner also set a special record in the ongoing World Test Championship cycle for India."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}