{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "Chennai Customs in spotlight as Wintrack fallout sparks flood of corruption claimsAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-205-points-lower-nifty-below-24800-tata-steel-up-3-2796990-2025-10-03",
      "headline": "Sensex opens 205 points lower, Nifty below 24,800; Tata Steel up 3%The S&P BSE Sensex was down by 208.31 points to 80,775.00, while the NSE Nifty50 lost 75 points to 24,760.80 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wework-india-ipo-open-should-you-subscribe-good-bad-review-check-gmp-listing-gains-2796988-2025-10-03",
      "headline": "WeWork India IPO opens for bidding: Should you subscribe? Check GMPFounded in 2016, WeWork India is a flexible workspace operator offering a wide range of solutions including co-working spaces, managed offices, enterprise office suites, private offices, and hybrid digital solutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-valuation-usd-500-billion-share-sale-softbank-sam-altman-2796731-2025-10-02",
      "headline": "OpenAI hits $500 billion mark as SoftBank, others buy shares: ReportThe latest valuation marks a sharp rise from the company's previous valuation of $300 billion and highlights how quickly OpenAI's value has grown as demand for artificial intelligence tools continues to rise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wintrack-vs-chennai-customs-import-firm-tamil-nadu-shuts-operations-bribery-corruption-allegations-controversy-2796711-2025-10-02",
      "headline": "Bribes and social media war: Import firm vs Chennai Customs over 'corruption'The controversy began on the social media platform X where Wintrack Inc, a Chennai-based import company, accused Chennai Customs of systemic corruption, saying that constant demands for bribes had forced it to shut down its operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/google-layoff-100-job-cuts-design-related-ai-shift-seo-sunder-pichai-artificial-intelligence-2796598-2025-10-02",
      "headline": "Google layoffs: Over 100 design jobs cut in AI shiftGoogle has also been cutting back on management layers. According to reports, the company has reduced the number of middle managers by more than a third, particularly those overseeing small teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gandhi-jayanti-2025-stock-market-holiday-nse-bse-open-or-close-dussehra-october-2-sensex-nifty-2796520-2025-10-02",
      "headline": "Market holiday: Are NSE, BSE open on Gandhi Jayanti, Dussehra on October 2?Sensex and Nifty gained nearly 1% in the last session after the Reserve Bank of India (RBI) kept the repo rate unchanged at 5.5% and maintained its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/cillian-murphy-peaky-blinders-confirm-two-new-seasons-2797141-2025-10-03",
      "headline": "Cillian Murphy's Peaky Blinders confirmed for two new seasons Tommy Shelby is back! Netflix's Peaky Blinders film officially starts production Cillian Murphy's historical crime drama 'Peaky Blinders' will be back with two new seasons on Netflix, following the franchise film 'The Immortal Man', which is slated to release in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sahher-bamba-meeting-shah-rukh-khan-gauri-khan-warmth-fan-moments-bollywood-2797114-2025-10-03",
      "headline": "Sahher Bamba recalls meeting Shah Rukh Khan, praises Gauri Khan Sahher Bamba shares her memorable experience meeting Shah Rukh Khan and Gauri Khan. She highlights the warmth and motherly care shown by Gauri Khan on the sets of 'The Ba***ds of Bollywood'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/neeraj-ghaywan-reacts-to-reports-of-paying-less-compensation-to-homebound-family-2797134-2025-10-03",
      "headline": "Neeraj Ghaywan reacts to reports of paying less compensation to Homebound family Director Neeraj Ghaywan reacted to reports of paying less compensation to the family on whom 'Homebound' is based.  The filmmaker set the record straight with his post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-40-day-39-written-update-farrhana-bhatt-ashnoor-kaur-fight-captaincy-tak-bb-dino-task-2797046-2025-10-03",
      "headline": "Bigg Boss 19 ep 40: Farrhana vs Ashnoor, housemates compete for captaincy Farrhana Bhatt and Ashnoor Kaur had a huge fight over house duties in the latest episode of 'Bigg Boss 19'. Earlier in the day, all the contestants competed against each other to clinch captaincy contendership. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-receives-cute-handmade-card-for-daughter-malti-marie-jonas-on-flight-to-us-2797070-2025-10-03",
      "headline": "Priyanka Chopra receives cute handmade card for daughter Malti on flight to US. Pics Priyanka Chopra returned to the US after her Mumbai trip and shared a sweet handmade card from Emirates for her daughter, Malti Marie Chopra Jonas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-the-life-of-a-showgirl-mother-has-fed-us-again-2797061-2025-10-03",
      "headline": "Taylor Swift's The Life of a Showgirl: Mother has fed us again Taylor Swift's 12th studio album 'The Life of a Showgirl' review: It is fast, fun and fierce, proving once again why she's the ultimate mother of pop music.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-joins-delhi-ramlila-celebration-burns-ravana-effigy-on-dussehra-2797041-2025-10-03",
      "headline": "Bobby Deol joins Delhi's Ramlila celebration, burns Ravana's effigy on Dussehra Bollywood actor Bobby Deol made Delhi's Ramlila more exciting this Dussehra by burning Ravana's effigy at the Red Fort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-smashing-machine-review-dwayne-johnson-ufc-biopic-mark-kerr-addiction-2797003-2025-10-03",
      "headline": "The Smashing Machine review: Dwayne Johnson shines in gritty biopicRelease Date:Fri Oct 03, 2025 The Smashing Machine movie review: Dwayne Johnson's 'The Smashing Machine' offers a gritty portrayal of MMA legend Mark Kerr's turbulent career. It reveals the human cost behind the fighter's public glory and personal struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharvari-begins-shooting-for-imtiaz-ali-next-film-wishes-dussehra-with-special-note-2797027-2025-10-03",
      "headline": "Sharvari begins shooting for Imtiaz Ali's next, wishes Dussehra with special note Bollywood actor Sharvari has begun shooting her next film with acclaimed director Imtiaz Ali, co-starring Vedang Raina, marking the start of the project on Dussehra with a special puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-album-release-spotify-outage-streaming-surge-2797017-2025-10-03",
      "headline": "Taylor Swift releases new album The Life of a Showgirl, Spotify crashes Spotify experienced a surge in user activity following Taylor Swift's 'The Life of a Showgirl' album release, leading to app crashes. Over 1,000 users reported issues, highlighting the significant demand for the pop star's latest work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-sandeep-vanga-praise-kantara-chapter-1-cinematic-thunderstorm-2796996-2025-10-03",
      "headline": "Cinematic thunderstorm: Prabhas, Sandeep Vanga shower praise on Kantara Chapter 1 Actor Prabhas and director Sandeep Reddy Vanga were blown away by Rishab Shetty's 'Kantara: Chapter 1'. While Prabhas called the film brilliant, Sandeep praised the film as a cinematic thunderstorm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-announces-og-sequel-prequel-box-office-success-2796981-2025-10-03",
      "headline": "Pawan Kalyan announces plans for OG prequel and sequel after film's success Pawan Kalyan formally announced the plans for a sequel and prequel to 'They Call Him OG' at the film's success meet. The film's strong box office performance motivates continued work on the 'OG' franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-collection-day-1-varun-dhawan-janhvi-kapoor-rohit-saraf-sanya-malhotra-film-2796985-2025-10-03",
      "headline": "Sunny Sanskari box office Day 1: How much did Varun-Janhvi film make? Read here 'Sunny Sanskari Ki Tulsi Kumari' starring Varun Dhawan and Janhvi Kapoor opened to Rs 9.25 crore on its first day amid stiff competition from 'Kantara Chapter 1'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-says-her-mother-asked-producer-to-drop-her-from-debut-2796978-2025-10-03",
      "headline": "Rani Mukerji says her mother asked producer to drop her from debut: Don't take her Rani Mukerji reflected on her early struggles in joining films, sharing how her father was against her acting career and her mother even doubted her first screen test. Now a National Award winner, she believes acting has become a far more feasible and respected career option for today's youngsters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-success-5000-shows-awards-kannada-cinema-2796963-2025-10-03",
      "headline": "Rishab Shetty recalls inspiring journey: 1 show in 2016 to 5,000 Kantara shows Rishab Shetty recalled his inspiring journey from a struggling director to one of Kannada cinema's celebrated actor-directors. His film 'Kantara: Chapter 1' has achieved over 5,000 houseful shows, marking a major milestone in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-rs-60-crore-opening-trails-kgf-2-hindi-rishab-shetty-2796949-2025-10-03",
      "headline": "Kantara Chapter 1 box office Day 1: Rs 60-crore opening, trails KGF 2 in Hindi Rishab Shetty's 'Kantara: Chapter 1' collected Rs 60 crore nett in India on its opening day. The film started on a slow note and picked up pace during the evening and night shows."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ashutosh-rana-says-raavan-is-the-worst-villain-till-date-2796873-2025-10-02",
      "headline": "Ashutosh Rana says Raavan is the worst villain till date Actor Ashutosh Rana, known for playing versatile characters, recently expressed his views on Lord Ram, Raavan, Lord Krishna and spirituality, in an exclusive interview with India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashutosh-rana-on-the-three-historical-characters-he-wants-to-invite-for-lunch-2796867-2025-10-02",
      "headline": "Ashutosh Rana wants to invite this Ramayana character to lunch for this reason Actor Ashutosh Rana, in an exclusive interview with India Today, expressed his views on spirituality, Lord Ram, Raavan and the power of manifestation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-shares-pics-bollywood-villains-reveals-fun-fact-about-gafoor-song-the-bads-of-bollywood-aryan-khan-2796849-2025-10-02",
      "headline": "Farah Khan shares pics with Bollywood villains, reveals fun fact about Gafoor song Director Farah Khan recently shared pictures with Bollywood villains and revealed an interesting fact about the popular song 'Gafoor' from Aryan Khan's directorial 'The Ba***ds of Bollywood.' "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/longest-op-sindoor-kill-300-kms-in-pak-territory-air-force-reveals-how-surface-to-air-missiles-turned-tables-2797132-2025-10-03",
      "headline": "Longest kill 300 kms in Pak territory: Air Force reveals Op Sindoor game-changerAir Chief Marshal Amar Preet Singh on Thursday said that Operation Sindoor marked a milestone for the Indian Air Force, with long-range SAM strikes over 300 km inside Pakistan, precise execution, and joint-service coordination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "Chennai Customs in spotlight as Wintrack fallout sparks flood of corruption claimsAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-day-2-live-score-shubman-gill-roston-chase-ahmedabad-2796974-2025-10-03",
      "headline": "Day 2 Live: Jadeja and Jural take lead over 100India (IND) vs West Indies (WI) Live Score, 1st Test, Day 2: Ravindra Jadeja and Dhruv Jurel have only shifted to big-time attacking gears after KL Rahul's wicket, as the duo take India's lead over 100 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-the-life-of-a-showgirl-mother-has-fed-us-again-2797061-2025-10-03",
      "headline": "Taylor Swift's The Life of a Showgirl: Mother has fed us againTaylor Swift's 12th studio album 'The Life of a Showgirl' review: It is fast, fun and fierce, proving once again why she's the ultimate mother of pop music.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-watch-ultra-saves-life-of-26-year-old-mumbai-techie-after-scuba-diving-accident-2796783-2025-10-02",
      "headline": "Apple Watch Ultra saves life of 26-year-old Mumbai techie after scuba diving accidentThe robust health and environment tracking in devices like Apple Watch can prove to be life-saving. As the Apple Watch Ultra recently did in the case of Kshitij Zodape, a Mumbai resident who was scuba diving in Puducherry a few months ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karur-stampede-aftermath-wont-permit-rallies-on-highways-till-sops-formed-tamil-nadu-tells-court-2797139-2025-10-03",
      "headline": "Karur stampede aftermath: Tamil Nadu to halt rallies on highways till new SOPs issuedKarur stampede aftermath: Won't permit rallies on highways till SOPs formed, Tamil Nadu tells court"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sana-mir-clarifies-azad-kashmir-comment-controversy-world-cup-2025-2796947-2025-10-03",
      "headline": "Pak's Sana Mir calls PoK player Azad Kashmir's, clarifies after massive backlashPakistani commentator Sana Mir has clarified her usage of the phrase \"Azad Kashmir\" while referring to a cricketer from Pakistan-occupied Kashmir during a Women's World Cup match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/oakville-theatre-arson-shooting-indian-film-screenings-cancelled-2796951-2025-10-03",
      "headline": "Canadian theatre halts screening Indian films after two violent attacksThe first incident occurred on September 25, when two suspects attempted to set fire to the theatre's entrance, while the second attack on Thursday 2 occurred when a single suspect fired multiple gunshots through the cinema hall's entrance doors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/iphone-air-review-love-and-limitations-2797140-2025-10-03",
      "headline": "iPhone Air review: Love and limitationsOf the three iPhones this year, the iPhone Air is the one that is likely to evoke strongest feelings — either you will love it, or you won't at all. And your response to it is going to reveal as much about you as it does about the phone. That, according to this iPhone Air review, is a win for Apple.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/fire-pakistan-occupied-kashmir-pok-protests-spread-to-islamabad-karachi-jkjaac-awami-action-committee-abolition-assembly-seats-2797112-2025-10-03",
      "headline": "Witch killing own people: Fire of POK protests spreads to Karachi, IslamabadProtests in Pakistan-occupied Kashmir (POK), sparked by unmet demands and police firing that killed at least 12, have spread to Karachi and Islamabad. A leader of the Awami Action Committee, which is spearheading the protests that are the biggest in 38 years, likened the crackdown to a 'witch killing its own people'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/beyond-toilets-the-urgent-need-for-bathrooms-to-protect-womens-health-and-dignity-2796189-2025-10-03",
      "headline": "Beyond toilets: The urgent need for bathrooms to protect women's health and dignityThe lack of bathrooms is not just about poverty. It is also about cultural attitudes, priorities in household spending, and the absence of targeted government programmes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-smashing-machine-review-dwayne-johnson-ufc-biopic-mark-kerr-addiction-2797003-2025-10-03",
      "headline": "The Smashing Machine review: Dwayne Johnson shines in gritty biopicRelease Date:Fri Oct 03, 2025The Smashing Machine movie review: Dwayne Johnson's 'The Smashing Machine' offers a gritty portrayal of MMA legend Mark Kerr's turbulent career. It reveals the human cost behind the fighter's public glory and personal struggles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/contaminated-cough-syrup-kidney-failure-child-deaths-chhindwara-2797026-2025-10-03",
      "headline": "Cough syrup-linked kidney failure deaths among children rise to 9 in Madhya PradeshWhat initially appeared to be ordinary cases of seasonal fever has now taken a deadly turn. Among the nine children who died, at least five had a history of taking Coldref, and one had taken Nextro syrup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/weight-loss-injections-cant-fix-your-body-image-issues-2796202-2025-10-03",
      "headline": "Weight-loss injections can't fix your body-image issuesWeight-loss injections aren't a magic solution for body image issues, they can sometimes make things worse. Focus on realistic health goals instead of obsessing over how you look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/merchant-of-death-the-shocking-story-behind-the-origin-of-the-nobel-prize-2797056-2025-10-03",
      "headline": "Merchant of death: The untold story of how the Nobel Prize beganDo you know how the Nobel Prize came into existence, and that it has a history related to brute force that has immense capability of destruction? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-home-test-century-west-indies-ahmedabad-2797082-2025-10-03",
      "headline": "KL Rahul hits first home Test century in 9 years, unveils new celebrationIndia vs West Indies, 1st Test: KL Rahul ended a 3,211-day wait for a Test century at home. The Indian opener flaunted a new celebratory gesture after getting to the milestone on Day 2 of the Test in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/office-empty-after-5-pm-indian-ca-in-europe-shares-viral-corporate-shock-video-2797030-2025-10-03",
      "headline": "Office empty after 5 pm, Indian CA in Europe shares viral 'corporate shock' videoIndian Chartered Accountant Jyoti Saini's video of her empty European office has gone viral. The clip has led to discussions comparing Western and Indian work ethics and office timings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-rs-60-crore-opening-trails-kgf-2-hindi-rishab-shetty-2796949-2025-10-03",
      "headline": "Kantara Chapter 1 box office Day 1: Rs 60-crore opening, trails KGF 2 in HindiRishab Shetty's 'Kantara: Chapter 1' collected Rs 60 crore nett in India on its opening day. The film started on a slow note and picked up pace during the evening and night shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/do-children-even-need-cough-syrup-rajasthan-deaths-revive-the-debate-2796153-2025-10-01",
      "headline": "India's cough syrup habit: A hidden risk to child health?Two children in Rajasthan died after consuming government-supplied cough syrup containing dextromethorphan. While the state government banned the syrup batch, it raises an urgent question: \"Do we really need cough syrups?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/albania-pm-mocks-trump-over-armenia-albania-mix-up-macron-left-laughing-glbs-2796929-2025-10-03",
      "headline": "Watch: EU leaders mock Trump's Armenia gaffe on hot mic, Macron can't stop laughingAlbanian Prime Minister Edi Rama took a dig at Trump, who on repeated occasions has mixed up Armenia with Albania while speaking about the peace deal he brokered with Azerbaijan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-weightlifting-championships-olympic-medalist-mirabai-chanu-wins-silver-2797004-2025-10-03",
      "headline": "World Weightlifting Championships: Olympic medalist Mirabai Chanu wins silverIndia's Mirabai Chanu returned to the World Weightlifting Championships podium with a silver in the women's 48kg, recording her first world medal since 2022, as North Korea's Ri Song Gum claimed gold with a world record total."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-new-profit-and-sustainability-rules-2797087-2025-10-03",
      "headline": "Premier League to take a call on divisive profit and sustainability rules The Premier League is preparing for a critical decision on its Profit and Sustainability Rules (PSR), with discussions underway about adopting a new financial model. This could significantly alter club spending regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-all-rounder-cameron-green-bowling-role-home-ashes-2797096-2025-10-03",
      "headline": "Cameron Green ready to resume bowling ahead of Ashes series Australia all-rounder Cameron Green is set to resume bowling following spinal surgery, with a carefully managed plan designed to ensure he peaks in time for the Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-home-test-century-west-indies-ahmedabad-2797082-2025-10-03",
      "headline": "KL Rahul hits first home Test century in 9 years, unveils new celebration India vs West Indies, 1st Test: KL Rahul ended a 3,211-day wait for a Test century at home. The Indian opener flaunted a new celebratory gesture after getting to the milestone on Day 2 of the Test in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-criticised-asia-cup-trophy-row-india-pakistan-cricket-tensions-2797050-2025-10-03",
      "headline": "AB de Villiers divides opinions after questioning India over Asia Cup trophy row Former cricketer AB de Villiers comments on the Asia Cup trophy presentation sparked backlash from Indian fans. India refused to recieve the trophy from Asian and Pakistan cricket chief, Mohsin Naqvi, after outclassing Pakistan in the final in Dubai on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-weightlifting-championships-olympic-medalist-mirabai-chanu-wins-silver-2797004-2025-10-03",
      "headline": "World Weightlifting Championships: Olympic medalist Mirabai Chanu wins silver India's Mirabai Chanu returned to the World Weightlifting Championships podium with a silver in the women's 48kg, recording her first world medal since 2022, as North Korea's Ri Song Gum claimed gold with a world record total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-day-2-live-score-shubman-gill-roston-chase-ahmedabad-2796974-2025-10-03",
      "headline": "Day 2 Live: Ravindra Jadeja and Dhruv Jurel in fiery mood India (IND) vs West Indies (WI) Live Score, 1st Test, Day 2: KL Rahul departs right after lunch, not run over his 11th Test hundred, as Ravindra Jadeja walks in. Dhruv Jurel looks steady at the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-zimbabwe-qualify-icc-men-t20-world-cup-2026-2796970-2025-10-03",
      "headline": "Namibia and Zimbabwe qualify for ICC Men's T20 World Cup in India and Sri Lanka Namibia and Zimbabwe qualified for next year's ICC Men's T20 World Cup to be held in India and Sri Lanka after reaching the semifinals in the Africa Regional Final in Harare on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-vs-west-indies-test-2796957-2025-10-03",
      "headline": "KL Rahul takes Rohit Sharma's role, become tone-setter for India in Tests After finally finding his place in the Indian Test team, KL Rahul is now ensuring that he sets the tone for his side's innings in each game. Rahul once again showed his class with a gritty fifty against West Indies on Day 1 of the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-beat-afghanistan-thrilling-1st-t20i-batting-collapse-2796954-2025-10-03",
      "headline": "1st T20I: Bangladesh survive batting collapse to seal thriller vs Afghanistan Bangladesh survived a stunning collapse to secure a four-wicket victory over Afghanistan in the opening T20I, with Nurul Hasan and Rishad Hossain guiding their side home after Rashid Khan's four-wicket burst threatened to turn the contest on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-day-2-live-score-shubman-gill-roston-chase-ahmedabad-2796974-2025-10-03",
      "headline": "Day 2 Live: Ravindra Jadeja and Dhruv Jurel in fiery mood India (IND) vs West Indies (WI) Live Score, 1st Test, Day 2: KL Rahul departs right after lunch, not run over his 11th Test hundred, as Ravindra Jadeja walks in. Dhruv Jurel looks steady at the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-zimbabwe-qualify-icc-men-t20-world-cup-2026-2796970-2025-10-03",
      "headline": "Namibia and Zimbabwe qualify for ICC Men's T20 World Cup in India and Sri Lanka Namibia and Zimbabwe qualified for next year's ICC Men's T20 World Cup to be held in India and Sri Lanka after reaching the semifinals in the Africa Regional Final in Harare on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-vs-west-indies-test-2796957-2025-10-03",
      "headline": "KL Rahul takes Rohit Sharma's role, become tone-setter for India in Tests After finally finding his place in the Indian Test team, KL Rahul is now ensuring that he sets the tone for his side's innings in each game. Rahul once again showed his class with a gritty fifty against West Indies on Day 1 of the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-beat-afghanistan-thrilling-1st-t20i-batting-collapse-2796954-2025-10-03",
      "headline": "1st T20I: Bangladesh survive batting collapse to seal thriller vs Afghanistan Bangladesh survived a stunning collapse to secure a four-wicket victory over Afghanistan in the opening T20I, with Nurul Hasan and Rishad Hossain guiding their side home after Rashid Khan's four-wicket burst threatened to turn the contest on its head."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}