{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-suga-apologises-to-fans-in-1st-instagram-post-after-military-service-addresses-past-controversy-2744055-2025-06-21",
      "headline": "BTS's Suga apologises to fans in 1st Instagram post, addresses past controversyBTS member Suga has completed his social service and shared a heartfelt message with fans expressing gratitude and remorse over a past incident. He reflected on his time away as a period of self-introspection and pledged to work harder to repay the love and support of the ARMY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fading-echoes-why-hindi-cinema-struggles-to-honour-its-musical-legends-on-screen-2743502-2025-06-21",
      "headline": "Fading Echoes: Why Hindi cinema struggles to honour its musical legends on-screenWhy have Bollywood filmmakers not been able to create musical biopics like other genres? Despite the immensely talented composers and singers of yesteryear's cinema, we don't have any musical adaptation at par with Western musicians. On Cinematic Saturday, we reflect on why Indian storytellers are missing out on the musical legacies of cinema's maestros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-day-1-dhanush-nagarjuna-film-opens-strong-with-rs-13-crore-2744043-2025-06-21",
      "headline": "Kuberaa box office Day 1: Dhanush, Nagarjuna's film opens strong with Rs 13 crore'Kuberaa' released in theatres on June 20, starring Dhanush, Rashmika Mandanna and Nagarjuna. The Telugu crime-thriller opened to great reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-day-1-aamir-khan-film-starts-decent-earns-rs-115-crore-2744034-2025-06-21",
      "headline": "Sitaare Zameen Par box office Day 1: Aamir's film starts decent, earns Rs 11.5 croreSitaare Zameen Par box office collection Day 1: Aamir Khan made a strong comeback with the RS Prasanna directorial on June 20. The film, a spiritual sequel to the 2007 hit, had a decent opening at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/prosenjit-chatterjee-on-sitaare-zameen-pars-cinema-only-move-aamir-can-take-risk-2743891-2025-06-20",
      "headline": "Prosenjit Chatterjee on Sitaare Zameen Par's cinema-only move: Aamir can take riskActor Prosenjit Chatterjee, in an exclusive interaction, reacted to Aamir Khan's decision to ditch OTT and release 'Sitaare Zameen Par' in theatres. He said that such kind of changes are important. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-takes-jibe-at-john-abraham-goal-slams-stardom-system-in-bollywood-2743844-2025-06-20",
      "headline": "Vivek Agnihotri takes jibe at John Abraham's Goal, slams stardom system in BollywoodDirector Vivek Agnihotri opened up about the challenges he faced during the shoot of John Abraham's 'Dhan Dhana Dhan Goal'. While criticising Bollywood's stardom system, he also slammed the stardom system of Bollywood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshaye-khannas-ott-film-revamped-for-theatres-as-akshardham-operation-vajra-shakti-2743879-2025-06-20",
      "headline": "Akshaye Khanna's OTT film revamped for theatres as Akshardham Operation Vajra ShaktiActor Akshaye Khanna's action drama 'State of Siege: Temple Attack' is set for a theatrical release on July 4, 2025, under a new title - 'Akshardham: Operation Vajra Shakti'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/elio-review-sweet-funny-pixar-film-lacks-emotional-depth-2743874-2025-06-20",
      "headline": "Elio review: Pixar's new offering is sweet and funny but lacks sparkReleased-Fri Jun 13, 2025Elio movie review: Pixar's Elio is a heartwarming story about an orphaned boy turned cosmic ambassador. Despite its charm, the film misses the emotional depth expected from Pixar's best works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-returns-mumbai-saif-ali-khan-kareena-kapoor-sunjay-kapur-funeral-2743878-2025-06-20",
      "headline": "Karisma Kapoor returns to Mumbai with Saif Ali Khan and Kareena Kapoor. WatchKarisma Kapoor, along with sister Kareena Kapoor and Saif Ali Khan, returned to Mumbai after Sunjay Kapur's funeral in Delhi. A video of them leaving Delhi has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diana-penty-was-initial-choice-for-rockstar-was-dropped-after-2-3-weeks-2743812-2025-06-20",
      "headline": "Diana Penty says she was dropped from Rockstar after workshops, later bagged CocktailActor Diana Penty said in an interview that she was rejected for Ranbir Kapoor-starrer 'Rockstar' before she made her debut with 'Cocktail.' She was dropped from the film after two to three weeks of workshops. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-dances-to-katrina-kaif-chikni-chameli-during-india-visit-2743850-2025-06-20",
      "headline": "Jackson Wang dances to Katrina Kaif's Chikni Chameli during India visit. WatchK-pop star Jackson Wang visited India to promote his upcoming album 'Magic Man 2'. In one of the viral moments from his trip, Wang was seen dancing to Katrina Kaif's 'Chikni Chameli'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/veteran-pakistani-actor-ayesha-khan-dies-at-76-body-discovered-after-a-week-2743855-2025-06-20",
      "headline": "Veteran Pakistani actor Ayesha Khan dies at 76, body discovered after a weekVeteran Pakistani actor Ayesha Khan was found dead in her apartment in Karachi, Pakistan. She was 76. Her body was discovered in a decomposed state nearly a week after her death.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boman-irani-recalls-sunil-dutt-camaraderie-munna-bhai-set-2743851-2025-06-20",
      "headline": "Boman Irani recalls Sunil Dutt ordering 23 umbrellas so crew could eat togetherActor Boman Irani shares a nostalgic memory of Sunil Dutt bringing the crew together on Munna Bhai MBBS set. He highlights how film-set camaraderie has changed and praises the new generation's preparation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-loses-part-of-her-eyebrow-during-action-scene-in-heads-of-state-2743795-2025-06-20",
      "headline": "Priyanka Chopra recalls losing part of her eyebrow during Heads of State shootPriyanka Chopra revealed she lost a chunk of her eyebrow while filming an action scene in her upcoming film, 'Heads of State', narrowly avoiding a serious eye injury. Despite the mishap, she patched it up with surgical glue and continued shooting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lizzo-on-weight-loss-journey-admits-using-ozempic-transformation-2743790-2025-06-20",
      "headline": "Lizzo opens up about her weight-loss journey, admits to using OzempicPop star Lizzo broke her silence on the rumours surrounding her weight-loss journey. She admitted to using Ozempic and other drugs to reduce weight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chunky-pandey-changing-times-in-bollywood-golden-period-indian-cinema-2743819-2025-06-20",
      "headline": "This is golden time of cinema: Chunky Pandey on changing times in film industryVeteran actor Chunky Pandey reflected on the shift towards detailed preparation and scientific approach in filmmaking. He called it the golden era of cinema with diverse platforms offering new opportunities for actors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jennie-cries-for-help-on-hotones-hot-wings-2743749-2025-06-20",
      "headline": "BLACKPINK's Jennie cries for help on HotOnes, says Jisoo should've done itK-pop star Jennie recently appeared on the popular YouTube show 'HotOnes' by First We Feast. During the episode, she was seen calling for help and joking that Jisoo should have taken her place instead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-dilwale-dulhania-le-jayenge-2025-release-evolving-love-portrayal-indian-films-2743753-2025-06-20",
      "headline": "Anupam Kher says DDLJ wouldn't work if released in 2025Actor Anupam Kher shares his views on how love stories in films have changed over time. He believes 'Dilwale Dulhania Le Jayenge' would not resonate if released for the first time in 2025 due to shifting societal values."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/detective-sherdill-movie-review-no-mystery-in-this-murder-mystery-led-by-diljit-dosanjh-2743796-2025-06-20",
      "headline": "Detective Sherdil review: No mystery in this murder mystery led by Diljit DosanjhReleased-Thu Jun 19, 2025Detective Sherdil movie review: A charming Diljit Dosanjh closes the murder case, and also your curiosity - long before the credits roll. The film is streaming on Zee5. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-nobel-peace-prize-india-pakistan-war-repeats-claim-pm-modi-call-2744063-2025-06-21",
      "headline": "Won't get Nobel for halting India-Pak war: Trump at it again after PM fact-checkIn a lengthy social media post, US President Donald Trump argued that he deserved the Nobel Peace Prize for multiple peace efforts, including his involvement in 'stopping' the war between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-at-international-yoga-day-yoga-gives-direction-of-peace-amid-unrest-that-world-witnesses-today-2744019-2025-06-21",
      "headline": "Yoga gives direction of peace as world today witnesses unrest: PM ModiAs conflicts in West Asia and Europe rage on, PM Modi said that yoga kills ego and 'takes us from me to we,' highlighting its power to foster global unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-reaction-parisdiamond-league-win-javelin-consistency-2744018-2025-06-21",
      "headline": "More 90m throws coming, but Neeraj Chopra proud of consistencyOlympic medal-winning Indian javelin throw superstar Neeraj Chopra was proud of his consistency after clinching his first Diamond League title in two years, upstaging German rival Julian Weber in a strong field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-defence-minister-operation-sindoor-pok-indian-army-terrorism-2743981-2025-06-21",
      "headline": "Pak had to kneel down, any attack will cost it dearly: Rajnath Singh's warningRajnath Singh, interacting with soldiers at Northern Command, said Operation Sindoor was only paused and any campaign by Pakistan to give a thousand wounds to India through terrorism would not succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-india-greatest-test-batter-part-2-2743895-2025-06-21",
      "headline": "Who is India's greatest Test batsman? Sherlock Holmes concludes his investigationGavaskar, Tendulkar, Dravid or Kohli? Who is the greatest Indian batter? After a thorough investigation in Part 1, Sherlock Holmes deduced Kohli comes in fourth in this field of four. Readers agreed with Holmes overwhelmingly. In this second and concluding part of his investigation, Holmes narrows in on Dravid, Gavaskar and Sachin to find the greatest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-live-updates-tel-aviv-tehran-donald-trump-white-house-missiles-drones-2743961-2025-06-20",
      "headline": "Live: Explosions heard in Isfahan, home to Iran's top nuclear research siteIsrael-Iran Conflict Live Updates: The Israel-Iran conflict showed no signs of stopping as the long-time enemies fired missiles and drones at each other on the eighth day. Israel bombed nuclear infrastructure in Iran. Tehran retaliated by firing missiles armed with cluster munitions, marking the first reported use of such weapons in the ongoing conflict. Meanwhile, US President Donald Trump, who will decide if the US will participate in the conflict, presided over a national security meeting about Iran with top aides at the White House on Friday, a US official said. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-21-pms-yoga-day-celebrations-indian-students-return-from-iran-2744029-2025-06-21",
      "headline": "News Menu, June 21: PM's Yoga Day celebrations, Indian students return from IranIn today's News Menu: PM's Yoga Day celebrations, Indian students evacuated from Iran under Operation Sindhu, Israel-Iran conflict intensifies and weather woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-nominates-donald-trump-for-2026-nobel-peace-prize-glbs-2743989-2025-06-21",
      "headline": "Pak nominates Trump for Nobel Prize for 'pivotal leadership' in truce with IndiaPakistan has nominated US President Donald Trump for the 2026 Nobel Peace Prize, citing his diplomatic role in defusing the 2025 India-Pakistan crisis and preventing a full-scale war.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-shubman-gill-day-1-captaincy-virat-kohli-2744058-2025-06-21",
      "headline": "First day in office: Shubman Gill and Virat Kohli. Same same, but differentENG vs IND, Leeds Test: On his first day as Test captain, Shubman Gill led with calm authority, silencing doubts not with flair but with discipline and steel. At Headingley, he and his young team signalled that India's red-ball future may well be in safe hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-its-very-hard-to-ask-israel-to-stop-airstrikes-on-iran-amid-military-gains-glbs-2744001-2025-06-21",
      "headline": "Trump says it's very hard to ask Israel to stop airstrikes on Iran amid military gainsPresident Donald Trump on Friday suggested he is unlikely to press Israel to pause its airstrikes on Iran, even as diplomatic efforts stall and global calls for de-escalation intensify.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/international-yoga-day-tokyo-new-york-times-sqaure-london-pm-narendra-modi-anupam-kher-visakhapatnam-celebrations-pictures-2025-2744042-2025-06-21",
      "headline": "In pics: From J&K to New York, celebrations galore on International Yoga DayThe 11th International Yoga Day is being celebrated in a grand manner as visuals showed people performing asanas from Tokyo to the iconic Times Square in New York City."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-highest-asian-wicketkeeper-batter-sena-3000-test-runs-headingley-2744057-2025-06-21",
      "headline": "Rishabh Pant becomes Asia's most successful Test wicketkeeper in SENA countriesENG vs IND: Rishabh Pant became the most successful Asian wicketkeeper-batter in SENA countries during the first Test against England, marking the milestone with a vital innings that helped India dominate Day 1 and set the tone for the new World Test Championship cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fading-echoes-why-hindi-cinema-struggles-to-honour-its-musical-legends-on-screen-2743502-2025-06-21",
      "headline": "Fading Echoes: Why Hindi cinema struggles to honour its musical legends on-screenWhy have Bollywood filmmakers not been able to create musical biopics like other genres? Despite the immensely talented composers and singers of yesteryear's cinema, we don't have any musical adaptation at par with Western musicians. On Cinematic Saturday, we reflect on why Indian storytellers are missing out on the musical legacies of cinema's maestros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/flight-carrying-indian-students-from-iran-lands-in-delhi-as-tehran-opens-airspace-for-evacuation-2743966-2025-06-20",
      "headline": "Flight carrying 290 Indian students from Iran lands in Delhi as Tehran opens airspaceThe Indian students were rescued from Tehran as part of India's Operation Sindhu. Approximately 1000 students will be brought back through Mahan Air's chartered flights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-day-one-yashasvi-jaiswal-hundred-leeds-2743974-2025-06-21",
      "headline": "Yashasvi Jaiswal reveals mantra after Leeds hundred: Being myself, keeping it simpleYashasvi Jaiswal revealed his mantra after scoring his fifth Test hundred on Day one of the match at Leeds on Friday, June 20. Jaiswal created a lot of records on his way to the hundred against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/dna-diet-is-new-biohack-benefits-and-limitationa-in-india-2743797-2025-06-21",
      "headline": "Forget fad diets, your DNA may have all the answersIn the ever-evolving world of wellness, the DNA diet is making a case for being the ultimate bio-hack for well-being. But is it really future-proof?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-498-20-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-raj-thackeray-shiv-sena-mns-alliance-civic-body-polls-2743996-2025-06-21",
      "headline": "Speculation rises over Uddhav-Raj alliance; civic poll seat-sharing major hurdle?The issue is complicated by the comparable influence both parties wield in certain areas, creating a deadlock over the terms of a possible alliance ahead of the civic polls. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/tulsi-gabbard-says-media-twisted-her-iran-testimony-after-trump-calls-her-wrong-glbs-2744005-2025-06-21",
      "headline": "Tulsi Gabbard says media twisted her Iran testimony after Trump calls her wrongTulsi Gabbard responded to President Trump's criticism of her Iran nuclear assessment, accusing the media of misrepresenting her testimony. She clarified that US intelligence shows Iran could produce a nuclear weapon soon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-day-1-aamir-khan-film-starts-decent-earns-rs-115-crore-2744034-2025-06-21",
      "headline": "Sitaare Zameen Par box office Day 1: Aamir's film starts decent, earns Rs 11.5 croreSitaare Zameen Par box office collection Day 1: Aamir Khan made a strong comeback with the RS Prasanna directorial on June 20. The film, a spiritual sequel to the 2007 hit, had a decent opening at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/international-yoga-day-2025-key-to-success-in-digital-age-andhra-pradesh-chief-minister-chandrababu-naidu-pm-modi-backs-yoga-schools-education-2744053-2025-06-21",
      "headline": "Chandrababu Naidu, sharing stage with PM, urges Yoga's inclusion in OlympicsCrediting PM Modi's leadership in popularising Yoga and its message to the world, Andhra Pradesh Chief Minister Chandrababu Naidu thanked him for giving Andhra Pradesh the honour of hosting the event, which saw the participation of over 3 lakh citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mindbogglingly-historic-trump-says-harvard-deal-may-be-possible-next-week-2743988-2025-06-21",
      "headline": "Trump says Harvard deal may be possible next week: Will be mindbogglingly historicPresident Trump said a \"mindbogglingly historic\" deal with Harvard could be finalised next week, praising the university's conduct during negotiations amid a legal battle over international student enrolment rights.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/10-year-old-girl-dies-in-road-accident-in-ponniyammanmedu-chennai-tn-two-traffic-officials-suspended-2742908-2025-06-19",
      "headline": "10-year-old on her way to school run over by lorry, two cops suspendedA 10-year-old girl died instantly when a transport lorry ran over her. The accident happened after her mother's two-wheeler they were riding slipped and fell on the road. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-hopeful-return-final-england-india-test-knee-injury-2744062-2025-06-21",
      "headline": "England pacer Mark Wood hopeful of comeback in fifth Test against IndiaEngland pace spearhead Mark Wood is hopeful of making a comeback in the ongoing Test series against India. The fast bowler said he is working on his recovery and could return in time for the final match of the five-Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-highest-asian-wicketkeeper-batter-sena-3000-test-runs-headingley-2744057-2025-06-21",
      "headline": "Rishabh Pant becomes Asia's most successful Test wicketkeeper in SENA countriesENG vs IND: Rishabh Pant became the most successful Asian wicketkeeper-batter in SENA countries during the first Test against England, marking the milestone with a vital innings that helped India dominate Day 1 and set the tone for the new World Test Championship cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-shubman-gill-day-1-captaincy-virat-kohli-2744058-2025-06-21",
      "headline": "First day in office: Shubman Gill and Virat Kohli. Same same, but differentENG vs IND, Leeds Test: On his first day as Test captain, Shubman Gill led with calm authority, silencing doubts not with flair but with discipline and steel. At Headingley, he and his young team signalled that India's red-ball future may well be in safe hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-india-greatest-test-batter-part-2-2743895-2025-06-21",
      "headline": "Who is India's greatest Test batsman? Sherlock Holmes concludes his investigationGavaskar, Tendulkar, Dravid or Kohli? Who is the greatest Indian batter? After a thorough investigation in Part 1, Sherlock Holmes deduced Kohli comes in fourth in this field of four. Readers agreed with Holmes overwhelmingly. In this second and concluding part of his investigation, Holmes narrows in on Dravid, Gavaskar and Sachin to find the greatest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-bayern-munich-boca-juniors-flamengo-chelsea-2744048-2025-06-21",
      "headline": "Bayern Munich edge Boca Juniors, Flamengo stun 10-man ChelseaBayern Munich secured their place in the FIFA Club World Cup knockout stage with a narrow win over Boca Juniors. Flamengo stunned Chelsea with a strong second-half comeback, shifting group dynamics significantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-questions-ben-stokes-bowling-first-decision-headingley-test-2744035-2025-06-21",
      "headline": "Michael Vaughan slams Ben Stokes's decision to bowl in Leeds TestFormer England captain Michael Vaughan said he was \"staggered\" that Ben Stokes chose to bowl first after winning the toss on the opening day of the Test series against India. The decision backfired as the tourists plundered 359 runs for the loss of just three wickets on a flat pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowling-coach-tim-southee-reaction-toss-india-dominate-leeds-test-2744030-2025-06-21",
      "headline": "Southee defends England's decision to bowl after India's Leeds show on Day 1ENG vs IND: England bowling coach Tim Southee came to the defence of captain Ben Stokes's decision to bowl first in the opening Test at Headingley after India put themselves firmly in the driver's seat on Day 1"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sachin-tendulkar-sourav-ganguly-banter-1st-test-day-1-leeds-2744021-2025-06-21",
      "headline": "Sachin Tendulkar nostalgic after young India's Leeds show, Sourav Ganguly reactsENG vs IND: Indian cricket legends Sachin Tendulkar and Sourav Ganguly were back in the spotlight after a nostalgic and light-hearted exchange on social media, following India's dominant display on the opening day of the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-reaction-parisdiamond-league-win-javelin-consistency-2744018-2025-06-21",
      "headline": "More 90m throws coming, but Neeraj Chopra proud of consistencyOlympic medal-winning Indian javelin throw superstar Neeraj Chopra was proud of his consistency after clinching his first Diamond League title in two years, upstaging German rival Julian Weber in a strong field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-paris-diamond-league-neeraj-chopra-title-win-result-julian-weber-2743987-2025-06-21",
      "headline": "No 90m, but Neeraj Chopra wins Paris Diamond League in first major crown of 2025There was no 90-metre magic for Neeraj Chopra, but he secured his first title of the season by claiming victory at the Paris Diamond League on Friday, June 20. Neeraj overcame the threat of Julian Weber to claim the first title win of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-test-yashasvi-jaiswal-planning-shubman-gill-2743980-2025-06-21",
      "headline": "Yashasvi Jaiswal reveals plan with Shubman Gill during Headingley standYashasvi Jaiswal opened up on his key partnership with Shubman Gill during India's dominant Day 1 at Headingley, revealing their simple but effective gameplan that led to twin centuries and a powerful platform for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bowling-coach-tim-southee-reaction-toss-india-dominate-leeds-test-2744030-2025-06-21",
      "headline": "Southee defends England's decision to bowl after India's Leeds show on Day 1ENG vs IND: England bowling coach Tim Southee came to the defence of captain Ben Stokes's decision to bowl first in the opening Test at Headingley after India put themselves firmly in the driver's seat on Day 1"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sachin-tendulkar-sourav-ganguly-banter-1st-test-day-1-leeds-2744021-2025-06-21",
      "headline": "Sachin Tendulkar nostalgic after young India's Leeds show, Sourav Ganguly reactsENG vs IND: Indian cricket legends Sachin Tendulkar and Sourav Ganguly were back in the spotlight after a nostalgic and light-hearted exchange on social media, following India's dominant display on the opening day of the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-reaction-parisdiamond-league-win-javelin-consistency-2744018-2025-06-21",
      "headline": "More 90m throws coming, but Neeraj Chopra proud of consistencyOlympic medal-winning Indian javelin throw superstar Neeraj Chopra was proud of his consistency after clinching his first Diamond League title in two years, upstaging German rival Julian Weber in a strong field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-paris-diamond-league-neeraj-chopra-title-win-result-julian-weber-2743987-2025-06-21",
      "headline": "No 90m, but Neeraj Chopra wins Paris Diamond League in first major crown of 2025There was no 90-metre magic for Neeraj Chopra, but he secured his first title of the season by claiming victory at the Paris Diamond League on Friday, June 20. Neeraj overcame the threat of Julian Weber to claim the first title win of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-test-yashasvi-jaiswal-planning-shubman-gill-2743980-2025-06-21",
      "headline": "Yashasvi Jaiswal reveals plan with Shubman Gill during Headingley standYashasvi Jaiswal opened up on his key partnership with Shubman Gill during India's dominant Day 1 at Headingley, revealing their simple but effective gameplan that led to twin centuries and a powerful platform for India."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}