{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam incidentThe company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Know who can file, new changes and other detailsThis year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanvi-the-great-box-office-day-1-anupam-kher-film-slow-start-earns-rs-40-lakh-2758093-2025-07-19",
      "headline": "Tanvi The Great box office Day 1: Slow start for Anupam Kher film, earns Rs 40 lakhAnupam Kher returned to direction with 'Tanvi The Great,' a film exploring autism and the Indian Army, but it received a lukewarm box office response despite critical acclaim abroad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-1-smashing-start-for-ahaan-panday-aneet-padda-mohit-suri-film-opens-at-rs-20-crore-2758085-2025-07-19",
      "headline": "Saiyaara box office Day 1: Smashing start for Ahaan-Aneet, film opens at Rs 20 croreMohit Suri's 'Saiyaara' has made a smashing debut at the Indian box office, breaking records with a Rs 20 crore opening day collection. The romantic drama featuring newcomer Ahaan Panday and Aneet Padda has struck a chord with audiences, setting a new benchmark for debut-led films in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-in-viral-jewellery-ad-with-prakash-varma-internet-is-stunned-2758080-2025-07-19",
      "headline": "Mohanlal embraces femininity in viral jewellery ad, internet is stunnedMohanlal showcased his unmatched versatility in a jewellery advertisement, captivating audiences with expressive eyes and graceful gestures. The ad, also featuring his 'Thudarum' co-star Prakash Varma, has received the internet's nod of approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-cinema-mid-year-box-office-report-tamil-telugu-malayalam-kannada-hits-misses-cinematic-saturday-2757249-2025-07-19",
      "headline": "South mid-year box office 2025: Malayalam-Tamil hold fort, Telugu-Kannada in crisisThe first half of 2025 brought contrasting fortunes for South Indian cinema with Malayalam and Tamil films performing well despite setbacks. Telugu and Kannada industries faced difficulties, but a strong lineup of big releases in the second half offers hope for recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-magic-man-2-review-the-alchemy-of-the-self-2757953-2025-07-18",
      "headline": "Magic Man 2 review: Jackson Wang's alchemy of the selfMagic Man 2 review: Jackson Wang's new album is an emotional map from chaos to clarity. 'Magic Man 2' is the work of a man who has lived, lost, and decided to tell the story in his own voice, on his own terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-abir-gulaal-boycott-and-censorship-reaction-so-much-hate-2757892-2025-07-18",
      "headline": "So much hate: Vaani Kapoor reacts to boycott and censorship after Abir Gulaal banActor Vaani Kapoor's recently spoke about film censorship and cancel culture in India. She expressed concerns about artistic freedom and the boycott trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-nayanthara-shoot-for-anil-ravipudis-film-in-kerala-video-leaks-online-2757957-2025-07-18",
      "headline": "Chiranjeevi, Nayanthara shoot for Anil Ravipudi film in Kerala, video goes viralA video from the sets of Anil Ravipudi's upcoming film, featuring Chiranjeevi and Nayanthara, is going viral on social media. The clip shows the stars filming a wedding scene in Kerala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-the-odyssey-imax-70mm-tickets-sell-out-a-year-before-its-2026-release-2757799-2025-07-18",
      "headline": "The Odyssey sets new record, Christopher Nolan's epic sells out a year in advanceDirector Christopher Nolan's 'The Odyssey' tickets for IMAX 70mm screenings sold out within an hour, a year before release. This unprecedented demand highlights the film's epic scale and Nolan's strong box-office pull. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-teams-up-with-director-joshiy-for-his-next-calls-it-dream-come-true-2757939-2025-07-18",
      "headline": "Unni Mukundan teams up with director Joshiy for his next, calls it dream come trueMalayalam cinema enthusiasts have a reason to rejoice as Unni Mukundan collaborates with legendary director Joshiy for a fresh action entertainer. This special project marks a significant milestone announced on Joshiy's birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aasif-khan-health-scare-reflux-disease-not-heart-attack-2757929-2025-07-18",
      "headline": "Aasif Khan clarifies health scare was reflux disease, not heart attackAasif Khan, known for his role in 'Panchayat', addresses rumours about his recent health scare, confirming it was not a heart attack but gastroesophageal reflux disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepak-tijori-on-losing-baazigar-to-shah-rukh-khan-it-was-all-very-amicable-2757930-2025-07-18",
      "headline": "Deepak Tijori on losing Baazigar to Shah Rukh Khan: It was all very amicableDeepak Tijori may have let go of 'Baazigar,' the film that became a turning point in Shah Rukh Khan's career, but he did so without regret or resentment. In an exclusive chat with India Today, the actor-director recalled how he had first narrated the film to Abbas-Mustan, only for it to land with SRK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonalika-joshi-taarak-mehtas-madhvi-bhide-recalls-being-called-a-chain-smoker-2757902-2025-07-18",
      "headline": "Sonalika Joshi, Taarak Mehta's Madhvi Bhide recalls being called a chain smokerActor Sonalika Joshi clarified a past photoshoot controversy where she was mistakenly labelled a chain smoker. She remained unfazed by social media backlash, valuing her family's support above public opinion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sitaare-zameen-par-writer-interview-says-aamir-never-interfered-he-respects-the-written-word-2757914-2025-07-18",
      "headline": "Sitaare Zameen Par writer says Aamir never interfered: He respects the written wordWhile Sitaare Zameen Par continues its impressive theatrical run, writer Divy Nidhi Sharma opens up about crafting humour within an emotional drama and working with Aamir Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nikita-roy-director-kussh-sinha-interview-on-nepotism-casting-sister-sonakshi-sinha-family-and-firsts-2757873-2025-07-18",
      "headline": "Had to earn my seat: Director Kussh Sinha on Nikita Roy, Sonakshi, family and firstsWith 'Nikita Roy', Kussh S Sinha steps out of the shadow of a celebrated surname and into his own cinematic light. In this conversation, the debut director opens up about casting his sister Sonakshi Sinha not out of convenience, but because of conviction, navigating the weight of legacy, and why filmmaking, for him, had to begin with patience and purpose. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-priyanka-chopra-resume-ssmb29-shoot-august-action-adventure-2757855-2025-07-18",
      "headline": "Mahesh Babu and Priyanka Chopra to resume SSMB29 shoot in AugustMahesh Babu and Priyanka Chopra will resume shooting for SS Rajamouli's 'SSMB29' in August. The film promises intense action and a globe-trotting adventure that could redefine their on-screen personas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nagesh-kukunoor-the-hunt-rajiv-gandhi-assassination-true-crime-series-sonyliv-2757784-2025-07-18",
      "headline": "Nagesh Kukunoor on making The Hunt without political biasNagesh Kukunoor discusses directing 'The Hunt', a true-crime series on Rajiv Gandhi's assassination. He shares the challenges of avoiding political content and self-censorship in today's filmmaking climate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-solo-music-career-killin-it-girl-mona-lisa-lollapalooza-berlin-2757755-2025-07-18",
      "headline": "BTS' J-Hope is building his solo empire and honestly, he's Killin' ItBTS member J-Hope is making headlines, topping charts, and rocking the stage with his solo career. In this week's K-fix, we will explore how the 'Killin' It' singer has redefined his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ekka-review-yuva-rajkumar-film-kannada-action-entertainer-2757845-2025-07-18",
      "headline": "Ekka review: Yuva Rajkumar's film is an almost perfect Kannada actionerRelease Date:Fri Jul 18, 2025Ekka movie review: Directed by Rohit Padaki, this Kannada gritty action film stars Yuva Rajkumar, Sanjana Anand and Sampada Hulivana in the lead. With a goosebumps-inducing first half and a good second half, the film is an exciting watch but also has its shortcomings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jurassic-world-rebirth-scarlett-johanssons-dino-saga-crosses-rs-100-crore-in-india-2757819-2025-07-18",
      "headline": "Jurassic World Rebirth: Scarlett Johansson's dino saga crosses Rs 100 crore in India'Jurassic World: Rebirth' hit Rs 100 crore in India, becoming the second highest-grossing Hollywood film in the country in 2025. The film, starring Scarlett Johansson and Jonathan Bailey, released in theatres on July 4. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/we-solved-it-through-trade-trump-says-he-helped-stop-india-pakistan-war-glbs-2758072-2025-07-19",
      "headline": "Trump says 5 jets were shot down during India-Pak clash, repeats truce claimThe US President, who made the remarks at a dinner with some Republican lawmakers, did not specify whether the jets belonged to India or Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/air-india-crash-reporting-is-premature-and-speculative-ntsb-chief-homendy-glbs-2758061-2025-07-19",
      "headline": "Reports on Air India crash probe premature, speculative: US probe agency chiefNTSB Chair Jennifer Homendy urged caution over early media coverage of the Air India crash, emphasising that investigations take time and all official updates should come from India's aviation authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-sends-notice-to-google-meta-in-online-betting-app-cases-summon-for-questioning-on-july-21-2758099-2025-07-19",
      "headline": "ED sends notices to Google, Meta in betting app cases, summons for questioningGoogle and Meta have been summoned by the ED for questioning on July 21, accusing them of promoting online betting apps under investigation for money laundering and other financial crimes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-understand-marathi-youll-get-slapped-mns-chief-raj-thackeray-warns-non-locals-in-mumbai-2757997-2025-07-18",
      "headline": "Don't understand Marathi? You'll get slapped, Raj Thackeray warns non-localsMNS chief Raj Thackeray issued a fresh threat to non-Marathi speakers in Mumbai, saying that if they 'fool around,' they will be slapped. He warned non-Marathi locals to go about their work quietly or face the consequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-mohammed-siraj-workload-comparison-2758089-2025-07-19",
      "headline": "Jasprit Bumrah gets rest for his workload, Mohammed Siraj deserves same careWhile Jasprit Bumrah's workload is being managed with precision, Mohammed Siraj has quietly become Indian cricket's most tireless workhorse—and it's time he got the same care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-designates-the-resistance-front-terrorist-group-pakistan-rejects-claims-2758030-2025-07-18",
      "headline": "Pak cries foul after US terror tag for Lashkar proxy, blames 'Indian propaganda'After the US designated The Resistance Front as a terrorist organisation, Pakistan rejected the accusations, calling itself a frontline state against terrorism and condemning India's claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam incidentThe company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-us-branding-pahalgam-perpetrator-trf-a-global-terror-outfit-is-a-message-to-pakistan-2757806-2025-07-18",
      "headline": "By naming TRF global terror outfit, US is sending a message to PakistanThe Resistance Front (TRF), responsible for numerous terror strikes in Kashmir, is directed by the Pakistani military and intelligence, with its leadership and training pads based in Pakistan\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sohail-khan-kudo-world-cup-silver-india-exclusive-golden-boy-2758078-2025-07-19",
      "headline": "The Silent Fighter: How Sohail Khan put India on the Kudo World MapIn an exclusive interview, Madhya Pradesh's Sohail Khan reflects on his remarkable journey - becoming the first Indian male to reach a Kudo World Cup final, carrying not just a silver medal but also placing India on the global map of a sport still struggling for recognition back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-threatens-10-tariff-on-brics-says-bloc-will-end-very-quickly-glbs-2758074-2025-07-19",
      "headline": "Trump threatens 10% tariff on Brics, says bloc 'will end very quickly'Trump mocked Brics as a fading group, accused it of trying to challenge the US dollar, and claimed his warnings scared leaders from meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/senior-bank-official-shivshankar-mitra-suicide-pune-workplace-stress-2758082-2025-07-19",
      "headline": "Bank manager dies by suicide inside work premises, note blames work pressureShivshankar Mitra asked a colleague to get him a rope, which he later used to hang himself, as captured by the bank's CCTV cameras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-in-viral-jewellery-ad-with-prakash-varma-internet-is-stunned-2758080-2025-07-19",
      "headline": "Mohanlal embraces femininity in viral jewellery ad, internet is stunnedMohanlal showcased his unmatched versatility in a jewellery advertisement, captivating audiences with expressive eyes and graceful gestures. The ad, also featuring his 'Thudarum' co-star Prakash Varma, has received the internet's nod of approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-sues-rupert-murdoch-wsj-over-epstein-birthday-letter-story-glbs-2758060-2025-07-19",
      "headline": "Trump sues Rupert Murdoch, WSJ for $10 billion over Epstein letter exposeThe defamation lawsuit came days after the Wall Street Journal published claims that Trump had sent Epstein a birthday letter in 2003."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-accuses-uddhav-thackeray-betraying-devendra-fadnavis-2019-maharashtra-assembly-elections-2758039-2025-07-19",
      "headline": "50 calls from Fadnavis, no reply: Eknath Shinde rips into Uddhav for ditching BJPEknath Shinde accused Uddhav Thackeray of betraying Devendra Fadnavis and the BJP alliance in the 2019 assembly elections. The allegations highlight ongoing political tensions within Maharashtra's Shiv Sena factions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hindutva-teaches-ahimsa-not-weakness-shivraj-chouhans-veiled-hindi-chini-dig-at-nehru-2757982-2025-07-18",
      "headline": "Hindutva teaches ahimsa, not weakness: Shivraj Chouhan's 'Hindi Chini' dig at NehruUnion Agriculture Minister Shivraj Singh Chouhan took a veiled dig at the 'Hindi Chini Bhai Bhai' catchphrase popularised by former Prime Minister Jawaharlal Nehru in the years leading to India's 1962 war with China, stating that the non-violence practised in Hindutva does not imply weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/do-microgreens-deserve-a-place-on-your-plate-2757729-2025-07-19",
      "headline": "Do microgreens deserve a place on your plate?Microgreens have become a buzzword in the food industry. They are highly nutritious and easy to grow at home. But are they too good to be true?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-said-giving-up-custody-after-divorce-doesnt-mean-mother-abandoned-child-2758047-2025-07-19",
      "headline": "Giving up custody after divorce doesn't mean mother abandoned child: High CourtThe Aurangabad bench of the Bombay High Court granted the mother interim custody of her five-and-a-half-year-old daughter, overturning an earlier rejection by a lower court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/to-pay-alimony-to-divorced-wife-nagpur-man-kanhaiya-narayan-baurashi-chain-snatching-2758057-2025-07-19",
      "headline": "Jobless man turns to chain-snatching to pay Rs 6,000 monthly alimony to ex-wifeThe accused Kanhaiya admitted he turned to crime as a desperate measure to pay Rs 6,000 in monthly alimony to his first wife, as ordered by the court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-1-smashing-start-for-ahaan-panday-aneet-padda-mohit-suri-film-opens-at-rs-20-crore-2758085-2025-07-19",
      "headline": "Saiyaara box office Day 1: Smashing start for Ahaan-Aneet, film opens at Rs 20 croreMohit Suri's 'Saiyaara' has made a smashing debut at the Indian box office, breaking records with a Rs 20 crore opening day collection. The romantic drama featuring newcomer Ahaan Panday and Aneet Padda has struck a chord with audiences, setting a new benchmark for debut-led films in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/indias-first-digital-arrest-conviction-nine-people-sentenced-to-life-by-bengal-court-2758042-2025-07-19",
      "headline": "India's first digital arrest conviction: 9 sentenced to life by Bengal courtThe nine convicts have been identified as Md Imtiyaz Ansari, Shahid Ali Shaikh, Shahrukh Rafik Shaikh, Jatin Anup Ladwal, Rohit Singh, Rupesh Yadav, Sahil Singh, Pathan Sumaiya Banu, Pathan Sumaiya Banu, and Faldu Ashoke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-banker-dies-by-suicide-over-online-scam-leaves-hug-me-once-note-to-parents-2758033-2025-07-18",
      "headline": "Banker dies by suicide over online scam, leaves 'hug me once' note to parentsA 25-year-old Gujarat woman died by suicide after losing Rs 28 lakh in an online task scam. She left a heartbreaking note for her parents, asking them to \"hug me once.\"\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madurai-suspended-police-constable-boasts-assault-wife-dowry-harassment-2758032-2025-07-19",
      "headline": "Suspended Tamil Nadu cop brags to sister, mother about assaulting wife; son saw itSuspended constable Bhoopalan in Madurai boasts about attacking his wife in an audio recording. The case highlights allegations of dowry harassment involving family members, under police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanvi-the-great-box-office-day-1-anupam-kher-film-slow-start-earns-rs-40-lakh-2758093-2025-07-19",
      "headline": "Tanvi The Great box office Day 1: Slow start for Anupam Kher film, earns Rs 40 lakhAnupam Kher returned to direction with 'Tanvi The Great,' a film exploring autism and the Indian Army, but it received a lukewarm box office response despite critical acclaim abroad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-1-smashing-start-for-ahaan-panday-aneet-padda-mohit-suri-film-opens-at-rs-20-crore-2758085-2025-07-19",
      "headline": "Saiyaara box office Day 1: Smashing start for Ahaan-Aneet, film opens at Rs 20 croreMohit Suri's 'Saiyaara' has made a smashing debut at the Indian box office, breaking records with a Rs 20 crore opening day collection. The romantic drama featuring newcomer Ahaan Panday and Aneet Padda has struck a chord with audiences, setting a new benchmark for debut-led films in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-in-viral-jewellery-ad-with-prakash-varma-internet-is-stunned-2758080-2025-07-19",
      "headline": "Mohanlal embraces femininity in viral jewellery ad, internet is stunnedMohanlal showcased his unmatched versatility in a jewellery advertisement, captivating audiences with expressive eyes and graceful gestures. The ad, also featuring his 'Thudarum' co-star Prakash Varma, has received the internet's nod of approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-magic-man-2-review-the-alchemy-of-the-self-2757953-2025-07-18",
      "headline": "Magic Man 2 review: Jackson Wang's alchemy of the selfMagic Man 2 review: Jackson Wang's new album is an emotional map from chaos to clarity. 'Magic Man 2' is the work of a man who has lived, lost, and decided to tell the story in his own voice, on his own terms."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-mohammed-siraj-workload-comparison-2758089-2025-07-19",
      "headline": "Jasprit Bumrah gets rest for his workload, Mohammed Siraj deserves same careWhile Jasprit Bumrah's workload is being managed with precision, Mohammed Siraj has quietly become Indian cricket's most tireless workhorse—and it's time he got the same care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-names-jasprit-bumrahs-replacement-for-4th-test-2758088-2025-07-19",
      "headline": "ENG vs IND: Ajinkya Rahane names Jasprit Bumrah's ideal replacement for 4th TestIndia batter Ajinkya Rahane has named the ideal replacement for Jasprit Bumrah for the fourth Test against England set to begin from July 23 at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-refutes-fabricated-quote-on-jasprit-bumrah-stop-fake-news-2758081-2025-07-19",
      "headline": "Irfan Pathan refutes fabricated quote on Jasprit Bumrah: Stop fake newsFormer India all-rounder Irfan Pathan has denounced a fabricated quote on Jasprit Bumrah's workload being spread under his name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sohail-khan-kudo-world-cup-silver-india-exclusive-golden-boy-2758078-2025-07-19",
      "headline": "The Silent Fighter: How Sohail Khan put India on the Kudo World MapIn an exclusive interview, Madhya Pradesh's Sohail Khan reflects on his remarkable journey - becoming the first Indian male to reach a Kudo World Cup final, carrying not just a silver medal but also placing India on the global map of a sport still struggling for recognition back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-pratika-rawal-icc-sanction-fine-2758017-2025-07-18",
      "headline": "After ICC fine, Rawal says shoulder contact with England stars unintentionalIndia batter Pratika Rawal said that the shoulder contact she had with England stars Lauren Filer and Sophie Ecclestone were unintentional after she was sanctioned by the ICC on Friday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-sign-noni-madueke-from-chelsea-mikel-arteta-2758005-2025-07-18",
      "headline": "Arsenal complete signing of Noni Madueke from ChelseaArsenal have announced that they have completed the signing of Noni Madueke from Chelsea on Friday, July 18. Madueke joins on a reported five-year contract for a total deal of 50 million pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-kashi-i-league-champions-solo-cas-battle-co-founder-aryaman-shukla-2757995-2025-07-18",
      "headline": "Satyamev Jayate: Inter Kashi reclaim I-League crown after solo CAS battleInter Kashi co-founder Aryaman Shukla calls it a victory for truth as the club wins a solo legal battle to be officially crowned I-League champions after CAS rules in their favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-bryan-mbeumo-signing-rio-ferdinand-2757983-2025-07-18",
      "headline": "Why Mbeumo is perfect signing for Manchester United? Ferdinand explainsRio Ferdinand explained why Bryan Mbeumo is the perfect signing for Manchester United as the forward edges closer to completing the move. Reports on Friday, July 18 suggested that United reached an agreement with Brentford for the signing of the Cameroonian international. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-3rd-t20i-tri-series-report-devon-conway-matt-henry-harare-2757974-2025-07-18",
      "headline": "Conway, Henry star as New Zealand make it two out of two in tri-seriesDevon Conway and Matt Henry were the stars of the show as New Zealand thrashed Zimbabwe by 8 wickets to continue their fine form in the tri-series on Friday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-number-three-farokh-engineer-sai-sudharsan-2757944-2025-07-18",
      "headline": "Karun Nair slammed by Engineer: A beautiful 30 is not expected from a No. 3Farokh Engineer criticises Karun Nair's inconsistent performance at No.3 in the ongoing India-England Test series. The former wicketkeeper urged selectors to pick the best XI for the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-fc-goa-head-coach-return-india-exit-indian-super-league-2757940-2025-07-18",
      "headline": "Manolo Marquez returns as FC Goa head coach after disastrous India stintAfter a short-lived and disappointing spell with the Indian national team, Manolo Marquez is back in familiar territory as FC Goa head coach, just as the Indian Super League faces an uncertain future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-kashi-i-league-champions-solo-cas-battle-co-founder-aryaman-shukla-2757995-2025-07-18",
      "headline": "Satyamev Jayate: Inter Kashi reclaim I-League crown after solo CAS battleInter Kashi co-founder Aryaman Shukla calls it a victory for truth as the club wins a solo legal battle to be officially crowned I-League champions after CAS rules in their favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-bryan-mbeumo-signing-rio-ferdinand-2757983-2025-07-18",
      "headline": "Why Mbeumo is perfect signing for Manchester United? Ferdinand explainsRio Ferdinand explained why Bryan Mbeumo is the perfect signing for Manchester United as the forward edges closer to completing the move. Reports on Friday, July 18 suggested that United reached an agreement with Brentford for the signing of the Cameroonian international. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-3rd-t20i-tri-series-report-devon-conway-matt-henry-harare-2757974-2025-07-18",
      "headline": "Conway, Henry star as New Zealand make it two out of two in tri-seriesDevon Conway and Matt Henry were the stars of the show as New Zealand thrashed Zimbabwe by 8 wickets to continue their fine form in the tri-series on Friday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-number-three-farokh-engineer-sai-sudharsan-2757944-2025-07-18",
      "headline": "Karun Nair slammed by Engineer: A beautiful 30 is not expected from a No. 3Farokh Engineer criticises Karun Nair's inconsistent performance at No.3 in the ongoing India-England Test series. The former wicketkeeper urged selectors to pick the best XI for the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-fc-goa-head-coach-return-india-exit-indian-super-league-2757940-2025-07-18",
      "headline": "Manolo Marquez returns as FC Goa head coach after disastrous India stintAfter a short-lived and disappointing spell with the Indian national team, Manolo Marquez is back in familiar territory as FC Goa head coach, just as the Indian Super League faces an uncertain future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-tri-series-new-zealand-glenn-phillips-ruled-out-groin-injury-2757920-2025-07-18",
      "headline": "Zimbabwe tri-series: NZ's Glenn Phillips ruled out due to groin injuryNew Zealand's Glenn Phillips has been ruled out of the ongoing tri-series in Zimbabwe due to a groin injury that he picked up during the Major League Cricket 2025 final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/la-olympics-west-indies-cricket-identity-rules-individual-participation-2757908-2025-07-18",
      "headline": "LA Olympics 2028: West Indies' cricket dream in doubt as identuty rules clashCricket returns to the Olympics after over a century, but West Indies—despite being one of the sport's most storied teams—could miss out entirely due to the region's fragmented national identities and Olympic rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-ravindra-jadeja-approach-balwinder-singh-sandhu-2757891-2025-07-18",
      "headline": "Ravindra Jadeja's lack of trust in tail cost India Lord's Test: World Cup winnerFormer Indian cricketer Balwinder Singh Sandhu has questioned Ravindra Jadeja's tactics in India's narrow loss at Lord's, pointing to a lack of trust in the tail during the final moments of the third Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-brentford-bryan-mbeumo-agreement-reports-2757881-2025-07-18",
      "headline": "Manchester United, Brentford reach agreement for Bryan Mbeumo: ReportManchester United and Brentford have reportedly reached an agreement for the transfer of Bryan Mbeumo for a deal reportedly worth 71 million pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/i-league-inter-kashi-champion-cas-verdict-churchill-brothers-indian-super-league-promotion-2757848-2025-07-18",
      "headline": "Inter Kashi named as I-League champions after CAS ruling against Churchill BrothersInter Kashi's debut season ends in high drama as CAS overturns AIFF's ruling, declaring them I-League champions. But while promotion beckons, the uncertain future of ISL casts a shadow on their historic achievement.leader Churchill Brothers on goal difference. Churchill will now drop to second place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-58-runs-away-from-joining-garfield-sobers-2757849-2025-07-18",
      "headline": "Ravindra Jadeja 58 runs away from joining Garfield Sobers in elite listIndia all-rounder Ravindra Jadeja finds himself on the verge of entering an elite list with the legendary Sir Garfield Sobers as he's just 58 runs away from completing 1000 Test runs in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riley-norton-south-africa-u19-all-rounder-u20-rugby-world-cup-2757846-2025-07-18",
      "headline": "Who is Riley Norton? South Africa's U19 all-rounder and U20 Rugby World Cup finalistRiley Norton is rewriting the script for young athletes—after shining in cricket's U19 World Cup, he's now captaining South Africa in a rugby world final, proving that elite talent knows no boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/las-vegas-freestyle-chess-praggnanandhaa-out-of-title-race-erigaisi-into-semis-2757842-2025-07-18",
      "headline": "Las Vegas Freestyle chess: Praggnanandhaa out of title race, Erigaisi into semisR Praggnanandhaa crashed out of the title race at the Las Vegas Freestyle chess while Arjun Erigaisi stormed into the semis with a comprehensive win over Uzbekistan's Nodirbek Abdusattorov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/i-league-inter-kashi-champion-cas-verdict-churchill-brothers-indian-super-league-promotion-2757848-2025-07-18",
      "headline": "Inter Kashi named as I-League champions after CAS ruling against Churchill BrothersInter Kashi's debut season ends in high drama as CAS overturns AIFF's ruling, declaring them I-League champions. But while promotion beckons, the uncertain future of ISL casts a shadow on their historic achievement.leader Churchill Brothers on goal difference. Churchill will now drop to second place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-58-runs-away-from-joining-garfield-sobers-2757849-2025-07-18",
      "headline": "Ravindra Jadeja 58 runs away from joining Garfield Sobers in elite listIndia all-rounder Ravindra Jadeja finds himself on the verge of entering an elite list with the legendary Sir Garfield Sobers as he's just 58 runs away from completing 1000 Test runs in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riley-norton-south-africa-u19-all-rounder-u20-rugby-world-cup-2757846-2025-07-18",
      "headline": "Who is Riley Norton? South Africa's U19 all-rounder and U20 Rugby World Cup finalistRiley Norton is rewriting the script for young athletes—after shining in cricket's U19 World Cup, he's now captaining South Africa in a rugby world final, proving that elite talent knows no boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/las-vegas-freestyle-chess-praggnanandhaa-out-of-title-race-erigaisi-into-semis-2757842-2025-07-18",
      "headline": "Las Vegas Freestyle chess: Praggnanandhaa out of title race, Erigaisi into semisR Praggnanandhaa crashed out of the title race at the Las Vegas Freestyle chess while Arjun Erigaisi stormed into the semis with a comprehensive win over Uzbekistan's Nodirbek Abdusattorov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-monty-panesar-on-arshdeep-singh-jasprit-bumrah-2757794-2025-07-18",
      "headline": "ENG vs IND: Monty Panesar surprised by India's major blunder in first 3 TestsFormer India spinner Monty Panesar has been left surprised by the non-selection of Arshdeep Singh in the first three Tests of the series against England. The left-arm spinner earned his maiden Test call-up for the ongoing England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-shouldnt-play-in-manchester-if-he-cant-keep-wickets-ravi-shastri-2757766-2025-07-18",
      "headline": "Rishabh Pant shouldn't play in Manchester if he can't keep wickets: Ravi ShastriFormer India cricketer and head coach Ravi Shastri feels Rishabh Pant shouldn't play the fourth Test against Englandt at Old Trafford, Manchester if he can't keep wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fine-pratika-rawal-on-field-conduct-england-slow-over-rate-2757765-2025-07-18",
      "headline": "ICC penalises Pratika Rawal for conduct, England fall short on over-rateThe ICC has penalised both Pratika Rawal and the England women's cricket team for their respective violations in the recently-concluded ODI that was held in Southampton earlier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-review-controversy-lords-test-edgbaston-gill-2757701-2025-07-18",
      "headline": "ENG vs IND: Manufacturer to review Dukes ball after rising quality concernsENG vs IND: The Dukes' ball manufacturers have confirmed that they will have a look at the match balls from the first three Tests to identify why the ball has been getting softer fairly quickly in the ongoing series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bevon-jacobs-relishes-dream-debut-for-new-zealand-on-south-africa-return-2757680-2025-07-18",
      "headline": "Bevon Jacobs relishes dream debut for New Zealand on South Africa returnBevon Jacobs relished a dream debut for New Zealand in the country of his birth, South Africa, as they defeated the Proteas in the opening game of the T20 Tri-Series in Harare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-batting-form-affected-by-heated-exchange-zak-crawley-lords-test-2757628-2025-07-18",
      "headline": "Manjrekar questions Shubman Gill's sledging battle after Lord's lossSanjay Manjrekar has suggested that Shubman Gill's fiery on-field spat with Zak Crawley during the Lord's Test may have thrown the young Indian skipper off his game and affected his performance with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-in-limbo-vision-2047-aiff-fsdl-2757613-2025-07-18",
      "headline": "India's Vision 2047 can wait as football's leaky boat needs fixing firstIndia's Vision 2047 wants to take football to the stars — but right now, the engine's sputtering. With ISL stalled and the national team coachless, Indian football needs repair, not just ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-must-curb-aggressive-instinct-dilip-vengsarkar-2757617-2025-07-18",
      "headline": "Yashasvi Jaiswal must curb aggressive instinct after Lord's blunder: Dilip VengsarkarFormer India batter Dilip Vengsarkar has asked Yashasvi Jaiswal to curb his aggressive instinct after his twin failures in the Lord's Test which eventually led to India's 22-run loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-fight-praised-gautam-gambhir-lords-test-india-lose-2757585-2025-07-18",
      "headline": "Ravindra Jadeja's resilience in Lord's Test earns him MVP praise from Team IndiaIndia head coach Gautam Gambhir was full of praise for seasoned all-rounder Ravindra Jadeja, hailing his battling knock in the Lord's Test against England as a display of \"incredible fight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}