{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pay10-becomes-first-entity-to-go-live-on-cbuaes-open-finance-framework-2714105-2025-04-24",
      "headline": "Pay10 becomes first entity to go live on CBUAE's open finance frameworkThe new license gives Pay10 secure, real-time access to consumer bank accounts, enabling seamless third-party financial services. This sets the foundation for broader innovations in areas such as embedded finance, digital identity, and interoperable payment systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-to-receive-lata-deenanath-mangeshkar-award-2025-2714079-2025-04-24",
      "headline": "Kumar Mangalam Birla to receive Lata Deenanath Mangeshkar Award 2025The 57-year-old industrialist, Padma Bhushan awardee and Chairman of the Aditya Birla Group, is being honoured for his pivotal role in shaping India's growth story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wives-are-smarter-harsh-goenka-gold-vs-gadget-lesson-goes-viral-2714047-2025-04-24",
      "headline": "'Wives are smarter': Harsh Goenka's gold vs gadget lesson goes viralOn April 24, at 10.30 am, gold on the Multi Commodity Exchange (MCX) was at Rs 95,893 per 10 grams, up Rs 1,171. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-315-points-lower-nifty-below-24250-hul-falls-4-percent-2714007-2025-04-24",
      "headline": "Sensex, Nifty snap 7-day winning streak, HUL falls 4% after Q4 resultsThe S&P BSE Sensex was down 315.06 points to 79,801.43 at the closing bell, while the NSE Nifty50 fell 82.25 points to settle at 24,246.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-indus-waters-treaty-india-pause-impact-pakistan-economy-pahalgam-attack-2713972-2025-04-24",
      "headline": "India hits pause on Indus Waters Treaty: Could this dry up Pakistan's economy?India has suspended the Indus Waters Treaty (IWT). The announcement was made by Foreign Secretary Vikram Misri on Wednesday, a day after a deadly attack in Pahalgam killed several civilians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-vs-mutual-funds-what-should-you-invest-in-for-better-returns-which-investment-give-higher-returns-2713963-2025-04-24",
      "headline": "Gold vs mutual funds: What should you invest in for better returns?Gold is often seen as a safe investment. When markets are shaky or inflation rises, many investors turn to gold. On the other hand, mutual funds, particularly equity funds, are linked to the stock market. When the market does well, your mutual fund investment can grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-today-india-yellow-metal-rates-in-metro-cities-silver-what-to-expect-us-dollar-global-market-2713934-2025-04-24",
      "headline": "Gold prices today: Check rates in metro cities. What to expect?On the Multi Commodity Exchange (MCX), gold was priced at Rs 95,893 per 10 grams at 10.30 am, which was a rise of Rs 1,171 from the last close."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-last-date-refund-timeline-and-documents-all-you-need-to-know-2713924-2025-04-24",
      "headline": "ITR filing 2025: Last date, refund timeline and documents. All you need to knowYou can submit your ITR for the year of assessment 2025-26 once the online portal goes live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/middle-class-stuck-in-debt-trap-says-marcellus-investments-saurabh-mukherjea-2713887-2025-04-24",
      "headline": "Middle-class stuck in debt trap, says Marcellus Investment's Saurabh MukherjeaUsing data from the Reserve Bank of India, Mukherjea estimates that 5-10% of middle-class households are now stuck in a debt trap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-share-upi-with-family-check-steps-to-use-bhim-app-upi-circle-2713877-2025-04-24",
      "headline": "Want to share UPI with family? Check steps to use BHIM app's UPI CircleUPI Circle is a feature where the main UPI account holder or the primary user can authorise up to five trusted people, i.e., secondary users to make UPI payments using his account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-clears-ed-notice-pmla-act-report-share-prce-fall-over-50-percent-in-last-6-months-2713873-2025-04-24",
      "headline": "Gensol says no ED notice received by company, stock continues steep fallGensol share price: The stock fell 5% to hit the lower circuit limit and has fallen over 50% in the last 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hul-q4-results-net-profit-4-percent-drop-rs-2464-crore-final-dividend-announced-2713861-2025-04-24",
      "headline": "HUL Q4 profit falls 4% to Rs 2,464 crore; announces Rs 24 final dividendThe FMCG major reported a consolidated net profit of Rs 2,464 crore for the March quarter, down 3.7% from Rs 2,558 crore in the same period last year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srinidhi-shetty-lost-nitesh-tiwari-ramayana-sita-to-sai-pallavi-2714680-2025-04-24",
      "headline": "Srinidhi Shetty on missing out Sita's role to Sai Pallavi in RamayanaNot many are aware that popular South Indian actor Srinidhi Shetty gave a screen test for Nitesh Tiwari's Ramayana. However, she lost it to Sai Pallavi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dia-mirza-says-kaafir-altered-her-taught-me-the-value-of-being-fearless-2714629-2025-04-24",
      "headline": "Dia Mirza says Kaafir altered her: Taught me the value of being fearlessDia Mirza reveals how her role in 'Kaafir' transformed her perspective on fearlessness and autonomy. The film adaptation of the series offers a fresh chance for audiences to engage with its profound themes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-fauji-co-star-imanvi-denies-rumours-of-pakistani-military-links-2714078-2025-04-24",
      "headline": "Imanvi, Prabhas's Fauji co-star, denies links to Pakistani militaryImanvi, Prabhas's co-star in 'Fauji', denies false claims linking her family to the Pakistani military and calls out fake news in a strong Instagram statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-calls-out-male-actors-for-pretending-to-be-woke-feminist-allies-2714054-2025-04-24",
      "headline": "Malavika Mohanan calls out male actors for pretending to be woke, feminist alliesActor Malavika Mohanan called out male actors who project a facade of feminism and wokeness, only to reveal deeply misogynistic behaviour behind the scenes. She criticised those who wear the mask of being 'woke' while embodying the exact opposite in reality.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/penn-badgley-on-dating-gossip-girl-co-star-blake-lively-personal-toll-of-playing-dan-2714042-2025-04-24",
      "headline": "Penn Badgley on dating Blake Lively during Gossip Girl: It was a strugglePenn Badgley reflected on his past romance with Gossip Girl co-star Blake Lively and opened up about how portraying a long-term character on screen affected his personal life.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/gangers-review-even-vadivelus-humour-cant-save-sundar-cs-outdated-film-2714037-2025-04-24",
      "headline": "Gangers review: Even Vadivelu's humour can't save Sundar C's outdated filmReleased-Thu Apr 24, 2025Gangers movie review: While director Sundar C says he makes films for the audience, this one feels stuck, somewhere between trying too hard to please and struggling to make us laugh. It's packed with masala tropes but lacks the spark that once made his films click."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhagyashree-slams-user-questioning-pakistan-role-pahalgam-terror-attack-2714019-2025-04-24",
      "headline": "Brainless idiot: Bhagyashree slams user questioning Pakistan's role in attackVeteran actor Bhagyashree slammed a social media user who questioned Pakistan's role in the recent Pahalgam terror attack that claimed the lives of 26 tourists. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-chennai-concert-cancelled-pahalgam-attack-organisers-promise-refund-2714039-2025-04-24",
      "headline": "Arijit Singh's Chennai concert cancelled after Pahalgam attack, refund promisedSinger Arijit Singh's Chennai concert has been cancelled after the tragic Pahalgam incident. The makers shared a statement and promised. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-rajinikanth-nelson-dilipkumar-jailer-2-2714038-2025-04-24",
      "headline": "Actor Fahadh Faasil to reunite with Rajinikanth in Jailer 2: ReportMalayalam actor Fahadh Faasil is likely to reunite with Superstar Rajinikanth for director Nelson Dilipkumar's 'Jailer 2'. The two actors earlier worked together in director TJ Gnanavel's 'Vettaiyan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanashree-verma-to-make-her-acting-debut-with-telugu-film-akasam-daati-vastaava-2713971-2025-04-24",
      "headline": "Dhanashree Verma to make her acting debut with dance-centric Telugu filmChoreographer Dhanashree Verma is set to make her acting debut with the Telugu film 'Akasam Daati Vastaava.' The upcoming dance-centric movie is backed by Dil Raju. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-postpones-bengaluru-concert-ticket-sales-after-phalgam-terror-attack-2713927-2025-04-24",
      "headline": "Composer Anirudh pauses Bengaluru concert ticket sales after Pahalgam attackComposer Anirudh Ravichander has halted the ticket sales of his Bengaluru concert in the wake of the Pahalgam terror attack. He mentioned that the new date will be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/demi-moore-named-worlds-most-beautiful-person-of-2025-2713919-2025-04-24",
      "headline": "Demi Moore named World's Most Beautiful person of 2025Demi Moore, 'The Substance' actor, has been named the World's Most Beautiful person of 2025 by People Magazine. The 62-year-old Hollywood icon broke age norms as she appeared on the magazine's annual cover, reflecting on beauty, ageing, and self-acceptance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-indecent-explicit-remarks-sexual-connotations-vincy-aloshious-2713944-2025-04-24",
      "headline": "After Vincy Aloshious, another actor accuses Shine Tom Chacko of indecent behaviourAfter Vincy Aloshious, actor Aparna John accused co-star Shine Tom Chacko of indecent behaviour. She said that his remarks were explicit with sexual connotations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/fawad-khan-film-abir-gulal-pakistani-actor-government-ib-ministry-will-not-be-allowed-to-release-in-india-2713942-2025-04-24",
      "headline": "Fawad Khan's Abir Gulal won't be allowed to release in India: Government sourcesFawad Khan and Vaani Kapoor's 'Abir Gulal' will not be allowed to release in India, according to government sources. The movie was slated for release in India on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anjali-anand-mother-was-cynical-of-her-joining-films-nothing-happens-without-contacts-2713885-2025-04-24",
      "headline": "Anjali Anand's mother was cynical about her film dreams: Nothing without contactsAnjali Anand reflects on her journey in the film industry, revealing her mother's initial scepticism about her career choice due to lack of connections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fawad-khan-vaani-kapoor-abir-gulaal-under-scanner-delayed-all-about-controversy-pahalgam-terror-attack-2713936-2025-04-24",
      "headline": "Why Fawad Khan, Vaani Kapoor's Abir Gulaal under scanner? All about the controversyPakistani actor Fawad Khan's upcoming film 'Abir Gulaal' has faced public outrage amid the terror attack in Pahalgam, with calls to boycott its release. The movie is slated to hit the screens on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-bas-baap-achha-hai-dont-know-his-acting-rahul-bhatt-2713878-2025-04-24",
      "headline": "Ranbir Kapoor bas baap achha hai, don't know his acting: Rahul BhattRahul Bhatt, Alia Bhatt's step-brother, talked about her husband Ranbir Kapoor in an interview. He said he doesn't know much about his acting skills but respects him for the kind of father he is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-breaks-silence-on-trolling-after-split-with-saira-banu-2713870-2025-04-24",
      "headline": "AR Rahman breaks silence on trolling after split: Even God gets reviewed, who am I?Singer and music composer AR Rahman finally broke his silence surrounding the online trolling following his separation announcement with wife Saira Banu. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-fan-from-kerala-pitches-film-script-at-hit-3-kerala-event-viral-video-2713856-2025-04-24",
      "headline": "Nani's fan pitches film script at event, actor's encouraging gesture wins heartAn ardent fan of Telugu actor Nani from Kerala pitched a film script to him at the Kochi event of his upcoming film, 'HIT 3'. The actor promised to read his synopsis and encouraged him to pursue cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/all-party-meeting-pahalgam-attack-government-says-local-authorities-opened-baisaran-without-intel-nod-2714697-2025-04-24",
      "headline": "At all-party meet, government admits to security lapse in Pahalgam: SourcesAt all-party meet, government says local authorities opened Baisaran in Pahalgam without intel nod: Sources"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-asks-indians-on-saarc-visa-to-leave-shuts-wagah-border-closes-air-space-pahalgam-attack-jammu-kashmir-2714052-2025-04-24",
      "headline": "Pak pauses Simla accord, shuts airspace for India after Delhi's diplomatic strikeIndia on Wednesday announced a five-pronged diplomatic response to Pakistan, including suspension of the Indus Waters Treaty, following the Pahalgam carnage. Less than 24 hours later, Pakistan announced a series of retaliatory measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-suspends-pakistani-visas-medical-jammu-kashmir-pahalgam-attack-2714022-2025-04-24",
      "headline": "India revokes Pakistanis' visas, advises citizens to return as it ups offensiveIndia has cancelled all Pakistani visas, including medical ones, in response to the deadly Pahalgam terror attack which took place on April 22, killing as many as 26 people, mostly tourists. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-pakistan-rangers-custody-accidentally-cross-international-border-flag-meets-ensure-return-2714075-2025-04-24",
      "headline": "BSF jawan in Pakistan custody after accidental border crossing: SourcesConstable PK Singh of the 182nd BSF battalion was detained by Pakistan Rangers after he accidentally crossed the Punjab border. Talks are on between the two forces to secure his safe release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-why-pakistan-army-chief-asim-munir-risking-mini-war-with-india-2714005-2025-04-24",
      "headline": "Why Pak army chief Asim Munir is desperate for a mini-war with IndiaIndia's top leadership, including PM Narendra Modi, has vowed a befitting reply over the Pahalgam massacre. Pakistan's role is undeniable, and India has both diplomatic and kinetic options on the table, like after the Uri and Pulwama attacks. This is why Pakistan's army chief, General Asim Munir, might be risking a limited war with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-briefs-envoys-of-select-nations-on-jk-attack-as-it-moves-to-isolate-pak-2714100-2025-04-24",
      "headline": "India briefs envoys of select nations on J&K attack as it moves to isolate PakEnvoys of select G20 countries, including China and Canada, were briefed by the MEA on the Pahalgam terror attack that claimed 26 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-conducts-drills-simulating-attacks-on-mountain-ground-target-exercise-aakraman-2714674-2025-04-24",
      "headline": "Air Force conducts drills simulating attacks on mountain, ground targetsRafale jets roar in the central skies as the Air Force simulates deep-strike ops in 'Exercise Aakraman' amid heightened India-Pakistan tensions following the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/simla-agreement-the-1972-pact-that-shaped-india-pakistan-relations-2714104-2025-04-24",
      "headline": "​Simla Agreement: All about the 1972 pact that shaped India-Pakistan relations​The Simla Agreement, signed in 1972, aimed to establish lasting peace between India and Pakistan post the 1971 war. Recent developments have brought its relevance back into focus.​\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-punishes-pakistan-diplomatic-measures-trade-indus-treaty-visa-fawad-khan-film-2714610-2025-04-24",
      "headline": "Trade to water: India punishes Pak with diplomatic blitz for Pahalgam horrorIndia's retaliatory measures also included an attempt to isolate Pakistan on the global stage by holding a meeting with top diplomats and envoys following the Pahalgam attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-victims-funeral-centre-to-hold-all-party-meet-brief-leaders-pm-modi-rajnath-singh-amit-shah-2713787-2025-04-24",
      "headline": "Live: Full support for any action, says Rahul Gandhi on Pahalgam attackTerror Attack In Pahalgam Live Updates: India briefed ambassadors of select countries, including the US, the UK and China, on the Pahalgam terror attack, which claimed 26 lives on Tuesday. This comes after India downgraded diplomatic ties with Pakistan and announced major diplomatic measures, including the suspension of the Indus Waters Treaty of 1960 and immediate shutting down of the Attari border. In response, Pakistan announced tit-for-tat measures, including the shutting down of airspace for Indian airlines. Meanwhile, the government held an all-party meeting and briefed leaders on the Pahalgam attack and heard their views. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-indus-waters-treaty-pakistan-impact-what-it-means-pahalgam-terror-attack-2713827-2025-04-24",
      "headline": "Can India turn off Indus tap and leave Pakistan high and dry?The suspension of the Indus Waters Treaty by India is more of a pressure tactic on Pakistan to force it to rein in terror groups and stop infiltration. Here is why India can't stop Indus waters to Pakistan overnight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indus-waters-treaty-suspended-india-pakistan-diplomatic-offensive-pahalgam-attack-2714660-2025-04-24",
      "headline": "Explained: The myth, hype and truth of Indus Waters TreatyHow long can India take to realistically pause water flows to Pakistan? Can Pakistan survive it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-pahalgam-terror-attack-jammu-kashmir-will-identify-track-punish-terrorist-pakistan-vows-warning-2713906-2025-04-24",
      "headline": "Punishment beyond imagination for every terrorist, PM promises after J&K attackPM Modi said the terrorists and conspirators behind the April 22 Pahalgam attack will get punishment beyond their imagination as he sent a strong-worded message from Bihar's Madhubani."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-unhappy-russian-strike-on-ukraine-vladimir-putin-volodymyr-zelenskyy-2714613-2025-04-24",
      "headline": "Vladimir, stop: Trump says he is not happy with Russian strikes on KyivDonald Trump, who has tried to broker peace between Russia and Ukraine, expressed unhappiness over the latest attack on Kyiv."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-power-supply-crisis-indus-waters-treaty-suspended-2713659-2025-04-24",
      "headline": "How India's suspension of Indus Waters Treaty may cause power crisis in PakIndia's suspension of the Indus Waters Treaty does not bode well for Pakistan's energy sector, which is heavily supported by its various hydropower projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/toilet-decoration-is-instagrams-new-obsession-but-experts-are-flushing-it-down-2714056-2025-04-24",
      "headline": "Toilet decoration is Instagram's new obsession, but experts are flushing it downA few influencers are indulging in toiletscaping – a decor trend where no stone is left unturned to transform the toilet into a mini museum, complete with decorative pieces and cosy touches like plush rugs and furry seat covers"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/case-against-bjp-it-cell-for-rahul-gandhi-post-after-pahalgam-attack-2714010-2025-04-24",
      "headline": "Case against BJP IT cell for Rahul Gandhi post after Pahalgam attackAn FIR has been registered against the BJP IT Cell at the High Grounds Police Station in Bengaluru over a derogatory social media post targeting Congress leader Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-tourists-close-save-baisaran-meadow-salty-rogan-josh-lack-of-horses-jaipur-couple-bhelpuri-2713900-2025-04-24",
      "headline": "Salty rogan josh, horse delay helped 39 cheat death in PahalgamA rogan josh meal too salty, a delay in the arrival of horses, and a plate of bhelpuri are what saved 41 tourists from the site where terrorists were carrying out a massacre in Pahalgam. After terrorists killed 26 people in Kashmir, stories are now emerging of how luck turned into unlikely shields for over 40 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-high-alert-police-sea-vigilance-increased-pahalgam-terror-attack-jk-2714089-2025-04-24",
      "headline": "Mumbai on high alert, sea vigilance stepped up after Pahalgam attackThe Maharashtra Home Department has instructed the Mumbai Police to increase vigilance at sea and tighten security at public places in the aftermath of the Pahalgam terror attack, which killed 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-india-indus-treaty-suspension-water-warfare-pahalgam-terror-attack-2713986-2025-04-24",
      "headline": "Act of war: Pak says water lifeline for 240 million as India pauses Indus treatyAs part of its diplomatic retaliation after the deadly Pahalgam terror attack, India has suspended the Indus Waters Treaty. Pakistan has vowed to challenge the move legally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-rare-switch-to-english-in-bihar-madhubani-ensures-world-gets-his-message-terrorism-2713932-2025-04-24",
      "headline": "With rare switch to English, PM Modi ensures world gets his message on terrorPrime Minister Narendra Modi, who usually uses Hindi and Indian regional languages in his speeches, made a rare switch to English at a rally in Bihar to convey that the perpetrators of the Pahalgam attack won't be spared. His use of English was to ensure that the world didn't miss a word of India's resolve to fight Pakistan-sponsored terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/iq-levels-are-falling-across-the-world-as-we-read-less-and-scroll-more-2713984-2025-04-24",
      "headline": "IQ levels are falling across the world as we read less and scroll moreRecent studies have shown a steady decline in IQ levels and cognitive skills among both teens and adults globally. One of the main reasons seems to be rising screen time and tech use over reading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahesh-joshi-former-rajasthan-minister-congress-leader-arrested-ed-jal-jeevan-mission-scam-2714666-2025-04-24",
      "headline": "ED arrests ex-Rajasthan minister Mahesh Joshi in Jal Jeevan Mission 'scam'Former Rajasthan minister Mahesh Joshi is accused of misappropriating funds with the connivance of officials and contractors of the Public Health Engineering Department in the implementation of the Jal Jeevan Mission in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-visuals-capture-moment-terrorists-fired-ak-47s-at-tourists-2713848-2025-04-24",
      "headline": "Disturbing video of Pahalgam horror, terrorists round up tourists, shoot themIn the video, an individual can be seen capturing the exact moment when the terrorists surrounded the unsuspecting tourists and began firing at them. While the sounds of gunshots and the screams of tourists can be heard in the background, alarming shots of bodies lying around can also be seen."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-bat-snapped-in-half-delhi-capitals-nets-axar-patel-mongoose-bat-joke-2714687-2025-04-24",
      "headline": "Watch: KL Rahul snaps bat in half during DC nets, Axar Patel adds hilarious twistAxar Patel grabbed KL Rahul's snapped handle, called it a \"mongoose bat,\" and the nets erupted in laughter—turning a routine practice mishap into a light-hearted moment that perfectly captured Delhi Capitals' relaxed, team-first spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rcb-vs-rr-ipl-2025-bengaluru-t20-record-2714684-2025-04-24",
      "headline": "Virat Kohli scripts history with 3500 T20 runs in BengaluruIPL 2025, RCB vs RR: Virat Kohli completed 3500 T20 runs at the M Chinnaswamy Stadium when Royal Challengers Bengaluru faced Rajasthan Royals on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-rcb-stephen-fleming-press-conference-2714673-2025-04-24",
      "headline": "CSK hoping to make IPL 2025 turnaround with RCB blueprint: Stephen FlemingStephen Fleming said that CSK will look to use RCB's IPL 2024 blueprint to make a comeback in the ongoing season. Chennai sits at the bottom of the IPL points table with just 2 wins from 8 matches this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-rr-rajat-patidar-bengaluru-toss-luck-2714661-2025-04-24",
      "headline": "4 out of 4: Rajat Patidar's dreadful toss luck in Bengaluru continuesIPL 2025, RCB vs RR: Rajat Patidar's Royal Challengers Bengaluru (RCB) have lost all four tosses at home at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-injury-copa-america-final-barcelona-el-clasico-2714635-2025-04-24",
      "headline": "Real Madrid set to miss key players ahead of Copa del Rey final vs BarcelonaReal Madrid are set to miss two of their key players in the Copa del Rey final against arch-rivals FC Barcelona. While David Alaba is out with a muscle injury, the club informed that Eduardo Camavinga has been ruled out for the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-gavaskar-slams-pahalgam-attack-masterminds-peace-message-2714631-2025-04-24",
      "headline": "Gavaskar's peace appeal after Pahalgam attack: What has fighting achieved?Sunil Gavaskar condemned the Pahalgam terror attack with a bold message for peace, urging the masterminds to reflect on their actions and asking what such brutality could possibly achieve for their cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-nehal-wadhera-conversation-rcb-vs-pbks-2714630-2025-04-24",
      "headline": "Shocked that Virat Kohli even knew my name: Nehal Wadhera on chat with RCB starNehal Wadhera revealed his chat with Virat Kohli and said he was shocked to see that the RCB star knew his name. Wadhera met up with Kohli during the RCB vs PBKS game earlier in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-royal-challengers-bengaluru-vs-rajasthan-royals-today-match-updates-2714112-2025-04-24",
      "headline": "RCB vs RR Live: Kohli out for 70, Padikkal hits fiftyIPL 2025, RCB vs RR Live Score: Virat Kohli has got out on 70 as Jofra Archer broke the dangerous partnership. Devdutt Padikkal has scored a 26-ball fifty and has been joined by Tim David. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-jamie-vardy-set-to-leave-leicester-city-confirmed-2714097-2025-04-24",
      "headline": "Jamie Vardy to end historic Leicester City chapter at the end of the seasonPremier League: Jamie Vardy is set to leave Leicester City after 13 unforgettable years, bringing an end to one of football's most inspiring stories—but the veteran striker has no plans to hang up his boots yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-ms-dhoni-jamie-overton-chepauk-2714090-2025-04-24",
      "headline": "You have to come experience Dhoni walking out: Jamie Overton's message to dadJamie Overton said he was in awe of seeing MS Dhoni walkout to the middle at the Chepauk stadium and revealed that he messaged his dad and agent, telling them to experience the CSK legend walkout to the middle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-madrid-open-french-open-injury-2714068-2025-04-24",
      "headline": "Alcaraz faces injury scare before French Open after Madrid Open snubWorld No.3 Carlos Alcaraz pulled out of the Madrid Open due to hamstring and groin injuries, bearing in mind the French Open to be held from May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-nehal-wadhera-conversation-rcb-vs-pbks-2714630-2025-04-24",
      "headline": "Shocked that Virat Kohli even knew my name: Nehal Wadhera on chat with RCB starNehal Wadhera revealed his chat with Virat Kohli and said he was shocked to see that the RCB star knew his name. Wadhera met up with Kohli during the RCB vs PBKS game earlier in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-royal-challengers-bengaluru-vs-rajasthan-royals-today-match-updates-2714112-2025-04-24",
      "headline": "RCB vs RR Live: Kohli out for 70, Padikkal hits fiftyIPL 2025, RCB vs RR Live Score: Virat Kohli has got out on 70 as Jofra Archer broke the dangerous partnership. Devdutt Padikkal has scored a 26-ball fifty and has been joined by Tim David. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-jamie-vardy-set-to-leave-leicester-city-confirmed-2714097-2025-04-24",
      "headline": "Jamie Vardy to end historic Leicester City chapter at the end of the seasonPremier League: Jamie Vardy is set to leave Leicester City after 13 unforgettable years, bringing an end to one of football's most inspiring stories—but the veteran striker has no plans to hang up his boots yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-ms-dhoni-jamie-overton-chepauk-2714090-2025-04-24",
      "headline": "You have to come experience Dhoni walking out: Jamie Overton's message to dadJamie Overton said he was in awe of seeing MS Dhoni walkout to the middle at the Chepauk stadium and revealed that he messaged his dad and agent, telling them to experience the CSK legend walkout to the middle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-madrid-open-french-open-injury-2714068-2025-04-24",
      "headline": "Alcaraz faces injury scare before French Open after Madrid Open snubWorld No.3 Carlos Alcaraz pulled out of the Madrid Open due to hamstring and groin injuries, bearing in mind the French Open to be held from May 25. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}