{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-tariff-90-day-pause-usd-500-billion-opportunity-2706882-2025-04-10",
      "headline": "90 days, $500 billion, one big shot: India's trade gamble in Trump's tariff pauseThe pause in tariffs is seen in New Delhi as more than just goodwill; it's strategic. By sparing countries like India, the US appears to be isolating China in what is shaping up to be the most aggressive round of trade hostilities since the Covid-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-jumps-over-6-percent-after-donald-trump-90-day-tariff-break-ethereum-xrp-cardano-solana-dogecoin-shiba-inu-witness-price-rally-2706858-2025-04-10",
      "headline": "Bitcoin jumps over 6% after Trump's 90-day tariff break; Ethereum, XRP rallyBitcoin, along with other major cryptos like Ethereum, XRP, Cardano, Solana, and Dogecoin, etc., are witnessing a surge in their prices post US President Donald Trump's announcement of a 90-day pause on new tariff hikes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-potential-market-crash-investors-may-stay-away-for-years-2706820-2025-04-10",
      "headline": "Zerodha CEO Nithin Kamath on market crash: \"Investors may stay away for years\"In 2008, the global market took a major hit with the collapse of Lehman Brothers, a global financial services firm and one of the largest investment banks in the US, causing a ripple effect around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tweet-great-time-to-buy-stock-market-advice-global-market-rally-90-day-pause-tariff-2706794-2025-04-10",
      "headline": "Should stock market investors take Donald Trump's 'buy' tip seriously?From aggressive tariffs on China to sudden pauses and vague reassurances, the whiplash is real and investors are feeling it. Markets bleed one day and bounce back the next, all thanks to a tweet or a policy pivot from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/msc-turkiye-world-biggest-green-cargo-ship-docks-at-adani-vizhinjam-port-2706724-2025-04-10",
      "headline": "World's biggest green cargo ship, MSC Turkiye docks at Adani's Vizhinjam PortMSC Turkiye: The vessel is 399.9 metres long, 61.3 metres wide, and has a depth of 33.5 metres. It has the capacity to carry 24,346 twenty-foot equivalent units (TEUs), making it one of the largest container ships ever built."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-surges-as-trump-hits-pause-on-tariffs-dow-jumps-over-2300-points-glbs-2706665-2025-04-09",
      "headline": "Wall Street surges as Trump hits pause on tariffs, Dow jumps over 2,300 pointsWall Street jumped after President Trump paused new tariffs for 90 days, easing trade worries. Big tech companies like Apple and Nvidia led the gains. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-over-350-points-nifty-below-22500-banking-stocks-down-2706416-2025-04-09",
      "headline": "Sensex falls over 350 points, Nifty below 22,500; banking stocks downThe S&P BSE Sensex was down 379.73 points to close at 73,847.15, while the NSE Nifty50 lost 136.70 points to end at 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-rajdhani-to-vande-bharat-investor-criticises-india-lag-in-train-tech-2706391-2025-04-09",
      "headline": "From Rajdhani to Vande Bharat: Investor criticises India's lag in train techWhen Rajdhani was launched in 1969, it placed India among Asia's fastest rail nations, second only to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-sanjay-malhotra-us-tariff-impact-worried-over-growth-than-inflation-2706354-2025-04-09",
      "headline": "RBI Governor says US tariff impact on growth bigger worry than inflationThe RBI's rate cut comes at a time when inflation appears to be under control, but economic growth faces risks from global uncertainty after US tariffs imposed by President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-impact-market-banking-stocks-down-reason-here-why-bank-margins-2706331-2025-04-09",
      "headline": "RBI rate cut brings relief for borrowers, but banking stocks tumble. Here's whyBanking stocks, especially public sector lenders, took a sharp hit after the rate cut announcement. The Nifty Bank index was down nearly 1%, with major losers including Bank of Baroda, Canara Bank, Punjab National Bank, and SBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-6-key-takeaways-from-mpc-meeting-governor-sanjay-malhotra-announces-april-9-2025-2706322-2025-04-09",
      "headline": "RBI monetary policy: 6 key takeaways from MPC meetingWith the repo rate cut, borrowing costs for home and personal loans are likely to fall. This would provide a big relief to the homebuyers and could boost the housing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-5-key-development-reforms-you-must-know-2706284-2025-04-09",
      "headline": "RBI MPC meeting: 5 key development reforms you must knowCurrently, UPI payments are mostly capped at Rs 1 lakh for both P2P and P2M. The RBI has suggested that National Payments Corporation of India (NPCI) may now review and revise these limits based on evolving user needs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-cuts-repo-rate-by-25-bps-to-6-gdp-forecast-lowered-to-65-for-fy26-ytvd-2706254-2025-04-09",
      "headline": "RBI cuts Repo Rate by 25 points to 6% amid global trade warThe Reserve Bank of India has cut the repo rate by 25 basis points to 6%, potentially leading to lower EMIs for home loans. The RBI has also lowered the GDP forecast for FY26 to 6.5% from the earlier 6.7%. The Monetary Policy Committee unanimously decided to change the stance from neutral to accommodative, hinting at possible further easing. The RBI Governor expressed concerns over global trade uncertainties and their potential impact on inflation and growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-rate-cut-6-percent-25-bps-home-auto-loan-emis-likely-to-get-cheaper-2706246-2025-04-09",
      "headline": "Cheaper home, auto loan EMIs after RBI rate cut. What it means for youRBI reduces key lending rate to 6%. Lower interest rates are expected to make borrowing cheaper, which can help people buy homes or vehicles more easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-central-bank-moves-from-neutral-to-accommodative-stance-2706237-2025-04-09",
      "headline": "RBI changes stance from neutral to accommodative: What does it mean?The Reserve Bank of India (RBI) Governor Sanjay Malhotra has announced a cut in the repo rate by 25 basis points, bringing it down from 6.25% to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-gdp-forecast-reduces-fiscal-2025-2026-65-per-cent-from-67-per-cent-donald-trump-us-tariff-war-2706227-2025-04-09",
      "headline": "RBI downgrades 2025-26 GDP forecast to 6.5% from 6.7% amid global tariff warWhile sharing the new projections, Governor Sanjay Malhotra said the downward revision of the GDP forecast was mainly due to growing risks in global trade and policy developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/donald-trumps-26-per-cent-reciprocal-tariffs-on-india-come-into-effect-2706214-2025-04-09",
      "headline": "Donald Trump's 26% reciprocal tariffs on India come into effectA 26% tariff on Indian exports to the USA has come into effect. Key sectors impacted include electronics, gems and jewellery, auto components, and agricultural products. The Union Cabinet is set to meet to discuss India's strategy and the impact on exporters. The Indian government is in touch with exporters to minimise the impact, while also working on a bilateral trade agreement with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-mpc-meeting-cuts-key-rates-again-second-consecutive-time-25-bps-6-per-cent-2706220-2025-04-09",
      "headline": "Home loans to get cheaper as RBI cuts key lending rate by 25 basis points to 6%RBI MPC meeting: This is the second rate cut in a row, following a 25 basis point reduction in February. RBI also changed its earlier stance from neutral to 'accommodative'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-indian-exports-imports-26-per-cent-come-into-effect-government-meeting-narendra-modi-2706212-2025-04-09",
      "headline": "Trump's 26% tariffs on India come into effect, big Cabinet meet todayWith markets in a free fall since Donald Trump's reciprocal tariff announcement, the Union Cabinet will hold a crucial meeting today to strategise on ways to minimise the impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-down-300-points-nifty-below-22500-as-investors-await-rbi-mpc-announcements-2706203-2025-04-09",
      "headline": "Sensex, Nifty open lower as RBI policy and global cues weigh on investorsThe S&P BSE Sensex fell by 255.49 points to 73,971.59, while the NSE Nifty50 lost 86.70 points to 22,449.15 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-will-home-loans-get-cheaper-policy-announcement-today-rate-cut-25-bps-2706195-2025-04-09",
      "headline": "RBI MPC: Will home loans get cheaper after today's policy announcement?RBI MPC meeting: In its last meeting held in February, the RBI cut the repo rate by 25 basis points. This was the first rate cut under RBI Governor Sanjay Malhotra, and also the first cut in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-april-9-rbi-mpc-decision-pause-dalal-street-rally-2706183-2025-04-09",
      "headline": "Stock market today: Will RBI MPC decision pause Sensex, Nifty rally?The Sensex and Nifty ended Tuesday's session with big gains, but a global sell-off and worries about trade tensions are expected to affect today's opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-9-shares-in-focus-today-ntpc-adani-wilmar-vodafone-idea-bpcl-trump-tariff-sensex-nifty-2706171-2025-04-09",
      "headline": "Stocks to watch on April 9: NTPC, Adani Wilmar, Vodafone Idea, BPCLIn today's trade, many shares will be in focus due to key news developments. These include NTPC, BPCL, Adani Wilmar, Vodafone Idea, Cyient, PNB Housing Finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-lowest-close-one-year-reciprocal-tariffs-donald-trump-hopes-fading-2706141-2025-04-09",
      "headline": "S&P 500 hits lowest level in one year as hopes for Trump tariff relief fadeThe S&P 500 reached its lowest level in nearly a year after it reversed a strong morning rally, as hopes faded for any concessions or delays on President Donald Trump's global tariffs on US's trading partners set to come into effect on April 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-dow-jones-nasdaq-sp-500-sensex-nifty-prediction-rally-to-continue-2706027-2025-04-08",
      "headline": "US markets gain sharply on hopes of tariff talks: Will Dalal Street continue rally?If Wall Street wraps up today's session on a strong note, it could deliver a big dose of confidence to investors worldwide, especially in Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opening-us-markets-rally-as-dow-jones-jumps-1100-points-nasdaq-sp-surge-3-percent-2706016-2025-04-08",
      "headline": "US markets rally as Dow Jones jumps 1,100 points, Nasdaq, S&P surge 3%The surge in US stocks came as investors looked for any indication that the US might be open to easing some of its tougher tariffs through negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opting-for-new-tax-regime-know-about-this-rs-7000-post-office-savings-benefit-2705963-2025-04-08",
      "headline": "Opting for new tax regime? Know about this Rs 7,000 post office savings benefitAs per a government notification issued back in 2011, interest from post office savings accounts is exempt under Section 10(15) of the Income Tax Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-with-1000-points-gain-nifty-closes-above-22500-as-dalal-street-shrugs-off-tariff-threat-2705854-2025-04-08",
      "headline": "Sensex, Nifty end higher on global recovery and RBI rate cut expectationsThe S&P BSE Sensex added 1,089.18 points to close at 74,227.08, while the NSE Nifty5o gained 374.25 points to end at 22,535.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-rate-cut-announcement-april-9-sanjay-malhotra-what-to-expect-25-bps-2705847-2025-04-08",
      "headline": "RBI MPC to announce decision on April 9: Will there be a rate cut?Since the last MPC meeting, held in February 2025, a lot of things have changed, both positive and negative. While inflation has come down, and growth has started to pick up, there are fresh worries about the global economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-businessmen-slam-us-president-bill-ackman-jamie-dimon-good-import-2705835-2025-04-08",
      "headline": "'Economic nuclear war': Billionaire business titans slam Trump's tariff gambitDonald Trump's tariff agenda is fracturing elite support, with top businessmen — from Bill Ackman to Jamie Dimon — warning it risks recession, inflation, and global instability. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hotmail-co-founder-sabeer-bhatia-on-indian-engineers-99-percent-start-giving-gyaan-2705785-2025-04-08",
      "headline": "Hotmail co-founder Sabeer Bhatia on Indian engineers: '99% start giving gyaan'Sabeer Bhatia pointed out that in India, people respect those who talk business, not those who write code or build software. This mindset, he says, is stopping India from becoming a hub of innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-1600-points-nifty-rise-500-stocks-driving-rally-titan-zomato-infosys-sbi-hcltech-2705770-2025-04-08",
      "headline": "Sensex up 1,600 points: Which stocks are driving the rally on Dalal Street?Markets saw a huge rebound from yesterday's crash as they staged a robust recovery as no stocks on the Sensex of Nifty50 traded in red in the afternoon session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jpmorgan-jamie-dimon-ceo-donald-trump-tariff-war-us-recesion-slow-growth-economic-concern-stronger-india-ties-2705740-2025-04-08",
      "headline": "Trump's tariff war may backfire, says JPMorgan CEO, urges stronger India tiesJPMorgan CEO, Jamie Dimon, explained that higher costs of imported goods would affect consumers, while increased demand for local products could also drive prices up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-centre-studying-global-models-to-manage-ups-pool-corpus-2705732-2025-04-08",
      "headline": "Unified Pension Scheme: Centre studying global models to manage UPS pool corpusThe government aims to create proper rules for investing the extra contribution made by it in a separate pension fund called the pool corpus under the newly launched Unified Pension Scheme (UPS).     "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japan-nikkei-leads-asia-recovery-as-us-mulls-softer-tariff-approach-2705703-2025-04-08",
      "headline": "Japan's Nikkei leads Asia's recovery as hopes rise for softer tariff approachA 5.6% rebound in Japan's Nikkei far outpaced other regional markets, with Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer tasked with leading trade negotiations with Tokyo."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/om-puri-first-wife-seema-kapoor-actor-affair-with-nandita-when-she-was-pregnant-2706880-2025-04-10",
      "headline": "Om Puri's first wife recalls actor's affair when she was pregnant: I was shatteredSeema Kapoor opens up about her tumultuous marriage with late actor Om Puri, highlighting his infidelity during her pregnancy and the subsequent breakdown of their relationship. Despite her attempts to save the marriage, the emotional strain and betrayal led to a separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bazooka-x-twitter-reviews-mammottys-film-has-nothing-impressive-fans-call-it-average-2706866-2025-04-10",
      "headline": "Bazooka X reviews: Mammotty's film has 'nothing impressive', fans call it averageMalayalam superstar Mammootty is back on the silver screen with Deeno Dennis's thriller Bazooka. The film received neutral response from fans, with some calling it an average watch, while others engaging. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oscar-nominated-actor-mickey-rourke-says-his-career-is-in-the-toilet-2706857-2025-04-10",
      "headline": "Oscar-nominated actor Mickey Rourke says his 'career is in the toilet'Oscar-nominated actor Mickey Rourke, who is currently seen on the reality show Celebrity Big Brother, opened up about how he has not been getting any decent roles of late. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karisma-kapoor-calls-alia-bhatt-biwi-no-1-ranveer-singh-hero-no-1-after-watching-their-new-ad-2706828-2025-04-10",
      "headline": "Karisma Kapoor calls Alia Biwi No 1, Ranveer Hero No 1 after watching their new adAlia Bhatt and Ranveer Singh channelled their '90s energy in a new ad. After fans praised the duo, actor Karisma Kapoor joined in, calling them Biwi No. 1 and Hero No. 1, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-amateur-review-rami-malek-film-watchable-but-rarely-thrilling-2706799-2025-04-10",
      "headline": "The Amateur review: Rami Malek's film is watchable, but rarely thrillingReleased-Thu Apr 10, 2025The Amateur movie review: Rami Malek stars in The Amateur, a film about a CIA codebreaker turned avenger after his wife's death, navigating a world of espionage with unconventional methods. Despite a strong cast and intriguing premise, the movie struggles to deliver sustained excitement, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-on-his-friendship-with-taylor-swift-we-have-six-hour-catchups-2706786-2025-04-10",
      "headline": "Ed Sheeran on his friendship with Taylor Swift: We have six-hour catchupsEd Sheeran shared insights into his enduring friendship with Taylor Swift, recalling their time during her Red Tour. Despite busy schedules, the two remain close, cherishing their rare meet-ups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-x-twitter-reviews-ajith-kumar-trisha-krishnan-adhik-ravichandran-fans-praise-dialgues-action-sequences-2706782-2025-04-10",
      "headline": "Good Bad Ugly X reviews: Fans hail dialogues, Ajith's mass entry, call it 'peak vibe'Internet declared Ajith Kumar's Good Bad Ugly a winner. While some raved about the dialogues between him and Simran Bagga, others highlighted the mass entry scene and peppy songs. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-day-11-box-office-salman-khans-film-struggles-to-keep-up-2706760-2025-04-10",
      "headline": "Sikandar Day 11 box office: Salman Khan's film struggles to keep upSalman Khan's much-anticipated film Sikandar has seen a decline in box office earnings on its 11th day. The film now faces stiff competition from new releases - Jaat and Good Bad Ugly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-wishes-george-clooney-ajith-kumar-good-bad-ugly-release-2706754-2025-04-10",
      "headline": "Khushbhoo Sundar sends wishes to Ajith for Good Bad Ugly: My George Clooney is backKhushboo Sundar gave a shout-out to her 'George Clooney' Ajith Kumar ahead of Good Bad Ugly release. The high-octane action comedy, directed by Adhik Ravichandran, released in theatres on April 10. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's 'Phule' release postponed amid row over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-box-office-day-14-mohanlal-prithviraj-sukumaran-film-eyes-rs-260-crore-globally-2706742-2025-04-10",
      "headline": "Empuraan box office Day 14: Mohanlal's film eyes Rs 260 crore globallyMohanlal and Prithviraj Sukumaran-starrer L2: Empuraan has crossed the Rs 250-crore mark worldwide in no time. It is gearing up to enter the Rs 260-crore club soon. The film is the sequel to 2019's hit Lucifer. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-snaps-at-disrespectful-paps-in-viral-clip-not-caring-about-humans-2706731-2025-04-10",
      "headline": "Justin Bieber snaps at 'disrespectful' paps in viral clip: Not caring about humansA video going viral online shows singer Justin Bieber losing his cool with the paparazzi, labelling them 'money-hungry' and disrespectful. He further criticised them for showing no regard for basic human decency.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vidyapati-movie-review-nagabhushana-carries-a-shaky-screenplay-banking-on-emotions-2706688-2025-04-10",
      "headline": "Vidyapati review: Nagabhushana carries a shaky screenplay banking on emotionsReleased-Thu Apr 10, 2025Vidyapati movie film review: This Kannada film, produced by Dhananjaya's Daali Pictures, is a comedy entertainer starring Nagabhushana, Malaika Vasupal and Garuda Ram in the lead. The film, despite having potential, falls short in being impressive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supermodel-gigi-hadid-reveals-how-she-met-her-current-boyfriend-bradley-cooper-glbs-2706693-2025-04-10",
      "headline": "Supermodel Gigi Hadid reveals how she met her current boyfriend Bradley CooperGigi Hadid opens up in Vogue about how she met Bradley Cooper at a backyard party, sharing insights into their low-key romance and the challenges of dating in the spotlight.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tracee-ellis-ross-wows-in-burnt-orange-leather-on-good-morning-america-glbs-2706692-2025-04-10",
      "headline": "Tracee Ellis Ross wows in burnt orange leather on Good Morning AmericaTracee Ellis Ross stunned on Good Morning America in a burnt orange leather ensemble and Bottega Veneta heels while promoting Black Mirror Season 7 with Rashida Jones, impressing fashion watchers once again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/beyonce-fans-can-win-concert-tickets-in-cowboy-carter-fashion-sweepstakes-glbs-2706691-2025-04-10",
      "headline": "Beyoncé fans can win concert tickets in Cowboy Carter fashion sweepstakesBeyoncé's Cowboy Carter album has inspired a handmade fashion sweepstakes by MakerPlace. Fans can design outfits for a chance to win concert tickets and $3,000. Entries close this Friday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-shares-health-update-after-breast-cancer-relapse-2706663-2025-04-09",
      "headline": "Back home, recovering: Tahira Kashyap shares health update after cancer relapseFilmmaker Tahira Kashyap shared a post and updated fans about her health after her breast cancer relapse. She thanked her fans anf followers for their unconditional support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-grooves-to-dhol-at-son-sunny-deols-jaat-premiere-2706651-2025-04-09",
      "headline": "Dharmendra grooves to dhol beat at son Sunny Deol's Jaat premiere. WatchVeteran actor Dharmendra stole the limelight with his dance at son Sunny Deol's Jaat premiere in Mumbai. The film will release in theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mari-selvaraj-reunite-after-four-years-for-d56-2706640-2025-04-09",
      "headline": "Dhanush, Mari Selvaraj reunite after four years for 'D56'Dhanush has teamed up with director Mari Selvaraj for his next film. Tentatively titled D56, the movie will be produced by Ishari Ganesh under Vels Films International. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-united-states-tariffs-donald-trump-pressure-blackmail-threats-will-not-work-125-per-cent-reaction-doors-open-talks-2706896-2025-04-10",
      "headline": "Doors open for talks, but blackmail won't work: China after Trump's 125% tariffsAmid an escalating tariff war, Beijing said that \"pressure, threats, and blackmail are not the right way to deal with China\", and warned that if Washington \"insists on its own way, China will follow through to the end\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-india-long-battle-nia-26-11-mumbai-terror-attacks-2706881-2025-04-10",
      "headline": "It took 14 years to get Tahawwur Rana to India: A look at NIA's long battleIt took nearly 14 years to get 26/11 attacks plotter Tahawwur Rana on a 17-hour flight to India from the US to face trial. Behind the scenes, India's deft diplomatic manoeuvring ensured no hiccups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-indian-students-self-deport-what-to-do-if-visa-revoked-trump-immigration-green-card-harvard-columbia-university-2706446-2025-04-10",
      "headline": "As US revokes visas, here's what Indian students can doMany Indians are among the scores of international students in American colleges and universities who have received an email stating that their visas have been revoked. Experts suggest self-deportation should be the last option. Amid fear of deportation, here's the legal recourse that students can take."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-tariff-tantrums-and-aapada-mein-avsar-2706872-2025-04-10",
      "headline": "Trump's Tariff Tantrums and Aapada Mein AvsarMeet Donald Trump, Agent Orange Hair. He's carpet-bombing global trade with tariffs and scorching supply chains. But for India, the global calamity brings an opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's 'Phule' release postponed amid row over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-piyush-goyal-takes-a-jab-at-congress-says-party-fed-biryani-to-ajmal-kasab-2706863-2025-04-10",
      "headline": "Congress fed biryani to Kasab: Piyush Goyal's jibe after Tahawwur Rana extraditionRana, a Pakistani-origin Canadian national, is scheduled to land in Delhi later today after the US Supreme Court rejected his plea against extradition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-xi-jinping-smartest-man-in-the-world-amid-ongoing-tariff-war-with-china-2706817-2025-04-10",
      "headline": "Love letter in a trade war: Trump calls Xi Jinping smartest man in the worldThe tensions flared further between the US and China when Donald Trump executed a stunning volte-face - suspending tariffs on over 75 countries in a conciliatory gesture, while simultaneously hammering Beijing with a punishing escalation, jacking up tariffs on Chinese imports to a staggering 125 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/michelle-obama-barack-obama-divorce-rumours-chose-to-do-whats-best-for-me-2706773-2025-04-10",
      "headline": "Michelle Obama opens up about divorce rumours: Chose to do what's best for meAddressing divorce rumours, Michelle Obama explained that she's simply taking more control over her schedule and prioritising personal well-being over societal expectations of women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-security-cell-that-held-ajmal-kasab-may-house-tahawwur-rana-next-sources-2706818-2025-04-10",
      "headline": "High-security cell that held Ajmal Kasab may house Tahawwur Rana next: SourcesAccording to sources, Tahawwur Rana may be lodged in Barrack No 12 of the Arthur Road prison — the same high-security wing where terrorist Ajmal Kasab was kept during the 26/11 trial before his execution in 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharbat-jihad-baba-ramdev-claims-juice-funds-used-to-build-mosques-madrasas-2706876-2025-04-10",
      "headline": "Sharbat jihad: Baba Ramdev claims juice funds used to build mosques, madrasas Ramdev claimed that a certain company sells sharbat (a traditional sweet drink), but the money earned from it is used to build madrasas and mosques. He said this while promoting Patanjali's rose sharbat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/is-trump-son-running-white-house-x-account-viral-let-him-cook-post-sparks-curiosity-2706850-2025-04-10",
      "headline": "Is Trump's son running White House X account? 'Let him cook' post sparks curiosityThe post went viral with close to 7 million views as Trump made a dramatic policy reversal on Wednesday, announcing a 90-day pause on his reciprocal tariff, just 24 hours after it came into effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-buy-stocks-tip-before-tariffs-pause-raises-calls-for-insider-trading-probe-2706713-2025-04-10",
      "headline": "Trump's 'good time to buy' tweet minutes before tariff pause sparks calls for probeShortly after markets opened, President Trump took to his Truth Social platform with a pair of upbeat posts. \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" he wrote, followed closely by a more direct appeal to investors: \"THIS IS A GREAT TIME TO BUY!!! DJT.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-attacks-plotter-2611-delhi-tihar-jail-extradition-us-david-headley-2706682-2025-04-10",
      "headline": "From Pak Army doctor to 26/11 attacks plotter: Who is Tahawwur RanaTahawwur Rana, a former Pakistan Army doctor accused of plotting the 2008 Mumbai terror attacks, is set to land in Delhi on Thursday afternoon. He was arrested by the FBI in 2009 and was lodged in a prison in the US before his extradition to India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariff-pause-strategy-isolate-china-countries-dialogue-negotiation-trade-deficit-art-of-the-deal-2706725-2025-04-10",
      "headline": "Tariff trap? Trump rewards allies, punishes China in 'art of the deal' strategyWhile the decision to impose across-the-board tariffs triggered panic in financial markets, the Trump administration is now suggesting it was part of a deliberate strategy aimed squarely at isolating China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-magic-of-having-a-yellow-person-in-your-life-2706796-2025-04-10",
      "headline": "The magic of having a 'yellow person' in your lifeA 'yellow person' is someone who embodies the qualities symbolically linked to the colour yellow - brightness, warmth, and optimism. They feel like sunshine breaking through a cloudy day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/tahawwur-rana-india-us-extradition-treaty-limits-prosecution-scope-trial-conditions-2706873-2025-04-10",
      "headline": "Tahawwur Rana faces trial in India, but US treaty limits prosecution scopeAs part of the extradition treaty with US, India must ensure that Tahawwur Rana will not be tortured, will be provided adequate protection in prison, and will only be tried for the offences for which he has been extradited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-r-ashwin-trolling-rcb-fans-youtube-show-2706868-2025-04-10",
      "headline": "R Ashwin on CSK criticism: Not bothered by trolls, real fans stand by playersIPL 2025: Senior off-spinner R Ashwin said he is open to constructive criticism following intense scrutiny over his slow start to the new season. AShwin has taken 5 wickets in five matches and conceded at over 9 runs per over on his return to CSK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-dm-mps-convoy-attacked-villagers-during-inspection-visit-siwan-2706780-2025-04-10",
      "headline": "Video: Bihar villagers attack cops with sticks, rods, stones during inspection visitThe convoy, which included several government officials, had visited Teghra Harkeshpur village for an inspection of the land for the school building where they were attacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/om-puri-first-wife-seema-kapoor-actor-affair-with-nandita-when-she-was-pregnant-2706880-2025-04-10",
      "headline": "Om Puri's first wife recalls actor's affair when she was pregnant: I was shatteredSeema Kapoor opens up about her tumultuous marriage with late actor Om Puri, highlighting his infidelity during her pregnancy and the subsequent breakdown of their relationship. Despite her attempts to save the marriage, the emotional strain and betrayal led to a separation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-trichy-dig-varun-kumar-woman-police-officer-insulting-rape-survivor-awps-suspension-2706856-2025-04-10",
      "headline": "Aren't you ashamed?: Tamil Nadu cop reprimanded for rude reply to rape survivorSenior Tamil Nadu cop pulled up Tiruchy's All Women Police Station after an officer rudely spoke to a rape survivor. He ordered action against the officer and questioned the Inspector for defending the woman officer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/fluoride-drinking-water-us-health-secretary-rfk-jr-cdc-2706823-2025-04-10",
      "headline": "Why US government wants CDC to stop adding fluoride to drinking waterUS health secretary RFK Jr. wants to stop the decades-long practice of adding fluoride to public drinking water systems due to various health problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/audi-luxury-cars-farmhouse-foreign-trips-rajasthan-acb-dudu-block-engineer-da-case-200-percent-wealth-2706852-2025-04-10",
      "headline": "2 Audis, farmhouse, foreign trips: Anti-corruption body busts Rajasthan officialHariprasad Meena's alleged assets include several luxury cars, three high-end apartments, and a farmhouse. He also spent around Rs 45 lakh on foreign trips and luxury hotel stays."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-ms-dhoni-thala-fan-trolls-2706887-2025-04-10",
      "headline": "I will always be a Thala fan: Ambati Rayudu slams trolls over MS Dhoni commentsIPL 2025: Ambati Rayudu lashed out at criticism of his comments about MS Dhoni. In a strongly-worded post on social media, the former CSK batter hit out at trolls, saying he will continue to be a fan of 'Thala'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-r-ashwin-trolling-rcb-fans-youtube-show-2706868-2025-04-10",
      "headline": "R Ashwin on CSK criticism: Not bothered by trolls, real fans stand by playersIPL 2025: Senior off-spinner R Ashwin said he is open to constructive criticism following intense scrutiny over his slow start to the new season. AShwin has taken 5 wickets in five matches and conceded at over 9 runs per over on his return to CSK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-prince-william-fan-disects-performance-viral-video-2706842-2025-04-10",
      "headline": "Prince William channels inner Villa fan with punditry before PSG defeatPrince William's detailed analysis of Aston Villa ahead of their defeat to PSG has gone viral, with football fans praising his tactical breakdown and deep knowledge of the game. The royal was in attendance at the Parc des Princes for the Champions League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-intense-rivalry-rcb-vs-csk-bengaluru-2706831-2025-04-10",
      "headline": "Virat Kohli on IPL's most buzzing rivalry: Nothing Like CSK vs RCB in BengaluruIPL 2025: Virat Kohli said the buzz during Chennai Super Kings' visit to Bengaluru at the M Chinnaswamy Stadium is unmatched and adds to the theatre around the contest. RCB hammered CSK by 50 runs earlier in the season in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-khvicha-kvaratskhelia-project-luis-enrique-champions-league-2706816-2025-04-10",
      "headline": "Luis Enrique hails Kvaratskhelia key to PSG project after Villa heroicsLuis Enrique praised Khvicha Kvaratskhelia's match-winning display against Aston Villa, calling him a vital piece of PSG's future. The Georgian winger's impact has already been felt since his January move, helping the Parisians take a strong lead into the second leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-preview-pitch-conditions-prediction-team-news-2706788-2025-04-10",
      "headline": "IPL preview: Unbeaten Delhi Captails visit Bengaluru as RCB seek home comfortUnbeaten Delhi Capitals will be aiming to make it four wins in a row when they face Royal Challengers Bengaluru at the M. Chinnaswamy Stadium on Thursday. Two explosive sides are set for a cracking contest—one that could well be decided by the finest of margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-rr-gujarat-titans-assistant-coach-parthiv-patel-press-conference-2706774-2025-04-10",
      "headline": "Had to drag Sudharsan out of nets: GT coach Parthiv praises opener's work ethicsGujarat Titans assistant coach Parthiv Patel has praised Sai Sudharsan's superb run with the bat in the ongoing Indian Premier League (IPL) 2025. Sudharsan starred with the bat again, scoring 82 from 53 deliveries against the Rajasthan Royals with eight boundaries and three sixes at a strike rate of 154.72."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-elite-list-chris-gayle-kane-williamson-2706751-2025-04-10",
      "headline": "GT vs RR: Sai Sudharsan goes past Gayle, Williamson in elite IPL listSai Sudharsan's brilliant 82 against Rajasthan Royals not only powered Gujarat Titans to a commanding win but also took him past IPL greats like Chris Gayle and Kane Williamson on the elite run-scorers list after 30 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-why-no-washington-sundar-parthiv-patel-explains-2706741-2025-04-10",
      "headline": "Why no Washington Sundar for GT vs RR: Parthiv Patel explains bold callGT batting coach Parthiv Patel has explained the reason why Washington Sundar wasn't part of the playing XI for their win over RR on April 9. Sundar's omission didn't sit well with a lot of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-rr-gujarat-titans-assistant-coach-parthiv-patel-press-conference-2706774-2025-04-10",
      "headline": "Had to drag Sudharsan out of nets: GT coach Parthiv praises opener's work ethicsGujarat Titans assistant coach Parthiv Patel has praised Sai Sudharsan's superb run with the bat in the ongoing Indian Premier League (IPL) 2025. Sudharsan starred with the bat again, scoring 82 from 53 deliveries against the Rajasthan Royals with eight boundaries and three sixes at a strike rate of 154.72."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/los-angeles-olympics-cricket-six-teams-90-players-details-2706771-2025-04-10",
      "headline": "LA Olympics 2028: Cricket to feature 6 teams, 90 players on Games returnCricket will return to the Olympic Games for the first time since 1900. Six men's teams and as many women's teams will be part of the Games in Los Angeles in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-elite-list-chris-gayle-kane-williamson-2706751-2025-04-10",
      "headline": "GT vs RR: Sai Sudharsan goes past Gayle, Williamson in elite IPL listSai Sudharsan's brilliant 82 against Rajasthan Royals not only powered Gujarat Titans to a commanding win but also took him past IPL greats like Chris Gayle and Kane Williamson on the elite run-scorers list after 30 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-why-no-washington-sundar-parthiv-patel-explains-2706741-2025-04-10",
      "headline": "Why no Washington Sundar for GT vs RR: Parthiv Patel explains bold callGT batting coach Parthiv Patel has explained the reason why Washington Sundar wasn't part of the playing XI for their win over RR on April 9. Sundar's omission didn't sit well with a lot of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-on-ashish-nehra-effect-on-mohammed-siraj-and-prasidh-krishna-2706680-2025-04-10",
      "headline": "Ashish Nehra's guidance has done a world of good to Siraj and Prasidh: Robin UthappaFormer India cricketer turned commentator Robin Uthappa has credited Gujarat Titans (GT) coach Ashish Nehra for helping Mohammed Siraj and Prasidh Krishna return to form in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-fined-slow-over-rate-gt-vs-rr-2706726-2025-04-10",
      "headline": "Sanju Samson fined for RR's slow over rate, joins penalised captains listSanju Samson was hit with a Rs 24 lakh fine for a slow over rate against Gujarat Titans, adding to Rajasthan Royals' early-season troubles as the team finds itself mid-table after a shaky 2-3 start in IPL 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-slams-rajasthan-royals-for-releasing-jos-buttler-2706676-2025-04-10",
      "headline": "Robin Uthappa slams Rajasthan Royals for releasing Jos Buttler for mega auctionFormer India cricketer turned commentator Robin Uthappa has slammed Rajasthan Royals (RR) for letting go of Jos Buttler ahead of the mega auction for the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-lack-of-partnerships-winning-team-chasing-siraj-bahutule-2706723-2025-04-10",
      "headline": "RR lacked partnerships vs GT, want to win games chasing: Spin bowling coachRajasthan Royals suffered a heavy defeat at the hands of Gujarat Titans, with coach Sairaj Bahutule calling for sharper batting partnerships and adaptability. RR's inability to chase down 218 now poses key questions for their middle-order consistency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-india-next-all-format-star-2706714-2025-04-10",
      "headline": "IPL 2025: GT's Sudharsan shows he is ready to be India's next all-format starWith maturity beyond his age, Sai Sudharsan is showing that he has all the tools needed to be India's next all-format star in the coming years. The TN batter has been in fine form for GT this season and is continuing to make fans with his smart gameplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/badminton-asia-championship-pv-sindhu-second-round-ester-wardoyo-2706674-2025-04-10",
      "headline": "Badminton Asia Championship: Sindhu reaches 2nd round with straight-sets winIndia's PV Sindhu made it to the second round of the Badminton Asia Championship on Wednesday, April 9. Sindhu defeated Ester Wardoyo of Indonesia in straight sets to make it to the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-crashes-out-of-monte-carlo-masters-after-loss-vs-alejandro-tabilo-2706673-2025-04-10",
      "headline": "Djokovic crashes out of Monte Carlo masters after 2nd straight loss to TabiloNovak Djokovic crashed out of the Monte Carlo Masters following a 3-6, 4-6 loss against unseeded Alejandro Tabilo in the second round on Wednesday. Following his win, Tabilo maintained a remarkable 100% win record over Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sanju-samson-chasing-ahmedabad-2706672-2025-04-10",
      "headline": "GT vs RR: Rajasthan skipper Samson defends decision to bowl first in AhmedabadRajasthan Royals skipper Sanju Samson defended the decision to bowl first in Ahmedabad after their loss to Gujarat Titans on Wednesday, April 9. RR lost their third game in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sai-sudharsan-india-next-all-format-star-2706714-2025-04-10",
      "headline": "IPL 2025: GT's Sudharsan shows he is ready to be India's next all-format starWith maturity beyond his age, Sai Sudharsan is showing that he has all the tools needed to be India's next all-format star in the coming years. The TN batter has been in fine form for GT this season and is continuing to make fans with his smart gameplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/badminton-asia-championship-pv-sindhu-second-round-ester-wardoyo-2706674-2025-04-10",
      "headline": "Badminton Asia Championship: Sindhu reaches 2nd round with straight-sets winIndia's PV Sindhu made it to the second round of the Badminton Asia Championship on Wednesday, April 9. Sindhu defeated Ester Wardoyo of Indonesia in straight sets to make it to the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-crashes-out-of-monte-carlo-masters-after-loss-vs-alejandro-tabilo-2706673-2025-04-10",
      "headline": "Djokovic crashes out of Monte Carlo masters after 2nd straight loss to TabiloNovak Djokovic crashed out of the Monte Carlo Masters following a 3-6, 4-6 loss against unseeded Alejandro Tabilo in the second round on Wednesday. Following his win, Tabilo maintained a remarkable 100% win record over Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sanju-samson-chasing-ahmedabad-2706672-2025-04-10",
      "headline": "GT vs RR: Rajasthan skipper Samson defends decision to bowl first in AhmedabadRajasthan Royals skipper Sanju Samson defended the decision to bowl first in Ahmedabad after their loss to Gujarat Titans on Wednesday, April 9. RR lost their third game in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-prasidh-krishna-shimron-hetmyer-gt-vs-rr-2706654-2025-04-09",
      "headline": "IPL 2025 GT vs RR: All-round Gujarat Titans hammer Rajasthan Royals to top tableGujarat Titans (GT) continued their winning run in the Indian Premier League 2025 (IPL 2025), beating Rajasthan Royals (RR) by 58 runs at the Narendra Modi Stadium in Ahmedabad. Sai Sudharsan was the star of the show with his magnificent innings of 82 (53) while Prasidh Krishna emerged as the pick of the bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-archery-compund-mixed-team-medal-added-2706659-2025-04-09",
      "headline": "Compound archery added to Olympics 2028: Why it's a big boost to India's hopesThe Los Angeles Olympics in 2028 will feature the mixed team compound archery event in addition to the five recurve events. For the first time since the reintroduction of archery in 1972 in the Olympics, a new bow style has been added to the Games. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-riyan-parag-angry-dismissal-ahmedabad-2706652-2025-04-09",
      "headline": "GT vs RR: Riyan Parag smashes bat in anger following controversial dismissalRiyan Parag was left fuming and smashed his bat in anger after being dismissed in controversial fashion against Gujarat Titans on April 9. Riyan was dismissed for 26 runs during the tough run chase against GT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yashasvi-jaiswals-catch-ruins-rashid-khans-no-look-shot-2706639-2025-04-09",
      "headline": "Watch: Yashasvi Jaiswal's spectacular catch ruins Rashid Khan's 'no-look' shotRajastha Royals batter Yashasvi Jaiswal took a stunning diving catch to dismiss Rashid Khan during Match 23 of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-upper-hand-over-dc-theyre-only-relying-on-only-3-players-jitesh-sharma-2706625-2025-04-09",
      "headline": "We've upper hand over DC, they're only relying on 3 players: Jitesh SharmaRoyal Challengers Bengaluru (RCB) wicketkeeper batter feels his team has the upper hand over Delhi Capitals (DC) in their upcoming clash at the M. Chinnaswamy Stadium in Bengaluru as they're not dependent on only three players like DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-on-dinesh-karthik-rcb-vs-dc-2706604-2025-04-09",
      "headline": "Jitesh Sharma aiming to become 360-degree player under Dinesh Karthik at RCBRoyal Challengers Bengaluru (RCB) wicketkeeper batter Jitesh Sharma has opened up on his training regime under batting coach and mentor Dinesh Karthik, who wants to make him a 360-degree player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-dc-kl-rahul-batting-spot-matthew-mott-press-conference-2706601-2025-04-09",
      "headline": "RCB vs DC: Class player KL Rahul has ability to bat anywhere, says Matthew MottDelhi Capitals assistant coach Matthew Mott feels that KL Rahul has the ability to bat anywhere in the lineup for the team ahead of their clash against RCB on April 10. Rahul has batted at No.4 and then opened the batting for DC in their win against CSK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-caratini-delivers-winning-hit-for-houston-astros-against-seattle-mariners-glbs-2706593-2025-04-09",
      "headline": "MLB: Caratini delivers winning hit for Houston Astros against Seattle MarinersThe Houston Astros defeated the Seattle Mariners on Tuesday, April 8 after Victor Caratini hit the winning RBI single in the top of the 12th innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badmiton-asia-championships-round-one-lakshya-sen-hs-prannoy-2706588-2025-04-09",
      "headline": "Badminton Asia Championships: Lakshya Sen, HS Prannoy crash out in Round 1India's Lakshya Sen and HS Prannoy suffered early exits from the Badminton Aisa Championships on Wednesday, April 9. Aakarshi Kashyap and Anupama Upadhyaya also lost their opening round matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammad-kaif-slams-practice-of-retiring-out-players-2706582-2025-04-09",
      "headline": "Mohammad Kaif slams practice of retiring out players in ongoing IPLFormer India cricketer turned commentator Mohammad Kaif has slammed the practice of retiring out players in the ongoing Indian Premier League 2025 (IPL 2025) calling it a move of desperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hayley-matthews-cramps-batting-women-world-cup-qualifier-west-indies-2706584-2025-04-09",
      "headline": "Watch: Hayley Matthews stretchered off, returns to hit hundred in WWC qualifierWest Indies captain Hayley Matthews was stretchered off the pitch in their Women's World Cup Qualifier match vs Scotland. Matthews battled cramps to score a heroic 114* in losing cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-washington-sundar-left-out-ashish-nehra-shubman-gill-2706583-2025-04-09",
      "headline": "Where is Sundar? Fans stunned as GT star left on bench for RR clashFans were stunned to see Washington Sundar miss out on making it to the playing XI for GT's clash against RR on Wednesday, April 9. Sundar was one of the stars of the show for GT in their win against SRH. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}