{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blusmart-uber-fleet-partnership-pivot-business-plan-financial-struggle-report-2708750-2025-04-14",
      "headline": "BluSmart likely to end cab service, join hands with Uber: ReportThe company, which started out by operating electric vehicles on Uber's platform nearly six years ago, is now preparing to shut down its own cab service and supply cars to Uber again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/investing-or-borrowing-check-new-sbi-hdfc-boi-interest-rates-rbi-repo-rate-cut-2708706-2025-04-14",
      "headline": "Investing or borrowing? Check new SBI, HDFC, BOI interest ratesThe latest rate cut signals a broader trend—savers are using savings accounts mainly for transactions, while putting the rest in fixed deposits for better returns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mehul-choksi-what-is-pnb-bank-scam-rs-13850-crore-arrested-in-belgium-nirav-modi-2708698-2025-04-14",
      "headline": "Mehul Choksi arrested in Belgium: What is the Rs 14,000 crore PNB scam?Mehul Choksi once headed the Gitanjali Group, a well-known jewellery firm. Born in 1959, Choksi was active in the diamond industry for many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-of-india-home-loan-interest-rates-cut-new-and-existing-borrowers-check-details-2708679-2025-04-14",
      "headline": "Bank of India cuts home loan rates for new, existing customers. Check detailsThis adjustment is expected to make borrowing slightly easier for individuals at a time when the RBI is clearly looking to revive private investment and sustain domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-this-week-what-to-expect-key-factors-to-watch-expert-insights-2708654-2025-04-14",
      "headline": "What to expect from stock market this week? 4 key things investors should knowMultiple factors could determine the mood on Dalal Street. From April 12 to 19, investors will be watching crucial Q4 earnings, economic data releases in India, the US, and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/make-in-india-investor-shankar-sharma-mumbai-slum-visit-china-manufacturing-reaction-x-2708599-2025-04-14",
      "headline": "Investor visits Mumbai slum, uncovers truth about 'Make in India'Veteran investor Shankar Sharma recently shared a personal experience that raised fresh questions about India's manufacturing reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kotak-mutual-fund-md-nilesh-shah-capital-gains-loophole-nris-tax-treaty-exploitation-2708591-2025-04-14",
      "headline": "'Shift to UAE': Kotak AMC MD Nilesh Shah flags tax loophole exploited by NRIsNilesh Shah has warned that high-net-worth individuals could exploit tax treaties with some countries to avoid India's capital gains tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-dividend-for-fy25-may-pay-record-rs-25-lakh-crore-to-government-more-than-fy24-2708569-2025-04-14",
      "headline": "RBI may pay record Rs 2.5 lakh crore dividend to centre in FY25The RBI is likely to announce the exact dividend amount in late May. Last year, the payout surprised many as it was double what most had expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-closed-today-for-ambedkar-jayanti-check-stock-market-holiday-list-2025-2708546-2025-04-14",
      "headline": "Ambedkar Jayanti 2025: Is the stock market closed today?Over the past few months, benchmark indices Sensex and Nifty have seen large ups and downs, with global news, especially from the United States, playing a major role in the market's movement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariff-war-may-benefit-india-despite-short-term-shocks-mercedes-benz-india-ceo-2708347-2025-04-13",
      "headline": "Tariff war may benefit India despite short-term shocks: Mercedes-Benz India CEOMercedes-Benz India CEO Santosh Iyer stated that India may benefit from the ongoing global tariff war in the long term despite short-term challenges. He highlights the potential for increased trade and reduced barriers as a positive outcome for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-600-ton-airlift-india-to-us-amid-trump-tariff-china-import-why-reason-explained-2707997-2025-04-12",
      "headline": "Why is Apple in a race against time to fly iPhones back to the US?Apple's long-term goal is to reduce its dependence on Chinese factories and shift more production to other countries, with India playing a big part in that plan.  However, it relies heavily on a network of suppliers and trained workers that only exists at the required scale in parts of Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-whatsapp-channel-qr-code-number-heres-how-to-access-banking-digital-safety-2707973-2025-04-12",
      "headline": "RBI launches WhatsApp Channel: Here's how to access it via QR codeThe RBI said that the goal of the WhatsApp channel is to provide verified and timely information about banking, digital safety, and other important topics directly to users. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-heartwarming-note-about-granddaughter-slow-living-and-real-joy-melts-hearts-2708744-2025-04-14",
      "headline": "Suniel Shetty's note about granddaughter, slow living, and real joy melts heartsActor Suniel Shetty said he has found real joy in his granddaughter. He wrote a long note about how the feeling of carrying his granddaughter in his arms is unparalleled and has provided new meaning to his life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/veteran-kannada-actor-bank-janardhan-dies-at-75-2708738-2025-04-14",
      "headline": "Veteran Kannada actor Bank Janardhan dies at 75Kannada film and television actor Bank Janardhan died at the age of 75 due to age-related health issues. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nushratt-bharuccha-chhorii-2-is-a-wake-up-call-2708672-2025-04-14",
      "headline": "Fear patriarchy, not paranormal: Nushrratt Bharuccha's Chhorii 2 is a wake-up callNushrratt Bharuccha's 'Chhorii 2' highlights the brutal side of Indian society, where the preference for having a male child and the growing cases of female foeticide have added to the ongoing debates about deep-rooted patriarchy, gender-based violence, and the societal failure to value the girl child.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kerianne-flynn-producer-travelling-katy-perry-blue-origin-lauren-sanchez-2708725-2025-04-14",
      "headline": "Who is Kerianne Flynn, producer travelling with Katy Perry to space?Producer Kerianne Flynn, who has bankrolled several acclaimed projects, including 'The Automatic Hate' (2015), 'This Changes Everything', and more, is among the six women preparing to launch into space on a Blue Origin rocket.  \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-questions-ranbir-kapoor-role-in-highway-promotions-with-alia-bhatt-while-he-was-left-out-2708681-2025-04-14",
      "headline": "Randeep Hooda questions Ranbir's role in Highway promotions while he was left outRanbir Kapoor once promoted 'Highway' with Alia Bhatt and Imtiaz Ali, while the film's lead actor, Randeep Hooda, was kept out of promotions. Now, the latter asked what Ranbir had to do with the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-trailer-nani-arjun-sarkaar-restores-faith-in-humanity-in-gritty-thriller-2708671-2025-04-14",
      "headline": "HIT 3 Trailer: Nani's Arjun Sarkaar restores faith in humanity in gritty thrillerThe much-awaited trailer of HIT 3 is out. Starring Nani as the fierce cop Arjun Sarkaar, the action-thriller will release in theatres on May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-asks-fans-how-to-grow-his-x-followers-internet-responds-with-hilarious-ideas-2708657-2025-04-14",
      "headline": "Big B asks fans how to grow his X followers, internet responds with hilarious ideasAmitabh Bachchan shared a post on X asking fans how he could grow his follower count. The internet responded with hilarious suggestions, including posting a selfie with actor Rekha, among others.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-red-jacket-look-in-swiss-pics-screams-saif-ali-khan-ta-ra-rum-pum-vibes-2708650-2025-04-14",
      "headline": "Ibrahim Ali Khan's red jacket look in Swiss pics screams Saif's Ta Ra Rum Pum vibesIbrahim Ali Khan once again gave his fans the like-father-like-son moment when he shared new photos of himself wearing a red jacket during his Switzerland trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kareena-kapoor-confirms-daayra-with-meghna-gulzar-prithviraj-sukumaran-2708606-2025-04-14",
      "headline": "Bold and thought-provoking: Kareena confirms Daayra with Meghna Gulzar, PrithvirajActors Kareena Kapoor and Prithviraj Sukumaran are set to share the screen space for the first time in Meghna Gulzar's crime drama, 'Daayra.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-april-photo-dump-has-more-of-hrithik-roshan-saba-azad-and-little-malti-viral-bollywood-photos-today-2708597-2025-04-14",
      "headline": "More of Hrithik, Saba, and little Malti in Priyanka's April photo-dump 'so far'Actor Priyanka Chopra on Monday gave a glimpse into her 'April so far'. She shared a new photo from her outing with Krrish co-star Hrithik Roshan and his partner, Saba Azad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-stands-by-friend-rida-tharana-over-black-magic-comment-2708575-2025-04-14",
      "headline": "End hate: Apoorva Mukhija stands by friend Rida Tharana over black magic commentApoorva Mukhija has spoken out following criticism directed at Rida Tharana over her remarks on black magic. She calls for an end to spreading negativity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-viral-zip-it-reaction-to-paparazzi-asking-about-govinda-watch-latest-video-bollywood-update-2708570-2025-04-14",
      "headline": "Sunita Ahuja's 'zip it' reaction to paparazzi asking about Govinda. WatchGovinda and his wife, Sunita Ahuja, faced divorce rumours earlier this year. Now, her reaction to paps asking about her husband's absence from an event has gone viral in a new video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-says-same-role-same-days-but-paid-dramatically-different-than-men-2708560-2025-04-14",
      "headline": "Samantha says same role, same days, but paid 'dramatically different' than menActor Samantha opened up about the significant pay gap between her and her male counterparts in the Telugu film industry. She advocated for equal pay for equal work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-4-detailed-report-sunny-deol-film-misses-rs-50-crore-mark-in-1st-weekend-2708561-2025-04-14",
      "headline": "Jaat box office Day 4: Sunny Deol's film misses Rs 50 crore mark in 1st weekend Sunny Deol's 'Jaat' collected around Rs 40 crore nett in India after its extended opening weekend. The film showed impressive growth on its first Sunday, which is a good sign for its future run domestically. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wife-anna-lezhneva-offers-hair-at-tirumala-after-son-survives-fire-accident-2708558-2025-04-14",
      "headline": "Pawan Kalyan's wife Anna offers hair at Tirumala after son survives fire accidentActor-politician Pawan Kalyan's wife Anna Lezhneva tonsured her head after their son, Mark Shankar, survived the fire accident at his school in Singapore. Anna vowed her hair to Lord Venkateshwara at the Tirumala Tirupati temple. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-4-detailed-report-ajith-film-to-top-dragon-soon-nears-rs-100-crore-after-1st-weekend-2708557-2025-04-14",
      "headline": "Good Bad Ugly box office Day 4: Ajith's film to top Dragon soon, nears Rs 100 croreAjith's 'Good Bad Ugly' is moving at a decent pace. While it is yet to surpass the benchmark of Rs 100 crore domestically, the film has already managed to cross that mark worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-2-episode-1-review-pedro-pascal-bella-ramsey-hbo-2708494-2025-04-14",
      "headline": "The Last of Us 2 Episode 1 review: Pedro Pascal show hits the sweet spotReleased-Mon Apr 14, 2025The pilot episode of HBO's highly-anticipated The Last of Us Season 2 is here, and it is safe to say that the audiences are in for an exhilarating ride. Once again. Read our complete take on the first episode here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-reacts-to-trolling-over-old-apology-video-some-memes-hurt-me-2708397-2025-04-13",
      "headline": "Babil Khan reacts to trolling over old apology video: Some memes hurt meActor Babil Khan broke his silence on the trolling that he was subjected to after hi repeated apologies for mistakenly photobombing a woman at an event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-creator-asit-modi-breaks-silence-on-controversies-dayaben-2708394-2025-04-13",
      "headline": "I do feel bad: Taarak Mehta creator Asit Modi breaks silence on controversies'Taarak Mehta Ka Ooltah Chashmah' creator Asit Modi responded to allegations raised by former actors of the show. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pnb-scam-case-how-india-foiled-mehul-choksis-plan-to-flee-to-switzerland-2708653-2025-04-14",
      "headline": "How India foiled Mehul Choksi's plan to flee to SwitzerlandMehul Choksi, who fled India in 2018 before his involvement in PNB scam case came to light, was arrested by Belgium authorities at India's request."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-betrayed-ambedkars-dream-used-constitution-for-appeasement-pm-2708627-2025-04-14",
      "headline": "PM's 'votebank ka virus' jibe at Congress draws 'lip service to Ambedkar' counterWhile speaking at an event in Haryana, PM Modi claimed that Congress never used the Constitution to benefit anyone, including the Muslims, Scheduled Castes, Scheduled Tribes, and Other Backward Classes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-stripped-of-hijab-hindu-man-beaten-in-up-muzaffarnagar-6-arrested-2708726-2025-04-14",
      "headline": "Woman stripped off hijab, Hindu man beaten in UP's Muzaffarnagar; 6 arrestedThe men in the video are seen forcibly removing the woman's hijab, while verbally abusing, harassing, and physically assaulting her and the man who accompanied her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-us-immigration-rules-by-trump-administration-brings-another-bad-news-for-india-2708601-2025-04-14",
      "headline": "Trump's new immigration rules bring more bad news for IndiansThe EB-5 Unreserved category for Indian applicants has retrogressed by over six months - from November 1, 2019, to May 1, 2019 - narrowing the eligibility window and significantly delaying the path to US permanent residency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nushratt-bharuccha-chhorii-2-is-a-wake-up-call-2708672-2025-04-14",
      "headline": "Fear patriarchy, not paranormal: Nushrratt Bharuccha's Chhorii 2 is a wake-up callNushrratt Bharuccha's 'Chhorii 2' highlights the brutal side of Indian society, where the preference for having a male child and the growing cases of female foeticide have added to the ongoing debates about deep-rooted patriarchy, gender-based violence, and the societal failure to value the girl child.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tahawwur-ranas-voice-samples-to-be-collected-by-nia-probe-dubai-link-say-sources-2708721-2025-04-14",
      "headline": "NIA to collect Tahawwur Rana's voice samples; probe Dubai link: SourcesAccording to sources, investigators are now considering collecting Rana's voice samples to verify intercepted conversations with David Coleman Headley, the convicted operative who carried out reconnaissance missions for the attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/cctv-footage-shows-how-accused-abducted-5-year-old-girl-before-attempting-to-rape-murdering-her-in-hubballi-karnataka-2708646-2025-04-14",
      "headline": "CCTV shows man kidnapping girl before killing her in Karnataka's HubballiThe chilling CCTV footage captured the moment a man abducted a five-year-old girl in Hubballi, Karnataka, ultimately leading to her murder. The accused was later killed in an encounter with the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mehul-choksi-what-is-pnb-bank-scam-rs-13850-crore-arrested-in-belgium-nirav-modi-2708698-2025-04-14",
      "headline": "Mehul Choksi arrested in Belgium: What is the Rs 14,000 crore PNB scam?Mehul Choksi once headed the Gitanjali Group, a well-known jewellery firm. Born in 1959, Choksi was active in the diamond industry for many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/science-meets-glamour-how-katy-perry-and-lauren-sanchez-are-taking-fashion-to-space-2708737-2025-04-14",
      "headline": "How Katy Perry and Lauren Sanchez are taking fashion to spaceIf space is the new frontier, then these women just turned the launchpad into a runway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-cop-mistakes-judge-for-thief-searches-her-home-in-bizarre-court-order-mix-up-2708652-2025-04-14",
      "headline": "UP cop mistakes judge for thief, searches her home in bizarre mix-upThe incident unfolded when Sub-Inspector Banwarilal, tasked with executing a proclamation order under Section 82 of the Criminal Procedure Code (CrPC), began searching for Chief Judicial Magistrate Nagma Khan - who had in fact issued the proclamation against the actual accused, Rajkumar alias Pappu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ncert-gives-hindi-names-to-english-textbooks-sparks-language-row-2708688-2025-04-14",
      "headline": "NCERT gives Hindi names to English textbooks, sparks language rowThe NCERT has stirred debate by giving Hindi names to its new English-medium textbooks, including those meant for learning English. Experts and educators question the move, calling it confusing and a break from long-standing academic norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/singapore-pm-lawrance-wong-indian-origin-candidates-2025-general-election-pap-patry-doctor-hamid-razak-2708694-2025-04-14",
      "headline": "No Indian-origin candidates in 2020, Singapore PM Wong vows to change thatAhead of the general elections in Singapore, PM Lawrence Wong has promised that his party, the People's Action Party (PAP), will field Indian-origin candidates, something it did not do in the 2020 polls. Calling the Indian community \"a small community with a big impact\", Wong said that among the PAP's 30 new faces, there would be Indians as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/porter-agent-calls-customer-lazy-tower-to-tower-delivery-same-complex-video-debate-2708589-2025-04-14",
      "headline": "Porter agent calls customer lazy for tower-to-tower delivery, video sparks debateThe Porter delivery man, who documented the process in the video, turned the camera toward tower 17, from where he had to collect the order, and then pointed at tower 19 in the same apartment complex, where it needed to be delivered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mayank-yadav-injury-updated-lsg-bcci-2708742-2025-04-14",
      "headline": "Mayank Yadav recovers from injury, set to join LSG after long layoffMayank Yadav, one of the fastest bowlers in the history of Indian cricket, has recovered from injury and is set to join the Lucknow Super Giants on Tuesday, April 15, India Today has learnt.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salman-khan-death-threat-mumbai-police-blow-up-his-car-assassinate-bollywood-lawrence-bishnoi-2708587-2025-04-14",
      "headline": "Will blow up his car: Actor Salman Khan gets another death threat, case filedThe fresh threat to Salman Khan comes almost exactly a year after multiple rounds were fired outside his Bandra home. Over the last few years, the Bollywood actor has received multiple threats from the Lawrence Bishnoi gang. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/come-see-what-putin-has-done-zelenskyy-invites-donald-trump-to-ukraine-sumy-missile-strike-2708708-2025-04-14",
      "headline": "Come see what Putin has done: Zelenskyy invites Donald Trump to UkraineRussia's missile attack on Sumy drew widespread criticism from international leaders with French President Emmanuel Macron claiming that Russia was 'undermining the diplomatic efforts made by President Trump.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/when-mom-has-diabetes-baby-might-too-the-hidden-risk-few-talk-about-2708656-2025-04-14",
      "headline": "Not just the mother's battle: How diabetes can cross the wombNeonatal diabetes is a rare type of diabetes that appears in newborns, usually before six months of age. Genetic testing helps doctors know which type a baby has and how to treat it effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mehul-choksi-belgium-arrested-extradition-whistleblower-sv-hariprasad-india-fugitive-economic-offender-nirav-modi-2708631-2025-04-14",
      "headline": "Choksi's wallet is full, he will do what Vijay Mallya did, warns whistleblowerIn what could provide a boost to India's fight against fugitive economic offenders, diamond trader Mehul Choksi has been arrested in Belgium. However, getting Choksi extradited could be a tough task, says PNB scam whistleblower Hariprasad SV. He says Choksi has the money to hire the best lawyers in Europe and frustrate India's efforts, like former liquor baron Vijay Mallya has."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-mi-rohit-sharma-tactical-suggestions-hardik-pandya-2708680-2025-04-14",
      "headline": "Subbed off, yet Rohit Sharma orchestrates game-changing moments in thrillerIPL 2025, DC vs MI: Despite having been subbed after the powerplay, Rohit Sharma's inputs from the dugout proved game-changing for Mumbai Indians. Despite Karun Nair's blazing 89, MI successfully defended 205 in Delhi on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/japan-embraces-4-day-workweek-while-india-debates-90-hour-weeks-2708684-2025-04-14",
      "headline": "As India debates 90-hour weeks, Japan embraces 4-day work cultureAs countries around the world move towards shorter workweeks, Japan's new four-day work policy shows how work-life balance is becoming an important part of solving bigger problems like falling birth rates and an ageing population. While some voices in India call for longer hours, countries are prioritising their population. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/volkswagen-tiguan-r-line-launched-in-india-at-rs-49-lakh-2708670-2025-04-14",
      "headline": "Volkswagen Tiguan R-Line launched in India at Rs 49 lakhBuilt on the MQB EVO platform, the Volkswagen Tiguan R-Line boasts a new chassis generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kotak-mutual-fund-md-nilesh-shah-capital-gains-loophole-nris-tax-treaty-exploitation-2708591-2025-04-14",
      "headline": "'Shift to UAE': Kotak AMC MD Nilesh Shah flags tax loophole exploited by NRIsNilesh Shah has warned that high-net-worth individuals could exploit tax treaties with some countries to avoid India's capital gains tax. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-educationists-body-demand-governor-rn-ravi-sack-president-murmu-jai-shri-ram-chant-students-2708600-2025-04-14",
      "headline": "Tamil Nadu educationists demand Governor RN Ravi's removal over 'Jai Shri Ram' rowA body of Tamil Nadu educationists has written to President Droupadi Murmu, demanding the removal of Governor RN Ravi for violating constitutional secularism by asking college students to chant \"Jai Shri Ram\" during a public event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/suzuki-two-wheelers-can-now-be-booked-on-flipkart-2708736-2025-04-14",
      "headline": "Suzuki two-wheelers can now be booked on FlipkartThe Suzuki Access is not yet available for booking on Flipkart."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mayank-yadav-injury-updated-lsg-bcci-2708742-2025-04-14",
      "headline": "Mayank Yadav recovers from injury, set to join LSG after long layoffMayank Yadav, one of the fastest bowlers in the history of Indian cricket, has recovered from injury and is set to join the Lucknow Super Giants on Tuesday, April 15, India Today has learnt.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-captain-mumbai-indians-fan-nita-ambani-video-2708713-2025-04-14",
      "headline": "Make Rohit captain: Fan pleads with folded hands to Nita Ambani at Shirdi templeIPL 2025: A fan was seen requesting Mumbai Indians owner Nita Ambani to reinstate Rohit Sharma as captain during the latter's visit to Shirdi temple. Hardik Pandya replaced Rohit as MI captain in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-red-card-tackle-vs-alaves-2708709-2025-04-14",
      "headline": "Watch: Kylian Mbappe's red-card tackle on Alaves playerReal Madrid forward Kylian Mbappe was given a straight red card for his horror tackle against Alaves midfielder Antonio Blanco. After the match, assistant coach Davide Ancelotti defended Mbappe, stating that he was not a violent guy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-mi-rohit-sharma-tactical-suggestions-hardik-pandya-2708680-2025-04-14",
      "headline": "Subbed off, yet Rohit Sharma orchestrates game-changing moments in thrillerIPL 2025, DC vs MI: Despite having been subbed after the powerplay, Rohit Sharma's inputs from the dugout proved game-changing for Mumbai Indians. Despite Karun Nair's blazing 89, MI successfully defended 205 in Delhi on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-newcastle-andre-onana-replacement-altay-bayindir-2708673-2025-04-14",
      "headline": "Man United's worries pile up as Onana replacement fails on debutManchester United fell to a 1-4 loss against Newcastle United on Sunday. Premier League debutant Altay Bayindir did not put in a good show complicating things for coach Ruben Amorim.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-csk-match-preview-rishabh-pant-ms-dhoni-2708641-2025-04-14",
      "headline": "Dhoni vs Rishabh in focus as CSK look to arrest freefall vs LucknowIPL 2025, LSG vs CSK match preview: Chennai Super Kings are in a freefall, losing six games in a row this season. Can they arrest their collapse against Rishabh Pant's Lucknow, who have sizzled with their in-form players?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-dc-vs-mi-12-lakh-fine-over-rate-2708635-2025-04-14",
      "headline": "Axar Patel fined Rs 12 lakh, 6th captain penalised for slow over-rateIPL 2025: Axar Patel became the sixth captain to be fined Rs 12 lakh for over-rate offence. The Delhi Capitals suffered their first defeat of the season, falling short of a 206-run target by 13 runs in New Delhi on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-rr-virat-kohli-prank-bat-missing-tim-david-ipl-2025-2708573-2025-04-14",
      "headline": "Watch: Virat Kohli gets pranked by RCB teammates after win vs RRRoyal Challengers Bengaluru players pulled off a hilarious prank on Virat Kohli after their win against  Rajasthan Royals. Tim David stole Virat's bat, which saw hilarious reactions from the legendary batter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-record-home-vs-away-devdutt-padikkal-2708565-2025-04-14",
      "headline": "About time RCB started winning at home: Padikkal jokes after 4th away winRoyal Challengers Bengaluru beat Rajasthan Royals 9 wickets in Jaipur on Sunday. This was RCB's 4th away win in the IPL in as many games. After the match, batter Devdutt Padikkal joked that it was about time RCB started to win at home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-rcb-mo-bobat-press-conference-2708556-2025-04-14",
      "headline": "RCB not worried about their poor home form in IPL 2025: Mo BobatRoyal Challengers Bengaluru's director of cricket, Mo Bobat, said that he was not worried about the team's home vs away record in the IPL 2025. This season, RCB have done well while visiting other venues, but have floundered at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-mi-karun-nair-full-press-conference-2708550-2025-04-14",
      "headline": "I had the confidence: Karun Nair after making sizzling IPL comebackKarun Nair put in an incredible show with the bat in his comeback to the Indian Premier League. Nair was the lone warrior for Delhi Capitals but was not able to take them home. Speaking after the match, Karun Nair said that he had the confidence that he would do well if given a chance this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-dc-vs-mi-12-lakh-fine-over-rate-2708635-2025-04-14",
      "headline": "Axar Patel fined Rs 12 lakh, 6th captain penalised for slow over-rateIPL 2025: Axar Patel became the sixth captain to be fined Rs 12 lakh for over-rate offence. The Delhi Capitals suffered their first defeat of the season, falling short of a 206-run target by 13 runs in New Delhi on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-rr-virat-kohli-prank-bat-missing-tim-david-ipl-2025-2708573-2025-04-14",
      "headline": "Watch: Virat Kohli gets pranked by RCB teammates after win vs RRRoyal Challengers Bengaluru players pulled off a hilarious prank on Virat Kohli after their win against  Rajasthan Royals. Tim David stole Virat's bat, which saw hilarious reactions from the legendary batter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-record-home-vs-away-devdutt-padikkal-2708565-2025-04-14",
      "headline": "About time RCB started winning at home: Padikkal jokes after 4th away winRoyal Challengers Bengaluru beat Rajasthan Royals 9 wickets in Jaipur on Sunday. This was RCB's 4th away win in the IPL in as many games. After the match, batter Devdutt Padikkal joked that it was about time RCB started to win at home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-rcb-mo-bobat-press-conference-2708556-2025-04-14",
      "headline": "RCB not worried about their poor home form in IPL 2025: Mo BobatRoyal Challengers Bengaluru's director of cricket, Mo Bobat, said that he was not worried about the team's home vs away record in the IPL 2025. This season, RCB have done well while visiting other venues, but have floundered at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-mi-karun-nair-full-press-conference-2708550-2025-04-14",
      "headline": "I had the confidence: Karun Nair after making sizzling IPL comebackKarun Nair put in an incredible show with the bat in his comeback to the Indian Premier League. Nair was the lone warrior for Delhi Capitals but was not able to take them home. Speaking after the match, Karun Nair said that he had the confidence that he would do well if given a chance this season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}