{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-why-you-should-declare-foreign-assets-by-january-15-check-details-2660469-2025-01-06",
      "headline": "ITR filing: Why you should declare foreign assets by January 15Indian residents must disclose foreign assets and income in their ITRs by January 15, 2025, to maintain compliance and avoid penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-3-0-launch-date-announced-check-atm-withdrawal-feature-other-details-2660427-2025-01-06",
      "headline": "EPFO 3.0 launch date announced: Check ATM withdrawal feature, other detailsEPFO 3.0, launching by June 2025, will offer ATM-based withdrawals, flexible contributions, and improved features, transforming retirement fund management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-giant-infosys-delays-annual-salary-hikes-to-q4-3-reasons-why-stmp-2660403-2025-01-06",
      "headline": "IT giant Infosys defers annual salary hikes to Q4. 3 reasons whyInfosys postpones annual salary hike: The ongoing macroeconomic uncertainty has left IT companies grappling with subdued discretionary spending, delayed client budgets, and rising cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-slides-1200-points-as-hmpv-virus-scare-derails-dalal-street-2660396-2025-01-06",
      "headline": "Sensex slides 1,200 points as HMPV scare derails Dalal StreetThe S&P BSE Sensex slipped 1258.12 points to close at 77,964.99, while the NSE Nifty50 nosedived 388.70 points to end at 23,616.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/table-space-co-founder-amit-banerji-dies-of-heart-attack-2660393-2025-01-06",
      "headline": "Table Space co-founder Amit Banerji dies of heart attackAmit Banerji, founder and CEO of Table Space, passed away suddenly at 44, leaving a lasting impact on the startup ecosystem and his company's growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-couple-stays-to-family-hotels-founder-ritesh-agarwal-on-changing-oyo-brand-image-2660388-2025-01-06",
      "headline": "Ritesh Agarwal explains how OYO is shifting focus to family-friendly staysKnown for being couple-friendly, even for unmarried couples, OYO has been working over the past few months to rebrand itself as a more family-oriented platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2025-will-salaried-class-get-any-tax-relief-increased-disposable-income-affordable-housing-inflation-control-healthcare-and-welfare-support-2660332-2025-01-06",
      "headline": "Budget 2025: Will salaried class get any tax relief?With Budget 2025 approaching, the salaried class eagerly anticipates a budget that acknowledges their contributions and eases financial burdens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-glass-lining-ipo-day-1-subscribe-skip-review-good-bad-latest-subscription-gmp-details-2660326-2025-01-06",
      "headline": "Standard Glass Lining IPO fully booked on Day 1: Should you subscribe or skip?Standard Glass Lining IPO Day 1: Investors have shown huge interest in the Standard Glass Lining IPO and on its opening day, the IPO was subscribed 7.43 times overall as of latest update. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-did-sensex-nifty-crash-today-5-reasons-why-stock-market-is-down-2660316-2025-01-06",
      "headline": "Why did Sensex, Nifty crash today? 5 reasons why stock market is down Share market crash today: Sensex and Nifty tumbled sharply during the trading session as Dalal Street saw a massive spike in volatility. Below are the key factors that have negatively impacted the stock market today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-bank-share-price-tumbles-7-percent-after-q3-update-key-reasons-explained-stmp-2660295-2025-01-06",
      "headline": "Explained: Why Union Bank share price tumbled 7% after Q3 updateUnion Bank stock price: The decline followed a weak quarter-on-quarter (Q-o-Q) performance in its Q3 update. By 1:09 pm, the stock was trading 6.69% lower at Rs 115.75 on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capital-infra-trust-invit-ipo-latest-gmp-price-band-and-key-dates-stmp-2660288-2025-01-06",
      "headline": "Capital Infra Trust IPO: Check latest GMP, price band, and key datesCapital Infra Trust InvIT IPO: The IPO allotment is scheduled for January 10, 2025, with refunds expected to be processed by January 13. Shares will likely be credited to demat accounts on the same day, and the listing is anticipated on January 14 on the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-5-new-tax-regime-features-every-taxpayer-must-know-revised-tax-slabs-standard-deduction-2660279-2025-01-06",
      "headline": "ITR filing: 5 new tax regime features every taxpayer must knowBudget 2024's revamped tax regime offers simplified slabs, higher deductions, and savings up to Rs 17,500 annually, enhancing flexibility and easing tax compliance for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/saregama-india-stock-price-surges-20-percent-in-5-days-should-you-buy-or-avoid-stmp-2660277-2025-01-06",
      "headline": "Saregama India share price surges over 20% in 5 days. Should you buy or avoid?Saregama India stock price opened at Rs 537.95 on the Bombay Stock Exchange (BSE) and climbed to an intraday high of Rs 593 before stabilising around Rs 568 at 12:27 PM, up 3% for the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2025-7-ways-government-can-boost-employment-2660250-2025-01-06",
      "headline": "Budget 2025: 7 ways government can boost employmentAs the budget approaches, several measures have been proposed to boost job creation and improve productivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-share-price-jump-today-nishant-pitti-explained-stmp-2660240-2025-01-06",
      "headline": "Explained: Why Easy Trip Planners share price jumped up to 17% todayEasy Trip Planners' stock price hit an intraday high of Rs 17.84 on the Bombay Stock Exchange, reflecting a 17.67% jump from its previous close. At 11:23 am, the stock traded at Rs 16.56, up 6.70%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-700-points-reason-behind-dalal-street-tumble-nifty-down-2660236-2025-01-06",
      "headline": "Sensex nosedives 1,200 points: 3 key reasons behind bloodbath on Dalal StreetStock market crash: The S&P BSE Sensex was down 1165.74 points to 78,057.37, while the NSE Nifty50 lost 366.85 points to 23,637.90 as of 12:02 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-securities-paytm-infosys-muthoot-finance-hdfc-bank-2025-top-stock-picks-with-gains-up-to-46-percent-2660099-2025-01-06",
      "headline": "Top stock picks for 2025: Paytm, Infosys in focus with gains of up to 46%From IT giant Infosys to fintech leader Paytm, the brokerage firm has outlined stocks that could deliver good returns. If you've been waiting for the next big idea to boost your portfolio, this list might just be your guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-share-price-hotel-business-demerger-special-pre-opening-session-key-details-review-stmp-2660219-2025-01-06",
      "headline": "Explained: Why ITC share price fell by 6% todayITC stock price: ITC hotels demerger process begins. A special pre-open session was conducted on the stock exchanges between 9:00 AM and 9:45 AM to determine ITC Hotels' share price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-unclaimed-deposits-bank-owe-you-money-check-via-udgam-portal-rbi-2660211-2025-01-06",
      "headline": "Do banks owe you money? Check unclaimed deposits via UDGAM portalRBI (Reerve Bank of India) launched the Unclaimed Deposits – Gateway to Access Information (UDGAM) portal in August 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-open-higher-driven-by-it-stocks-titan-gains-2-percent-2660201-2025-01-06",
      "headline": "Sensex, Nifty open higher driven by IT stocks; Titan gains 2% The S&P BSE Sensex was up 254.19 points to 79,477.30, while NSE Nifty50 gained 61.50 points to 24,066.25 as of 9:23 AM. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canadian-pm-justin-trudeau-steps-down-as-liberal-party-leader-amid-growing-pressure-2660611-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada PM Justin Trudeau says he'll resign after new Liberal party leader namedCalling himself \"a fighter who cares for his country\", Justin Trudeau announced plans to resign after nine years in office, citing party leadership renewal amid growing internal pressure to step aside and voter dissatisfaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hmpv-cases-in-india-health-ministry-advisory-karnataka-maharashtra-china-new-infection-2660527-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "HMPV not a new virus, no reason to worry: Government as 3 cases reportedUnion Health Minister JP Nadda, in a video message, said that India's health systems and surveillance networks are vigilant to ensure a prompt response to any emerging health challenges due to Human Metapneumovirus (HMPV). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/cm-atishi-interview-aap-arvind-kejriwal-bjp-delhi-assembly-polls-2660582-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP arrested Arvind Kejriwal to stall AAP's work in Delhi: Atishi to India TodaySpeaking to India Today TV, Chief Minister Atishi slammed the BJP for hindering work in Delhi by arresting top leaders, challenging saffron party-ruled states to match AAP's achievements. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/labourers-trapped-flooded-rat-hole-mine-assam-rescue-operations-underway-2660605-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "9 trapped in flooded rat-hole mine in Assam, rescue operation launchedA joint operation has been launched by specialised teams from the Army, the State Disaster Response Force (SDRF) and the National Disaster Response Force (NDRF) to rescue the workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/golden-globes-2025-fashion-trends-best-dressed-celebrities-stmp-2660522-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It was all Golden at The Globes this year. Plus, other fashion trendsBillowing silhouettes, opera gloves, ogle-worthy jewellery pieces, sequin galore, voluminous hairstyles  and roaring red were the top trends at the Golden Globes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/hmpv-may-put-infants-at-risk-top-questions-answered-2660589-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Infants at risk from HMPV: Top questions answeredSpeaking to India Today TV, renowned paediatrician Dr Krishna Chugh addressed key concerns about HMPV, focusing on its potential risks to infants and precautions that parents can take against the virus spread."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-his-wife-poison-children-die-by-suicide-family-of-4-found-dead-2660434-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie, wife poison their kids, aged 2 and 5, before hanging themselvesAnup Kumar (38) and his wife Rakhi (35) poisoned their children and later died by hanging themselves at their rented apartment in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-elections-leaked-cag-report-fuels-bjps-sheeshmahal-jibe-against-aap-2660458-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leaked CAG report fuels BJP's 'sheeshmahal' attack against AAP ahead of Delhi pollsAs per the CAG report, the renovation of the Delhi Chief Minister's residence, initially approved at Rs 7.61 crore in 2020, saw its costs spiral to Rs 33.66 crore by April 2022 - a 342% increase over the original estimate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zendaya-and-tom-holland-are-engaged-report-2660661-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zendaya and Tom Holland are engaged: ReportActors Zendaya and Tom Holland are reportedly engaged. According to sources, the Spider-Man star proposed to Zendaya during an intimate holiday gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/will-hmpv-cause-new-pandemic-after-covid-19-what-you-should-know-2660387-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will HMPV cause new pandemic after Covid-19? What you should knowIndia has detected three cases of Human Metapneumovirus (HMPV), a respiratory virus similar to Covid-19 that spreads through droplets and affects vulnerable groups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/naxals-blow-up-vehicle-carrying-security-personnel-in-chhattisgarhs-bijapur-casualties-feared-2660375-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "9 killed as Naxals blow up vehicle carrying security personnel in ChhattisgarhChhattisgarh Naxal Attack: Naxals on Monday blew up a vehicle carrying District Reserve Guard (DRG) personnel on Kutru Road in Chhattisgarh's Bijapur district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/saturn-crosses-the-moon-to-get-closer-to-venus-you-can-see-it-with-naked-eyes-2660484-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You can see Saturn, Venus, and Jupiter with your own eyes tonightThis astronomical event is part of a spectacular \"planet parade\" that will also feature Jupiter and Mars, creating a dazzling display in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/demi-moores-daughters-have-the-best-reaction-to-her-golden-globes-win-2660607-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Demi Moore's daughters have the best reaction to her Golden Globes winActor Demi Moore's daughters had an unforgettable reaction to her first-ever Golden Globes win. In a now-viral video, they are seen shouting and jumping with joy as actor Kerry Washington announced Demi's name as the winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jake-sullivan-us-taking-steps-to-pave-way-for-full-civil-nuclear-cooperation-with-india-2660450-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US moving towards full civil nuclear cooperation with India: Jake SullivanJake Sullivan, who is on his last trip to India as the US National Security Advisor, said that steps are being taken to finalise full-scale civil nuclear cooperation, which was visioned by Manmohan Singh nearly 20 years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/iim-bengaluru-student-dies-falling-hostel-building-floor-birthday-celebration-2660361-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIM-Bangalore student falls to death from hostel after celebrating 29th birthdayA 29-year-old IIM-Bangalore student fell to his death from the second floor of his hostel building hours after he celebrated his birthday with his friends. A case of unnatural death was registered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-government-h1b-visa-renew-pilot-programme-indians-specialty-occupation-workers-renew-visa-without-leaving-country-2660351-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indians can soon renew H-1B visas without returning to IndiaThe US Department of State has successfully completed a pilot programme to renew H-1B visas in the United States and is set to set up a US-based visa rewewal programme this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/leaves-have-emerged-isros-plant-experiment-delivers-stunning-results-in-space-2660386-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leaves have emerged! Isro's plant experiment delivers in spaceLaunched on December 30, 2024, as part of the PSLV-C60 mission, the CROPS experiment is designed to study how plants adapt and grow in the unique environment of space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-faces-legal-troubles-as-chandramukhi-makers-sue-over-netflix-documentary-clips-2660435-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Dhanush, Chandramukhi makers sue Nayanthara for Rs 5 crore over documentaryNayanthara is reportedly entangled in a legal dispute, with the makers of Chandramukhi filing a lawsuit over the alleged use of clips in her Netflix documentary. This development adds to her growing legal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/test-cricket-2-tier-format-jay-shah-icc-president-ind-vs-aus-sa-vs-pak-2660261-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2-tier Test cricket in the works, ICC chief Jay Shah leading the charge: ReportA 2-tier Test cricket structure might be in the works, reported an Australian media outlet on Monday, 6 December. The report suggested that ICC chief Jay Shah is leading the charge with Australia, India and England to incorporate a system where top teams play more often."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-winter-storm-cancels-over-1300-flights-southwest-airlines-united-delta-american-airlines-2660487-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Winter Storm grounds over 1,300 flights across USA winter storm in the US caused over 1,300 flight cancellations and 414 delays on Monday. Airlines such as Southwest, American, United, and Delta issued travel advisories, warning of disruptions due to the storm.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/solar-eruption-on-january-1-sparked-auroras-in-ladakh-watch-video-2660401-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Solar eruption on January 1 sparked auroras in Ladakh. Watch VideoThe Indian Astronomical Observatory in Hanle captured this breathtaking phenomenon, showcasing the beauty of nature's light display in a region known for its dark skies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-care-for-your-hair-without-breast-cancer-fears-2659408-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to care for your hair without breast cancer fearsA study says chemicals in lab-made haircare products and heat treatments can significantly increase the risk. Experts recommend natural alternatives"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-chief-minister-atishi-breaks-down-slams-bjps-ramesh-bidhuri-over-offensive-changed-her-father-remark-2660369-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi gets emotional, slams BJP's Ramesh Bidhuri over 'changed her father' remarkDelhi Chief Minister Atishi broke down during a press briefing over BJP leader Ramesh Bidhuri's remark that \"she changed her father\". Bidhuri, the BJP's candidate for the Kalkaji Assembly constituency, made the remark on Sunday.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/baby-detected-with-hmpv-in-bengaluru-hospital-citys-first-case-karnataka-government-says-not-aware-of-strain-2660205-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Karnataka and Gujarat, Tamil Nadu reports 2 HMPV cases, taking total to 5Three babies, a three-month-old and an eight-month-old, in Bengaluru and a two-month-old boy in Ahmedabad have been detected with respiratory distress-causing HMPV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zendaya-and-tom-holland-are-engaged-report-2660661-2025-01-06",
      "headline": "Zendaya and Tom Holland are engaged: ReportActors Zendaya and Tom Holland are reportedly engaged. According to sources, the Spider-Man star proposed to Zendaya during an intimate holiday gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/sana-khan-welcomes-second-child-a-baby-boy-with-husband-anas-saiyad-2660647-2025-01-06",
      "headline": "Sana Khan welcomes second child, a baby boy, with husband Anas SaiyadFormer actor Sana Khan welcomed her second child, a baby boy, with her businessman-husband Anas Saiyad. She shared a heart-warming post on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/monali-thakur-shares-unfortunate-truth-about-varanasi-concert-calls-it-deeply-troubling-2660622-2025-01-06",
      "headline": "Monali Thakur shares 'unfortunate truth' about Varanasi concert: Deeply troublingSinger Monali Thakur broke her silence on the recent Varanasi concert, sharing a detailed note where she clarified the mismanagement. She also slammed the management team for the sexual harassment accusations levelled against her and her team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/demi-moores-daughters-have-the-best-reaction-to-her-golden-globes-win-2660607-2025-01-06",
      "headline": "Watch: Demi Moore's daughters have the best reaction to her Golden Globes winActor Demi Moore's daughters had an unforgettable reaction to her first-ever Golden Globes win. In a now-viral video, they are seen shouting and jumping with joy as actor Kerry Washington announced Demi's name as the winner."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-stepped-up-when-we-lost-saim-shan-masood-hails-pakistans-fightback-2660681-2025-01-06",
      "headline": "Babar Azam stepped up when we lost Saim: Shan Masood hails Pakistan's fightbackBabar Azam's resilience shone despite Pakistan's loss, with a stellar performance alongside Shan Masood. However, Masood emphasised the need for the team to capitalise on key moments, stressing the importance of learning to win in crucial situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-pak-test-series-south-africa-comeback-fairy-tale-2660660-2025-01-06",
      "headline": "Rampaging South Africa script fairy-tale comeback to confirm WTC top spot SA vs PAK: With their 10-wicket win over Pakistan in the New Year's Test, South Africa confirmed their top spot in the WTC 2023-25. South Africa started 2024 with three losses and a draw before going on a seven-match winning streak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-south-africa-vs-pakistan-wtc-final-australia-2660623-2025-01-06",
      "headline": "No mean feat: Temba Bavuma braces for WTC final vs AustraliaSA vs PAK: South African skipper Temba Bavuma said that the Proteas are ready to face Australia in the World Test Championship final. On Monday, South Africa beat Pakistan by 10 wickets in Cape Town to win the series 2-0. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/angelo-mathews-slams-icc-for-sri-lankas-limited-2025-test-schedule-shocking-2660617-2025-01-06",
      "headline": "Angelo Mathews slams ICC for Sri Lanka's limited 2025 Test schedule: ShockingAngelo Mathews calls out the ICC over Sri Lanka's dwindling Test opportunities, urging fairer scheduling to preserve the format's legacy. With just four Tests in 2025, Mathews fears disrupted careers and missed milestones as Sri Lanka's Test future hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-pink-test-sydney-cousin-grandfather-cancer-2660613-2025-01-06",
      "headline": "Konstas opens up on 'special' Test, recalls cousin, grandfather's death Border Gavaskar Trophy, IND vs AUS: Young Australian batter Sam Konstas said that the Pink Test holds a special place for him since the SCG Test helps in spreading awareness about cancer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-overcome-pakistans-stoic-resistance-to-win-new-years-test-sweep-series-2-0-2660612-2025-01-06",
      "headline": "South Africa overcome Pakistan's stoic resistance to win New Year's Test, sweep series 2-0South Africa's dominance continues with a 10-wicket win over Pakistan, marking their seventh straight Test victory. Rickelton's double ton and Maharaj's key strikes shone, while Pakistan's valiant fight in the follow-on wasn't enough to avoid defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-asb-classic-naomi-osaka-injury-update-2660587-2025-01-06",
      "headline": "Naomi Osaka 'optimistic' about Australian Open after painful Auckland exit  Naomi Osaka was confident of getting fit before the Australian Open after sustaining an abdominal injury that forced her out of the ASB Classic final against Clara Tauson on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-reveals-admiration-for-pat-cummins-since-coaching-era-he-amazes-me-2660566-2025-01-06",
      "headline": "Ravi Shastri reveals admiration for Pat Cummins since coaching era: He amazes meRavi Shastri lauded Pat Cummins' captaincy after Australia's 3-1 BGT triumph, praising his competitive spirit and resilience. Shastri, recalling India's Test wins in Australia under his tenure, highlighted Cummins' determination and never-say-die attitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jahanara-alam-bangladesh-fast-bowler-mental-health-break-2660565-2025-01-06",
      "headline": "Bangladesh's Jahanara Alam takes two-month mental health breakBangladesh speedster Jahanara Alam took a two-month mental health break and did not feature in the national squad for the historic tour of the West Indies later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-liverpool-big-six-shine-rune-amorim-consistency-problem-2660543-2025-01-06",
      "headline": "Big 6 vs Manchester United: Ruben Amorim's boys shine best under pressureRuben Amorim's Manchester United thrives under the spotlight of the Premier League's elite, blending tactical ingenuity with raw intensity. Yet, the inconsistency against lower-ranked sides raises a compelling question: can this team channel brilliance into consistent success across all battles?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hashmatullah-hails-ismat-alams-ton-on-debut-after-afghanistans-test-series-win-zim-vs-afg-2660537-2025-01-06",
      "headline": "Hashmatullah hails Ismat Alams' ton on debut after Afghanistan's Test series winIsmat Alam's debut ton, honouring his father's legacy as an Afghan cricket pioneer, and Rashid Khan's match-winning brilliance powered Afghanistan to a historic Test series win over Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-asb-classic-naomi-osaka-injury-update-2660587-2025-01-06",
      "headline": "Naomi Osaka 'optimistic' about Australian Open after painful Auckland exit  Naomi Osaka was confident of getting fit before the Australian Open after sustaining an abdominal injury that forced her out of the ASB Classic final against Clara Tauson on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-reveals-admiration-for-pat-cummins-since-coaching-era-he-amazes-me-2660566-2025-01-06",
      "headline": "Ravi Shastri reveals admiration for Pat Cummins since coaching era: He amazes meRavi Shastri lauded Pat Cummins' captaincy after Australia's 3-1 BGT triumph, praising his competitive spirit and resilience. Shastri, recalling India's Test wins in Australia under his tenure, highlighted Cummins' determination and never-say-die attitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jahanara-alam-bangladesh-fast-bowler-mental-health-break-2660565-2025-01-06",
      "headline": "Bangladesh's Jahanara Alam takes two-month mental health breakBangladesh speedster Jahanara Alam took a two-month mental health break and did not feature in the national squad for the historic tour of the West Indies later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-liverpool-big-six-shine-rune-amorim-consistency-problem-2660543-2025-01-06",
      "headline": "Big 6 vs Manchester United: Ruben Amorim's boys shine best under pressureRuben Amorim's Manchester United thrives under the spotlight of the Premier League's elite, blending tactical ingenuity with raw intensity. Yet, the inconsistency against lower-ranked sides raises a compelling question: can this team channel brilliance into consistent success across all battles?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hashmatullah-hails-ismat-alams-ton-on-debut-after-afghanistans-test-series-win-zim-vs-afg-2660537-2025-01-06",
      "headline": "Hashmatullah hails Ismat Alams' ton on debut after Afghanistan's Test series winIsmat Alam's debut ton, honouring his father's legacy as an Afghan cricket pioneer, and Rashid Khan's match-winning brilliance powered Afghanistan to a historic Test series win over Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-valiant-effort-in-vain-makes-1st-round-exit-from-asb-classic-2660532-2025-01-06",
      "headline": "Sumit Nagal valiant effort in vain, makes 1st round exit from ASB ClassicIn a gripping match, India's Sumit Nagal showed resilience but lost to USA's Alex Michelsen to make an early exit from the ASB Classic. Meanwhile, the Indo-Mexican duo of Balaji and Reyes-Varela pulled off a thrilling victory against Bopanna and Barrientos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-kerry-okeeffe-border-gavaskar-trophy-india-vs-australia-2660524-2025-01-06",
      "headline": "Australia's tactics to break Rohit Sharma empowered them: Kerry O'KeeffeBorder Gavaskar Trophy, IND vs AUS: Kerry O'Keeffe said that Australia could not take down Jasprit Bumrah, but were successfully able to break Indian captain Rohit Sharma in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-vs-manchester-united-trent-alexander-arnold-real-madrid-talk-virgil-van-dijk-2660517-2025-01-06",
      "headline": "Trent Alexander-Arnold unaffected by Real Madrid talk: Virgil van DijkLiverpool captain Virgil van Dijk has claimed that Trent Alexander-Arnold is unaffected by the talk around his future at the club as talks about a move to Real Madrid continue. Alexander-Arnold had a sloppy performance in the 2-2 draw against Manchester United at Anfield on January 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-south-africa-vs-pakistan-history-record-2660507-2025-01-06",
      "headline": "Shan Masood shatters 27-year-old record to make history for PakistanSA vs PAK, New Year's Test: Shan Masood scored 145 runs off 251 balls in the second Test against South Africa at the Newlands in Cape Town. Masood also shared a 205-run partnership with Babar Azam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/trent-alexander-arnold-tranmere-rovers-blunt-response-roy-kean-liverpool-vs-manchester-united-2660490-2025-01-06",
      "headline": "3rd Division club trolls Alexander-Arnold after disaster show vs Man UnitedTranmere Rovers cheekily dismissed Roy Keane's suggestion of signing Trent Alexander-Arnold after the Liverpool defender's defensive struggles against Manchester United. Meanwhile, transfer speculation continues to link Alexander-Arnold with a potential move to Real Madrid as his Anfield future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-squad-ireland-women-shafali-verma-arundhati-reddy-2660438-2025-01-06",
      "headline": "No Shafali, Arundhati snubbed: Talking points from India's squad vs IrelandIND-W vs IRE-W: Shafali Verma could not stake her claim back in the national team as India named their squad for the Women's ODI series against Ireland. Arundhati Reddy's snub since the Australia series has also come as a surprise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-doping-scandal-suspension-treat-liar-2660477-2025-01-06",
      "headline": "They treat you like a liar: Iga Swiatek opens up on doping scandalIga Swiatek opened up on the tough times when she was serving her suspension after a failed doping test last year. Swiatek had tested positive for a banned substance, named trimetazidine, after which she missed three tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-2025-schedule-live-streaming-details-satwik-chirag-lakshya-sen-2660475-2025-01-06",
      "headline": "Malaysia Open 2025: All you need to know about the season openerSatwik-Chirag and Lakshya Sen will be leading the charge for India as the season-opening Malaysia Open 2025 gets underway on January 7. HS Prannoy, Treesa-Gayatri duo will also be in action during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/trent-alexander-arnold-tranmere-rovers-blunt-response-roy-kean-liverpool-vs-manchester-united-2660490-2025-01-06",
      "headline": "3rd Division club trolls Alexander-Arnold after disaster show vs Man UnitedTranmere Rovers cheekily dismissed Roy Keane's suggestion of signing Trent Alexander-Arnold after the Liverpool defender's defensive struggles against Manchester United. Meanwhile, transfer speculation continues to link Alexander-Arnold with a potential move to Real Madrid as his Anfield future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-squad-ireland-women-shafali-verma-arundhati-reddy-2660438-2025-01-06",
      "headline": "No Shafali, Arundhati snubbed: Talking points from India's squad vs IrelandIND-W vs IRE-W: Shafali Verma could not stake her claim back in the national team as India named their squad for the Women's ODI series against Ireland. Arundhati Reddy's snub since the Australia series has also come as a surprise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-doping-scandal-suspension-treat-liar-2660477-2025-01-06",
      "headline": "They treat you like a liar: Iga Swiatek opens up on doping scandalIga Swiatek opened up on the tough times when she was serving her suspension after a failed doping test last year. Swiatek had tested positive for a banned substance, named trimetazidine, after which she missed three tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-2025-schedule-live-streaming-details-satwik-chirag-lakshya-sen-2660475-2025-01-06",
      "headline": "Malaysia Open 2025: All you need to know about the season openerSatwik-Chirag and Lakshya Sen will be leading the charge for India as the season-opening Malaysia Open 2025 gets underway on January 7. HS Prannoy, Treesa-Gayatri duo will also be in action during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-injury-harbhajan-singh-2660451-2025-01-06",
      "headline": "Jasprit Bumrah was used like you squeezed juice from sugarcane: Harbhajan SinghHarbhajan Singh slammed the Indian team management's handling of Jasprit Bumrah as the Indian pacer sustained an injury during the Sydney Test. Bumrah sustained back spasms during the final match of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dan-christain-massive-six-sydney-thunder-vs-brisbane-heat-watch-comes-out-of-retirement-2660444-2025-01-06",
      "headline": "Watch: Assistant coach Dan Christian hits massive six in Big Bash LeagueDan Christian, at 41, rolled back the years with a stunning cameo of 23 runs, including two towering sixes, as he stepped out of retirement to bolster Sydney Thunder amidst an injury crisis, showcasing his enduring class and leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-and-usman-khawaja-praise-jaiswal-in-instagram-comments-2660432-2025-01-06",
      "headline": "Michael Vaughan and Usman Khawaja praise Yashasvi Jaiswal in Instagram commentsYashasvi Jaiswal's stellar debut tour of Australia earned praise from legends Michael Vaughan and Usman Khawaja. With 391 runs, including a stunning century in Perth, the young Indian batter showcased his grit and emerged as a future star.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-sam-konstas-jasprit-bumrah-intimidation-remark-brad-hogg-2660422-2025-01-06",
      "headline": "India intimidated Sam Konstas: Brag Hogg says Australia remark 'a bit too far'Brad Hogg has claimed that the remark made by Australia coach Andrew McDonald about India intimidating Sam Konstas was a bit far-fetched. Konstas was involved in an altercation with the Indian team and Jasprit Bumrah during the Sydney Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}