{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-zerodha-founder-and-ceo-nithin-kamath-warning-investors-against-pre-ipo-hype-2827686-2025-11-28",
      "headline": "Why is Zerodha's Nithin Kamath warning investors against pre-IPO hype?With IPO buzz at its peak, Nithin Kamath has stepped in to warn investors about the increasing speculation in the unlisted market, where many buyers are chasing inflated pre-IPO valuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-recover-money-after-credit-card-fraud-steps-you-must-know-2827637-2025-11-28",
      "headline": "How do you recover money after credit card fraud? Steps you must knowRecovering money after credit card fraud can feel stressful, but the process is simpler if you act quickly. Knowing the right steps — and your rights, can greatly improve your chances of getting your money back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-82-in-q2fy26-beats-estimates-2827593-2025-11-28",
      "headline": "India's GDP rises by 8.2% in Q2 despite Trump tariffs, highest in six quartersIndia's 8.2% Q2 GDP print has beaten forecasts despite pressure from US tariffs, with manufacturing and services driving momentum and reaffirming the nation's place as the fastest-growing major economy heading into FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-flat-as-dalal-street-takes-breather-after-hitting-all-time-highs-2827579-2025-11-28",
      "headline": "Sensex, Nifty end flat as Dalal Street takes breather after hitting all-time highsThe S&P BSE Sensex slipped 13.71 points to close at 85,706.67, while the NSE Nifty50 ended 12.60 points lower at 26,202.95. The broader market also remained subdued, with most major sectoral indices finishing in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-millennials-relying-too-heavily-on-mutual-fund-sips-drawbacks-explained-2827567-2025-11-28",
      "headline": "Are millennials relying too heavily on SIPs for wealth building?Millennials swear by SIPs for long term investing, but are they mistaking convenience for safety? As market cycles turn unpredictable, is it time to rethink what \"safe investing\" really means?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-tax-deadlines-to-lpg-prices-pensions-ups-atf-prices-5-major-financial-changes-starting-december-1-2827505-2025-11-28",
      "headline": "From tax deadlines to LPG, pensions: 5 major financial changes starting December 1Before December begins, it's worth noting that several new financial rules will kick in, affecting your bills, savings and even travel plans. Whether it's cooking gas, pension rules or tax filings, here's what to expect as the calendar turns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-shares-rise-nearly-29-percent-over-ipo-price-what-should-investors-do-2827446-2025-11-28",
      "headline": "Sudeep Pharma shares rise nearly 29% over IPO price. What should investors do?Sudeep Pharma's strong debut has impressed investors, but with valuations now stretched, is this the right moment to book profits or should investors stay put and ride the long-term story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-price-band-gmp-company-details-all-you-need-to-know-2827438-2025-11-28",
      "headline": "From GMP to price band: 5 things to know about Meesho IPOThe SoftBank-backed e-commerce platform has set a price band of Rs 105 to Rs 111 per share, valuing the company at nearly Rs 50,100 crore at the upper end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pension-stop-after-november-30-check-now-2827427-2025-11-28",
      "headline": "Will your pension stop after November 30? Check nowThe deadline to submit the annual Life Certificate is almost here, and missing it could put your pension on hold. Pensioners must complete the process by 30 November to avoid any interruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-benefits-challenges-payroll-impact-take-home-pay-2827422-2025-11-28",
      "headline": "New labour codes bring major employee benefits, but what are the big challenges?The new labour codes promise stronger protection and wider benefits for workers, but the real test begins now as businesses brace for higher costs, major restructuring and a challenging transition across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-tax-department-sending-sms-alerts-to-25000-taxpayers-about-foreign-assets-2827404-2025-11-28",
      "headline": "Why is tax department sending SMS alerts to 25,000 taxpayers about foreign assets?Tax officials examined data received from foreign jurisdictions through the Automatic Exchange of Information (AEOI) system. This international framework allows countries to share details of financial accounts held abroad by their residents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-opening-december-3-price-band-gmp-listing-expectations-2827389-2025-11-28",
      "headline": "Meesho IPO opening on December 3: What investors need to knowMeesho IPO is all set to open for subscription, backed by strong GMP cues and rising investor interest, but can the value-commerce giant turn pre-listing hype into sustained market performance? Here is all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-lying-unclaimed-here-is-how-delhis-new-campaign-help-you-recover-it-2827382-2025-11-28",
      "headline": "Is your money lying unclaimed? Here's how Delhi's new campaign help you recover itThe move is part of the Centre's ongoing 'Apki Punji, Apka Adhikar' campaign, which focuses on returning such funds to their rightful owners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-share-price-strong-ipo-listing-hold-sell-book-profit-2827376-2025-11-28",
      "headline": "Sudeep Pharma makes strong market debut. Hold or book profit now?A blockbuster debut has rewarded Sudeep Pharma IPO investors. Should you cash out while sentiment is high or hold on for the company's expansion and export growth story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-ipo-listing-23-percent-premium-in-strong-stock-market-debut-2827332-2025-11-28",
      "headline": "Sudeep Pharma shares list at 23% premium in strong market debutThe Rs 895-crore issue, which was subscribed an extraordinary 93.71 times between November 21 and 25, opened at Rs 730 on the NSE and Rs 725 on the BSE, against the upper-end IPO price of Rs 593. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gail-share-price-today-pipeline-tariff-hike-impact-psu-stock-falls-2827323-2025-11-28",
      "headline": "GAIL share price tumbles 6%. Here's why the PSU stock is falling todayThe slump in GAIL's share price reflects investor disappointment over a tariff hike that landed far below expectations. With a full review pushed to 2028, the market is recalibrating its outlook on earnings support for the PSU major."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-pause-record-highs-2827304-2025-11-28",
      "headline": "Sensex, Nifty take breather after hitting record highsThe S&P BSE Sensex was up 65.92 points at 85,786.30 around 9:22 am, while the NSE Nifty50 slipped 16.65 points to 26,232.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodha-founder-and-ceo-nithin-kamath-says-crypto-derivatives-need-urgent-regulation-2827073-2025-11-27",
      "headline": "Why Zerodha's Nithin Kamath says crypto derivatives need urgent regulationKamath described the current state of crypto derivative exchanges as \"a bit like Schrödinger's cat — neither fully regulated nor unregulated.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-still-pending-here-is-how-to-check-your-status-using-pan-2826992-2025-11-27",
      "headline": "ITR refund still pending? Here's how to check your status using PANIf your ITR refund for FY24–25 hasn't arrived yet, you're not alone. Many taxpayers are seeing longer delays this year. The good news: you can quickly check your refund status online using just your PAN."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jaya-bhattacharya-on-abusive-childhood-forced-to-act-beaten-with-hunter-shoes-2827999-2025-11-29",
      "headline": "Jaya Bhattacharya on abusive childhood: Forced to act; beaten with hunter, shoes Jaya Bhattacharya opened up about her traumatic childhood, sharing years of physical abuse from her mother and the impact of her parents' toxic marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-and-lin-laishram-announce-pregnancy-on-2nd-wedding-anniversary-2827988-2025-11-29",
      "headline": "Randeep Hooda and Lin Laishram announce pregnancy on 2nd wedding anniversary Randeep Hooda and Lin Laishram announced that they are expecting their first child as they marked their second wedding anniversary with a heartfelt Instagram post. The couple shared a dreamy bonfire picture and expressed their joy, calling their baby \"a little wild one on the way.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/choreographer-nandika-cheating-claims-smriti-palaash-wedding-put-on-hold-2827978-2025-11-29",
      "headline": "Choreographer Nandika on cheating claims after Smriti–Palaash wedding is put on hold Choreographer Nandika Dwivedi has denied cheating allegations after rumours linked her to Smriti Mandhana and Palash Muchhal's wedding being put on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/superstar-rajinikanth-wins-hearts-as-he-poses-with-paps-at-iffi-2025-red-carpet-2827987-2025-11-29",
      "headline": "Superstar Rajinikanth wins hearts as he poses with paps at IFFI 2025 red carpet Superstar Rajinikanth lit up the IFFI 2025 red carpet as he greeted and posed with paps, drawing massive attention from fans and media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-turns-lyricist-to-highlight-mumbai-pollution-with-a-witty-song-2827956-2025-11-29",
      "headline": "Vir Das turns lyricist to highlight Mumbai pollution with a witty song. Video Vir Das turned lyricist to highlight Mumbai's worsening smog, posting a witty song with lines like \"AQI, AQI, let me die\" that has humour with the city's pollution woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-box-office-collection-day-1-dhanush-kriti-sanon-film-earns-rs-1650-crore-2827932-2025-11-29",
      "headline": "Tere Ishk Mein box office Day 1: Dhanush-Kriti Sanon's film earns Rs 16.50 crore Tere Ishk Mein, starring Dhanush and Kriti Sanon, opened strongly at the box office with a Rs 16.50 crore collection on Day 1, supported by solid occupancy across major cities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-he-endorsed-cardamom-not-gutkha-in-pan-masala-ad-row-2827917-2025-11-29",
      "headline": "Salman Khan says he endorsed cardamom, not gutkha, in pan masala ad row Salman Khan told the Kota Consumer Court that he endorsed only silver-coated cardamom and \"not gutkha,\" as he faced allegations of promoting misleading pan masala ads. The complaint also questioned the authenticity of his signatures and raised concerns about celebrity responsibility in influencing young consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-turns-dull-dirty-ashnoor-kaur-lashes-out-pranit-more-slips-show-sinks-before-finale-2827863-2025-11-29",
      "headline": "BB19 turns dull-dirty: Ashnoor lashes out, Pranit slips, show sinks before finale Bigg Boss 19 hits a surprising slump just a week before the finale as top contestants lose their spark. Ashnoor's outburst to Pranit's unexpected spiral, it feels unusually dull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-padda-recreate-saiyaara-iconic-scene-at-delhi-event-2827906-2025-11-29",
      "headline": "Ahaan-Aneet recreate Saiyaara's iconic scene at Delhi event, video goes viral Ahaan Panday and Aneet Padda set social media buzzing after recreating their iconic Saiyaara scene at a Delhi award event, delighting fans with their chemistry. The breakout stars, honoured as Gen Z Icons, continue to soar with blockbuster success and upcoming projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-shares-fans-savage-post-calling-out-audience-hypocrisy-2827898-2025-11-29",
      "headline": "Akshaye Khanna shares fan's savage post calling out audience hypocrisy Akshaye Khanna sparked buzz by sharing a fan's sarcastic post calling out audience hypocrisy ahead of Dhurandhar's release. His repost went viral as the film's intense first look heightened excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rangeela-at-30-does-the-trendsetter-superhit-survive-new-age-scrutiny-2827644-2025-11-29",
      "headline": "Rangeela at 30: Does the trendsetter superhit survive new-age scrutiny? As Rangeela's 4K restoration lights up screens this November 28, Cinematic Saturday looks at the blueprint that changed it all, while analysing if its tropes pass in 2025?\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-97-day-96-written-update-malti-chahar-kicks-farrhana-bhatt-pranit-more-roasts-tanya-mittal-2827850-2025-11-28",
      "headline": "Bigg Boss 19 episode 97: Malti kicks Farrhana, Pranit roasts Tanya and others The latest episode of 'Bigg Boss 19' saw Malti Chahar kicking Farrhana Bhatt amid an argument. Pranit More hosted his weekly comedy session, in which he roasted Tanya Mittal and others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/david-beckham-meets-samantha-ruth-prabhu-dhanush-mumbai-sparks-social-media-buzz-2827831-2025-11-28",
      "headline": "David Beckham meets Samantha and Dhanush in Mumbai, sparks social media buzz Football legend David Beckham, currently in Mumbai as UNICEF Goodwill Ambassador, was seen meeting Indian actors Samantha Ruth Prabhu and Dhanush on Friday. Their encounters drew attention both at an event and on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-emotional-speech-at-iffi-50-years-in-cinema-felt-like-10-15-years-2827795-2025-11-28",
      "headline": "Rajinikanth's emotional speech at IFFI: 50 years in cinema felt like 10-15 years Rajinikanth was recognised for his five decades in the film industry at the 56th International Film Festival of India (IFFI)'s closing ceremony in Goa. In his speech, the actor reflected on his career and expressed gratitude to fans and the industry at large."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-song-gehra-hua-out-arijit-singh-adds-soul-to-ranveer-singh-sara-arjun-romance-2827775-2025-11-28",
      "headline": "Dhurandhar song Gehra Hua out: Arijit Singh adds soul to Ranveer, Sara's romance The makers of 'Dhurandhar' have unveiled the third track from the upcoming film's album. Titled 'Gehra Hua' and sung by Arijit Singh, the romantic number offers audiences a glimpse into Ranveer Singh and Sara Arjun's on-screen bond. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/american-singer-jon-batiste-mumbai-debut-was-spellbinding-and-a-little-cheeky-2827759-2025-11-28",
      "headline": "American singer Jon Batiste's Mumbai debut was spellbinding and a little cheeky American singer Jon Batiste made his Mumbai debut with a captivating and playful live show. His cross-cultural performance highlighted a new spirit in India's live music scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/smriti-mandhana-palaash-muchhal-wedding-row-choreographer-hits-out-as-theories-swirl-over-says-we-arent-involved-2827656-2025-11-28",
      "headline": "We aren't involved: Choreographer hits out as theories swirl over Smriti-Palaash row One of the choreographers dragged into the social-media speculation surrounding Smriti Mandhana and Palaash Muchhal's wedding shared a note on Instagram. Her post came days after the couple announced that the ceremony was being put on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/did-ashnoor-kaur-intentionally-hit-tanya-mittal-in-bigg-boss-19-here-is-what-actually-happened-2827748-2025-11-28",
      "headline": "Did Ashnoor intentionally hit Tanya in Bigg Boss 19? Here's what actually happened Ashnoor Kaur has reportedly been evicted from Bigg Boss 19 after a tense clash with Tanya Mittal during the Ticket to Finale task. The incident, captured on camera, sparked massive debate online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-meri-main-tera-main-tera-tu-meri-title-track-kartik-aaryan-ananya-panday-sun-soaked-romance-2827685-2025-11-28",
      "headline": "Watch Kartik and Ananya's sun-soaked romance in Tu Meri Main Tera title track The title track of actors Kartik Aaryan and Ananya Panday's upcoming film 'Tu Meri Main Tera Main Tera Tu Meri' has been released. The film is set for theatrical release on December 25."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-power-tussle-siddaramaiah-dk-shivakumar-breakfast-chief-minister-congress-high-command-2827979-2025-11-29",
      "headline": "We're united: Siddaramaiah, Shivakumar's bonhomie after breakfast meetSiddaramaiah and DK Shivakumar used a high-command-prompted breakfast meeting in Bengaluru to project unity, discuss 2028 election strategy and dismiss speculation of a leadership rift in Karnataka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-cm-siddaramaiah-welcome-his-deputy-shivakumar-at-residence-for-breakfast-meet-amid-power-crisis-2827937-2025-11-29",
      "headline": "Upma, idli and fragile truce: Siddaramaiah, Shivakumar meet for power breakfastSiddaramaiah on Saturday hosted Shivakumar over breakfast to discuss the ongoing leadership tussle within the Congress-led Karnataka government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-air-india-warn-of-delays-as-a320-glitch-hits-over-200-aircraft-in-india-glbs-2827877-2025-11-29",
      "headline": "Airbus A320 glitch causes airlines in India to scramble, 400 aircraft may be hitAsserting that safety is their top priority, Air India and IndiGo said they have completed updates on 40% and 80% of their A320-family aircraft, respectively, and are confident of completing the entire fleet within the timeline set by EASA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/three-chinese-workers-killed-tajikistan-gold-mine-drone-attack-pakistan-afghanistan-taliban-theories-2827742-2025-11-29",
      "headline": "Who killed 3 Chinese gold miners? Pakistan, Taliban push own theoriesAfter an armed drone attack on a China-linked gold mine in Tajikistan killed three Chinese nationals, Dushanbe described the perpetrators as \"criminal groups\" from a neighbouring country. While Afghanistan blamed a \"circle\" creating \"chaos, instability, and distrust in the region\" for the attack, Pakistan quickly jumped in, accusing the Taliban regime of Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-and-lin-laishram-announce-pregnancy-on-2nd-wedding-anniversary-2827988-2025-11-29",
      "headline": "Randeep Hooda and Lin Laishram announce pregnancy on 2nd wedding anniversaryRandeep Hooda and Lin Laishram announced that they are expecting their first child as they marked their second wedding anniversary with a heartfelt Instagram post. The couple shared a dreamy bonfire picture and expressed their joy, calling their baby \"a little wild one on the way.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-and-senyar-live-updates-rain-alert-tamil-nadu-puducherry-andhra-pradesh-2827299-2025-11-28",
      "headline": "LIVE: Death toll rises to 123 in Sri Lanka; Tamil Nadu braces for landfallCyclone Ditwah Live Updates: The India Meteorological Department (IMD) informed that Cyclonic Storm Ditwah is moving toward the Tamil Nadu, Puducherry and south Andhra Pradesh coast, and is likely to make landfall on November 30. The storm had earlier struck Sri Lanka's eastern coast on Friday morning, leaving over 120 people dead and causing extensive damage as it moved northwest toward India. PM Modi offered condolences to those who lost loved ones and wished a swift recovery for the affected communities. The system remains classified as a cyclonic storm with no indication of strengthening further. Tamil Nadu has issued a red alert for four districts and an orange alert for five others ahead of its arrival. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/oxford-debate-fiasco-unfolds-with-indian-pakistan-sides-trading-blame-over-walkout-sai-deepak-2827870-2025-11-29",
      "headline": "Oxford debate fiasco unfolds with Indian, Pak sides trading blame over walkoutWhile Supreme Court lawyer J Sai Deepak provided a concrete timeline of events, the Pakistan High Commission in the UK claimed that the Indian delegation withdrew at the last moment, lacking \"confidence,\" even without an iota of proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/airbus-grounding-solar-radiation-grounds-global-software-fix-flights-cancelled-delayed-2827984-2025-11-29",
      "headline": "How the Sun grounded 6,000 Airbus planes globallyAirlines worldwide cancelled and delayed flights as they worked to patch software on a widely used Airbus flight, after an analysis indicated that a software flaw code may have contributed to a sudden loss of altitude in a recent incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/reviews/story/mahindra-xev-9s-review-first-drive-an-e-suv-for-the-family-man-2827926-2025-11-29",
      "headline": "Mahindra XEV 9S review, first drive: An E-SUV for the family manMahindra's electric SUVs are rather radical. But what about people who don't want to go that flashy? Mahindra believes the XEV 9S will be the right choice for them. But will it be? We find out.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-speakers-dispute-pakistan-high-commission-oxford-union-debate-withdrawal-claims-2827874-2025-11-29",
      "headline": "Oxford Union debate row: Lawyer Sai Deepak demolishes Pak's walkout versionThe controversy erupted after the Pakistan High Commission in the UK claimed in a tweet that Indian speakers withdrew at the last moment from a debate titled 'India's Policy Towards Pakistan is a Populist Strategy Sold as Security Policy,' resulting in a walkover for the Pakistani team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/gccs-rev-up-job-market-that-90s-moment-has-arrived-for-accounting-professionals-ca-financeaccounting-mba-us-uk-2827763-2025-11-28",
      "headline": "GCCs rev up job market: That 90s moment has arrived for accounting professionalsGlobal Capability Centres are creating a new hiring wave and if you are a commerce graduate, a CA student, or a finance professional anywhere in India, it means the moment has arrived.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/for-women-sex-after-60-is-not-over-new-study-reveals-its-evolving-2827629-2025-11-28",
      "headline": "For women, sex after 60 is not over. New study reveals, it's evolvingFor decades, research on sexuality in older adults has mostly focused on partnered sex. Solo pleasure and masturbation, especially among women, have been under-examined or quietly dismissed. But this study puts the spotlight exactly where it's been missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-confirmed-on-nikhil-kamaths-wtf-podcast-social-media-reacts-2827905-2025-11-29",
      "headline": "Nikhil Kamath teases next podcast with Elon Musk. Internet can't handle itNikhil Kamath released a black-and-white teaser announcing Elon Musk's upcoming appearance on his WTF podcast."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-update-instagram-bios-wedding-postponed-2827942-2025-11-29",
      "headline": "Buzz over Smriti, Palash's Instagram bio update amid wedding delayIndia batter Smriti Mandhana and her fiancé Palash Muchhal have postponed their wedding due to her father's health scare. The couple updated their Instagram bios with a nazar emoji amid social media rumours about their personal lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/indian-restaurants-are-now-also-lecture-halls-art-classes-theatres-and-whatnot-2827451-2025-11-29",
      "headline": "Indian restaurants are now also lecture halls, art classes, theatres and whatnotWould you go to a restaurant for a cooking class, to paint a mug, to watch a movie, or to attend a cool lecture? Read how and why Indian restaurants are doubling up as culture centres again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-547-28-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-crisis-news-live-updates-power-tussle-dk-shivakumar-siddaramaiah-politics-breakfast-meeting-bengaluru-2827882-2025-11-29",
      "headline": "Live: Shivakumar's Delhi visit on hold after meeting with Siddaramaiah amid power tussleKarnataka Political Crisis Live: Karnataka Chief Minister Siddaramaiah and embattled Deputy Chief Minister DK Shivakumar met for breakfast today after the Congress leadership asked them to bury their differences, before heading to Delhi to resolve the crisis within the Congress-led government. Shivakumar and his supporters have demanded that the party honour what they describe as a power-sharing agreement, seeking his appointment as Chief Minister as the government reaches its halfway mark. Stay tuned to IndiaToday.in for the latest updates and political developments from Karnataka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-man-swaps-traditional-thanksgiving-spread-with-indian-food-heres-the-menu-2827977-2025-11-29",
      "headline": "US man swaps traditional Thanksgiving spread with Indian food. Here's the menuAn American man replaced the traditional Thanksgiving meal with an Indian feast, bringing the all-time classics like chicken tikka and biryani to the table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rangeela-at-30-does-the-trendsetter-superhit-survive-new-age-scrutiny-2827644-2025-11-29",
      "headline": "Rangeela at 30: Does the trendsetter superhit survive new-age scrutiny?As Rangeela's 4K restoration lights up screens this November 28, Cinematic Saturday looks at the blueprint that changed it all, while analysing if its tropes pass in 2025?\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terror-suspects-ask-for-food-at-jk-home-spark-massive-search-operation-2827955-2025-11-29",
      "headline": "3 terror suspects ask for food at J&K home, spark massive search operationA tense security operation is underway in Udhampur's Basantgarh region after suspected terrorists sought food from a local Bakerwal family. Security forces are combing dense forests and villages to trace the suspects in this high-risk infiltration corridor.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ai-chatbots-reveal-nuclear-bomb-tips-when-asked-in-poem-form-shocking-study-finds-2827965-2025-11-29",
      "headline": "AI chatbots reveal nuclear bomb tips when asked in poem form, shocking study findsResearchers reveal that poetic prompts can fool AI chatbots into sharing dangerous information. This flaw raises serious concerns about current AI safety and its ability to detect subtle threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-tightens-grip-landfall-in-tamil-nadu-in-24-hours-red-alert-issued-2827903-2025-11-29",
      "headline": "Cyclone Ditwah landfall in Tamil Nadu in 24 hours; Sri Lanka massively hitCyclone Ditwah is steadily advancing towards the Tamil Nadu and south Andhra Pradesh coast, prompting high alert and extensive preparedness measures. The storm has already caused severe devastation in Sri Lanka, with India gearing up for potential impact and providing aid to its neighbour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-and-lin-laishram-announce-pregnancy-on-2nd-wedding-anniversary-2827988-2025-11-29",
      "headline": "Randeep Hooda and Lin Laishram announce pregnancy on 2nd wedding anniversaryRandeep Hooda and Lin Laishram announced that they are expecting their first child as they marked their second wedding anniversary with a heartfelt Instagram post. The couple shared a dreamy bonfire picture and expressed their joy, calling their baby \"a little wild one on the way.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/superstar-rajinikanth-wins-hearts-as-he-poses-with-paps-at-iffi-2025-red-carpet-2827987-2025-11-29",
      "headline": "Superstar Rajinikanth wins hearts as he poses with paps at IFFI 2025 red carpetSuperstar Rajinikanth lit up the IFFI 2025 red carpet as he greeted and posed with paps, drawing massive attention from fans and media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/urvil-patel-gujarat-smat-chennai-super-kings-ms-dhoni-2827994-2025-11-29",
      "headline": "When in MS Dhoni sir's team, definition of success changes: Gujarat's Urvil Patel Urvil Patel has been retained by Chennai Super Kings for the IPL 2026 season. The aggressive wicketkeeper-batter began the Syed Mushtaq Ali Trophy tournament with a 31-ball hundred for Gujarat against Services on November 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/milly-illingworth-mumbai-indians-wpl-contract-wbbl-bowling-figures-2026-season-2827995-2025-11-29",
      "headline": "After dream WPL deal, 20-year-old Australia pacer stuns with career-best WBBL spell Milly Illingworth earned her maiden WPL deal with the Mumbai Indians and celebrated it by producing her best-ever WBBL spell of 3 for 19 for the Melbourne Renegades. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/perth-stadium-pitch-criticism-usman-khawaja-cricket-australia-response-ashes-test-2827990-2025-11-29",
      "headline": "Usman Khawaja asked to explain Perth pitch comments by Cricket Australia Australian opener Usman Khawaja has been called to explain his criticism of the Perth Stadium pitch, following remarks made after the first Ashes Test against England. Cricket Australia officials expressed dissatisfaction with Khawaja's comments, which described the surface in negative terms, despite the match referee rating it as 'very good.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ab-de-villiers-on-jasprit-bumrah-workload-management-2827983-2025-11-29",
      "headline": "No Bumrah for home Tests? Ashwin, AB de Villiers send India pacer big message Former India all rounder Ravichandran Ashwin and former South Africa batter AB de Villiers have advised fast bowler Jasprit Bumrah to focus more on white-ball cricket and play only the crucial Test matches for India. Bumrah has been rested for three-match Test series against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-south-africa-ranchi-odi-video-2827980-2025-11-29",
      "headline": "Watch: Virat Kohli rock solid in intense nets session before 1st ODI vs South Africa IND vs SA: Veteran batter Virat Kohli looked in superb touch during an intense Ranchi nets session, signalling strong form and confidence ahead of the first ODI against South Africa.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatre-youngest-player-score-centuries-all-formats-breaks-rohit-sharma-record-2827963-2025-11-29",
      "headline": "Ayush Mhatre shatters Rohit Sharma's record after blistering century in SMAT Ayush Mhatre broke Rohit Sharma's record to become the youngest player to score centuries in all three formats of cricket. He achieved the feat  after scoring his maiden T20 century for Mumbai in Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-ben-stokes-responds-critics-england-heavy-defeat-in-perth-2827936-2025-11-29",
      "headline": "Ben Stokes hits back at critics: Call England rubbish, but not arrogant Ashes, AUS vs ENG: Skipper Ben Stokes defended England after a heavy eight-wicket loss, insisting the team isn't arrogant and vowing to fight back in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-royal-challengers-bengaluru-schedule-navi-mumbai-vadodara-2827948-2025-11-29",
      "headline": "MI vs RCB kicks off blockbuster season as BCCI announces full schedule The WPL 2026 will begin on January 9 with defending champions Mumbai Indians facing Royal Challengers Bengaluru, featuring 20 league matches across Navi Mumbai and Vadodara, following an auction where 67 of 277 players were sold for Rs 40.8 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-update-instagram-bios-wedding-postponed-2827942-2025-11-29",
      "headline": "Buzz over Smriti, Palash's Instagram bio update amid wedding delay India batter Smriti Mandhana and her fiancé Palash Muchhal have postponed their wedding due to her father's health scare. The couple updated their Instagram bios with a nazar emoji amid social media rumours about their personal lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-criticises-india-after-south-africa-whitewash-home-test-series-2827928-2025-11-29",
      "headline": "Kapil Dev slams India after SA series loss: More occupied with ODIs and T20Is Kapil Dev has strongly criticised the Indian cricket team after their 0-2 whitewash loss to South Africa at home. He highlighted poor domestic cricket exposure and unfavourable pitch conditions as key reasons behind the team's struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umran-malik-india-comeback-fast-bowling-yorkers-slower-balls-2827915-2025-11-29",
      "headline": "Umran Malik vows to make India comeback, adds new tricks beside 150 kph speed Umran Malik remains confident of an India comeback as he rediscovers form and adds new skills to complement his 150 kph pace. The speedster is currently playing for Jammu and Kashmir in the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-ben-stokes-responds-critics-england-heavy-defeat-in-perth-2827936-2025-11-29",
      "headline": "Ben Stokes hits back at critics: Call England rubbish, but not arrogant Ashes, AUS vs ENG: Skipper Ben Stokes defended England after a heavy eight-wicket loss, insisting the team isn't arrogant and vowing to fight back in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-royal-challengers-bengaluru-schedule-navi-mumbai-vadodara-2827948-2025-11-29",
      "headline": "MI vs RCB kicks off blockbuster season as BCCI announces full schedule The WPL 2026 will begin on January 9 with defending champions Mumbai Indians facing Royal Challengers Bengaluru, featuring 20 league matches across Navi Mumbai and Vadodara, following an auction where 67 of 277 players were sold for Rs 40.8 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-update-instagram-bios-wedding-postponed-2827942-2025-11-29",
      "headline": "Buzz over Smriti, Palash's Instagram bio update amid wedding delay India batter Smriti Mandhana and her fiancé Palash Muchhal have postponed their wedding due to her father's health scare. The couple updated their Instagram bios with a nazar emoji amid social media rumours about their personal lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-criticises-india-after-south-africa-whitewash-home-test-series-2827928-2025-11-29",
      "headline": "Kapil Dev slams India after SA series loss: More occupied with ODIs and T20Is Kapil Dev has strongly criticised the Indian cricket team after their 0-2 whitewash loss to South Africa at home. He highlighted poor domestic cricket exposure and unfavourable pitch conditions as key reasons behind the team's struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umran-malik-india-comeback-fast-bowling-yorkers-slower-balls-2827915-2025-11-29",
      "headline": "Umran Malik vows to make India comeback, adds new tricks beside 150 kph speed Umran Malik remains confident of an India comeback as he rediscovers form and adds new skills to complement his 150 kph pace. The speedster is currently playing for Jammu and Kashmir in the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-records-india-odi-series-south-africa-2827902-2025-11-29",
      "headline": "Rohit Sharma nears 20K international runs, eyes historic landmarkIND vs SA: Rohit Sharma enters the South Africa ODI series on the verge of two historic milestones, reaching 20,000 international runs and becoming the first batter to hit 650 sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-drs-2827858-2025-11-29",
      "headline": "DRS: Who is responsible for the lowest point in Indian cricket?India's losses in two home series in two years have forced the cricketing fans into an uncomfortable question – who is responsible for this mess? Is it the selectors, the coach or the current crop of players who have failed to live up to their positions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-series-virat-kohli-rohit-sharma-return-2827891-2025-11-29",
      "headline": "Ro-Ko's India return, new opening duo? What to look forward to in IND vs SA ODIsIND vs SA: After a bruising Test series loss at home, India look to their stalwarts Rohit Sharma and Virat Kohli to restore authority in the ODI series against South Africa. However, the Ro-Ko return will not be all to look forward to for fans in the ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-series-gaikwad-jaiswal-opener-competition-2827751-2025-11-29",
      "headline": "Jaiswal or Gaikwad? Who should open with Rohit Sharma in South Africa ODI series?IND vs SA: As India look to bounce back in the ODI series after a 0-2 Test defeat to South Africa, the absence of Shubman Gill opens a chance for Ruturaj Gaikwad and Yashasvi Jaiswal to secure the spot as the backup opener of the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-anxiety-world-cup-smriti-mandhana-2827868-2025-11-29",
      "headline": "Jemimah Rodrigues opens up on dealing with anxiety during ODI World CupIndia batter Jemimah Rodrigues has opened up on facing anxiety throughout the ODI World Cup campaign. Jemimah delved deep into the problems she faced and how she finally came out of it.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/junior-hockey-world-cup-india-vs-chile-winning-start-chennai-2827855-2025-11-28",
      "headline": "India thrash Chile 7-0 to open Junior Hockey World Cup campaign in styleRosan Khujur and Dilraj Singh starred as India began their Junior Hockey World Cup campaign in dominant fashion, thrashing Chile 7-0 to underline their title ambitions in front of the home crowd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/papua-new-guinea-cricketer-kiplin-doriga-jailed-robbery-jersey-2827839-2025-11-28",
      "headline": "International cricketer jailed for punching woman and stealing her phone: ReportPapua New Guinea cricketer Kiplin Doriga has been sentenced to three years in jail for robbery in Jersey. The case raises concerns about athlete conduct during international tours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-odis-morne-morkel-need-momentum-back-test-series-whitewash-2827840-2025-11-28",
      "headline": "India need momentum back in dressing room after SA Tests whitewash: Morne MorkelIND vs SA: India bowling coach Morne Morkel has called on India to reset after their Test series loss against Souh Africa, stressing the need to rebuild momentum and play good cricket in their upcoming ODI series. He emphasised that good cricket would be key against a confident South African team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-anxiety-world-cup-smriti-mandhana-2827868-2025-11-29",
      "headline": "Jemimah Rodrigues opens up on dealing with anxiety during ODI World CupIndia batter Jemimah Rodrigues has opened up on facing anxiety throughout the ODI World Cup campaign. Jemimah delved deep into the problems she faced and how she finally came out of it.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/junior-hockey-world-cup-india-vs-chile-winning-start-chennai-2827855-2025-11-28",
      "headline": "India thrash Chile 7-0 to open Junior Hockey World Cup campaign in styleRosan Khujur and Dilraj Singh starred as India began their Junior Hockey World Cup campaign in dominant fashion, thrashing Chile 7-0 to underline their title ambitions in front of the home crowd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/papua-new-guinea-cricketer-kiplin-doriga-jailed-robbery-jersey-2827839-2025-11-28",
      "headline": "International cricketer jailed for punching woman and stealing her phone: ReportPapua New Guinea cricketer Kiplin Doriga has been sentenced to three years in jail for robbery in Jersey. The case raises concerns about athlete conduct during international tours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-odis-morne-morkel-need-momentum-back-test-series-whitewash-2827840-2025-11-28",
      "headline": "India need momentum back in dressing room after SA Tests whitewash: Morne MorkelIND vs SA: India bowling coach Morne Morkel has called on India to reset after their Test series loss against Souh Africa, stressing the need to rebuild momentum and play good cricket in their upcoming ODI series. He emphasised that good cricket would be key against a confident South African team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-real-madrid-barcelonaitis-joan-laporta-slams-florentino-perez-negreira-allegations-laliga-2827821-2025-11-28",
      "headline": "Real Madrid have Barcelona-itis: Laporta hits out at Perez's Negreira allegationsFC Barcelona president Joan Laporta hit back at Real Madrid over its repeated Negreira allegations, calling the accusations baseless and accusing the Spanish giants of being obsessed with Barca."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-series-morne-morkel-south-africa-press-conference-2827817-2025-11-28",
      "headline": "Morne Morkel distances himself from team selection after Test disasterIndia bowling coach Morne Morkel said that he plays no part in selecting players for the team. Morkel said that the decision rests with the head coach, captain and the selectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/syed-modi-international-tanvi-sharma-kidambi-srikanth-2827807-2025-11-28",
      "headline": "Syed Modi International: Tanvi Sharma qualifies for semi-final with spirited runSyed Modi International: Giant killer Tanvi Sharma continued her dream run by reaching the semi-finals of the Syed Modi International Super 300 badminton tournament. Alongside Tanvu, Unnati Hooda also qualified for the semis with a hardfought victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-training-santos-injury-advice-risk-sacrifice-brazil-fifa-world-cup-2827803-2025-11-28",
      "headline": "Neymar risking it all for World Cup: Likely to play for Santos despite injuryNeymar's decision to train and make himself available for Santos' upcoming match, despite clear medical risks, highlights just how much this moment means to him. With club survival and his fourth, likely final World Cup at stake, every step now carries enormous consequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-arjun-tendulkar-bowling-goa-vs-chandigarh-2827782-2025-11-28",
      "headline": "Arjun Tendulkar's fiery opening spell topples Chandigarh in SMATSMAT 2025: Goa hammered Chandigarh in their group-stage game on Friday. Vasuki Koushik and Arjun Tendulkar's fiery spells ripped apart Chandigarh's batting unit at the Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-backlash-syed-mushtaq-ali-trophy-missed-run-out-delhi-tamil-nadu-cricket-2827743-2025-11-28",
      "headline": "Backlash for Mankad? R Ashwin reacts to missed chance in TN vs Delhi thrillerFormer India off-spinner R Ashwin responded to a missed run-out chance in a thrilling Syed Mushtaq Ali Trophy match between Delhi and Tamil Nadu in Ahmedabad. Ashwin had run Jos Buttler at the non-striker's end in IPL 2019, triggering one of the fiercest debates in modern cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-controversy-adelaide-strikers-vs-sydney-thunder-rain-2827732-2025-11-28",
      "headline": "WBBL: Fans slam contentious finish to Strikers vs Thunder clashThe Australian Cricket Board was slammed for a contentious finish in the Adelaide Strikers vs Sydney Thunder match on Friday, November 28. The fans could not believe that the rain-affected match was abandoned with Thunder needing just 3 runs with 10 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-shreyas-iyer-injury-update-morne-morkel-press-conference-2827722-2025-11-28",
      "headline": "Shubman Gill recovering well, Shreyas Iyer started rehab: Morne Morkel shares updateIND vs SA: India bowling coach Morne Morkel confirmed that both Gill and Iyer are progressing well in recovery, offering a positive note for India as they prepare to face South Africa without their captain and vice-captain."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}