{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-day-3-last-day-bidding-today-latest-subscription-gmp-listing-allotment-2756419-2025-07-16",
      "headline": "Anthem Biosciences IPO to close for bidding: Check latest subscription, GMPThis IPO is entirely an offer for sale (OFS) of 5.96 crore equity shares by existing shareholders. The company itself will not receive any money from this offer. The price band has been set at Rs 570 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-sold-chryscapital-buyer-two-sisters-how-it-started-mumbai-bakery-cafe-cake-brownie-2756217-2025-07-15",
      "headline": "The Theobroma story: How 2 sisters turned a cafe into 225-store pan-India chainPrivate equity firm ChrysCapital has struck a sweet deal to acquire a 90% stake in Theobroma Foods for Rs 2,410 crore. The bakery chain, started by two sisters in Mumbai, has grown into a 225-store brand loved for its brownies and cakes. Read on to know more about the Mumbai-based bakery chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-misses-rs-8585-crore-payments-owes-7-public-sector-banks-2756159-2025-07-15",
      "headline": "MTNL misses Rs 8,585 crore payments, owes 7 public sector banksIn a filing on Tuesday, MTNL confirmed that it has defaulted on both principal and interest payments to a group of lenders, which include some of India's biggest state-owned banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/should-you-subscribe-anthem-biosciences-ipo-listing-gains-gmp-allotment-date-review-2756093-2025-07-15",
      "headline": "Anthem Biosciences IPO fully booked: Should you subscribe? Check listing gainsThe IPO opened for subscription on July 14, aims to raise Rs 3,395 crore through a complete offer for sale (OFS) of 5.96 crore equity shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-rs-12-crore-did-not-make-this-man-happy-investment-advisor-explains-2756072-2025-07-15",
      "headline": "Why Rs 12 crore didn't make this man happy? Investment advisor explainsWhile money matters, it should never cost you your health, peace of mind, or precious family time. True wealth is living well, not just stacking numbers in a bank account, says an investment advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodhas-nithin-kamath-wants-short-selling-made-easy-in-india-2756030-2025-07-15",
      "headline": "Why Zerodha's Nithin Kamath wants short selling made easy in IndiaIf someone wants to short a stock today, they mostly do it through futures or options. But there's a catch, there are only 224 stocks in India that have futures and options. So if a bad company is not on that list, no one can short it easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-fake-itr-refunds-here-is-what-could-happen-2755957-2025-07-15",
      "headline": "Claiming fake ITR refunds? Here's what could happenTo give honest taxpayers a chance to fix their mistakes, the department had earlier asked people to revise their returns if they had claimed any wrong deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-2-or-itr-3-check-these-common-mistakes-and-tips-to-avoid-them-2755920-2025-07-15",
      "headline": "Filing ITR-2 or ITR-3? Check these common mistakes and tips to avoid themUsing the Excel utility for ITR-2 or ITR-3 seems easy, but it's easy to get stuck if you're not careful. One wrong entry can throw your entire tax calculation off. Here's a handy guide to avoid common slip-ups."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/director-mohit-suri-on-not-returning-for-aashiqui-3-2756434-2025-07-16",
      "headline": "They don't want to employ me: Director Mohit Suri on not returning for Aashiqui 3Director Mohit Suri shared he hasn't been approached to direct 'Aashiqui 3', despite expressing interest in reuniting with the original lead pair. He cited creative challenges and industry decisions as reasons behind his absence from the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-and-twinkle-khanna-enjoy-cricket-date-at-lords-cricket-ground-london-2756416-2025-07-16",
      "headline": "Akshay Kumar and Twinkle Khanna enjoy cricket date at Lord's, shares photosAkshay Kumar and Twinkle Khanna made a stylish appearance at Lord's Cricket Ground during the India vs England Test match. Twinkle shared a few glimpses with her humorous take on the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmy-nominations-2025-squid-game-patrick-schwarzenegger-snubbed-2756423-2025-07-16",
      "headline": "2025 Emmy nominations: Squid Game, Patrick Schwarzenegger among major snubsThe 77th Primetime Emmy nominations have been announced with popular shows like 'Squid Game' Season 2 and Renée Zellweger's TV-movie portrayal notably missing from the list. Fans expressed their disappointment as some major performances and shows were overlooked in this year's race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bajrangi-bhaijaan-2-director-kabir-khan-confirms-talks-with-salman-khan-2756408-2025-07-16",
      "headline": "Salman Khan's Bajrangi Bhaijaan 2 in works? Director confirms talks with actorDirector Kabir Khan has confirmed that he and Salman Khan are in talks for 'Bajrangi Bhaijaan 2', but they are waiting for the right story before moving forward. The director emphasised that the sequel would only be made to honour the original's legacy, not just for box office success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-cinema-ticket-price-cap-rs-200-regional-films-2756406-2025-07-16",
      "headline": "Karnataka brings back Rs 200 cap for regional cinema in multiplexesKarnataka has re-introduced a Rs 200 cap on cinema ticket prices. This move could encourage audiences to visit theatres, potentially increasing attendance amidst past resistance from multiplexes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-teja-father-rajagopal-raju-dies-at-90-2756397-2025-07-16",
      "headline": "Telugu actor Ravi Teja's father dies at 90Telugu actor Ravi Teja's father, Rajagopal Raju, died at the age of 90 on Tuesday. More details on the funeral and cremation are awaited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-bachchan-shoutout-to-amitabh-bachchan-2756392-2025-07-16",
      "headline": "Boss is back: Abhishek's shoutout to father Amitabh Bachchan with new KBC promoAbhishek Bachchan gave a special shoutout to his father, Amitabh Bachchan, by sharing the latest promo of Kaun Banega Crorepati. The new season premieres on August 11 on Sony Entertainment Television and SonyLIV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nysa-devgn-viral-dance-ajay-devgn-son-of-sardaar-2-orry-mrunal-thakur-2756383-2025-07-16",
      "headline": "Nysa-Orry mimic Ajay Devgn's viral 'Pehla Tu' step, fans call it best video everNysa Devgn recreated her father Ajay Devgn's viral dance move from 'Son of Sardaar 2' with Orhan Awatramani aka Orry. Internet users were taken by surprise seeing Nysa's effortless charm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/toronto-rapper-stabbed-in-london-hours-after-attending-drakes-uk-tour-show-glbs-2756360-2025-07-16",
      "headline": "Toronto rapper stabbed in London hours after attending Drake's UK tour showToronto rapper Top5, recently cleared of murder charges, was stabbed in North London after attending a Drake concert. Police say his injuries are not life-threatening; no arrests have been made.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kathy-bates-makes-emmy-history-with-matlock-drama-nomination-glbs-2756350-2025-07-16",
      "headline": "Kathy Bates makes Emmy history with 'Matlock' drama nominationNoah Wyle and Adam Scott earned their first Best Actor Emmy nominations. Kathy Bates made history with Matlock. The Emmy Awards will air live on September 14 from Los Angeles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-blessed-with-baby-girl-2756276-2025-07-15",
      "headline": "Kiara Advani-Sidharth Malhotra welcome a baby girlKiara Advani and Sidharth Malhotra welcomed their first child today. The couple was blessed with a baby girl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/2025-emmy-nominations-severance-leads-27-followed-the-penguin-the-white-lotus-2756297-2025-07-15",
      "headline": "Emmy nominations 2025: Severance leads with 27, followed by Penguin, White LotusThe 2025 Emmy nominations have been announced. Adam Scott-starrer 'Severance' leads with 27 nominations, followed by 'The Penguin' with 24 and 'The White Lotus' and 'The Studio' with 23 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-bigha-zamin-4k-restoration-venice-film-festival-2025-bimal-roy-2756232-2025-07-15",
      "headline": "Bimal Roy's Do Bigha Zamin to be screened in 4K at Venice Film Festival 2025The Venice Film Festival 2025 will screen a restored 4K version of Bimal Roy's 'Do Bigha Zamin'. This screening is significant as it highlights the film's impact on Indian cinema and the restoration effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dominic-mclaughlin-meet-hbo-harry-potter-actor-2756110-2025-07-15",
      "headline": "Dominic McLaughlin: Meet the actor behind HBO's Harry PotterProduction has officially commenced on HBO's Harry Potter television series. HBO revealed the first glimpse of young Harry, portrayed by Dominic McLaughlin. Here's all you need to know about him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmy-awards-2025-nominations-reality-and-talk-show-categories-announced-ahead-of-full-list-2756236-2025-07-15",
      "headline": "Emmys 2025 nominations: Reality, talk show categories announced ahead of full listThe nominations for two categories of the 2025 Emmy Awards have been unveiled, with CBS Mornings making the official announcement. Take a look at the nominations below."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-mandala-murders-trailer-vaani-kapoor-mythological-crime-thriller-yrf-2756228-2025-07-15",
      "headline": "Mandala Murders trailer: Vaani Kapoor as detective is up against crime and sorceryActor Vaani Kapoor plays investigating officer Rea Thomas in Yash Raj Films' mythological-crime-thriller—'Mandala Murders'. The upcoming Netflix show blends crime investigation with mystical elements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/su-from-so-trailer-released-supernatural-comedy-mangaluru-village-2756213-2025-07-15",
      "headline": "Su From So trailer: Raj B Shetty's supernatural comedy promises a laugh riot'Su From So' is a Kannada supernatural comedy drama film written and directed by JP Thuminad, who also stars in the film featuring several known faces from films like 'Kantara' and 'Sapta Sagaradaache Ello'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-rangeen-vineet-kumar-singh-comedy-series-premiere-july-25-love-betrayal-2756141-2025-07-15",
      "headline": "Rangeen first look: Vineet Kumar Singh's new show to explore love and betrayalPrime Video announced the release of its upcoming comedy-drama series-'Rangeen', featuring Vineet Kumar Singh and Rajshri Deshpande. The show is backed by Kabir Khan and Rajan Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/producer-naga-vamsi-confirms-jr-ntr-has-full-role-in-war-2-not-a-cameo-2756196-2025-07-15",
      "headline": "Producer Naga Vamsi confirms Jr NTR has full role in War 2, not a cameoProducer Naga Vamsi clarified fan speculation about Jr NTR's screen time in 'War 2', confirming the actor has a full-length role alongside Hrithik Roshan."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nato-chief-warns-india-china-brazil-of-100-secondary-sanctions-over-russia-trade-glbs-2756349-2025-07-16",
      "headline": "If you're Prime Minister of India and...: Nato's warning over buying Russian oilMark Rutte warned the leaders of China, India, and Brazil that if they continued trading with Russia and buying its oil and gas, he would impose 100 per cent secondary sanctions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-year-old-nri-arrested-in-hit-and-run-death-of-legendary-marathoner-fauja-singh-in-punjab-2756384-2025-07-16",
      "headline": "NRI arrested in hit-and-run death of legendary marathoner Fauja SinghDuring police questioning, NRI Amritpal Singh Dhillon revealed that he was returning from Mukerian after selling his phone when his vehicle struck 114-year-old athlete Fauja Singh near Bias Pind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/millions-dead-aadhaar-still-active-rti-finds-only-115-crore-cards-deactivated-2756437-2025-07-16",
      "headline": "Millions dead, Aadhaar still active: RTI finds only 1.15 crore cards deactivatedDespite over 83 lakh deaths recorded annually, UIDAI's cumbersome, certificate-dependent process has led to less than 10% of estimated deaths, resulting in Aadhaar deactivation, raising risks of misuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prada-team-visits-kolhapur-meet-local-artisans-after-kolhapuri-sandals-row-2756336-2025-07-16",
      "headline": "Prada team visits Kolhapur, meets local artisans after Kolhapuri sandals rowThe visit comes after Prada faced criticism for allegedly showcasing Kolhapuri-style sandals in its Spring/Summer 2026 menswear show in Milan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-day-5-siraj-bowled-bashir-analysis-luck-2756387-2025-07-16",
      "headline": "The ball that bowled Siraj in Lord's Test: A freak delivery and pure bad luckEngland vs India: In a surreal final twist at Lord's, Mohammed Siraj was bowled by a delivery from Shoaib Bashir that spun off the pitch, the bat, and then the pitch again - a freak dismissal that defied cricketing logic. Siraj's gritty 30-ball stay ended when he was bowled as England went on to win a thriller by 22 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-ahmedabad-crash-demand-cockpit-video-recorders-debate-safety-vs-privacy-2756086-2025-07-16",
      "headline": "Why no cockpit video recorder? Air India crash triggers demand, debateThe fuel-switch report in the Air India Boeing 787 crash probe has sparked a demand for a cockpit video recorder. The NTSB of the US that probes air crashes has for years batted for one. If cockpit voice recorders are part of the black boxes of planes, what has kept cockpit video recorders, which would aid air crash investigations, from being installed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/were-getting-access-trump-says-india-trade-deal-is-near-glbs-2756361-2025-07-16",
      "headline": "What Trump said on trade talks with India as August 1 deadline loomsUS President Donald Trump updated on America's ongoing trade talks with India, showing hope and confidence, ahead of August 1, when his steep tariffs will come into effect."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/chatgpt-down-ai-chatbot-shows-unusual-activity-error-to-some-users-many-unable-to-login-2756414-2025-07-16",
      "headline": "ChatGPT down, users unable to login: What went wrong?OpenAI's ChatGPT and related services went down globally, leaving users unable to log in or complete tasks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-worry-lines-in-air-india-flight-ai171-crash-preliminary-report-2755488-2025-07-14",
      "headline": "The worry lines in Air India Flight AI171 crash preliminary reportIt's not the final verdict, yet the 15-page report on the ongoing investigation points to some telltale signs and raises troubling questions\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-urges-dhaka-to-reconsider-satyajit-rays-home-demolition-offers-repair-help-2756273-2025-07-15",
      "headline": "India urges Dhaka to reconsider Satyajit Ray's home demolition, offers repair helpThe house was built by Satyajit Ray's grandfather, Upendra Kishore Ray Chowdhury, who was also the father of celebrated poet Sukumar Ray. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/balasore-bed-student-death-sexual-harassment-complaint-ignored-fakir-mohan-college-2756364-2025-07-16",
      "headline": "Odisha self-immolation case: Committee recommended transfer, principal ignored itThe girl lodged a formal complaint with the college's Internal Complaints Committee (ICC), alleging that Sahoo had asked for inappropriate favours, implying sexual harassment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-blessed-with-baby-girl-2756276-2025-07-15",
      "headline": "Kiara Advani-Sidharth Malhotra welcome a baby girlKiara Advani and Sidharth Malhotra welcomed their first child today. The couple was blessed with a baby girl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-why-ben-stokes-jasprit-bumrah-workload-management-incomparable-2756385-2025-07-16",
      "headline": "Why Stokes and Bumrah's workload management is incomparableENG vs IND: Ben Stokes and Jasprit Bumrah recently came to the limelight for their workload management after England won the Lord's Test by 22 runs to go 2-1 up in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-cinema-ticket-price-cap-rs-200-regional-films-2756406-2025-07-16",
      "headline": "Karnataka brings back Rs 200 cap for regional cinema in multiplexesKarnataka has re-introduced a Rs 200 cap on cinema ticket prices. This move could encourage audiences to visit theatres, potentially increasing attendance amidst past resistance from multiplexes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-man-gets-russian-citizenship-after-secretly-aiding-kremlin-in-ukraine-glbs-2756359-2025-07-16",
      "headline": "US man gets Russian citizenship after secretly aiding Kremlin in UkraineDaniel Martindale, a US citizen, was granted Russian citizenship after secretly aiding Kremlin forces in Ukraine by passing military intel. Russia calls it a reward for his loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-bachchan-shoutout-to-amitabh-bachchan-2756392-2025-07-16",
      "headline": "Boss is back: Abhishek's shoutout to father Amitabh Bachchan with new KBC promoAbhishek Bachchan gave a special shoutout to his father, Amitabh Bachchan, by sharing the latest promo of Kaun Banega Crorepati. The new season premieres on August 11 on Sony Entertainment Television and SonyLIV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-chandrashekhar-azad-is-out-to-break-new-ground-with-muslim-outreach-2755547-2025-07-14",
      "headline": "How Chandrashekhar Azad is out to break new ground with Muslim outreachPairing Dalit assertion with ​Muslim support to spread base beyond the current foothold in western Uttar Pradesh is a bold move to challenge mainstream parties\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-rahul-gandhi-jaishankar-xi-jinping-meeting-china-pakistan-operation-sindoor-2756146-2025-07-15",
      "headline": "He's running a full-blown circus: Rahul Gandhi slams S Jaishankar after Xi meetThe Congress took aim at S Jaishankar over his meeting with Xi Jinping, pointing out how China provided iron-clad support to Pakistan during Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-rahul-gandhi-veer-savarkar-remarks-petition-defamation-case-2756023-2025-07-15",
      "headline": "You know he will become PM? Court berates petitioner over Rahul Gandhi pleaThe petitioner, founder president of an organisation called Abhinav Bharat Congress, pointed out that Rahul Gandhi's 'immature and irresponsible' statements about Veer Savarkar were creating a lot of confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/2025-emmy-nominations-severance-leads-27-followed-the-penguin-the-white-lotus-2756297-2025-07-15",
      "headline": "Emmy nominations 2025: Severance leads with 27, followed by Penguin, White LotusThe 2025 Emmy nominations have been announced. Adam Scott-starrer 'Severance' leads with 27 nominations, followed by 'The Penguin' with 24 and 'The White Lotus' and 'The Studio' with 23 each."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-shouldnt-target-moscow-trump-takes-u-turn-over-deep-strike-claim-glbs-2756343-2025-07-16",
      "headline": "Zelenskyy shouldn't target Moscow: Trump's U-turn over 'deep strike' claimTrump has been putting pressure on Russia to end its war on Ukraine and issued a warning to Putin, threatening 'severe' tariffs if a ceasefire is not reached within the next 50 days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-fold-tipped-to-feature-a-crease-free-display-2756410-2025-07-16",
      "headline": "iPhone Fold tipped to feature a crease-free displayThe iPhone Fold is speculated to debut with a crease-free display, thanks to Samsung's display technology. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/green-card-update-us-august-visa-bulletin-shows-modest-relief-for-indian-applicants-glbs-2756345-2025-07-16",
      "headline": "US's latest green card update brings relief for Indian applicantsThe US August 2025 Visa Bulletin offers modest relief for Indian EB-3 and EB-5 applicants, but warns of possible retrogression in EB-2 and EB-3 due to high demand and nearing visa caps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/director-mohit-suri-on-not-returning-for-aashiqui-3-2756434-2025-07-16",
      "headline": "They don't want to employ me: Director Mohit Suri on not returning for Aashiqui 3Director Mohit Suri shared he hasn't been approached to direct 'Aashiqui 3', despite expressing interest in reuniting with the original lead pair. He cited creative challenges and industry decisions as reasons behind his absence from the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-and-twinkle-khanna-enjoy-cricket-date-at-lords-cricket-ground-london-2756416-2025-07-16",
      "headline": "Akshay Kumar and Twinkle Khanna enjoy cricket date at Lord's, shares photosAkshay Kumar and Twinkle Khanna made a stylish appearance at Lord's Cricket Ground during the India vs England Test match. Twinkle shared a few glimpses with her humorous take on the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bajrangi-bhaijaan-2-director-kabir-khan-confirms-talks-with-salman-khan-2756408-2025-07-16",
      "headline": "Salman Khan's Bajrangi Bhaijaan 2 in works? Director confirms talks with actorDirector Kabir Khan has confirmed that he and Salman Khan are in talks for 'Bajrangi Bhaijaan 2', but they are waiting for the right story before moving forward. The director emphasised that the sequel would only be made to honour the original's legacy, not just for box office success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-cinema-ticket-price-cap-rs-200-regional-films-2756406-2025-07-16",
      "headline": "Karnataka brings back Rs 200 cap for regional cinema in multiplexesKarnataka has re-introduced a Rs 200 cap on cinema ticket prices. This move could encourage audiences to visit theatres, potentially increasing attendance amidst past resistance from multiplexes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-dismissal-lords-test-turning-point-ajinkya-rahane-2756440-2025-07-16",
      "headline": "Karun Nair's dismissal was turning point in Lord's Test: Ajinkya RahaneAjinkya Rahane called Karun Nair's second-innings dismissal the turning point in the Lord's Test, as India's chase lost momentum following his LBW, opening the door for England to claw back into the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thiago-almada-atletico-madrid-transfer-botafogo-2756431-2025-07-16",
      "headline": "Atletico Madrid agree deal to sign Argentina's Thiago Almada from BotafogoAtletico Madrid have confirmed an agreement to sign Argentina midfielder Thiago Almada from Brazilian club Botafogo, pending the player's medical examination and contract signing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-not-bcci-decision-rajeev-shukla-2756411-2025-07-16",
      "headline": "Kohli, Rohit retired on own will, BCCI has no role: Rajeev ShuklaBCCI vice-president Rajeev Shukla has set the record straight on Rohit Sharma and Virat Kohli's Test retirements, stating that the BCCI had no influence, and that both legends made the decision entirely on their own terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/tara-moore-doping-ban-cas-overturns-clearance-four-years-2756407-2025-07-16",
      "headline": "British tennis player Tara Moore handed four-year doping banBritish tennis player Tara Moore has been banned for four years after sport's highest court overturned her earlier exoneration in a doping case. The Court of Arbitration for Sport (CAS) on Tuesday upheld an appeal by the International Tennis Integrity Agency (ITIA), reversing a previous ruling that had cleared the 32-year-old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-england-women-odi-series-predicted-11-live-streaming-full-squads-2756394-2025-07-16",
      "headline": "India vs England Women's ODI Series 2025, Live streaming: All you need to knowFresh off a 3-2 victory in the T20I series, India Women are set to take on England Women once again in a three-match ODI series, starting Wednesday, July 16. The opening ODI will be a day-night encounter at The Rose Bowl in Southampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-england-women-odi-world-cup-feature-2756234-2025-07-16",
      "headline": "India Women seek balance amid key issues before World CupIND-W vs ENG-W: India Women will have the advantage of playing the ODI World Cup in front of their home crowd, but they need to finetune certain aspects of their lineup in their upcoming ODI series against England and Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-day-5-siraj-bowled-bashir-analysis-luck-2756387-2025-07-16",
      "headline": "The ball that bowled Siraj in Lord's Test: A freak delivery and pure bad luckEngland vs India: In a surreal final twist at Lord's, Mohammed Siraj was bowled by a delivery from Shoaib Bashir that spun off the pitch, the bat, and then the pitch again - a freak dismissal that defied cricketing logic. Siraj's gritty 30-ball stay ended when he was bowled as England went on to win a thriller by 22 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-why-ben-stokes-jasprit-bumrah-workload-management-incomparable-2756385-2025-07-16",
      "headline": "Why Stokes and Bumrah's workload management is incomparableENG vs IND: Ben Stokes and Jasprit Bumrah recently came to the limelight for their workload management after England won the Lord's Test by 22 runs to go 2-1 up in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-shree-charani-england-women-vs-india-women-2756306-2025-07-15",
      "headline": "She has been outstanding: Harmanpreet impressed with 20-year-old DC spinnerENG-W vs IND-W: Harmanpreet Kaur heaped praise on left-arm spinner Shree Charani, who took 10 wickets in the T20Is on English soil and won the Player of the Series award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kevin-de-bruyne-napoli-unretire-diego-maradona-10-kit-2756301-2025-07-15",
      "headline": "De Bruyne to inherit Maradona's No.10? Napoli training photos suggest yesNapoli could unretire Diego Maradona's No.10 kit to give to Kevin de Bruyne. The Belgian was seen wearing a No.10 training kit ahead of their pre-season games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-lords-test-england-vs-india-2756295-2025-07-15",
      "headline": "India should have chased 193: Ganguly disappointed after Lord's Test defeatENG vs IND: Former captain Sourav Ganguly was disappointed after India lost the Lord's Test by 22 runs, failing to chase down 193. Ravindra Jadeja's unbeaten 61 wasn't enough for India to taste victory on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-day-5-siraj-bowled-bashir-analysis-luck-2756387-2025-07-16",
      "headline": "The ball that bowled Siraj in Lord's Test: A freak delivery and pure bad luckEngland vs India: In a surreal final twist at Lord's, Mohammed Siraj was bowled by a delivery from Shoaib Bashir that spun off the pitch, the bat, and then the pitch again - a freak dismissal that defied cricketing logic. Siraj's gritty 30-ball stay ended when he was bowled as England went on to win a thriller by 22 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-why-ben-stokes-jasprit-bumrah-workload-management-incomparable-2756385-2025-07-16",
      "headline": "Why Stokes and Bumrah's workload management is incomparableENG vs IND: Ben Stokes and Jasprit Bumrah recently came to the limelight for their workload management after England won the Lord's Test by 22 runs to go 2-1 up in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-shree-charani-england-women-vs-india-women-2756306-2025-07-15",
      "headline": "She has been outstanding: Harmanpreet impressed with 20-year-old DC spinnerENG-W vs IND-W: Harmanpreet Kaur heaped praise on left-arm spinner Shree Charani, who took 10 wickets in the T20Is on English soil and won the Player of the Series award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kevin-de-bruyne-napoli-unretire-diego-maradona-10-kit-2756301-2025-07-15",
      "headline": "De Bruyne to inherit Maradona's No.10? Napoli training photos suggest yesNapoli could unretire Diego Maradona's No.10 kit to give to Kevin de Bruyne. The Belgian was seen wearing a No.10 training kit ahead of their pre-season games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-lords-test-england-vs-india-2756295-2025-07-15",
      "headline": "India should have chased 193: Ganguly disappointed after Lord's Test defeatENG vs IND: Former captain Sourav Ganguly was disappointed after India lost the Lord's Test by 22 runs, failing to chase down 193. Ravindra Jadeja's unbeaten 61 wasn't enough for India to taste victory on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-ashes-2025-tour-england-vs-australia-november-2025-2756287-2025-07-15",
      "headline": "Archer eyes Ashes 2025 tour: Will do everything to be on the plane in NovemberJofra Archer has made his intentions clear. He aims to be fit and cleared to compete without any hassles for the upcoming Ashes tour, later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-sexual-exploitation-fir-allahabad-high-court-stays-arrest-2756261-2025-07-15",
      "headline": "Court stays arrest of cricketer Yash Dayal in alleged sexual exploitation caseAn FIR was registered on July 6 at the Indirapuram police station in Ghaziabad district under Section 69 of the BNS. Yash Dayal has been accused of sexually exploiting a woman on the pretext of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-bumrah-pant-and-gill-chat-with-idris-elba-at-king-charles-london-home-2756256-2025-07-15",
      "headline": "Watch: Bumrah, Pant and Gill chat with Idris Elba at King Charles' homeDuring the meeting with King Charles at his London home, some of the Indian cricketers got the chance to meet popular English actor, Idris Elba. The group were seen having a chat talking about the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-management-anil-kumble-2756255-2025-07-15",
      "headline": "Bumrah gets new workload management advice: Play last 2 Tests in England, rest laterEngland vs India: Jasprit Bumrah was initially scheduled to play only three of the five Tests in the Anderson–Tendulkar Trophy. However, with India trailing 1–2 after the Lord's thriller, former captain Anil Kumble has suggested that the pace spearhead should play the final two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-virat-kohli-obsession-lords-test-2756225-2025-07-15",
      "headline": "Aggression not for everyone: Gill needs his own voice, not mimic KohliENG vs IND: Is Shubman Gill unintentionally trying to do what Virat Kohli does? Since his appointment as Test skipper, some of his actions have been eerily similar to the former captain, and this could be a possible concern in the long run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/27-all-out-cricket-west-indies-emergency-meeting-lara-lloyd-viv-richards-2756233-2025-07-15",
      "headline": "27 all-out triggers panic: West Indies board calls legends for crisis talksCricket West Indies (CWI) have hit the panic button as they have called for an emergency review meeting after the nightmare pink-ball Test in Jamaica where Australia ran riot to end the game in just two and a half days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-indian-cricket-teams-meet-king-charles-iii-in-london-day-after-lords-test-2756192-2025-07-15",
      "headline": "Watch: Indian cricket teams meet King Charles III in London day after Lord's TestKing Charles II met the Indian men's and women's teams at St James's Palace in London on Tuesday. The men's team lost the Lord's Test by 22 runs, while the women's team will take part in a three-match ODI series following their 3-2 triumph in the ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-king-charles-shubman-gill-mohammed-siraj-lords-test-wicket-2756172-2025-07-15",
      "headline": "Unfortunate: How King Charles reacted to Mohammed Siraj's Lord's Test dismissalIndia captain Shubman Gill and vice-captain Rishabh Pant met King Charles III on Tuesday. The King praised India's spirited fight and spoke about Mohammed Siraj's dismissal in the Lord's Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-virat-kohli-obsession-lords-test-2756225-2025-07-15",
      "headline": "Aggression not for everyone: Gill needs his own voice, not mimic KohliENG vs IND: Is Shubman Gill unintentionally trying to do what Virat Kohli does? Since his appointment as Test skipper, some of his actions have been eerily similar to the former captain, and this could be a possible concern in the long run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/27-all-out-cricket-west-indies-emergency-meeting-lara-lloyd-viv-richards-2756233-2025-07-15",
      "headline": "27 all-out triggers panic: West Indies board calls legends for crisis talksCricket West Indies (CWI) have hit the panic button as they have called for an emergency review meeting after the nightmare pink-ball Test in Jamaica where Australia ran riot to end the game in just two and a half days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-indian-cricket-teams-meet-king-charles-iii-in-london-day-after-lords-test-2756192-2025-07-15",
      "headline": "Watch: Indian cricket teams meet King Charles III in London day after Lord's TestKing Charles II met the Indian men's and women's teams at St James's Palace in London on Tuesday. The men's team lost the Lord's Test by 22 runs, while the women's team will take part in a three-match ODI series following their 3-2 triumph in the ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-king-charles-shubman-gill-mohammed-siraj-lords-test-wicket-2756172-2025-07-15",
      "headline": "Unfortunate: How King Charles reacted to Mohammed Siraj's Lord's Test dismissalIndia captain Shubman Gill and vice-captain Rishabh Pant met King Charles III on Tuesday. The King praised India's spirited fight and spoke about Mohammed Siraj's dismissal in the Lord's Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-india-new-zealand-warm-ups-fixtures-2756152-2025-07-15",
      "headline": "India to face England, New Zealand in Women's World Cup warm-upsIndia are set to lock horns with England and New Zealand in their two warm-up matches of the Women's ODI World Cup on September 25 and 27 in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-blue-hat-johnathan-agnew-doubters-lords-test-2756143-2025-07-15",
      "headline": "Jofra Archer dons commentator's hat after proving critics wrong at Lord'sJofra Archer made his Test return in style—and with a smile—by wearing Jonathan Agnew's blue hat on-air, cheekily completing a bet made years ago that he'd never play red-ball cricket again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jordan-henderson-premier-league-return-brentford-ajax-2756144-2025-07-15",
      "headline": "Henderson returns to Premier League with Brentford after Ajax exitFormer Liverpool captain Jordan Henderson makes his return to the Premier League as he joins Brentford on a two-year deal. After a brief stint outside Engalnd, the Premier League and Champions League winner makes his return to English top-flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-greatest-captain-michael-vaughan-ashesh-win-2756137-2025-07-15",
      "headline": "Ben Stokes doesn't need Ashes for greatest England captain tag: VaughanMichael Vaughan called Ben Stokes one of England's finest Test captains. He emphasised Stokes doesn't need an Ashes win to prove his greatness as a captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-dawson-shoaib-bashir-england-vs-india-manchester-test-2756122-2025-07-15",
      "headline": "Liam Dawson returns to Tests after 8 years, replaces Shoaib BashirENG vs IND: Liam Dawson has replaced the injured Shoaib Bashir for the Manchester Test, scheduled to begin on July 23. On Monday, England took a 2-1 series lead after beating India by 22 runs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-archie-vaughan-beckhenam-youth-test-2756073-2025-07-15",
      "headline": "All-round Suryavanshi takes spotlight, Vaughan takes three in Youth TestIndia U19's Vaibhav Suryavanshi was back amongst the runs as he smashed a quickfire fifty while England U19's Archie Vaughan was the pick of the bowlers with three wickets on Day 3 of the Youth Test in Beckenham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-two-rankings-shafali-verma-top-10-batters-arundhati-2756100-2025-07-15",
      "headline": "ICC Women's T20I rankings: Shafali Verma returns to top 10 after England heroicsIndia opener Shafali Verma has returned to the top 10 in the ICC Women's T20I Batting Rankings, as per the latest update released on Tuesday. Shafali was the second-highest run-getter behind fellow opener Smriti Mandhana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-wildcard-pick-manchester-originals-the-hundred-2024-2756085-2025-07-15",
      "headline": "Fast bowler James Anderson bags major T20 league contract at 42James Anderson has been selected by Manchester Originals as a wildcard for The Hundred 2025 season. Anderson retired from Test cricket, but the 42-year-old has been playing domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-trott-reaction-anderson-tendulkar-trophy-2755975-2025-07-15",
      "headline": "Great for Test cricket: Jonathan Trott praises Lord's red-ball classicEngland vs India: Former England batsman Jonathan Trott has hailed the thrilling third Test in the Anderson-Tendulkar Trophy, saying it was great for red-ball cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-olympics-games-la-2028-dates-medal-matches-2755961-2025-07-15",
      "headline": "Cricket at LA Olympics to begin on July 12, medal matches on July 20 and 29Cricket's highly anticipated return to the Olympic Games at LA 2028 will begin on July 12, with medal matches scheduled for the 20th and 29th of the month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-silences-keyboard-warriors-with-heroic-test-return-for-england-2755941-2025-07-15",
      "headline": "Jofra Archer silences keyboard warriors with heroic Test return for EnglandJofra Archer helped England seal a thrilling 22-run victory over India in the third Test — silencing the \"keyboard warriors\" who had written him off during his long absence from red-ball cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-alvaro-carreras-signing-sl-benfica-transfer-laliga-2755909-2025-07-15",
      "headline": "Real Madrid complete full-back Alvaro Carreras signing from SL BenficaReal Madrid have re-signed Alvaro Carreras from Benfica for €50 million, bringing the 22-year-old full-back back to his boyhood club as part of Xabi Alonso's defensive rebuild ahead of the new season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}