{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-is-catching-up-fast-with-us-china-in-ai-race-indiaai-ceo-abhishek-singh-2871846-2026-02-20",
      "headline": "India is catching up fast with US, China in AI race: IndiaAI CEO Abhishek SinghIn an exclusive interview following the Grand AI India Impact Summit, Abhishek Singh, CEO of India's Mission AI, discusses the nation's emerging role in the global artificial intelligence landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brazil-president-lula-exclusive-india-brazil-trade-own-currency-need-not-rely-on-us-dollar-2871794-2026-02-20",
      "headline": "Brazilian President Lula says India and Brazil can trade without relying on US dollarAs Brazil looks to deepen ties with India, Brazilian President Luiz Inácio Lula da Silva signals a future where the two economies trade more, rely less on the US dollar, and build a partnership driven by growth, technology and trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-debates-within-brics-to-create-new-currency-brazils-lula-to-india-today-2871784-2026-02-20",
      "headline": "No debates within BRICS to create new currency: Brazil's Lula to India TodayIn an exclusive interview with India Today TV, Brazilian President Luiz Inacio Lula da Silva clarified there is no BRICS currency plan, but said India and Brazil can still rethink dollar-based trade and slowly build alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-multiple-ppf-accounts-here-is-the-answer-2871751-2026-02-20",
      "headline": "Can you open multiple PPF accounts? Here's the answerThe Public Provident Fund (PPF) is one of India's most trusted long-term savings options, thanks to its tax benefits, steady returns and government backing. Many investors, however, wonder if it's possible to open more than one PPF account to save more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sips-in-crypto-what-they-are-and-how-to-get-started-2871634-2026-02-20",
      "headline": "SIPs in crypto? What they are and how to get startedCrypto is often linked with sharp price swings and high risk. SIPs, on the other hand, are associated with steady, long-term investing. So what happens when these two very different ideas come together? That is where the conversation around crypto SIPs begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-is-like-a-tsunami-hitting-jobs-market-warns-imfs-chief-2871599-2026-02-20",
      "headline": "Exclusive: AI is like a tsunami hitting jobs market, warns IMF's chiefAccording to Georgieva, AI can boost growth and raise incomes. However, if not handled carefully, it can deepen inequality and unsettle workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-300-points-higher-nifty-gains-despite-market-volatility-2871564-2026-02-20",
      "headline": "Sensex ends over 300 points higher, Nifty gains despite market volatilityThe S&P BSE Sensex rose 316.57 points to end at 82,814.71, while the Nifty50 gained 116.90 points to settle at 25,571.25. Broader market indices also recovered well through the afternoon, lifting overall sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-nearly-rs-1000-silver-surges-rs-4000-time-to-invest-or-wait-for-a-dip-bullion-gold-prices-silver-prices-2871519-2026-02-20",
      "headline": "Gold jumps nearly Rs 1,000, silver surges Rs 4,000: Time to invest or wait for a dip?After several weeks of uncertainty, gold and silver are now moving higher with steady gains. This has boosted market sentiment, but it has also left many wondering whether to buy now or wait for more favourable prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/biryani-billing-scam-multicrore-tax-evasion-rs-70000-turnover-supression-2871475-2026-02-20",
      "headline": "How Hyderabad's love for biryani exposed a nationwide multi-crore tax scamIn India, biryani is more than food. It is an emotion that finally left a trail too big to hide. Read on to find out how it exposed a nationwide multi-crore tax scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-you-get-your-arrears-and-salary-hike-2871457-2026-02-20",
      "headline": "8th Pay Commission: When will you get your arrears and salary hike?Central government employees and pensioners are closely watching every update on the 8th Pay Commission. The big questions remain, i.e., when will the new pay structure be implemented, and when will arrears actually reach your bank account?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/guardrails-needed-as-ai-reshapes-jobs-and-global-growth-says-imf-chief-2871416-2026-02-20",
      "headline": "IMF chief says India well-positioned in AI race thanks to digital infrastructureAccording to Kristalina Georgieva, India is in a strong position due to its early investment in digital public infrastructure, which now forms the base for wider AI access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-evasion-fraud-biryani-chains-billing-scam-2871390-2026-02-20",
      "headline": "How a biryani billing trail exposed tax scam; Rs 70,000 crore sales hiddenWhat began as a simple I-T review of biryani restaurant bills turned into a sweeping hunt for Rs 70,000 crore in suppressed sales buried across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/dutch-company-asml-jumps-90-last-si-months-global-tech-ecosystem-explained-2871359-2026-02-20",
      "headline": "Why has this Dutch company's stock gained over 90% on Nasdaq in six months?ASML Holding's stock has gained 94.66% in the past six months on the US stock exchange Nasdaq, where many of the world's biggest technology companies list their shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tech-mahindra-tcs-why-it-stocks-are-crashing-again-today-2871347-2026-02-20",
      "headline": "Infosys, Tech Mahindra, TCS: Why IT stocks are falling again todayThe slide in IT stocks raises fresh questions about what is spooking investors and how long this uneasy phase could last. A closer look may reveal more than the morning numbers suggest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-high-volatility-us-iran-tensions-2871341-2026-02-20",
      "headline": "Sensex, Nifty open flat amid volatility, IT stocks continue to declineWith global cues expected to remain volatile, investors are likely to stay cautious. Movements in crude oil, the rupee and developments in the US–Iran standoff will remain key drivers for market direction through the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/uk-and-india-must-shape-ai-together-says-kanishka-narayan-2871082-2026-02-19",
      "headline": "UK and India must shape AI together, says Kanishka NarayanIn an exclusive conversation with India Today, UK AI Minister Kanishka Narayan highlighted the strengthening technological partnership between India and the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/bnw-developments-radisson-hotel-group-launch-radisson-blu-rak-central-ras-al-khaimah-hotel-branded-residences-uae-property-market-2871035-2026-02-19",
      "headline": "BNW Developments partners with Radisson Hotel Group for hotel and residencesThe development will include the Radisson Blu Hotel, RAK Central, with 361 rooms, and Radisson Blu Residences, RAK Central, with 222 branded homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-well-positioned-to-lead-in-ai-sam-altman-at-ai-impact-summit-2870977-2026-02-19",
      "headline": "India well-positioned to lead in AI: Sam Altman at AI Impact SummitOpenAI CEO Sam Altman hailed India's rapid progress in 'sovereign AI' and said it's well-positioned to lead in AI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-closing-bell-sensex-closes-1236-points-lower-nifty-below-25500-indigo-down-3-percent-2870960-2026-02-19",
      "headline": "Sensex closes 1,236 points lower, Nifty below 25,500; IndiGo down 3%The S&P BSE Sensex tanked 1,236.11 points to close at 82,498.14, while the NSE Nifty50 lost 365 points to end at 25,454.35. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-700-points-nifty-tumbles-key-reasons-explained-2870850-2026-02-19",
      "headline": "Sensex down 1,200 points: 3 reasons why the stock market is falling todayAt the closing bell, the Sensex was down 1236.11 points at 82,498.14, while the Nifty50 had slipped 365 points to 25,454.35. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tapsee-pannu-marriage-freedom-long-distance-relationship-mathias-boe-2871864-2026-02-20",
      "headline": "Never lets me feel burden of relationship: Taapsee Pannu on husband Mathias Boe Actor Taapsee Pannu has shared candid insights about husband Mathias Boe, revealing the one condition she had before marriage and what truly makes him special.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/eric-dane-final-interview-als-battle-legacy-netflix-documentary-2871844-2026-02-20",
      "headline": "Eric Dane's final interview now streams in Netflix's 'Famous Last Words' Eric Dane opened up in a powerful Famous Last Words interview, sharing reflections on regret, resilience and legacy that leave a lasting impact.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-espionage-thriller-breaks-box-office-records-26-11-mumbai-attack-scenes-2871779-2026-02-20",
      "headline": "R Madhavan says Dhurandhar stars broke down after 26/11 scene R Madhavan reveals how Akshaye Khanna and Arjun Rampal reacted after filming the 26/11 sequence in Dhurandhar -- and why the moment changed everything on set.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-pavane-review-slow-romance-emotional-depth-2871765-2026-02-20",
      "headline": "Pavane review: Moon Sang-min leads a tepid romance that never quite soarsRelease Date:Fri Feb 20, 2026 Netflix's Pavane is a slow-paced romance set in Seoul's department store. The film explores subtle emotional connections but struggles to gain momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kh-x-rk-rajinikanth-kamal-haasan-go-full-retro-swag-in-new-poster-promo-out-soon-2871748-2026-02-20",
      "headline": "KH X RK: Rajinikanth-Kamal Haasan go retro with swag in new poster, promo out soon Rajinikanth and Kamal Haasan, two iconic figures of Tamil cinema, will share the screen again after nearly five decades, with a vintage-themed promo video set to release on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chiraiya-teaser-divya-dutta-leads-hard-hitting-social-drama-on-marital-consent-2871743-2026-02-20",
      "headline": "Chiraiya teaser: Divya Dutta leads hard-hitting social drama on marital consent The teaser of Chiraiya, starring Divya Dutta, raises pressing questions about marital consent. Directed by Shashant Shah, the release date of the upcoming series is yet to be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-actor-shanaya-kapoor-career-setbacks-growth-acting-journey-2871726-2026-02-20",
      "headline": "Actor Shanaya Kapoor says shelved Bedhadak shaped her journey Shanaya Kapoor looks back at the shelving of Bedhadak and reveals how the setback shaped her journey in Bollywood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-on-his-blink-and-miss-cameo-in-kohrra-2-calls-show-a-rare-gem-2871709-2026-02-20",
      "headline": "Sudip can't make crime shows without me: Jaideep Ahlawat on his Kohrra 2 cameo Kohrra Season 2 has surprised fans with a clever Easter egg featuring Jaideep Ahlawat in a brief, unannounced cameo. The actor has now opened up about the role and credited maker Sudip Sharma, calling the show a rare gem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-moved-by-hrithik-roshan-praise-for-o-romeo-calls-it-special-2871703-2026-02-20",
      "headline": "Shahid Kapoor moved by Hrithik Roshan's praise for O' Romeo, calls it special After Hrithik Roshan praised O' Romeo, Shahid Kapoor shared an emotional response. He reflected on Hrithik's influence on his early years and expressed his excitement over the recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-dies-aged-53-greys-anatomy-actor-als-battle-legacy-awareness-2871685-2026-02-20",
      "headline": "Patrick Dempsey reflects on Grey's Anatomy co-star Eric Dane's final days Actor Patrick Dempsey has shared an emotional tribute to Eric Dane following his death at 53, recalling their final conversations and the laughter they shared.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-3-review-suraj-sharma-joins-gabriel-basso-for-an-edgier-season-2871697-2026-02-20",
      "headline": "The Night Agent 3 review: Suraj Sharma joins Gabriel Basso for an edgier seasonRelease Date:Fri Feb 20, 2026 The Night Agent Season 3 on Netflix raised the bar with a gripping blend of global conspiracies and moral complexity, making the story more intense and relatable. Featuring strong performances, especially by Indian actor Suraj Sharma, the season delivered a fresh, layered thriller experience for loyal fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-patel-suffered-rib-fracture-quit-the-50-reality-show-on-medical-advice-actors-team-2871658-2026-02-20",
      "headline": "Karan Patel suffered rib fracture, quit The 50 on medical advice: Actor's team Actor Karan Patel's team released a statement following his departure from The 50. It explained the circumstances around his exit and addressed narratives regarding his performance and conduct during the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-praises-yash-as-toxic-teaser-creates-frenzy-2871655-2026-02-20",
      "headline": "It's gonna get crazy: Rishab Shetty reacts to Yash's Toxic teaser The highly anticipated teaser for Toxic: A Fairytale for Grown-Ups has been released, showcasing Yash's striking transformation. The film is set for a major box office clash this March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/second-case-of-seetharam-review-vijay-raghavendra-crime-thriller-review-2871603-2026-02-20",
      "headline": "Second Case of Seetharam review: Vijay Raghavendra anchors engaging slow burnRelease Date:Fri Feb 20, 2026 Second Case of Seetharam movie review: The Vijay Raghavendra-starrer sequel offers a slow-burn investigation with strong psychological elements but faces pacing challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-lord-ram-look-varanasi-poster-viral-ss-rajamouli-film-2871575-2026-02-20",
      "headline": "Mahesh Babu's Lord Ram look from Varanasi out? Theatre hoarding goes viral Mahesh Babu's Lord Ram look from the film Varanasi has surfaced on a digital theatre hoarding in Guntur. The viral poster hints at the actor's intense preparation and the film's epic narrative under SS Rajamouli's direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-cm-siddaramaiah-marks-shivarajkumars-40-years-in-cinema-truly-no-equal-2871566-2026-02-20",
      "headline": "Karnataka CM Siddaramaiah marks Shivarajkumar's 40 years in cinema: Truly no equal Karnataka's Chief Minister Siddaramaiah and others celebrate Shivarajkumar's four decades as a lead actor, highlighting his film achievements and recent return to work after health challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-step-out-amid-extortion-threat-pics-go-viral-2871552-2026-02-20",
      "headline": "Ranveer Singh and Deepika Padukone step out amid extortion threat. Pics go viral Actor-couple Ranveer Singh and Deepika Padukone made a public appearance in Mumbai to support her father, Prakash Padukone. The outing came amid increasing security around their home after a threatening extortion message to the Dhurandhar star. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/supreme-court-pulls-up-elvish-yadav-in-snake-venom-case-flags-wildlife-act-breach-2871571-2026-02-20",
      "headline": "Supreme Court pulls up Elvish Yadav in snake venom case, flags Wildlife Act breach The Supreme Court pulled up Elvish Yadav while hearing his plea in the alleged snake venom case, saying it would send a \"bad message\" if protected species were misused. The bench said it would examine the complaint under the Wildlife (Protection) Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-bandar-bobby-deol-movie-release-2026-2871567-2026-02-20",
      "headline": "Anurag Kashyap's Bandar with Bobby Deol set for theatrical release. Check out date Anurag Kashyap's film Bandar starring Bobby Deol is set for worldwide theatrical release in May 2026. The film's premiere at the Toronto Film Festival has raised expectations about its socio-political themes."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/i-can-charge-much-more-donald-trump-imposes-new-10-global-tariff-after-supreme-court-blow-2871881-2026-02-21",
      "headline": "I can charge more: Trump imposes 10% global tariff following Supreme Court rulingTrump announced a new 10% global tariff under Section 122 for 150 days, replacing duties struck down by the Supreme Court and signalling potential higher tariffs after fresh trade investigations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-deal-stands-wont-change-trump-says-after-us-supreme-court-tariff-verdict-2871885-2026-02-21",
      "headline": "Nothing changes: Trump says India trade deal intact after Supreme Court rulingAfter the Supreme Court voided his reciprocal tariffs, Trump defended the India trade arrangement, calling it fair and reiterating that the United States will not face duties under the pact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ashamed-of-certain-members-of-court-swayed-by-foreign-interests-trump-slams-ruling-striking-tariffs-2871868-2026-02-20",
      "headline": "Deeply disappointing: Trump says Supreme Court swayed by foreign interestsTrump blasted the Supreme Court's 6-3 decision striking down his global tariffs as deeply disappointing, accused justices of foreign influence, and vowed stronger trade measures, including possible embargoes and alternative actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-icc-blunders-fifty-years-format-wrong-history-odis-2871463-2026-02-20",
      "headline": "Fifty years of blunders: How the ICC keeps getting the World Cup format wrongFor over five decades, the ICC has repeatedly reshaped World Cup formats in the name of innovation, often sacrificing clarity and competitive integrity. From Super Six confusion to modern pre-seeding chaos, cricket's biggest tournament keeps solving problems it creates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/willing-to-negotiate-with-trump-will-take-everything-in-writing-brazils-lula-to-india-today-on-us-tariffs-2871787-2026-02-20",
      "headline": "Two 80-year-olds don't need to fight: Brazil's Lula jabs Trump on tariffsOne of the fiercest critics of Donald Trump, Brazilian President Luiz Inacio Lula da Silva, in an interview with India Today, gave an insight into the US President's behaviour and how he would negotiate on tariffs with him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-mental-health-asif-nazrul-controversy-2871819-2026-02-20",
      "headline": "Players in mental coma: Bangladesh coach slams Yunus official for World Cup exitBangladesh senior assistant coach Mohammad Salahuddin slammed former sports advisor Asif Nazrul for allegedly making blatant false claims and criticised him for shattering the dreams of young cricketers following Bangladesh's boycott of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chitrakoot-child-sexual-abuse-videos-case-uttar-pradesh-couple-death-sentence-special-pocso-court-banda-2871750-2026-02-20",
      "headline": "UP couple sentenced to death for filming, selling child abuse videos on dark webThe convicts, Ram Bhavan, a junior engineer in the Irrigation Department, and his wife Durgavati, were found guilty under multiple provisions of the relevant criminal laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-supreme-court-strike-down-donald-trump-tariff-emergency-law-us-president-media-briefing-live-updates-2871857-2026-02-20",
      "headline": "Live: Will sign executive order to enact 10% global tariff, Trump says after Supreme Court defeatUS Supreme Court Tariff Ruling Live updates: The US Supreme Court on Friday struck down President Donald Trump's sweeping tariffs, delivering a major setback to one of his most aggressive economic measures. In a 6-3 ruling authored by Chief Justice John Roberts, the court upheld a lower court's decision that Trump exceeded his authority by invoking the International Emergency Economic Powers Act (IEEPA) of 1977 to levy broad import taxes. While the IEEPA allows a president to regulate financial transactions and oversee imports and exports during a national emergency, it does not explicitly authorise the imposition of tariffs. The court noted that although past presidents have used the law to impose sanctions, Trump was the first to apply it to tariffs. Reacting sharply, Trump called the ruling a \"disgrace\" and said he has a backup plan. The tariffs had targeted multiple countries, including a steep 50 per cent duty on India, intensifying global trade tensions. Stay tuned with IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/how-iran-linked-oil-tankers-seized-by-india-went-dark-after-entering-pakistans-sea-zone-2871376-2026-02-20",
      "headline": "How Iran-linked oil tanker seized by India went dark after entering Pak's sea zoneMT Asphalt Star, one of the three Iran-linked tankers seized near Mumbai, was detected operating suspiciously in Pakistan's Exclusive Economic Zone (EEZ). On January 28, the tanker went completely \"dark\" for about 11 hours, disabling its Automatic Identification System, Very High Frequency radio and onboard sensors, while concealing its identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-debates-within-brics-to-create-new-currency-brazils-lula-to-india-today-2871784-2026-02-20",
      "headline": "No debates within BRICS to create new currency: Brazil's Lula to India TodayIn an exclusive interview with India Today TV, Brazilian President Luiz Inacio Lula da Silva clarified there is no BRICS currency plan, but said India and Brazil can still rethink dollar-based trade and slowly build alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-supreme-court-strikes-down-donald-trumps-sweeping-global-tariffs-terms-measures-illegal-2871795-2026-02-20",
      "headline": "US Supreme Court strikes down Trump's global tariffs 6-3, terms them illegalA Chief Justice John Roberts-led bench upheld a lower court ruling that Trump exceeded his authority by invoking the International Emergency Economic Powers Act (IEEPA) to levy broad import taxes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-supreme-court-strikes-down-donald-trump-global-tariffs-6-3-terms-them-illegal-will-india-get-tariff-refund-america-exporters-2871824-2026-02-20",
      "headline": "Trump tariffs ruled illegal: Will Indians get any refund or relief from US?The US Supreme Court has struck down President Donald Trump's tariffs on countries, including India, as illegal. This might open the door to billions of dollars in refunds, and might benefit US importers. There is no mechanism to compensate Indian exporters for the losses they suffered. However, they benefit as they regain a competitive edge in the US market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/in-an-era-of-ring-shy-men-nick-jonas-mangalsutra-bracelet-is-more-than-just-fashion-2871563-2026-02-20",
      "headline": "In an era of ring-shy men, Nick Jonas' mangalsutra bracelet is more than fashionIn a world where some men 'forget' their wedding rings at home, Nick Jonas' mangalsutra bracelet is a loud-yet-subtle declaration of love and commitment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brazilian-president-luiz-inacio-lula-da-silva-pact-with-god-wanted-to-live-till-120-years-indiatoday-interview-2871861-2026-02-20",
      "headline": "I have a pact with God, I want to live till 120 years: Brazil's Lula to India TodayThe president of South America's largest country also shared an eye-catching fitness confession while in New Delhi for the AI Impact Summit 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-joined-united-states-led-pax-silica-but-not-us-president-donald-trumps-board-of-peace-explained-2871550-2026-02-20",
      "headline": "Why India has joined US-led Pax Silica but not Trump's Board of PeaceIndia has taken two divergent approaches to two President Donald Trump-led initiatives. While it joined Pax Silica, it sent an observer to the Board of Peace meeting. Here's why New Delhi's stance is about calibration, and not contradiction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-to-launch-astronauts-to-moon-in-march-leaks-fixed-2871834-2026-02-20",
      "headline": "Nasa to launch four astronauts on a round-trip to the Moon on March 6The Space Launch System (SLS), the most powerful rocket ever built by Nasa, will carry astronauts aboard the Orion spacecraft on a mission designed to pave the way for a sustained human presence on the Moon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-deewane-seher-mein-review-siddhant-chaturvedi-mrunal-thakur-imperfect-love-story-2871510-2026-02-20",
      "headline": "Do Deewane Seher Mein review: A tender tale of imperfect loveRelease Date:Fri Feb 20, 2026Do Deewane Seher Mein movie review: Do Deewane Seher Mein explores a love story rooted in imperfections and emotional scars. The film highlights how childhood wounds influence adult relationships and healing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariff-options-after-supreme-court-ruling-us-2871865-2026-02-20",
      "headline": "Trump still has ways to keep tariffs after Supreme Court setbackEven after the Supreme Court struck down his emergency tariffs, Donald Trump still has multiple legal pathways to impose aggressive import taxes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/eric-dane-final-interview-als-battle-legacy-netflix-documentary-2871844-2026-02-20",
      "headline": "Eric Dane's final interview now streams in Netflix's 'Famous Last Words'Eric Dane opened up in a powerful Famous Last Words interview, sharing reflections on regret, resilience and legacy that leave a lasting impact.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-chaibasa-woman-two-month-old-infant-baby-held-in-arms-burnt-to-death-set-on-fire-mob-villagers-husband-escapes-suspicion-witch-2871763-2026-02-20",
      "headline": "Labelled a witch, woman with her 2-month-old son in arms, set on fire; both dieA 32-year-old woman, branded a witch, and her two-month-old baby, were set on fire by a mob in Jharkhand's Chaibasa earlier this week. Her husband, who was also attacked, somehow escaped and is currently hospitalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/bangladesh-secular-constitution-bnp-tarique-rahman-sheikh-hasina-awami-league-jamaat-2871155-2026-02-20",
      "headline": "Why Bangladesh's secular Constitution starts with Bismillah, invokes Allah?Two events have brought Bangladesh's Constitution back into focus. The recent elections that made Tarique Rahman the Prime Minister, and the approval of the July Charter referendum, mandating fresh constitutional changes. It was Tarique's father, Ziaur Rahman, who altered the original secular framework and legalised religion-based politics. Now Bangladesh's Constitution straddles a duality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-web-services-suffered-hours-long-outage-because-its-ai-bot-kiro-did-some-job-created-a-bug-2871437-2026-02-20",
      "headline": "AWS suffered outage because AI bot Kiro did some job, Amazon says user error behind itAmazon Web Services faced service disruption in December after its agentic AI bot, Kiro, was given the autonomy to fix a software issue. After Kiro did its job, the service suffered a glitch for hours. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1b-visa-news-us-immigration-policy-debate-visa-programme-anti-india-racism-hate-speech-2871442-2026-02-20",
      "headline": "Deport Indians: How H-1B debate is driving racism and hate speech in the USPolicy debates around the H-1B visa programme have shifted from concerns around jobs and wages to now inciting hate speech and racism against Indians and Indian-origin citizens in the US. Research by Stop AAPI Hate, cited by The New York Times, shows how social media discourse became more vitriolic against Indians in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youth-congress-members-detained-at-ai-summit-after-shirtless-protest-slogans-against-pm-2871490-2026-02-20",
      "headline": "Youth Congress members detained at AI Summit after shirtless protest against PMDelhi saw a bold shirtless protest by Youth Congress workers against PM Narendra Modi during the AI Summit. Authorities have initiated strict legal action as political tensions escalate in the capital.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-pakistan-vs-new-zealand-mike-hesson-super-8-2871866-2026-02-20",
      "headline": "Pakistan having psychological advantage over New Zealand? Mike Hesson opens up T20 World Cup 2026, PAK vs NZ: Speaking to reporters, Pakistan head coach Mike Hesson discussed whether Pakistan holds the upper hand ahead of their Super 8 clash against New Zealand. Historically, Pakistan have defeated the Black Caps in five of their seven encounters in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-curators-tricky-pitches-wankhede-narendra-modi-stadium-t20-world-cup-2871860-2026-02-20",
      "headline": "T20 World Cup: India bowling coach Morkel defends 'tacky' Wankhede, Motera pitches India bowling coach Morne Morkel has come out in support of the curators at the Wankhede Stadium and the Narendra Modi Stadium in Motera, backing their efforts after the slightly tacky surfaces at both venues drew scrutiny during the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/richard-kettleborough-chris-gaffaney-umpire-india-south-africa-t20-world-cup-super-8-2871856-2026-02-20",
      "headline": "Richard Kettleborough, Chris Gaffaney to officiate India vs SA Super 8 match Richard Kettleborough and Chris Gaffaney will be the on-field umpires for India's opening Super 8 match of the T20 World Cup against South Africa in Ahmedabad on Sunday, the ICC said on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-babar-azam-batting-order-pakistan-mike-hesson-explains-2871837-2026-02-20",
      "headline": "Babar Azam's strike rate is low: Pakistan coach defends batting order change T20 World Cup: Pakistan head coach Mike Hesson on Friday justified the decision not to send Babar Azam in at his usual No. 4 spot in the final group-stage clash against Namibia, saying he would not have been the best person to come in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-mental-health-asif-nazrul-controversy-2871819-2026-02-20",
      "headline": "Players in mental coma: Bangladesh coach slams Yunus official for World Cup exit Bangladesh senior assistant coach Mohammad Salahuddin slammed former sports advisor Asif Nazrul for allegedly making blatant false claims and criticised him for shattering the dreams of young cricketers following Bangladesh's boycott of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-oman-t20-world-cup-group-match-marsh-head-2871813-2026-02-20",
      "headline": "Australia bow out on a high, Marsh-Head hand Oman a 9-wicket thrashing Australia ended their disappointing T20 World Cup campaign with a crushing 9-wicket win over Oman in their final Group match in Pallekele. After bowling Oman out for 105, captain Mitchell Marsh gunned down the 105-run target in just 9.4 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-divorce-confirms-ipl-2026-chennai-super-kings-2871777-2026-02-20",
      "headline": "CSK's latest spin acquisition, Rahul Chahar, confirms divorce Indian leg-spinner Rahul Chahar confirmed his divorce from wife Ishani Johar through an Instagram post, ending his marriage after more than three and a half years together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-clarifies-viral-video-pakistan-t20-world-cup-salman-agha-frustration-2871776-2026-02-20",
      "headline": "Rift in Pakistan camp? Pak coach opens up on Salman Agha outburst in Namibia clash T20 World Cup, NZ vs PAK: Mike Hesson has clarified the viral video in which he was seen speaking with Salman Agha, who smashed a bottle on the ground during Pakistan's match against Namibia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mp-high-court-seeks-clarity-nrai-licence-orders-release-cartridges-shooters-2871772-2026-02-20",
      "headline": "MP HC asks Centre to clarify national rifle association's ammunition license status The Madhya Pradesh High Court has sought clarity from the Centre on NRAI's licence status while granting interim relief to shooters by ordering the release of 1,000 cartridges each for training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-morkel-brothers-morne-india-albie-south-africa-super-8-2871755-2026-02-20",
      "headline": "IND vs SA: Morkel brothers, Morne and Albie, set for strategic clash in Super 8 India vs South Africa: Albie and Morne Morkel will face each other as coaches in the ICC Men's T20 World Cup Super 8 stage, setting up a rare off-field sibling rivalry. Back home, their mother is torn between supporting India or South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-t20-world-cup-super-8-india-south-africa-morne-morkel-2871752-2026-02-20",
      "headline": "Varun Chakravarthy under pressure? Morne Morkel opens up on spinner's workload T20 World Cup, IND vs SA: Morne Morkel said that Varun Chakravarthy has been under pressure to provide India with crucial breakthroughs. Chakravarthy has been India's standout bowler in the competition so far, picking up nine wickets from four matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-brutal-reality-check-shadab-khan-namibia-new-zealand-t20-world-cup-2871756-2026-02-20",
      "headline": "Shahid Afridi gives brutal reminder to Shadab: You performed only vs NamibiaT20 World Cup: Former Pakistan captain Shahid Afridi delivered a pointed response to Shadab Khan after the all-rounder defended his generation's 2021 World Cup win over India, questioning their ability to handle success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-aiden-markram-spin-control-practice-session-ahmedabad-2871730-2026-02-20",
      "headline": "Inside South Africa's game plan vs India: Proteas put all their chips on Aiden MarkramT20 World Cup: South Africa had a quiet training session two days ahead of their first Super 8 game against India. Aiden Markram was asked to bowl first, as the Proteas focused their preparations on bowling to India's southpaws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-bowling-coach-morne-morkel-abhishek-sharma-form-ind-vs-sa-2871716-2026-02-20",
      "headline": "Three ducks, no alarm: India stands firm behind Abhishek Sharma ahead of Super 8sT20 World Cup: India bowling coach Morne Morkel has thrown his weight behind Abhishek Sharma despite the opener's string of failures, making it clear there is \"absolutely no discussion\" about his place in the playing XI ahead of the Super 8 clash against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-oman-score-today-t20-world-cup-match-updates-pallekele-2871706-2026-02-20",
      "headline": "AUS vs OMA Highlights: Mitchell Marsh's fifty gives consolation win by 9 wicketsAustralia (AUS) vs Oman (OMA) Highlights, T20 World Cup: Mitchell Marsh's fireworks in Kandy has given Australia their first win of the tournament, albeit being a bit too late. Nonetheless a consolation win for the Aussies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-ownership-disputes-sialkot-lahore-qalandars-2871678-2026-02-20",
      "headline": "Pakistan board grapples with ownership issues in two PSL franchisesThe Pakistan Cricket Board is facing ownership concerns involving at least two of the eight franchises in the Pakistan Super League, according to PTI. A dispute has reportedly erupted within the newly auctioned Sialkot franchise over majority ownership.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-england-stop-ipl-owners-pakistan-players-blocked-michael-vaughan-2871651-2026-02-20",
      "headline": "England must not allow IPL owners to block Pakistan players from Hundred: VaughanFormer England captain Michael Vaughan called for ECB's intervention to stop IPL-owned franchises in The Hundred from picking Pakistan players for the upcoming auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mark-chapman-new-zealand-vs-pakistan-spin-bowling-super-8-2871583-2026-02-20",
      "headline": "New Zealand's Mark Chapman ready for Pakistan's familiar spin challenge in Super 8sNew Zealand middle-order batter Mark Chapman is banking on the familiarity factor to counter the mystery spinner Usman Tariq-led Pakistan bowling unit in their Group 2 Super 8 clash of the ICC Men's T20 World Cup here on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-super-8s-new-zealand-playing-colombo-advantage-mark-chapman-2871584-2026-02-20",
      "headline": "Playing all Super 8 games in Colombo is a big advantage for New Zealand: Mark ChapmanT20 World Cup 2026: Here is the full excerpt from New Zealand batter Mark Chapman ahead of their game against Pakistan in Colombo.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-women-asia-cup-rising-stars-final-radha-yadav-all-round-performance-2871562-2026-02-20",
      "headline": "Radha Yadav heroics power India A Women into Rising Stars Asia Cup final vs BangladeshRising Stars Asia Cup: Radha Yadav put in a strong all-round performance as India A Women beat Sri Lanka A Women by five wickets on Friday, February 20 at the Terdthai Cricket Ground in Bangkok."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-igor-tudor-tottenham-hotspurs-vs-arsenal-manchester-united-michael-carrick-2871554-2026-02-20",
      "headline": "Premier League: Igor Tudor's Spurs test, transfer battles, and big callsManagerial sackings, loan disruption and transfer confusion have once again reshaped the Premier League narrative. From Nwaneri's stalled development to Trafford's frustration and Forest's gamble, instability continues to define English football's shifting landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-coach-denies-t20-world-cup-neglect-shock-group-stage-exit-2871544-2026-02-20",
      "headline": "Does Australia not take T20 World Cup seriously? Head coach responds after shock exitT20 World Cup: Australia head coach Andrew McDonald rejected claims his team didn't prioritise the T20 World Cup after crashing out in the group stages with losses to Zimbabwe and Sri Lanka in a shock exit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-captain-amaad-butt-ban-revoked-phf-tariq-bugti-controversy-fih-pro-league-2871535-2026-02-20",
      "headline": "Pakistan scraps two-year ban on hockey captain Ammad ButtPakistan overturned Ammad Butt's two-year ban, calling it illegal and unconstitutional. The dramatic reversal added to the turmoil surrounding Pakistan hockey after a chaotic Australia tour and a winless Pro League campaign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-babar-azam-form-mohammad-yousuf-pakistan-2871507-2026-02-20",
      "headline": "Told to rest Babar, I was forced to resign as Pakistan selector: Mohammad YousufT20 World Cup: Mohammad Yousuf revealed that he was forced to resign from his role as Pakistan selector in 2024 after suggesting that Babar Azam should be dropped from T20Is. Babar has struggled for form during the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-pak-decline-viewership-numbers-jiohotstar-2871486-2026-02-20",
      "headline": "T20 World Cup: Is IND vs PAK on the decline? Viewership numbers suggest otherwiseT20 World Cup 2026: India vs Pakistan T20 World Cup match shatters viewership records with 163 million digital reach, the highest for any ICC T20 event, despite pre-tournament boycott drama and India's dominant 8-1 record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ipl-preperation-gujarat-titans-nets-session-hitting-six-watch-video-t20-world-cup-snub-2871474-2026-02-20",
      "headline": "Watch: Shubman Gill goes full throttle in IPL prep, leaves T20 World Cup snub behindA viral nets video showed Shubman Gill in destructive touch ahead of IPL 2026. After a tough international phase and a T20 World Cup snub, the Gujarat Titans captain appeared focused on reset, rhythm and response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-icc-blunders-fifty-years-format-wrong-history-odis-2871463-2026-02-20",
      "headline": "Fifty years of blunders: How the ICC keeps getting the World Cup format wrongFor over five decades, the ICC has repeatedly reshaped World Cup formats in the name of innovation, often sacrificing clarity and competitive integrity. From Super Six confusion to modern pre-seeding chaos, cricket's biggest tournament keeps solving problems it creates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-2026-player-auction-updates-squad-budgets-joe-root-adil-rashid-2871427-2026-02-20",
      "headline": "The Hundred auction: Joe Root, Adil Rashid among big names to go under hammerJoe Root and Adil Rashid are among the big names who are set to go under the hammer during the first-ever Hundred auction, with all 16 franchises looking to snap up big talent before the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-hardik-pandya-india-why-batting-number-5-mohammed-kaif-2871417-2026-02-20",
      "headline": "Hardik Pandya at No.5 right or wrong? Mohammed Kaif questions India's batting orderT20 World Cup: Mohammed Kaif has questioned Hardik Pandya's promotion to No.5 despite India's unbeaten run. With the Super 8s looming, India's left-heavy batting order and tactical tweaks are back under the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jonathan-trott-farewell-afghanistan-vs-canada-press-conference-2871398-2026-02-20",
      "headline": "Here by chance, gave it my all: Trott bids farewell to Afghanistan cricketT20 World Cup: An emotional Jonathan Trott bid farewell to Afghanistan cricket, saying that he is proud of his players and will remain a fan of them forever. Having got the chance to be the coach by luck, Trott guided Afghanistan to the semi-final stage of the T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shivam-dube-yuvraj-comparison-t20-world-cup-2026-india-2871226-2026-02-20",
      "headline": "From next Yuvraj to main man: Shivam Dube owning the T20 World Cup stageT20 World Cup: After being compared to Yuvraj Singh in his early days, Shivam Dube is producing a performance like the Indian legend on the T20 World Cup stage. With improved batting and bowling skills, Dube could be the difference for India in their bid to regain their crown.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}