{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-acts-password-override-privacy-threat-or-necessary-power-2777086-2025-08-26",
      "headline": "New Income Tax Act's password override: Privacy threat or necessary power?India's new tax law brings a digital twist; officials can now override passwords during raids. Supporters say it's just enforcement in the digital age, but privacy advocates worry about unchecked surveillance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-us-tariff-sensex-loses-849-points-nifty-below-24750-tata-steel-down-3-percent-2777012-2025-08-26",
      "headline": "Sensex slumps 849 points, Nifty below 24,750; Tata Steel down 3%The S&P BSE Sensex tanked 849.37 points to close at 80,786.54, while the NSE Nifty50 lost 255.70 points to end at 24,712.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-notice-rs-258-crore-recuced-to-zero-money-saving-section-54-land-sell-property-buy-2776992-2025-08-26",
      "headline": "Woman got tax notice of Rs 2.58 crore. Here's how she reduced it to Rs 0Seema found herself staring at a tax notice of Rs 2.58 crore after selling a piece of land in Patna. The confusion arose due to a simple error in her tax return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-august-27-impact-economy-export-pmo-meeting-modi-government-textile-gems-pharma-2776931-2025-08-26",
      "headline": "Trump's 50% tariff takes effect tomorrow: Who wins, who losesThe United States government has issued a draft notification confirming the step, which will be applied through a supplementary 25% duty on top of existing tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-india-really-needs-to-become-viksit-bharat-by-2047-2776887-2025-08-26",
      "headline": "What India really needs to become 'Viksit Bharat' by 2047IndiaToday.in reached out to leading economists to understand what India must do over the next two decades to achieve its 'Viksit Bharat' vision. Here's what they had to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-shares-crash-over-50-percent-why-bonus-issue-did-it-really-fall-2776872-2025-08-26",
      "headline": "HDFC Bank share crash explained: Did it actually fall over 50%?HDFC Bank's shares appeared to have tanked over 50% compared to the previous close on Dalal Street in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switching-from-ups-unified-pension-scheme-to-nps-national-pension-scheme-here-is-what-employees-must-know-2776864-2025-08-26",
      "headline": "Switching from UPS to NPS? Here's what employees must knowCentral government employees now have a one-time chance to switch from the Unified Pension Scheme (UPS) to the National Pension System (NPS). But the move comes with strict rules, deadlines, and conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/simplified-new-tax-rules-and-formswhat-you-need-to-know-2776823-2025-08-26",
      "headline": "Simplified, new tax rules and forms: What you need to knowThe Income Tax department is working on new rules and forms under the Income-tax Act, 2025, which will be notified by December-end to ensure a smoother, simpler process for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-farming-crisis-india-farmers-low-prices-production-fall-pest-msp-govt-prices-yield-2776817-2025-08-26",
      "headline": "Once 'white gold', cotton turns into burden for India's farmersAt present, cotton cultivation area, production, and productivity are all going down. In just two years, the cotton cultivation area has fallen by 14.8 lakh hectares, while production has dropped by 42.35 lakh bales. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-down-why-us-tariff-august-27-pharma-financial-shares-decline-pmo-meet-modi-2776775-2025-08-26",
      "headline": "Sensex crashes 900 points: Why is stock market down today?The BSE Sensex showed a negative start as trading commenced today, with most stocks tanking at the opening bell. Sensex and Nifty fell nearly 1% a few minutes after opening for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-400-points-nifty-falls-below-24900-as-us-tariff-concerns-hit-d-street-2776765-2025-08-26",
      "headline": "Sensex, Nifty tank nearly 1% as US tariff fears spook D-Street investorsThe Sensex fell over 500 points, while the Nifty slipped below the psychological 24,900 mark in early trade, mirroring global risk-off cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-10-30-50-formula-edelweiss-mf-radhika-gupta-on-smart-money-habits-2776514-2025-08-25",
      "headline": "What is the 10-30-50 formula? Edelweiss MF's Radhika Gupta on smart money habitsRadhika Gupta explained that this tug of war between splurging and saving is not new. In fact, she advised a simple rule for different life stages, i.e., the 10-30-50 principle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-retains-its-rating-for-india-sees-growth-at-65-percent-2776462-2025-08-25",
      "headline": "Fitch retains its rating for India, sees growth at 6.5%Fitch's rating comes days after S&P Global Ratings lifted its sovereign credit rating on India, citing strong economic growth, marking its first upgrade in 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-329-points-higher-nifty-above-24950-infosys-gains-3-percent-2776450-2025-08-25",
      "headline": "Sensex ends 329 points higher, Nifty above 24.950; Infosys gains 3%The S&P BSE Sensex added 329.06 points to close at 81,635.91, while the NSE Nifty50 gained 97.65 points to end at 24,967.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-wedding-gifts-really-tax-free-here-is-the-answer-2776443-2025-08-25",
      "headline": "Are wedding gifts really tax-free? Here's the answerIn India, weddings are full of joy, rituals and generous gifts. But when the celebrations end, many couples wonder, do these gifts come with hidden tax bills? The answer may surprise you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pmo-to-convene-big-meeting-tomorrow-as-us-tariffs-set-to-come-into-force-sources-2776418-2025-08-25",
      "headline": "PMO to convene big meeting tomorrow as US tariffs set to come into force: SourcesThe Prime Minister's Office will hold a high-level review meeting on August 26 to assess support measures for Indian exporters hit by higher US tariffs. The session, chaired by the PM's Principal Secretary, comes as Washington doubles duties, with Indian goods now facing a steep 50% tariff, raising cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ahpi-bajaj-allianz-cashless-treatment-hospital-body-meeting-insurance-rejection-claims-girdhar-gyani-2776408-2025-08-25",
      "headline": "Why hospitals have barred cashless services from Bajaj Allianz policyholdersThe meeting between AHPI's (Association of Healthcare Providers India) will include core committee members and senior representatives from Bajaj Allianz, and is scheduled for August 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-on-the-one-skill-ai-can-not-replace-2776378-2025-08-25",
      "headline": "Zerodha's Nithin Kamath on the one skill AI can't replaceNithin Kamath explained that curiosity should not be confined to a person's own role but should extend to the larger environment around them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pmo-to-chair-key-meeting-on-50-us-tariffs-tomorrow-details-here-2776375-2025-08-25",
      "headline": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: SourcesStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/common-empanelment-explained-why-big-private-hospitals-and-insurers-are-at-odds-2776335-2025-08-25",
      "headline": "Common empanelment explained: Why big private hospitals and insurers are at oddsCommon empanelment aims to simplify cashless insurance in India, but hospitals resist over tariffs and operational issues, leaving policyholders' access dependent on achieving fair rates, efficient settlements, and system flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-itr-filing-deadline-be-extended-again-after-delayed-rollout-of-utilities-2776296-2025-08-25",
      "headline": "Will ITR filing deadline be extended again after delayed rollout of utilities?With the revised ITR utilities coming out much later than expected, taxpayers and professionals are now questioning whether the government will grant another extension to ease the compliance burden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/mangal-electrical-ipo-allotment-out-today-check-status-listing-gains-stock-market-debut-2776284-2025-08-25",
      "headline": "Mangal Electrical IPO allotment out: Check your status, possible listing gainsInvestors who applied for the Mangal Electrical IPO can check their allotment status through two official platforms, the BSE website and the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wallet-money-cash-winning-dream11-mpl-winzo-zupee-withdrawal-online-gaming-bill-2025-2776264-2025-08-25",
      "headline": "Online gaming law: Will users get Dream11, MPL, Winzo wallet cash?The Online Gaming Bill, cleared by both Lok Sabha and Rajya Sabha this week, bans all forms of online money games. These are defined as games where players deposit money, directly or indirectly, with the hope of winning cash rewards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-gain-infosys-tcs-wipro-why-are-they-rising-today-2776249-2025-08-25",
      "headline": "Infosys, TCS, Wipro rally: Why are IT stocks rising today?Analysts said the rally reflects expectations that lower US interest rates will make emerging markets, including India, more attractive to foreign investors, supporting inflows into the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-200-points-nifty-above-24900-it-stocks-lead-gains-2776241-2025-08-25",
      "headline": "Sensex rises over 200 points, Nifty above 24,900; IT stocks lead gainsAt 9:22 am, the BSE Sensex rose 203.14 points to 81,509.99, while the NSE Nifty50 advanced 53.20 points to 24,923.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-likely-by-dussehra-government-braces-for-big-revenue-shortfall-2776239-2025-08-25",
      "headline": "New GST rates likely by Dussehra, government braces for big revenue shortfallThe proposed GST revamp aims to simplify the tax system by introducing a two-tier rate structure of 5% and 18%, along with a 40% levy on sin goods. While the move promises greater simplicity, it is expected to significantly impact revenues for both central and state governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/this-is-how-new-income-tax-bill-2025-brings-relief-for-salaried-and-small-taxpayers-2775991-2025-08-24",
      "headline": "How new Income Tax Bill 2025 brings relief for salaried and small taxpayersEndless forms and confusing jargon may soon be history. The New Income Tax Bill 2025 could be the game-changer salaried and small taxpayers have been waiting for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/internet-praises-amit-sadh-humility-after-content-creators-fail-recognise-him-2777229-2025-08-26",
      "headline": "Internet praises Amit Sadh's humility after content creators fail to recognise himContent creators known as therealstreets fail to recognise actor Amit Sadh during a chance encounter, later photographing him. Here's what happened and where you've seen him before.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-launches-production-studio-keneeshaa-francis-an-ordinary-man-2777198-2025-08-26",
      "headline": "Actor Ravi Mohan calls Keneesha god-sent gift, leaves her teary-eyedActor Ravi Mohan, who launched his new production banner, Ravi Mohan Studios, in a grand fashion, had a few heartfelt things to say about his 'companion' Keneeshaa Francis. She was visibly emotional upon hearing his speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ntr-x-neel-jr-ntr-begin-film-2nd-schedule-with-director-prashanth-neel-2777194-2025-08-26",
      "headline": "NTR x Neel: Jr NTR to soon begin film's 2nd schedule with director Prashanth NeelActor Jr NTR is set to begin the second schedule of the much-awaited film NTR x Neel in September 2025. The collaboration with director Prashanth Neel is speculated to be a major pan-India film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-candid-in-flight-moment-goes-viral-amid-love-and-war-shoot-2777204-2025-08-26",
      "headline": "Ranbir Kapoor's candid in-flight moment goes viral amid Love and War shootRanbir Kapoor's candid off-screen moment during a flight went viral, showing his relatable side to fans. Meanwhile, his much-anticipated film 'Love and War', featuring a star-studded cast and high-octane action, is currently under production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/king-conqueror-director-says-james-norton-nikolaj-fantastic-2777168-2025-08-26",
      "headline": "King & Conqueror director says James Norton and Nikolaj were fantasticKing & Conqueror explores the legendary clash between Harold Godwinson and William of Normandy. The series blends history and drama with powerful performances, premiering soon on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lil-nas-x-pleads-not-guilty-amid-charges-of-assaulting-police-roaming-in-underwear-2777132-2025-08-26",
      "headline": "Lil Nas X pleads not guilty amid charges of assaulting police, roaming in underwearAmercian rapper Lil Nas X pleaded not guilty to charges after allegedly assaulting police officers in Los Angeles. The case highlights the legal and personal challenges facing the Grammy-winning rapper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aneez-bazmee-salman-khan-anil-kapoor-no-entry-sequel-2777174-2025-08-26",
      "headline": "Aneez Bazmee on not having Salman and Anil in No Entry sequel: Pain remainsFilmmaker Aneez Bazmee talked about the pain of not having actors Salman Khan and Anil Kapoor in the sequel to 'No Entry' in a recent interview. He also expressed his hesitation over Bipasha Basu's character in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-and-zoe-kravitz-dating-rome-walk-2777019-2025-08-26",
      "headline": "Are Harry Styles and Zoe Kravitz dating? Their Rome walk has fans guessingSinger Harry Styles and actor Zoe Kravitz were seen holding hands in Rome, setting off dating rumours after a paparazzi video made the rounds on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-teaser-ss-rajamouli-prabhas-rana-daggubati-anushka-shetty-tamannaah-bhatia-2777108-2025-08-26",
      "headline": "Baahubali The Epic teaser: Prabhas-starrer is a trip down memory laneThe teaser for 'Baahubali: The Epic', starring Prabhas, Rana Daggubati, Anushka Shetty and Tamannaah Bhatia, was released on Tuesday. Directed by SS Rajamouli, the film is set for a release on October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-trailer-mohanlal-next-is-a-festive-mix-of-comedy-love-and-emotion-2777146-2025-08-26",
      "headline": "Hridayapoorvam trailer: Mohanlal's next is a festive mix of comedy, love and emotionMohanlal's latest film 'Hridayapoorvam' promises a feel-good narrative, releasing on August 28 during Onam festivities. The trailer hints at a humorous yet touching journey post heart surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-akeli-laila-baaghi-4-song-tiger-shroff-2777009-2025-08-26",
      "headline": "Sonam Bajwa is Bollywood's Akeli Laila in Baaghi 4 dance number. WatchActor Sonam Bajwa featured in the latest song of 'Baaghi 4' titled 'Akeli Laila', which released on Tuesday. The dance number also gives a glimpse into the action sequences of Tiger Shroff. 'Baaghi 4' is scheduled for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sophie-turner-defends-game-of-thrones-controversial-rape-scene-on-women-struggles-patriarchy-trigger-warnings-2777038-2025-08-26",
      "headline": "Sophie Turner says Game of Thrones rape scene was triggering, highlighted patriarchySophie Turner reflected on the controversial rape scene in 'Game of Thrones'. She supported the show's portrayal of women's struggles, and suggested adding trigger warnings if released today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-anniversary-wish-for-kirron-has-outlander-twist-2776958-2025-08-26",
      "headline": "Anupam Kher's loving anniversary wish for Kirron has Outlander twist. WatchAnupam Kher and Kirron Kher celebrated their 40th wedding anniversary with Instagram posts, recalling cherished memories and their journey together. Anupam shared a special Outlander video that once uplifted Kirron, while she called him her best friend and life partner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-note-on-privacy-photos-of-under-construction-home-go-viral-2777079-2025-08-26",
      "headline": "Alia Bhatt shares note on privacy as pics of her under construction home go viralActor Alia Bhatt shared a note on privacy and consent after photos of her under-construction home went viral. She called out the paparazzi with regard to a serious privacy and security breach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farrhana-bhatt-bigg-boss-19-kashmir-image-change-2777061-2025-08-26",
      "headline": "Farrhana Bhatt hopes Bigg Boss 19 changes Kashmir's perceptionFarrhana Bhatt joins 'Bigg Boss 19' to represent Kashmir and its unique culture. In an exclusive chat with India Today, Bhatt said that she aims to change the state's image while embracing the show's political theme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rima-kallingal-kerala-film-critics-award-theatre-the-myth-of-reality-media-focus-amma-2777022-2025-08-26",
      "headline": "Rima Kallingal slams media focus on Malayalam film body: I'm an artist firstMalayalam actor Rima Kallingal has voiced her frustration at the media for overlooking her Kerala Film Critics Award win for 'Theatre: The Myth of Reality'. Despite her acclaimed performance, questions centred on AMMA's internal matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-directorial-debut-yogi-babu-film-launches-production-house-2777050-2025-08-26",
      "headline": "Actor Ravi Mohan turns director with Yogi Babu film, announces production line-upActor Ravi Mohan launched his production house, Ravi Mohan Studios, with various projects. He will also direct his first film under his banner, which will feature Yogi Babu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madharaasi-can-sivakarthikeyan-and-ar-murugadoss-break-tamil-cinemas-star-curse-2777044-2025-08-26",
      "headline": "Madhuaraasi: Can Sivakarthikeyan and AR Murugadoss break Tamil cinema's star curse?As big-budget star vehicles falter in Tamil cinema, all eyes turn to Sivakarthikeyan and AR Murugadoss' 'Madharaasi', which will hit theatres on September 5. Will the film strike gold at the box office?"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/amit-shah-claimed-bjp-will-stay-in-power-for-50-years-as-it-does-vote-chori-rahul-gandhi-sharpens-attack-2777212-2025-08-26",
      "headline": "Amit Shah talks about 50 years of BJP rule because of 'vote chori': Rahul GandhiCongress leaders Rahul Gandhi and Priyanka Gandhi Vadra on Tuesday sharpened their attack on the BJP, accusing them of \"stealing votes\" to stay in power."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/5-killed-14-injured-due-to-landslides-on-vaishno-devi-yatra-route-amid-heavy-rain-in-jk-2777128-2025-08-26",
      "headline": "6 killed in landslides on Vaishno Devi Yatra route amid heavy rain in J&KA heavy downpour triggered a landslide on the route to the Mata Vaishno Devi shrine atop Jammu and Kashmir's Trikuta hills, leaving at least five dead and 14 injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-refused-donald-trump-calls-four-times-in-recent-weeks-german-newspaper-frankfurter-allgemeine-faz-2777026-2025-08-26",
      "headline": "Modi refused Trump's calls 4 times in recent weeks: German newspaperUS President Donald Trump tried to talk to Indian Prime Minister Narendra Modi four times in recent weeks amid a raging trade dispute, but the Indian leader refused to talk, according to German newspaper Frankfurter Allgemeine. This demonstrates the anger and caution in New Delhi, suggests the Mainz-based newspaper of record."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-dead-vaishno-devi-yatra-suspended-as-heavy-rains-landslides-hit-india-2777109-2025-08-26",
      "headline": "Floods ravage Himachal, landslides in J&K, Arunachal amid heavy rain; 9 dead Over the past 48 hours, nature's fury has been particularly unforgiving in the hill states of Jammu & Kashmir and Himachal Pradesh, where rivers have surged past danger marks, homes have been swept away, roads washed out, and entire communities cut off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-cleric-engineer-muhammad-ali-mirza-arrested-controversial-remarks-prophet-muhammad-blasphemy-controversy-2777149-2025-08-26",
      "headline": "Pak arrests cleric Engineer Mirza. Here's why his remarks sparked outragePopular Pakistani cleric Engineer Muhammad Ali Mirza was arrested over alleged blasphemous remarks. His controversial reference to Prophet Muhammad in his videos triggered an outrage, and ultimately led to his arrest after a religious group filed complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-collegium-patna-high-court-vm-pancholi-elevation-justice-nagarathna-dissent-regional-seniority-2776981-2025-08-26",
      "headline": "Collegium split over top court pick, dissenting judge cites 'regional imbalance'The Supreme Court Collegium's decision recommending the elevation of Patna High Court Chief Justice VM Pancholi to the top court was reportedly not unanimous, with one of the five members dissenting on grounds of regional representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/samay-raina-apology-india-got-latent-supreme-court-case-disability-2777163-2025-08-26",
      "headline": "No intent to offend: Samay Raina says sorry in Supreme Court for mocking disabledSamay Raina apologised and clarified that his intent was never to ridicule but to promote inclusivity, while pledging greater care in future performances and shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rss-red-flag-harassment-of-bengali-migrants-a-self-goal-against-mamata-2777138-2025-08-26",
      "headline": "RSS red-flag: Harassment of Bengali migrants a self-goal against MamataFor the RSS, in the run-up to Bengal polls, it is as important to reinforce its ideology on Bangladeshi infiltration as to project sensitivity towards Bengali cultural pride"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/africa-india-map-distortion-global-south-europe-correcting-mercator-equal-earth-projection-campaign-explained-2776606-2025-08-26",
      "headline": "What's wrong with Africa's map? Does it concern India too?The African Union has intensified a campaign for the use of the \"right map of Africa\". In the widely used Mercator map, Africa appears smaller than it is. In a bid to depict the continent's relative size accurately, African leaders are challenging the outdated colonial perspectives for fairer perceptions in education, media, and policy. Should India, which is also depicted smaller than it is, take it up?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-donald-trump-silently-switched-laws-in-india-tariff-case-ieepa-us-court-ruling-tax-rate-duties-russia-war-oil-2768888-2025-08-26",
      "headline": "Why Trump was forced to silently switch laws in India tariff caseIn April, US President Trump used a national emergency law from 1977 to impose tariffs against India and other countries. However, a legal challenge, which is ongoing, forced him to silently switch to a 1962 law to enforce the tariffs. Can the case against the use of the 1977 law have bearings on Trump's tariffs?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/power-optics-xi-to-host-putin-pm-modi-in-show-of-solidarity-amid-trump-trade-war-2776959-2025-08-26",
      "headline": "Xi set to host Putin, PM Modi in show of solidarity amid Trump's tariff threatsAhead of the SCO summit, experts pointed out that while bloc expansion will be a key focus, the mega-event will also serve as Xi Jinping's way of showing the US a mirror of the emerging new world order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-exclusive-regrets-selection-saurashtra-2777107-2025-08-26",
      "headline": "No regrets over last 2 years, proud to have played 100 Tests for India: PujaraIn an exclusive interview, Cheteshwar Pujara said he took the decision to retire a week after contemplating the big call. The Test specialist added that he has no regrets about his career, including the last two years when he was not selected for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreign-nationals-clean-gurugram-drains-and-roads-viral-video-sparks-outrage-2777184-2025-08-26",
      "headline": "Foreign nationals clean Gurugram drains and roads, video sparks outrageResidents from countries including Serbia and France took part in a cleanliness drive across parts of Gurugram on August 24.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manali-kulli-flood-leh-highway-roads-beas-hotel-houses-dextroyed-himachal-2777025-2025-08-26",
      "headline": "Flood fury in Manali, raging Beas waters wash away portion of Leh highwayHeavy rain in Manali caused the Beas River to overflow, triggering floods and landslides that swept away homes, shops, and a hotel, while cutting off highways and inundating several residential areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stevia-monk-fruit-jaggery-sugar-sucrose-which-sweetener-belongs-in-your-diet-2777029-2025-08-26",
      "headline": "Stevia, monk fruit, jaggery: Which sugar belongs in your diet?The first thing to understand is that there's no such thing as \"healthy\" sugar. Honey and jaggery are still considered free sugars, which your body processes just like table sugar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/congundrum-why-dk-shivakumar-cant-wont-jump-ship-2777017-2025-08-26",
      "headline": "Cong-undrum: Why DK Shivakumar can't, won't jump shipWhat makes DK Shivakumar stand apart is his identity as a fighter. He is deeply invested in the Congress and involved in its struggles, but his singing of the RSS anthem in the Karnataka Assembly has spawned a tsunami of speculation. Calling the Gandhi family his \"God\", Shivakumar said he was ready to apologise if the recital hurt anyone, while reaffirming his loyalty to the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-bollywood-couples-arent-waiting-too-long-to-start-families-anymore-2777010-2025-08-26",
      "headline": "Why Bollywood couples aren't waiting too long to start families anymoreParineeti Chopra-Raghav Chadha joining the new wave of Bollywood couples embracing early parenthood reflects a broader shift in attitudes towards balancing career and family life. This change, influenced by evolving societal norms and post-pandemic perspectives, celebrates openness and the choice to prioritise love and legacy without delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/shrekking-problematic-dating-trend-relationship-experts-warn-2777152-2025-08-26",
      "headline": "Shrekking: The problematic dating trend you should stay away fromShrekking, a new dating term, refers to dating someone less attractive than you in the hope of being treated better in the relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-auraiya-monkey-snatches-bag-containing-rs-80000-rains-money-from-tree-viral-video-2777202-2025-08-26",
      "headline": "Monkey snatches bag containing Rs 80,000, rains money from tree in UP. Watch videoWitnesses said the monkey began tearing and tossing the currency, creating a \"rain of money\" in the compound. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/a-pet-for-your-lonely-soul-must-dos-before-adopting-one-2777126-2025-08-26",
      "headline": "A pet for your lonely soul? Must-dos before adopting oneA study says most Indians feel pets boost mental wellbeing, but experts caution that an unprepared pet parent might end up more stressed than happy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/new-world-screwworm-flesh-eating-parasite-infection-first-human-case-confirmed-in-us-from-el-salvador-travel-2777072-2025-08-26",
      "headline": "First human case of flesh-eating parasite confirmed in US: What is it?The US has confirmed its first human case of New World screwworm parasite infestation. Authorities warn of potential livestock risks and advise travellers to take precautions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/long-before-the-silk-road-indias-golden-road-to-china-2775857-2025-08-26",
      "headline": "Cholas and Pallavas traded with China centuries ago, coins tell the storyCoins found in the territories of the Cholas (Thanjavur, Thallikottai) recall an age when the Bay of Bengal was a maritime highway, carrying silk and spices, and connecting the Tamil shores with China. The maritime route not only flourished with trade but also carried cultural influence across Southeast Asia. This route may well be described as the 'Golden Road' that transformed the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/justice-sharad-kumar-sharma-recuses-nclat-case-judicial-influence-insolvency-2777006-2025-08-26",
      "headline": "Tribunal judge opts out of insolvency case, cites 'higher judiciary' pressureJustice Sharad Kumar Sharma of the National Company Law Appellate Tribunal recused himself from a case after receiving a request for a favourable order from a senior judiciary member, prompting procedural changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/micro-dramas-india-fast-growing-mobile-entertainment-5-billion-market-2776893-2025-08-26",
      "headline": "Are micro-dramas India's next big craze? Your cheat sheet on the new OTT formatMicro-dramas are transforming mobile entertainment in India with short, engaging episodes. This format offers new revenue models and production advantages, reshaping content consumption."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-message-cheteshwar-pujara-retirement-2777230-2025-08-26",
      "headline": "Puji, thanks for making my job easier: Virat Kohli's Insta note for ex-teammateVirat Kohli penned an emotional message for Cheteshwar Pujara after he retired from Indian cricket. Pujara, who retired on August 24, ended his career with 7,195 Test runs in 103 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sl-brendon-taylor-returns-zimbabwe-odi-squad-sri-lanka-series-2777222-2025-08-26",
      "headline": "Brendon Taylor set for ODI comeback, named in Zimbabwe's squad for Sri Lanka seriesBrendon Taylor could make his return to ODI cricket since his last in 2021 as he was named for the two-match series against Sri Lanka set to be held in Harare, later in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-3-updates-iga-swiatek-jannik-sinner-coco-gauff-2777216-2025-08-26",
      "headline": "Day 3 LIVE: Musetti vs Perricard underway, Iga Swiatek to play nextUS Open 2025 Day 3 Live Updates: Iga Swiatek will start the day against Colombia's Emiliana Arango while Lorenzo Musetti is currently up against France's Giovanni Mpetshi Perricard. Later in the day, Jannik Sinner, Alexander Zverev and Coco Gauff will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-bwf-world-championships-2025-joakim-oldorff-win-2777217-2025-08-26",
      "headline": "BWF World Championships: HS Prannoy makes solid start with straight games winIndia's HS Prannoy defeated Finland's Joakim Oldorff 21-18, 21-15 in the BWF World Championships 2025 opener. He now faces 2nd seed Anders Antonsen in the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-says-ultimate-goal-was-to-play-for-india-again-wanted-the-comeback-2777201-2025-08-26",
      "headline": "Pujara says ultimate goal was to play for India again: Wanted the comebackCheteshwar Pujara revealed, in an exclusive interview with India Today's Consulting Editor Rajdeep Sardesai and Sports Consulting Editor Nikhil Naz, that his ultimate goal was to play for India again as he was eager to make a comeback to the Test team. Pujara announced his retirement from Indian cricket on August 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hanuma-vihari-andhra-tripura-india-domestic-season-2777196-2025-08-26",
      "headline": "Good enough to play all three formats: Hanuma Vihari joins TripuraAfter leaving Andhra, veteran India batter Hanuma Vihari has joined Tripura for the 2025-26 season, saying that he's still good enough to play all three formats of the game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-beats-kaloyana-nalbantova-second-round-bwf-world-championships-2025-2777171-2025-08-26",
      "headline": "PV Sindhu shakes off slow start to ease into second roundPV Sindhu came up with a solid show in the opening round of BWF World Championships 2025. After a sluggish start, the 2019 champion outclassed Bulgaria's Kaloyana Nalbantova 23-21, 21-6 to ease into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/cadillac-2026-bottas-perez-lineup-horner-rumours-2777139-2025-08-26",
      "headline": "F1: Cadillac ropes in Bottas and Perez for 2026, squash Horner rumoursCadillac F1 have confirmed Valtteri Bottas and Sergio Perez as their drivers for their maiden Formula One campaign in 2026. The team also denied Christian Horner links, as they decided to back Graeme Lowdon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-real-money-gaming-ban-usman-khawaja-australia-government-push-2777122-2025-08-26",
      "headline": "As India bans real-money gaming, Khawaja urges Australia to curb gambling adsAustralian cricketer Usman Khawaja has urged the government to curb gambling ads in sport, warning of their impact on young fans. His call comes after India banned real-money gaming under the Online Gaming Bill 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-beats-kaloyana-nalbantova-second-round-bwf-world-championships-2025-2777171-2025-08-26",
      "headline": "PV Sindhu shakes off slow start to ease into second roundPV Sindhu came up with a solid show in the opening round of BWF World Championships 2025. After a sluggish start, the 2019 champion outclassed Bulgaria's Kaloyana Nalbantova 23-21, 21-6 to ease into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/cadillac-2026-bottas-perez-lineup-horner-rumours-2777139-2025-08-26",
      "headline": "F1: Cadillac ropes in Bottas and Perez for 2026, squash Horner rumoursCadillac F1 have confirmed Valtteri Bottas and Sergio Perez as their drivers for their maiden Formula One campaign in 2026. The team also denied Christian Horner links, as they decided to back Graeme Lowdon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-real-money-gaming-ban-usman-khawaja-australia-government-push-2777122-2025-08-26",
      "headline": "As India bans real-money gaming, Khawaja urges Australia to curb gambling adsAustralian cricketer Usman Khawaja has urged the government to curb gambling ads in sport, warning of their impact on young fans. His call comes after India banned real-money gaming under the Online Gaming Bill 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-exclusive-regrets-selection-saurashtra-2777107-2025-08-26",
      "headline": "No regrets over last 2 years, proud to have played 100 Tests for India: PujaraIn an exclusive interview, Cheteshwar Pujara said he took the decision to retire a week after contemplating the big call. The Test specialist added that he has no regrets about his career, including the last two years when he was not selected for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-on-england-vs-india-test-series-oval-test-2777084-2025-08-26",
      "headline": "Could've played another game in England, can do anything for Test cricket: SirajIndia fast bowler Mohammed Siraj revealed the secret behind his hunger to bowl tireless long spells in Tests and spoke about his love for Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-anthony-gordon-red-card-liverpool-virgil-van-djik-newcastle-united-2777085-2025-08-26",
      "headline": "Anthony Gordon apologises after reckless tackle on Virgil Van DjikAnthony Gordon took to social media to apologise for his horrendous tackle on Virgil van Djik, which resulted in him being sent off. He admitted that he got caught up at the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-dhruv-jurel-asia-cup-2777083-2025-08-26",
      "headline": "Gautam Gambhir's aura makes everyone feel pumped up: Dhruv JurelDhruv Jurel has praised Gautam Gambhir for the way he motivates players in the dressing room. He also values Gambhir's personal support and advice, which gives him confidence and keeps him determined to make the most of future opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/muhammad-imran-asia-cup-shoaib-akhtar-2777059-2025-08-26",
      "headline": "Meet Muhammad Imran: Oman's 'Shoaib Akhtar' gears up for Asia Cup 2025Fast bowler Mumhammad Imran, who went viral for his Shoaib Akhtar-like action and nuance, will play for Oman in the Asia Cup 2025 to be held from September 9 in the UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-preparation-t20-world-cup-virender-sehwag-2777056-2025-08-26",
      "headline": "Asia Cup, a good opportunity to prepare for T20 World Cup: Virender SehwagFormer India cricketer, Virender Sehwag, believes that the upcoming Asia Cup will serve as the perfect testing ground for the Indian team to build their team for the T20 World Cup, slated to take place next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-order-of-play-schedule-sinner-swiatek-2777007-2025-08-26",
      "headline": "US Open, Day 3 Order of Play: Sinner, Swiatek set to be in actionJannik Sinner and Iga Swiatek are set to take the stage on Tuesday evening in the US Open 2025. Here's a list of all the important matches on August 26 and 27 in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jatinder-singh-oman-squad-asia-cup-india-born-2777003-2025-08-26",
      "headline": "Who is Jatinder Singh? Oman's Punjab-born captain set for Asia Cup debutJatinder Singh will lead Oman in the upcoming Asia Cup to be held in the United Arab Emirates from September 9. Oman will begin their campaign against Pakistan on September 12. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/muhammad-imran-asia-cup-shoaib-akhtar-2777059-2025-08-26",
      "headline": "Meet Muhammad Imran: Oman's 'Shoaib Akhtar' gears up for Asia Cup 2025Fast bowler Mumhammad Imran, who went viral for his Shoaib Akhtar-like action and nuance, will play for Oman in the Asia Cup 2025 to be held from September 9 in the UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-preparation-t20-world-cup-virender-sehwag-2777056-2025-08-26",
      "headline": "Asia Cup, a good opportunity to prepare for T20 World Cup: Virender SehwagFormer India cricketer, Virender Sehwag, believes that the upcoming Asia Cup will serve as the perfect testing ground for the Indian team to build their team for the T20 World Cup, slated to take place next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-order-of-play-schedule-sinner-swiatek-2777007-2025-08-26",
      "headline": "US Open, Day 3 Order of Play: Sinner, Swiatek set to be in actionJannik Sinner and Iga Swiatek are set to take the stage on Tuesday evening in the US Open 2025. Here's a list of all the important matches on August 26 and 27 in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jatinder-singh-oman-squad-asia-cup-india-born-2777003-2025-08-26",
      "headline": "Who is Jatinder Singh? Oman's Punjab-born captain set for Asia Cup debutJatinder Singh will lead Oman in the upcoming Asia Cup to be held in the United Arab Emirates from September 9. Oman will begin their campaign against Pakistan on September 12. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-haris-raufs-bold-claim-for-india-vs-pakistan-clash-2776991-2025-08-26",
      "headline": "Haris Rauf makes bold claim for India vs Pakistan clash: We'll win both matchesPakistan fast bowler Haris Rauf has made a bold claim that they will win both of their matches against India in the Asia Cup 2025. India and Paksitan are scheduled to clash on September 14 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-r-ashwin-tribute-instagram-reels-virat-kohli-2776983-2025-08-26",
      "headline": "Pujara's defence deserves reels like Virat Kohli's cover drives: R AshwinFormer India off-spinner R Ashwin has called for greater recognition of Cheteshwar Pujara's cricketing achievements. Pujara retired from international cricket on Sunday, bringing the curtains down on a decorated Test career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasim-akram-asia-cup-test-cricket-india-pakistan-2776984-2025-08-26",
      "headline": "Want India-Pakistan to resume Test cricket: Wasim AkramFormer fast bowler Wasim Akram wants India and Pakistan to resume Test cricket. India last played Pakistan in a red ball game back in 2007 when Pakistan visited India for a 3-match Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-maria-sharapova-us-open-buzz-cut-haircut-2776955-2025-08-26",
      "headline": "Still stuck at the buzz cut: Sharapova approves Alcaraz's new hairdoMaria Sharapova praised Carlos Alcaraz's new buzz cut at the 2025 US Open, admiring its simplicity and his confidence in carrying the look. On Monday, Alcaraz defeated American Reilly Opelka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-didnt-like-me-supported-his-favourite-players-manoj-tiwary-2776903-2025-08-26",
      "headline": "MS Dhoni didn't like me, supported his favourite players: Manoj TiwaryFormer India cricketer Manoj Tiwary has said that despite good performances for India, he never got enough opportunities in the MS Dhoni-led side. He feels that other players got more backing and support during the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-tickets-india-match-dates-2776922-2025-08-26",
      "headline": "Hockey Asia Cup: Fans get free entry in Rajgir stadiumHockey India has announced free tickets for fans who want to watch the Asia Cup 2025. The tournament is being held in Rajgir, Bihar.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-santner-glenn-phillips-finn-allen-will-o-rourke-new-zealand-injuries-2776873-2025-08-26",
      "headline": "Santner, Phillips among big names injured for New Zealand ahead of long home seasonNew Zealand players Mitchell Santner, Finn Allen, Glenn Phillips and Will O' Rourke are suffering from various injuries ahead of their long home season, where they will host Australia, England, West Indies and South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/oman-cricket-controversy-squad-announced-asia-cup-2776842-2025-08-26",
      "headline": "Asia Cup debutants Oman announce squad, Jatinder Singh to lead 17-member squadOman became the sixth team to announce their squad for the Asia Cup. The side announced a 17-member team, with opener Jastinder Singh leading the side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-breaks-silence-on-joe-root-breaking-his-record-2776825-2025-08-26",
      "headline": "Sachin Tendulkar breaks silence on Joe Root nearing his all-time Test runs milestoneLegendary India batter Sachin Tendulkar recently praised Joe Root's prolific run in Tests as he's approaching his record for most runs in the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-first-round-opelka-2776791-2025-08-26",
      "headline": "Buzz cut Alcaraz powers himself into 2nd round with straight sets winCarlos Alcaraz debuted a fresh buzz cut and won his US Open first-round match. His strong performance overshadowed mixed fan reactions to his new look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rio-ngumoha-liverpool-youngest-scorer-stoppage-time-winner-newcastle-premier-league-2776778-2025-08-26",
      "headline": "16-year-old Ngumoha scripts history as Liverpool down Newcastle in injury timeSixteen-year-old Rio Ngumoha scored a stunning stoppage-time winner for Liverpool against Newcastle. His historic goal secured a thrilling 3-2 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-cheteshwar-pujara-virat-kohli-rohit-sharma-2776783-2025-08-26",
      "headline": "Pujara is a whitewalker, his contributions are no less than Kohli and Rohit: R AshwinFormer India all-rounder Ravichandran Ashwin has compared Cheteshwar Pujara to a 'Whitewalker', mentioning that his contributions to Indian cricket were as similar as Virat Kohli and Rohit Sharma."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}