{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-rally-ending-in-india-mcx-global-price-crash-explained-2806485-2025-10-22",
      "headline": "Will gold, silver prices fall in India tomorrow as global rates crash?Global gold and silver have cooled after historic gains, while MCX remains closed. Will Indian investors face similar declines tomorrow, or is this a buying opportunity? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-ease-import-tariffs-boost-trade-ties-report-pm-modi-donald-trump-2806464-2025-10-22",
      "headline": "US likely to cut tariffs on Indian imports to 15%-16%: ReportThe proposed agreement mainly focusses on the energy and agriculture sectors. One of the key elements under discussion is India's gradual reduction of crude oil imports from Russia, a move that aligns with Washington's efforts to limit global dependence on Russian energy supplies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/samvat-2082-high-conviction-stock-ideas-market-rally-choice-broking-2806433-2025-10-22",
      "headline": "Samvat 2082: 15 high-conviction stock ideas amid ongoing market rallyAnalysts see higher returns ahead as Dalal Street enters Samvat 2082. Check out Choice Broking's top 15 stock picks span defence, tech, and premium consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-update-open-close-wednesday-october-22-diwali-balipratipada-nse-bse-today-2806404-2025-10-22",
      "headline": "BSE, NSE holiday: Is stock market open or closed for trading today?The stock market was closed on Tuesday on account of Diwali and only two more holidays remain this year. One for Guru Nanank Jayanti on November 05 and the other for Christmas, December 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-india-rates-is-bullion-rally-over-should-you-buy-latest-update-yellow-metal-2806397-2025-10-22",
      "headline": "Gold, silver prices fall: Is the bullion rally ending?Gold prices have gained nearly 56% this year due to strong demand from central banks, ongoing geopolitical tensions, and rising expectations of rate cuts by major central banks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/muhurat-trading-ends-in-green-cipla-bajaj-finserv-among-top-gainers-2806126-2025-10-21",
      "headline": "Muhurat Trading ends in green; Cipla, Bajaj Finserv among top gainersThe BSE Sensex and NSE Nifty50 both closed in the green, led by gains in Cipla and Bajaj Finserv, even as mid-session profit booking trimmed early advances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/business-today/video/samvat-2082-experts-see-new-highs-bet-on-domestic-sectors-2806115-2025-10-21",
      "headline": "Samvat 2082: Experts see new highs, bet on domestic sectorsFor investors, Bandyopadhyay recommends focusing on domestic growth stories. \"Cement, infrastructure, construction, and capital goods will lead the charge,\" he noted, highlighting Ultratech Cement, L&T, and Bharti Airtel as top picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-250-points-nifty-above-25900-infosys-gains-over-1-2806070-2025-10-21",
      "headline": "Muhurat Trading 2025: Sensex, Nifty dip after strong opening; Infosys up 1%The BSE Sensex rose 180.76 points, or 0.21%, to 84,544.13, while the NSE Nifty50 climbed 62.60 points, or 0.24%, to 25,905.75 at 1:50 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-bonus-investment-tips-maximise-profit-growth-mistakes-to-avoid-2806011-2025-10-21",
      "headline": "How to make the most of your Diwali bonus and build long-term wealthTurn your Diwali bonus into a stepping stone for long-term financial security with these expert-backed tips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-rebound-buy-or-wait-dip-muhurat-trading-diwali-2805982-2025-10-21",
      "headline": "Gold hits Rs 1.30 lakh again, silver at Rs 1.58 lakh: Buy now or wait for a dip?Gold and silver are regaining momentum amid festive demand and global uncertainty. Investors should buy with discipline, stagger purchases, and treat bullion as a long-term hedge rather than chasing short-term spikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/diwali-muhurat-trading-2025-how-to-make-the-most-of-todays-one-hour-special-session-2805947-2025-10-21",
      "headline": "Muhurat Trading today: Your quick guide to today's one-hour special sessionAs Muhurat Trading 2025 begins this afternoon, optimism runs high on Dalal Street. With Nifty near record highs and liquidity improving, experts suggest discipline, stock selection, and long-term focus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-on-diwali-as-reliance-bank-stocks-shine-2805815-2025-10-20",
      "headline": "Sensex, Nifty end higher on Diwali as Reliance, bank stocks shineThe BSE Sensex rose 0.5% to 84,363.37, while the NSE Nifty50 gained 0.49% to 25,851—both hitting fresh one-year highs. Over the past four sessions, the indices have climbed 2.8%, leaving them less than 2% away from their all-time highs scaled in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesThe Chinese Commerce Ministry has alleged that the measures by India violate several WTO obligations, including the principle of national treatment, and constitute import substitution subsidies, which are explicitly prohibited under the multi-lateral trade rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-on-october-21-everything-investors-need-to-know-special-market-session-2805749-2025-10-20",
      "headline": "Muhurat Trading on October 21: Check timing, trade strategy and moreMuhurat Trading will take place on October 21 this year. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm, and a closing session until 3:05 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-shares-jump-q2-results-diwali-portfolio-buy-sell-explained-2805722-2025-10-20",
      "headline": "Reliance shares jump 3% after Q2 results. Should it be in your Diwali portfolio?Around 10:20 am, shares of Reliance Industries rose 3.22% to Rs 1,462.60 on the Bombay Stock Exchange (BSE). The stock's sharp upmove added to the broader market rally on Dalal Street as sentiment turned upbeat following a string of solid earnings reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-rare-earth-export-curbs-impact-eu-industries-auto-defence-response-glbs-2805666-2025-10-20",
      "headline": "EU to hold urgent talks on European industries hit by China's rare earth curbsChina, the world's leading producer of the minerals used to make magnets crucial to the auto, electronics and defence industries, this month announced new controls on the export of rare-earth technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-on-thamma-box-office-opening-record-thamma-breaks-myth-that-only-superstar-films-work-on-diwali-2806615-2025-10-22",
      "headline": "Ayushmann Khurrana: Thamma breaks myth that only superstar films work on Diwali Ayushmann Khurrana's 'Thamma' scored the biggest opening of his career with Rs 25.11 crore on Diwali. The actor called it a dream-come-true moment and said the film proves audiences still value original stories.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/krishna-shroff-losing-chhoriyan-chali-gaon-anita-2806602-2025-10-22",
      "headline": "Krishna Shroff on losing Chhoriyan Chali Gaon to Anita: It was a personal win After emerging as the runner-up of 'Chhoriyan Chali Gaon', Krishna Shroff opened up about her equation with actor Anita Hassanandani. In an exclusive conversation, Krishna also shared how the show's host, Rannvijay Singha, influenced her journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-disappointed-with-paradha-theatrical-run-i-am-really-sad-2806604-2025-10-22",
      "headline": "Anupama Parameswaran disappointed with Paradha's theatrical run: I am really sad Anupama Parameswaran addresses the underwhelming box office performance of her recent Telugu film Paradha, acknowledging her disappointment despite positive reviews and a diverse slate of film projects this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb19-episode-57-altaf-raja-concert-ashnoor-jealous-over-farrhana-abhishek-bond-2806608-2025-10-22",
      "headline": "BB19 episode 57: Altaf Raja concert, Ashnoor jealous over Farrhana-Abhishek bond Altaf Raja's Diwali performance had Neelam, Tanya, and Malti dancing and enjoying the festive cheer in the 'Bigg Boss 19' house. Meanwhile, tensions simmered as Ashnoor grew jealous of Abhishek and Farrhana's playful interactions, and Gaurav clashed with housemates over unwashed spoons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-44-thanuja-and-emmanuels-clash-sparks-house-drama-2806547-2025-10-22",
      "headline": "Bigg Boss Telugu 9 Day 44: Thanuja and Emmanuel's clash sparks house drama The October 22 episode of 'Bigg Boss Telugu 9' brought an emotional storm inside the house, with relationships tested, tempers flaring, and unexpected shifts in alliances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-praises-mari-selvaraj-bison-kaalamaadan-support-tamil-cinema-2806541-2025-10-22",
      "headline": "Rajinikanth praises Mari Selvaraj's Bison Kaalamaadan: Your effort amazes me Superstar Rajinikanth called director Mari Selvaraj to praise his new film 'Bison Kaalamaadan'. Selvaraj shared details of the call and expressed gratitude on behalf of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/if-lokah-was-made-in-telugu-people-wouldve-picked-it-apart-says-naga-vamsi-2806531-2025-10-22",
      "headline": "If Lokah was made in Telugu, people would've picked it apart, says Naga Vamsi Producer Naga Vamsi said the Malayalam superhero 'Lokah Chapter 1: Chandra', dubbed as 'Kotha Lokah', was better received in Telugu than it might have been as a native film. He also noted smaller films like 'Little Hearts' are seeing surprising success ahead of Ravi Teja's 'Mass Jathara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-asrani-regretted-doing-sunny-leones-mastizaade-decried-vulgarity-in-films-2806551-2025-10-22",
      "headline": "When Asrani regretted doing Sunny Leone's Mastizaade, decried vulgarity in films Veteran actor Asrani passed away on October 20 in Mumbai. In a past interview, he criticised rising vulgarity in films like 'Mastizaade' and expressed faith that Indian audiences would always value family-oriented cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chitrangda-singh-shares-hospital-update-deletes-post-later-2806557-2025-10-22",
      "headline": "Actor Chitrangda Singh shares hospital update, deletes post later Actor Chitrangda Singh shared a hospital update on Instagram, assuring fans she'll be \"back running like a hare soon\" despite not revealing the reason for her admission. She continues to work on projects including 'Battle of Galwan' and recently starred in 'Housefull 5'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jitendra-kumar-dark-role-bhagwat-crime-thriller-zee5-2806514-2025-10-22",
      "headline": "Jitendra Kumar on Bhagwat: Nothing in this role is similar to what I've done before Jitendra Kumar takes a bold leap with a dark character in 'Bhagwat Chapter One: Raakshas'. His role challenges his usual image and offers audiences a gripping crime thriller experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-bhagwat-real-story-not-ott-trends-akshay-shere-2806527-2025-10-22",
      "headline": "Exclusive: Bhagwat inspired by real story not OTT trends, says director Akshay Shere Director Akshay Shere drew inspiration for his film 'Bhagwat Chapter One: Raakshas' from a newspaper report, rather than go with the current wave of thrillers on streaming platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arshad-warsi-did-the-bads-of-bollywood-because-aryan-is-srk-son-ghafoor-to-return-2806521-2025-10-22",
      "headline": "Arshad Warsi: Did Ba***ds because Aryan is SRK's son; Ghafoor to return In an interview with India Today, Arshad Warsi revealed that he joined Aryan Khan's Netflix series 'The Ba**ds of Bollywood' out of affection for Shah Rukh Khan's family, calling Aryan \"a different mind.\" The actor also teased Gafoor's return in Season 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asrani-dance-viral-video-on-stage-days-before-death-2806484-2025-10-22",
      "headline": "Asrani danced joyfully on stage days before death. Watch viral video Late actor Asrani was filmed dancing joyfully just ten days before his death on October 20. The video has been posted on social media by singer Pinky Maidasani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kylo-ren-redemption-standalone-star-wars-film-adam-driver-steven-soderbergh-rejected-disney-2806511-2025-10-22",
      "headline": "Adam Driver wanted a solo Kylo Ren movie, but the Force said no Adam Driver reveals he and director Steven Soderbergh developed a character-driven Star Wars film focusing on Kylo Ren's redemption, but Disney ultimately declined the project. The script, appreciated by Lucasfilm executives, did not proceed due to concerns over the character's fate in the main saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asrani-dies-at-84-salman-khan-hema-malini-pay-tribute-2806480-2025-10-22",
      "headline": "True legend of laughter: Salman Khan, Hema Malini pay tribute to late actor Asrani Veteran actor and comedian Govardhan Asrani died in Mumbai at age 84 after a brief hospitalisation. Hema Malini and Salman Khan paid their last respects to the comedy legend on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-deewane-ki-deewaniyat-box-office-day-1-decent-opening-despite-thamma-wave-for-harshvardhan-rane-sonam-bajwa-film-2806490-2025-10-22",
      "headline": "Ek Deewane Ki Deewaniyat box office Day 1: Decent opening despite Thamma wave 'Ek Deewane Ki Deewaniyat', starring Harshvardhan Rane and Sonam Bajwa, released on Tuesday and saw a promising box office start. The film earned Rs 8.5 crore nett in India despite competition from 'Thamma', which collected Rs 24.5 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mira-kapoor-urges-to-stop-normalising-firecrackers-amid-severe-pollution-concern-2806488-2025-10-22",
      "headline": "Mira Kapoor urges to stop normalising firecrackers amid severe pollution concern Mira Rajput Kapoor urged people to stop bursting firecrackers after Diwali, calling out the hypocrisy of celebrating at the cost of the environment. Her post came as air quality in Delhi and Mumbai dipped to hazardous levels, sparking widespread discussion online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sujeeth-addresses-rumours-rift-producer-dvv-danayya-og-film-production-2806450-2025-10-22",
      "headline": "OG director Sujeeth dismisses rift rumours with producer Danayya: Lot is being said 'They Call Him OG' director Sujeeth responded to speculation about a rift with producer DVV Danayya. The director emphasised the importance of respecting the filmmaking process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harrdy-sandhu-wife-zenith-sidhu-welcome-second-child-our-blessing-has-arrived-2806468-2025-10-22",
      "headline": "Harrdy Sandhu, wife Zenith Sidhu welcome second child: Our blessing has arrived Singer Harrdy Sandhu and his wife Zenith Sidhu welcomed their second child on Diwali, sharing the happy news with fans online. The announcement doubled the festive joy as friends and fans flooded the couple with love and congratulations."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shama-mohamed-slams-gautam-gambhir-sarfaraz-khan-non-selection-2806563-2025-10-22",
      "headline": "Because Sarfaraz is Khan? Congress's Shama Mohamed jabs Gambhir in selection rowCongress spokesperson Shama Mohamed questioned India coach Gautam Gambhir over the non-selection of Sarfaraz Khan in the recent national team assignments despite his good form in domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/modi-trump-phone-call-russia-oil-purchase-claim-shift-from-india-pakistan-conflict-2806610-2025-10-22",
      "headline": "'I ended India-Pak conflict' now passe, Trump has a new playlistModi-Trump call: Over the past week, Trump repeated four times that PM Modi assured him of halting Russian oil purchases. Surprisingly, Trump's boast about stopping the India-Pakistan conflict, which he has repeated over 50 times, has been MIA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/teesta-water-dispute-master-plan-china-involvement-investment-red-flag-for-india-delhi-explained-2806137-2025-10-22",
      "headline": "Why protest over China-backed Teesta plan in Bangladesh is a red flag for DelhiThousands in Bangladesh's Chattogram held a massive rally demanding the implementation of the China-backed Teesta River Master Plan. However, experts say the plan involving Beijing, amid stalled water-sharing talks with India, could pose strategic risks for New Delhi due to its proximity to the sensitive Siliguri Corridor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-abolished-kafala-system-what-is-kafeel-uae-indian-worker-migrant-gulf-jobs-explained-2806518-2025-10-22",
      "headline": "How kafala turns Indians into slaves and why Saudi scrapped itThe kafala system in Gulf countries enables employers to seize passports, control movement, institutionalise abuse and turn millions of migrant workers, with the largest chunk from India, into \"modern-day slaves\". Saudi Arabia has finally scrapped the 50-year-old setup, but several Gulf Cooperation Council countries still facilitate abuse under the kafala system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-slams-taj-hotel-for-asking-her-not-to-sit-cross-legged-while-dining-posts-video-2806561-2025-10-22",
      "headline": "Woman slams Taj for asking her not to sit cross-legged, posts video from restaurantIn a now-viral video, Shradha Sharma narrated how a hotel manager approached her during the meal and told her not to sit cross-legged as it was making other guests uncomfortable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranveer-singh-share-first-pictures-daughter-dua-padukone-singh-diwali-2806412-2025-10-22",
      "headline": "Bollywood gushes over baby Dua: Sonam Kapoor to Priyanka Chopra, celebs shower loveBollywood is abuzz as Deepika Padukone and Ranveer Singh share the first clear pictures of their daughter, Dua Padukone Singh, this Diwali. The heartwarming post, celebrating their baby girl's adorable debut, drew affectionate wishes from stars across the industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-ease-import-tariffs-boost-trade-ties-report-pm-modi-donald-trump-2806464-2025-10-22",
      "headline": "US likely to cut tariffs on Indian imports to 15%-16%: ReportThe proposed agreement mainly focusses on the energy and agriculture sectors. One of the key elements under discussion is India's gradual reduction of crude oil imports from Russia, a move that aligns with Washington's efforts to limit global dependence on Russian energy supplies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-india-navy-coastline-ins-vikrant-narendra-modi-diwali-2806415-2025-10-22",
      "headline": "Pakistan's vulnerable coastline and fear of the Indian NavyDuring the 88 hours of Operation Sindoor, Pakistani warships were forced to flee their home ports in Karachi, highlighting how vulnerable the country's coastline is to Indian naval attacks and blockades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-sierra-to-launch-in-november-powetrain-design-interiors-all-you-need-to-know-2806538-2025-10-22",
      "headline": "All you need to know about Tata Sierra: The nostalgic SUV returns next monthTata Motors is set to revive the legendary Sierra SUV this November, blending its nostalgic 1990s charm with modern design, advanced technology, and both ICE and electric powertrain options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pick-paul-ingrassia-withdraws-had-sent-racist-never-trust-indian-text-for-vivek-ramaswamy-2806458-2025-10-22",
      "headline": "Trump's White House General Counsel pick too racist even for RepublicansPaul Ingrassia withdrew as Trump's nominee for the Office of Special Counsel after racist and inflammatory texts, including a slur targeting Vivek Ramaswamy, surfaced. His nomination collapsed amid GOP opposition and controversy over past conduct."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-lahore-imperial-college-london-denies-claim-overseas-campus-pmln-maryam-nawaz-2806505-2025-10-22",
      "headline": "Pakistan has egg on face as Imperial College London busts Lahore campus claimsThe Punjab government of Pakistan announced a new campus of London's Imperial College campus in Lahore. However, the UK university quickly denied the claim, saying it had \"no such plans\". The fake claim by the Maryam Nawaz-led provincial government, which she herself amplified, sparked criticism from an alumnus of the Imperial College, who slammed the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-phone-call-details-diwali-pakistan-terrorism-2806454-2025-10-22",
      "headline": "PM Modi's Diwali call with Trump carries strong message on Pakistan, terrorModi-Trump call: In their second phone call in as many months, PM Modi used the occasion to underscore India's firm stance against terrorism, subtly flagging New Delhi's discomfort with Washington's growing proximity to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/samantha-prabhu-weighs-50kg-eats-100g-protein-nutritionist-says-its-not-for-all-2806496-2025-10-22",
      "headline": "Samantha Prabhu weighs 50kg, eats 100g protein. Nutritionist says it's not for allCelebrity diets can inspire, but blindly following them can backfire. Samantha Prabhu eats 100 g of protein daily at 50 kg, but Nutritionist warn it's not for everyone. Here's what average Indian women should aim for and how to meet it naturally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/presidents-chopper-wheels-sink-into-fresh-concrete-in-kerala-requires-manual-push-2806459-2025-10-22",
      "headline": "Video: Staff pushes President's chopper after it sinks into new helipadPresident Droupadi Murmu's helicopter wheels got stuck in depressions on a freshly concreted helipad at Pramadam. The incident occurred as she landed in Kerala for her Sabarimala visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/government-jobs-rs-30000-monthly-salary-tejashwi-yadav-announces-scheme-for-women-of-self-help-groups-2806471-2025-10-22",
      "headline": "Tejashwi Yadav takes on NDA's Jeevika Didi scheme with permanent job promiseAnnouncing big poll promises, RJD leader Tejashwi Yadav promised Rs 30,000 salary for Jeevika Didis, loan waivers and insurance coverage if his party forms government in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-going-cash-only-and-ditching-upi-help-you-save-money-2806248-2025-10-22",
      "headline": "Can going cash-only (and ditching UPI) help you save money?Is taking a break from UPI apps and going cash-only to curb unnecessary spending and save money a good idea? Finance experts have a lot to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/feeling-the-festive-hangover-not-just-your-body-your-brain-needs-a-reset-too-2806461-2025-10-22",
      "headline": "Feeling the festive hangover? Not just your body, your brain needs a reset tooHas all the festive celebration left you feeling tired? Don't just rest your body, cleanse your brain too, before you dive back into your routine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chitradurga-teacher-arrested-video-shows-student-kicked-beaten-for-making-a-call-2806517-2025-10-22",
      "headline": "Caught on camera: Karnataka teacher drags, slaps, kicks student for using phoneA teacher in Chitradurga, Karnataka, was arrested for thrashing a student over using a mobile phone. The incident happened months ago, surfaced recently, and sparked outrage. The student later left the school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aqi-air-pollution-level-experts-warn-firecrackers-noida-ncr-weather-update-2806572-2025-10-22",
      "headline": "Delhi's post-Diwali pollution is at a 5-year-high. What experts say?Delhi's air turned toxic after Diwali as smoke from fireworks mixed with stagnant winter air, trapping pollutants close to the ground and pushing pollution levels to their worst in years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/comet-lemmon-ladakh-hanle-india-science-event-capture-space-comets-space-stars-2806515-2025-10-22",
      "headline": "Watch comet Lemmon passes over India in stunning flybyAstronomers note that such comets are remnants of the early solar system, containing pristine material billions of years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-asrani-regretted-doing-sunny-leones-mastizaade-decried-vulgarity-in-films-2806551-2025-10-22",
      "headline": "When Asrani regretted doing Sunny Leone's Mastizaade, decried vulgarity in filmsVeteran actor Asrani passed away on October 20 in Mumbai. In a past interview, he criticised rising vulgarity in films like 'Mastizaade' and expressed faith that Indian audiences would always value family-oriented cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-duck-perth-matt-renshaw-2806506-2025-10-22",
      "headline": "Virat Kohli inspires even in failure: How Perth duck calmed Aussie debutant's nerveIndia tour of Australia: Virat Kohli's rare failure in Perth turned into a source of calm for Australian debutant Matt Renshaw. As nerves crept in before his first ODI innings, seeing the Indian maestro fall for a duck reminded Renshaw that even the greats have off days – and that failure is part of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mehul-choksi-extradition-belgian-court-affirms-indian-charges-2806494-2025-10-22",
      "headline": "Setback for Mehul Choksi, court says offences in India punishable in Belgium alsoA Belgian court has ruled that the offences cited by India in its extradition request for Mehul Choksi are also recognised crimes in Belgium. This decision marks a significant setback for Choksi's efforts to avoid extradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-rally-ending-in-india-mcx-global-price-crash-explained-2806485-2025-10-22",
      "headline": "Will gold, silver prices fall in India tomorrow as global rates crash?Global gold and silver have cooled after historic gains, while MCX remains closed. Will Indian investors face similar declines tomorrow, or is this a buying opportunity? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-on-thamma-box-office-opening-record-thamma-breaks-myth-that-only-superstar-films-work-on-diwali-2806615-2025-10-22",
      "headline": "Ayushmann Khurrana: Thamma breaks myth that only superstar films work on DiwaliAyushmann Khurrana's 'Thamma' scored the biggest opening of his career with Rs 25.11 crore on Diwali. The actor called it a dream-come-true moment and said the film proves audiences still value original stories.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-disappointed-with-paradha-theatrical-run-i-am-really-sad-2806604-2025-10-22",
      "headline": "Anupama Parameswaran disappointed with Paradha's theatrical run: I am really sadAnupama Parameswaran addresses the underwhelming box office performance of her recent Telugu film Paradha, acknowledging her disappointment despite positive reviews and a diverse slate of film projects this year."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-live-streaming-afc-champions-league-2-when-and-where-to-watch-2806614-2025-10-22",
      "headline": "FC Goa vs Al Nassr FC: When and where to watch AFC Champions League 2 clash Al Nassr will be aiming to keep their winning momentum going in the AFC Champions League 2 as they take on FC Goa in Fatorda. The Indian side has lost their first two games in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shama-mohamed-slams-gautam-gambhir-sarfaraz-khan-non-selection-2806563-2025-10-22",
      "headline": "Because Sarfaraz is Khan? Congress's Shama Mohamed jabs Gambhir in selection row Congress spokesperson Shama Mohamed questioned India coach Gautam Gambhir over the non-selection of Sarfaraz Khan in the recent national team assignments despite his good form in domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-praises-shubman-gill-captaincy-bulldog-instinct-england-tour-2806548-2025-10-22",
      "headline": "The bulldog in Shubman Gill comes out when team needs him most: Ricky Ponting Ricky Ponting said that he has been impressed by Shubman Gill's captaincy so far ahead of the second ODI between Australia and India. Gill was made captain earlier in the year and is tipped to be the skipper for India in all three formats soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-asif-afridi-oldest-bowler-record-five-wicket-haul-2806528-2025-10-22",
      "headline": "Pakistan's Asif Afridi, 38, becomes oldest to take 5-wicket haul on Test debut Pakistan vs South Africa: 38-year-old Asif Afridi became the oldest bowler to take a five-wicket haul on Test debut. The left-arm spinner ran through South Africa's middle-order on Days 2 and 3 of the Rawalpindi Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-champions-league-olympiacos-2806519-2025-10-22",
      "headline": "Hattrick hero Fermin hails perfect El Clasico prep after Barca rout Olympiacos FC Barcelona routed Olympiacos in the Champions League. Fermin Lopez hit his maiden hattrick for the club as they capped off a perfect game ahead of El Clasico on Sunday, October 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-duck-perth-matt-renshaw-2806506-2025-10-22",
      "headline": "Virat Kohli inspires even in failure: How Perth duck calmed Aussie debutant's nerve India tour of Australia: Virat Kohli's rare failure in Perth turned into a source of calm for Australian debutant Matt Renshaw. As nerves crept in before his first ODI innings, seeing the Indian maestro fall for a duck reminded Renshaw that even the greats have off days – and that failure is part of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-sitanshu-kotak-press-conference-2806503-2025-10-22",
      "headline": "Virat-Rohit get thumbs up from Sitanshu Kotak ahead of Adelaide ODI India vs Australia: India batting coach Sitanshu Kotak has given the vote of confidence to Virat Kohli and Rohit Sharma ahead of the 2nd ODI clash of the series. Kotak said that both batted well in the nets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/laliga-cancels-barcelona-villarreal-miami-match-fan-protests-2806452-2025-10-22",
      "headline": "LaLiga cancels Barcelona's match in Miami after severe backlash from fans LaLiga has cancelled Barcelona's match against Villarreal, which was scheduled to take place in Miami. The move came against immense backlash from fans and pundits who complained about the disruption of schedule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/asia-cup-trophy-war-pak-minister-naqvi-refuses-to-hand-over-prize-to-india-bcci-warns-icc-action-ytvd-2806425-2025-10-22",
      "headline": "Asia Cup Trophy War: Pak Minister Naqvi Refuses to Hand Over Prize to India, BCCI Warns ICC Action This special report focuses on the continuing deadlock over the Asia Cup 2025 trophy between the Board of Control for Cricket in India (BCCI) and Asian Cricket Council (ACC) President Mohsin Naqvi. The controversy ignited after Naqvi, who is also Pakistan's Interior Minister and PCB Chairman, refused to part with the trophy, instead urging 'that there be a presentation ceremony at which a BCCI officer, office bearer that is, and a participating player of the Indian team collect the trophy directly from him'. The demand came in response to a stern letter from the BCCI asking for the trophy to be sent to India. Following the refusal, the BCCI has warned it will escalate the matter to the International Cricket Council (ICC) if the trophy is not handed over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-hussey-the-grade-cricketer-podcast-sachin-tendulkar-2806414-2025-10-22",
      "headline": "Would be 5000 runs past Sachin Tendulkar had I debuted early: Michael Hussey Former Australia cricketer Michael Hussey believes that he would have crossed Sachin Tendulkar if he had debuted earlier in international cricket. Hussey, lovingly known as Mr. Cricket debuted for Australia at the age of 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-sitanshu-kotak-press-conference-2806503-2025-10-22",
      "headline": "Virat-Rohit get thumbs up from Sitanshu Kotak ahead of Adelaide ODI India vs Australia: India batting coach Sitanshu Kotak has given the vote of confidence to Virat Kohli and Rohit Sharma ahead of the 2nd ODI clash of the series. Kotak said that both batted well in the nets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/laliga-cancels-barcelona-villarreal-miami-match-fan-protests-2806452-2025-10-22",
      "headline": "LaLiga cancels Barcelona's match in Miami after severe backlash from fans LaLiga has cancelled Barcelona's match against Villarreal, which was scheduled to take place in Miami. The move came against immense backlash from fans and pundits who complained about the disruption of schedule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/asia-cup-trophy-war-pak-minister-naqvi-refuses-to-hand-over-prize-to-india-bcci-warns-icc-action-ytvd-2806425-2025-10-22",
      "headline": "Asia Cup Trophy War: Pak Minister Naqvi Refuses to Hand Over Prize to India, BCCI Warns ICC Action This special report focuses on the continuing deadlock over the Asia Cup 2025 trophy between the Board of Control for Cricket in India (BCCI) and Asian Cricket Council (ACC) President Mohsin Naqvi. The controversy ignited after Naqvi, who is also Pakistan's Interior Minister and PCB Chairman, refused to part with the trophy, instead urging 'that there be a presentation ceremony at which a BCCI officer, office bearer that is, and a participating player of the Indian team collect the trophy directly from him'. The demand came in response to a stern letter from the BCCI asking for the trophy to be sent to India. Following the refusal, the BCCI has warned it will escalate the matter to the International Cricket Council (ICC) if the trophy is not handed over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-hussey-the-grade-cricketer-podcast-sachin-tendulkar-2806414-2025-10-22",
      "headline": "Would be 5000 runs past Sachin Tendulkar had I debuted early: Michael Hussey Former Australia cricketer Michael Hussey believes that he would have crossed Sachin Tendulkar if he had debuted earlier in international cricket. Hussey, lovingly known as Mr. Cricket debuted for Australia at the age of 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lance-watson-polo-family-legacy-olympic-dream-2806215-2025-10-22",
      "headline": "Polo, family, and an Olympic dream: Inside Lance Watson's remarkable journeyA third-generation polo player and one of the shining stars of the legendary Jaipur polo team, Lance Watson opens up about his journey in the sport, his love for India, and the Olympic dream he sees alongside his kids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-rohit-sharma-virat-kohli-not-rusty-sitanshu-kotak-2806410-2025-10-22",
      "headline": "Rohit-Kohli not rusty, no need to jump the gun on them: Sitanshu KotakIndia batting coach Sitanshu Kotak believes that there is no need to jump the gun on Virat Kohli and Rohit Sharma. Speaking ahead of the 2nd ODI against Australia, Kotak called for patience with the senior duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-2nd-odi-harshit-rana-criticism-favourite-gambhir-2806389-2025-10-22",
      "headline": "Is Harshit Rana criticised for clicks or is the scrutiny warranted?Harshit Rana's selection has sparked debate, balancing performance, perception, and patronage. At 23, he's a promising pacer in a thin Indian fast-bowling pool. Criticism is fair, but noise and nepotism claims risk overshadowing his potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-vs-new-zealand-world-cup-2806381-2025-10-22",
      "headline": "With India's campaign on the edge, time running out for captain Harmanpreet KaurWomen's World Cup: With India's campaign veering off track after three straight defeats, time is running out for captain Harmanpreet Kaur to rally her side and inspire a turnaround, even as their hopes of a semifinal spot remain in their own hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-crash-out-dls-womens-world-cup-2806345-2025-10-21",
      "headline": "South Africa knock Pakistan out in rain-hit clash, storm to top of tableWomen's World Cup: South Africa extended their impressive ICC Women's World Cup run, defeating Pakistan via the Duckworth-Lewis-Stern (DLS) method to climb to the top of the points table. Pakistan, meanwhile, crashed out of the semi-final race as their winless streak in Colombo continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-rain-washes-out-indias-nets-session-ahead-of-crucial-new-zealand-clash-2806329-2025-10-21",
      "headline": "Heavy rain washes out India's nets session before crucial New Zealand clashHeavy rains in Navi Mumbai on Tuesday forced India to cancel their training session ahead of Thursday's crucial Women's World Cup clash against New Zealand. With the weather and net run rate potentially playing a decisive role, India face a tense battle to secure a spot in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-test-hopes-no-3-role-india-a-squads-exclude-2806309-2025-10-21",
      "headline": "Sarfaraz may have to bat at No. 3 for Mumbai to stay in India's scheme: SourcesThough omitted from the India A squads, Sarfaraz Khan's chances of returning to the Test side may depend on batting at No. 3 for Mumbai, as selectors lean on multi-skilled players to fill the middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thibaut-courtois-criticises-laliga-miami-match-decision-2806312-2025-10-21",
      "headline": "Courtois slams LaLiga over Miami match, says it distorts fairness and competitionReal Madrid goalkeeper Thibaut Courtois criticises LaLiga's decision to hold Barcelona's away match in Miami. The move has sparked protests and raised concerns about league fairness and consultation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-crash-out-dls-womens-world-cup-2806345-2025-10-21",
      "headline": "South Africa knock Pakistan out in rain-hit clash, storm to top of tableWomen's World Cup: South Africa extended their impressive ICC Women's World Cup run, defeating Pakistan via the Duckworth-Lewis-Stern (DLS) method to climb to the top of the points table. Pakistan, meanwhile, crashed out of the semi-final race as their winless streak in Colombo continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-rain-washes-out-indias-nets-session-ahead-of-crucial-new-zealand-clash-2806329-2025-10-21",
      "headline": "Heavy rain washes out India's nets session before crucial New Zealand clashHeavy rains in Navi Mumbai on Tuesday forced India to cancel their training session ahead of Thursday's crucial Women's World Cup clash against New Zealand. With the weather and net run rate potentially playing a decisive role, India face a tense battle to secure a spot in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-test-hopes-no-3-role-india-a-squads-exclude-2806309-2025-10-21",
      "headline": "Sarfaraz may have to bat at No. 3 for Mumbai to stay in India's scheme: SourcesThough omitted from the India A squads, Sarfaraz Khan's chances of returning to the Test side may depend on batting at No. 3 for Mumbai, as selectors lean on multi-skilled players to fill the middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thibaut-courtois-criticises-laliga-miami-match-decision-2806312-2025-10-21",
      "headline": "Courtois slams LaLiga over Miami match, says it distorts fairness and competitionReal Madrid goalkeeper Thibaut Courtois criticises LaLiga's decision to hold Barcelona's away match in Miami. The move has sparked protests and raised concerns about league fairness and consultation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-shai-hope-akeal-hosein-all-spin-attack-super-over-win-bangladesh-dhaka-odi-2806305-2025-10-21",
      "headline": "Bangladesh bottle it again, this time vs West Indies in rare Super Over encounterWest Indies triumphed over Bangladesh in a thrilling Super Over after a historic all-spin bowling strategy. The dramatic finish highlighted spin's growing influence and raised questions on Bangladesh's batting resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/asia-cup-trophy-war-bcci-vs-acc-chief-warns-of-icc-escalation-ytvd-2806289-2025-10-21",
      "headline": "Asia Cup Trophy War: BCCI vs ACC Chief, Warns of ICC EscalationThe focus of this special report is the escalating dispute between the BCCI and Asian Cricket Council (ACC) Chairman Mohsin Naqvi over the Asia Cup trophy. The Board of Control for Cricket in India (BCCI) is demanding the handover of the silverware after the Indian team refused to accept it from Naqvi, who is also Pakistan's Interior Minister, following their victory. BCCI secretary Devajit Saikia told India Today, 'We have written to ACC to give the trophy to the champion team. We are awaiting a response.' The board has made it clear that if the ACC does not comply, it will escalate the matter to the International Cricket Council (ICC). This unprecedented situation has garnered support for the BCCI from the cricket boards of Sri Lanka and Afghanistan, further intensifying pressure on the ACC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rishabh-pants-comeback-confirmed-to-captain-india-a-after-injury-layoff-ytvd-2806287-2025-10-21",
      "headline": "Rishabh Pant's Comeback Confirmed! To Captain India A After Injury LayoffThis special report focuses on the much-awaited return of Indian wicketkeeper-batter Rishabh Pant to competitive cricket. 'It's been confirmed the wicketkeeper batter will be leading India A in two four-day matches against a visiting South Africa A side ahead of the much-anticipated test series between India and South Africa.' Sidelined since July this year due to a foot fracture sustained during the Anderson-Tendulkar trophy, Pant is set to captain the India A squad. The two four-day matches will be played in Bengaluru, with the first starting on October 30. This series is seen as a crucial warm-up for Pant ahead of the senior team's Test series against South Africa. He has been undergoing rehabilitation in Bengaluru and has been in contact with the medical team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-kl-rahul-batting-order-india-vs-australia-perth-odi-2806270-2025-10-21",
      "headline": "KL Rahul's nearly batted at all 11 positions: McGrath on India star's roleGlenn McGrath said that he was surprised by the constant batting spot changes for KL Rahul. McGrath said that the constant shuffling can affect Rahul's confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-mohsin-naqvi-reaction-india-asia-cup-trophy-row-bcci-letter-2806261-2025-10-21",
      "headline": "Send a player to collect Asia Cup: Adamant Mohsin Naqvi responds to BCCI letterAsian Cricket Council (ACC) President Mohsin Naqvi has refused to hand over the Asia Cup trophy to India, despite a formal demand from the Board of Control for Cricket in India (BCCI). Instead, Naqvi, who also serves as chairman of the Pakistan Cricket Board (PCB), has directed the BCCI to organise a presentation ceremony in India and send a player to collect the trophy from him personally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-exits-french-open-super-750-first-round-loss-nhat-nguyen-2806245-2025-10-21",
      "headline": "Lakshya Sen crashes out of French Open after humbling loss in 1st roundWorld No. 16 Lakshya Sen suffered a straight-games defeat to Ireland's Nhat Nguyen in the French Open Super 750 men's singles opening round in Paris, marking an early and unexpected exit for the Indian shuttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-keshav-maharaj-reaction-7-wicket-haul-babar-azam-rawalpindi-2806244-2025-10-21",
      "headline": "PAK vs SA: Rawalpindi hero Keshav Maharaj reveals how he outsmarted Babar AzamSouth Africa left-arm spinner Keshav Maharaj revealed how he outfoxed star Pakistan batter Babar Azam during his seven-wicket haul in the first innings of the Rawalpindi Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-prioritises-test-cricket-mental-freshness-ashes-opener-perth-2806243-2025-10-21",
      "headline": "Older and wiser, Steve Smith prioritises mental freshness for Ashes 2025Smith reflects on career adjustments and mental strategies as he prepares to captain Australia in the Ashes opener, emphasising the importance of prioritisation and mental well-being."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}