{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-hints-at-major-overhaul-in-epfo-with-30-rollout-2778669-2025-08-29",
      "headline": "Sanjeev Sanyal hints at major overhaul in EPFO with 3.0 rolloutEconomist Sanjeev Sanyal has signalled that the Employees' Provident Fund Organisation (EPFO) is gearing up for a major transformation, with the much-awaited EPFO 3.0 promising faster, simpler, and more digital-first services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trumps-50-percent-tariffs-could-cost-india-usd-55-60-billion-warns-jefferies-global-head-of-equity-strategy-chris-wood-2778657-2025-08-29",
      "headline": "Trump's draconian tariffs may cost India $55-60 billion, warns Jefferies' Chris WoodChris Wood argues that the US tariffs are as much political as economic. He links the steep duties to Donald Trump's \"personal pique\" at being denied a role in resolving India-Pakistan tensions after their four-day conflict in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-rich-but-time-poor-why-real-wealth-is-about-balance-explains-ca-2778622-2025-08-29",
      "headline": "Cash-rich but time-poor? Why real wealth is about balance, explains CAIn today's fast-paced world, people often chase bigger salaries and titles, but an expert says money alone cannot define wealth. What matters more, he argues, is the freedom to spend time on things that truly count."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fan-cycles-300-km-to-meet-him-actor-promises-support-for-her-children-2778848-2025-08-29",
      "headline": "Chiranjeevi fan cycles 300 km to meet him, actor promises support for her childrenA woman named Rajeshwari pedalled all the way from Andhra Pradesh to Hyderabad to meet her idol, Chiranjeevi. The fan travelled 312 kilometres from Adoni to meet the star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-reynolds-instagram-misses-blake-lively-posts-split-rumours-swirl-2778725-2025-08-29",
      "headline": "Ryan Reynolds' Instagram misses Blake Lively posts, split rumours swirlFans are speculating that Ryan Reynolds may have archived photos of Blake Lively on Instagram after failing to post for her birthday, further fuelling rumours about the state of their marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shodha-review-a-mediocre-thriller-with-an-engaging-case-let-down-by-a-flat-resolution-2778850-2025-08-29",
      "headline": "Shodha review: Intriguing case overshadowed by lacklustre resolutionRelease Date:Fri Aug 29, 2025Shodha Kannada series review: Starring Pawan Kumar, Siri Ravikumar and Arun Sagar in the lead, 'Shodha' presents a case set in Madikeri, Karnataka where a family deals with trust issues and mistaken identities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/odum-kuthira-chadum-kuthira-review-fahadh-faasil-film-is-an-absurd-comedy-that-is-painfully-unfunny-2778831-2025-08-29",
      "headline": "Odum Kuthira Chadum Kuthira review: Fahadh Faasil in painfully unfunny comedyRelease Date:Fri Aug 29, 2025Odum Kuthira Chadum Kuthira movie review: Director Althaf Salim's romantic comedy, starring Fahadh Faasil and Kalyani Priyadardhan, is an absurd romantic comedy that struggles to find its footing. Surprisingly, even Fahadh Faasil isn't able to elevate it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-recalls-ex-partner-calling-him-on-her-wedding-day-on-bigg-boss-19-2778811-2025-08-29",
      "headline": "Amaal Mallik recalls ex-partner calling him on her wedding day on Bigg Boss 19Amaal Mallik shared on 'Bigg Boss 19' how his ex-girlfriend called him on her wedding day, but he refused to go out of respect for his parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jimin-song-da-eun-saga-exposes-toxic-fan-culture-why-idols-in-love-are-punished-2778750-2025-08-29",
      "headline": "Jimin-Song Da-eun saga exposes toxic fan culture: Why idols in love are punishedBTS Jimin and Song Da-eun dating rumours sparked backlash among fans. In this week's K-fix, we will dive deep inside K-pop's toxic fan culture - no dating rules, and why idols keep apologising for falling in love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tu-pehli-tu-aakhri-shah-rukh-khan-new-the-bads-of-bollywood-track-as-his-favourite-2778806-2025-08-29",
      "headline": "Tu Pehli Tu Aakhri: SRK calls new The Ba***ds of Bollywood track his favouriteShah Rukh Khan expressed his fondness for the new track 'Tu Pehli Tu Aakhri' from 'The Ba***ds of Bollywood'. The series will premiere on September 18 on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-venice-film-festival-jay-kelly-premiere-standing-ovation-adam-sandler-2778704-2025-08-29",
      "headline": "George Clooney, Adam Sandler's Jay Kelly gets standing ovation at Venice premiereActor George Clooney braved a sinus infection and rain for the premiere of Jay Kelly at Venice International Film Festival. His co-star Adam Sandler was also present at the screening as the movie received a standing ovation from the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/do-you-wanna-partner-trailer-tammanaah-diana-run-beer-start-up-in-quirky-dramedy-2778745-2025-08-29",
      "headline": "Do You Wanna Partner trailer: Tamannaah, Diana run beer start-up in quirky dramedyThe trailer for the comedy-drama 'Do You Wanna Partner', featuring actors Tamannaah Bhatia and Diana Penty, was released on August 29. The series highlights female friendship and entrepreneurship in a male-dominated society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/param-sundari-movie-review-sidharth-malhotra-janhvi-kapoor-can-sell-kerala-trips-not-love-2778728-2025-08-29",
      "headline": "Param Sundari review: Sidharth-Janhvi can sell Kerala trips, not loveRelease Date:Fri Aug 29, 2025'Param Sundari' review: Tushar Jalota's romantic comedy starring Sidharth Malhotra and Janhvi Kapoor delivers stunning Kerala visuals and good music, but lacks chemistry and a compelling story. Yet another predictable and forgettable Bollywood love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-meets-sabyasachi-mukherjee-at-taj-hotel-mumbai-2778710-2025-08-29",
      "headline": "Zeenat Aman admits she once failed to recognise SabyasachiVeteran actor Zeenat Aman shares a nostalgic encounter with designer Sabyasachi Mukherjee at Mumbai's Taj hotel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-welcomes-isro-scientist-haripriya-saketpuram-who-quit-game-at-rs-25-lakh-can-you-answer-2778697-2025-08-29",
      "headline": "KBC 17: Isro scientist fails to answer Rs 25 lakh question. Can you?In the latest episode of 'Kaun Banega Crorepati', Amitabh Bachchan welcomed Isro scientist to the hot seat, who quit the game at Rs 25 lakh. Can you answer the answer? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rocky-anthony-ippolito-to-play-young-sylvester-stallone-in-biopic-amazon-mgm-2778647-2025-08-29",
      "headline": "Anthony Ippolito to portray young Sylvester Stallone in biopic I Play RockyActor Anthony Ippolito is set to take on the role of young Sylvester Stallone in 'I Play Rocky'. The film reveals the true underdog story behind the making of the iconic 'Rocky' movie and Stallone's relentless pursuit of his dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-x-reviews-sidharth-malhotra-janhvi-kapoor-shine-weak-second-half-2778680-2025-08-29",
      "headline": "Param Sundari X reviews: Sidharth-Janhvi shine in a film with weak second halfActors Sidharth Malhotra and Janhvi Kapoor's 'Param Sundari' opens to mixed reactions. Audiences praise the chemistry, but criticise the predictable second half.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-mallik-accuses-awez-darbar-nagma-mirajkar-gauahar-khan-reacts-2778651-2025-08-29",
      "headline": "Bigg Boss 19: Gauahar reacts after Amaal says Awez-Nagma get work because of himBigg Boss 19 heats up as Amaal Mallik accuses Awez Darbar and Nagma Mirajkar of taking no stand inside the house. Gauahar Khan defends the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-marks-ganesh-chaturthi-shefali-jariwala-memory-fulfills-her-wish-2778659-2025-08-29",
      "headline": "Parag Tyagi marks Ganesh Chaturthi in Shefali Jariwala's memory, fulfills her wishParag Tyagi celebrated Ganesh Chaturthi in memory of Shefali Jariwala. He shared a video along with a heartfelt note while remembering his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-credit-for-janhvi-kapoor-chuttamale-choreographer-needs-to-be-celebrated-as-much-as-a-star-2778627-2025-08-29",
      "headline": "Bosco Martis demands equal credit for choreographers after Chuttamalle's successChoreographer Bosco Martis has voiced his concerns about inadequate recognition for his work on the hit song 'Chuttamalle' from the Telugu film Devara Part 1.  He called for equal respect and visibility for choreographers alongside stars and music directors in the Indian film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-and-playboi-carti-to-headline-lollapalooza-india-2026-2778592-2025-08-29",
      "headline": "Linkin Park and Playboi Carti to headline Lollapalooza India 2026Lollapalooza India 2026 has announced a historic line-up with Linkin Park set to perform in the country for the first time, alongside headliner Playboi Carti. The Mumbai festival has been scheduled for January 24–25, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/songs-of-paradise-review-saba-azad-soni-razdan-bring-noor-begum-alive-2778557-2025-08-29",
      "headline": "Songs of Paradise review: Saba delivers, Soni Razdan adds soul to Kashmiri sagaRelease Date:Fri Aug 29, 2025'Songs of Paradise' review: Prime Video's latest offering, 'Songs of Paradise', beautifully blends Kashmir's breathtaking landscapes with its rich musical heritage, tracing the inspiring journey of Noor Begum, a woman who defied patriarchy through her voice. Anchored by powerful performances and soulful music, the film is a poignant ode to resilience and art."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-china-visit-japan-xi-jinping-bilateral-relations-indo-china-ties-trump-tariff-2778821-2025-08-29",
      "headline": "India, China must unite for stable world economic order: PM's message in JapanPM Narendra Modi, ahead of his China visit, stressed the need for stable and friendly India-China relations to ensure regional peace and global economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-in-japan-shigeru-ishiba-press-conference-make-in-india-trade-trump-tariffs-2778799-2025-08-29",
      "headline": "Japanese tech and Indian talent a winning combination, says PM in TokyoThe remarks come as India looks to deepen its relationship with traditional allies like Japan and ramp up investments amid a downturn in ties with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahua-moitra-amit-shah-shocking-remark-infiltration-bangladesh-2778856-2025-08-29",
      "headline": "Mahua Moitra's STSJ shocker on Amit ShahTrinamool MP Mahua Moitra's shocking remarks on Amit Shah have invited strong condemnation from the BJP. A complaint has also been filed against Moitra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-loses-putri-wardani-paris-quarterfinals-world-championship-2778855-2025-08-29",
      "headline": "PV Sindhu misses historic medal as resurgent run ends in quartersPV Sindhu's quest for a sixth World Championship medal ended with a heartbreaking defeat in Paris. Sindhu lost to higher-ranked Putri Wardani in a fiercely fought three-game quarter-finals.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariff-india-aide-peter-navarro-post-social-media-sanctions-personal-attack-swami-vivekananda-kanyakumari-2778787-2025-08-29",
      "headline": "Battle against India is personal for Trump, his aide Navarro lets it slipPeter Navarro, President Trump's senior counsellor on trade, has given it away that the record-high tariffs against India are not just over Russian oil or trade. With his language and images in particular, Navarro has revealed that Trump and his cronies are making it personal against PM Modi. The attack is directed at India's civilisational roots."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-cancels-ex-us-vice-president-kamala-harriss-secret-service-protection-given-by-joe-biden-2778858-2025-08-29",
      "headline": "Trump cancels Kamala Harris's Secret Service protectionKamala Harris was the Democratic Presidential candidate opposite her Republican rival, Donald Trump, and conceded a massive defeat in the November 5, 2024 election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/param-sundari-movie-review-sidharth-malhotra-janhvi-kapoor-can-sell-kerala-trips-not-love-2778728-2025-08-29",
      "headline": "Param Sundari review: Sidharth-Janhvi can sell Kerala trips, not loveRelease Date:Fri Aug 29, 2025'Param Sundari' review: Tushar Jalota's romantic comedy starring Sidharth Malhotra and Janhvi Kapoor delivers stunning Kerala visuals and good music, but lacks chemistry and a compelling story. Yet another predictable and forgettable Bollywood love story. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sikh-man-shot-dead-us-los-angeles-gatka-martial-art-machette-footage-viral-2778730-2025-08-29",
      "headline": "US cops shoot dead Sikh man performing gatka on road, release footageLos Angeles police claimed that Gurpreet Singh was wielding a machete and was shot dead after he refused to comply and tried to attack the cops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-personal-pique-singling-out-india-tariffs-not-allowed-mediate-pakistan-conflict-2778696-2025-08-29",
      "headline": "India tariffs result of Trump's personal grudge: JefferiesThe report by Jefferies said Trump's 'personal pique' saw the US impose a 50% tariff on India, the highest among American trading partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-must-apologise-amit-shah-on-abuse-to-pm-modi-his-mother-at-bihar-rally-2778648-2025-08-29",
      "headline": "Rahul Gandhi must apologise: Amit Shah on abuse to PM, his mother at Bihar rallyAmit Shah condemned Congress leaders for allegedly using derogatory words against PM Modi and his late mother during a Bihar rally, calling it the \"greatest fall in politics.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-gold-fixation-midas-touch-white-house-gilding-obsession-lobbying-with-lusture-change-global-relations-2778268-2025-08-29",
      "headline": "How Trump's gold fixation is bringing Midas curse to White HouseDonald Trump has brought the golden flashiness of his Trump Towers to the White House, changing its look and feel. The whole world now knows about Trump's gold obsession and Apple's Tim Cook has even \"bribed\" him with a golden plaque. This is how the Midas curse is bringing a golden murkiness to the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/taylor-swift-engagement-diamond-ring-indian-roots-golconda-mines-history-mir-jumla-persia-link-nadir-shah-2778454-2025-08-29",
      "headline": "How a poor Persian oilman's son rose to rule Kohinoor's nest in IndiaThe rock that Taylor Swift flaunted after her engagement brought India's Golconda diamond mines into focus. The Koh-i-Noor, the world's most famous and costliest diamond, was from India's Golconda mines, and was looted and taken to Persia by invader Nadir Shah. About 150 years before that, a Persian oilman's son, Mir Jumla, who helped Aurangzeb in his succession battle, came to rule the Golconda mines, the nest of the Kohinoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-jaish-e-mohammed-suspects-depart-kathmandu-malaysia-deny-india-entry-bihar-police-claims-2778736-2025-08-29",
      "headline": "Nepal denies reports of Jaish terrorists entering Bihar: They flew to MalaysiaNepal stated that the three Pakistani nationals flew from Kathmandu to Kuala Lumpur on separate flights at different times, contradicting Bihar Police's claim that they had entered the poll-bound state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/body-of-80-year-old-man-found-in-indores-dilapidated-house-mauled-by-stray-dogs-2778830-2025-08-29",
      "headline": "Elderly man's body, mauled by street dogs, found in dilapidated house in IndoreThe half-decomposed body of an 80-year-old man was recovered from his dilapidated house in Indore on Thursday. Neighbours and relatives found street dogs mauling the corpse after breaking open the door."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/iodised-salt-pink-black-sendha-namak-low-sodium-salt-is-better-health-benefits-2778741-2025-08-29",
      "headline": "Iodised, pink, black, low-sodium: Which salt actually wins?While people debate which salt is \"healthiest,\" the real problem is not which salt — but how much."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-plea-bengali-migrants-illegal-detention-deportation-centre-warns-systemic-infiltration-2778785-2025-08-29",
      "headline": "There's systemic infiltration: Centre on plea over detention of Bengali migrantsThe Supreme Court issued notices to the Centre on the plea alleging that Bengali-speaking Muslim migrants are being illegally detained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jimin-song-da-eun-saga-exposes-toxic-fan-culture-why-idols-in-love-are-punished-2778750-2025-08-29",
      "headline": "Jimin-Song Da-eun saga exposes toxic fan culture: Why idols in love are punishedBTS Jimin and Song Da-eun dating rumours sparked backlash among fans. In this week's K-fix, we will dive deep inside K-pop's toxic fan culture - no dating rules, and why idols keep apologising for falling in love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/what-is-daruma-doll-gifted-pm-narendra-modi-japan-visit-significance-summit-chief-priest-tokyo-here-is-more-explained-2778589-2025-08-29",
      "headline": "What is Daruma doll gifted to PM Modi, what's its significance?During his two-day visit to Japan for the India-Japan Annual Summit, Prime Minister Narendra Modi was presented with a Daruma doll by the chief priest of Shorinzan-Daruma-ji Temple. The Daruma doll is a hollow, round, brightly painted figure with blank white eyes. It symbolises perseverance, resilience, good fortune, and the pursuit of goals.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-india-vs-china-harmanpreet-singh-hat-trick-rajgir-2778805-2025-08-29",
      "headline": "Asia Cup: Hat-trick hero Harmanpreet saves India, edges China 4-3 in RajgirHarmanpreet Singh was the star of the show as India edged past China 4-3 to start their Asia Cup campaign with a win. The Chinese team troubled the hosts throughout the game and pushed them all the way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/xi-jinping-secret-letter-spurred-delhi-beijing-thaw-during-trumps-tariff-war-report-2778543-2025-08-29",
      "headline": "Xi's secret letter spurred Delhi-Beijing thaw during Trump's tariff war: ReportIn his letter to President Droupadi Murmu, later passed on to PM Modi, Chinese President Xi Jinping sought to \"test the waters on improving ties.\" Indian officials said Xi reached out directly to Indian President Droupadi Murmu in March, during heightened US trade tensions with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/du-issues-spot-round-allocation-for-ug-admission-2025-supernumerary-seats-also-allotted-2778686-2025-08-29",
      "headline": "Over 67,000 seats filled in Delhi University admissions, spot round 1 allocation outDelhi University has released the CSAS UG 2025 spot round results, with 7,908 seats allotted from nearly 30,000 applications."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/donald-bradman-australia-last-baggy-green-cap-auction-aud-2778878-2025-08-29",
      "headline": "Bradman's final baggy green cap sells for AUD 438,500 in historic auctionSir Donald Bradman's last baggy green cap from the 1948 Invincibles tour sold for AUD 438,500. The National Museum of Australia secured the iconic piece to preserve cricket heritage and inspire future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-malewar-double-century-auqib-dar-hat-trick-duleep-trophy-day-2-2778879-2025-08-29",
      "headline": "Danish Malewar retires out after 203, Auqib Dar's hat-trick takes spotlightDanish Malewar scored a brilliant double century while Auqib Dar claimed a hat-trick on Day 2 of the Duleep Trophy. Their standout helped their respective teams establish control in the quarterfinal clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-netherlands-t20i-series-sylhet-squads-schedule-2778864-2025-08-29",
      "headline": "Bangladesh vs Netherlands T20I series Live Streaming: Squads, all you need to knowBAN vs NED T20I series: Bangladesh will host the Netherlands in their first-ever bilateral T20I series starting August 30 in Sylhet. The series offers crucial preparation for both teams ahead of upcoming major tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-loses-putri-wardani-paris-quarterfinals-world-championship-2778855-2025-08-29",
      "headline": "PV Sindhu misses historic medal as resurgent run ends in quartersPV Sindhu's quest for a sixth World Championship medal ended with a heartbreaking defeat in Paris. Sindhu lost to higher-ranked Putri Wardani in a fiercely fought three-game quarter-finals.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-trent-alexander-arnold-dropped-england-world-cup-qualifier-squad-thomas-tuchel-2778844-2025-08-29",
      "headline": "Trent Alexander-Arnold snubbed from England squad for World Cup QualifiersTrent Alexander-Arnold has been dropped from Thomas Tuchel's England squad for the World Cup qualifiers. The Real Madrid right-back has struggled for form in Spain, while Rashford earns a place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/png-cricketer-kiplin-doriga-charged-robbery-icc-challenge-league-jersey-2778824-2025-08-29",
      "headline": "PNG cricketer charged with robbery during ICC Challenge League in JerseyPapua New Guinea wicketkeeper-batsman Kiplin Doriga has been charged with robbery during the ICC Challenge League in Jersey. The case has been classified as serious, with Doriga remanded in custody until 2025, raising questions about team impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-india-vs-china-harmanpreet-singh-hat-trick-rajgir-2778805-2025-08-29",
      "headline": "Asia Cup: Hat-trick hero Harmanpreet saves India, edges China 4-3 in RajgirHarmanpreet Singh was the star of the show as India edged past China 4-3 to start their Asia Cup campaign with a win. The Chinese team troubled the hosts throughout the game and pushed them all the way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-vs-putri-wardani-live-score-bwf-world-championships-quarters-2778784-2025-08-29",
      "headline": "Highlights: Heartbreak for PV Sindhu, loses quarterfinal to Putri WardaniBWF World Championships 2025 Highlights: PV Sindhu loses quarterfinal to higher-ranked Putri Wardani 14-21, 21-13, 16-21 as she misses out on a sixth medal in the history of the competition. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-tanisha-crasto-dhruv-kapila-medal-2778733-2025-08-29",
      "headline": "World Championships: Tanisha Crasto and Dhruv Kapila fall short of historic medalBWF World Championships 2025: India's Dhruv Kapila and Tanisha Crasto fell one step short of a historic medal at the world meet. The 17th-ranked pair los to World No. 4 Chen Tangjie and Toh Eewei of Malaysia on Friday in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simone-biles-meets-coco-gauff-inspiring-confidence-us-open-2025-2778729-2025-08-29",
      "headline": "Watch: Coco Gauff meets gymnastics legend Simone Biles at US OpenAmerican star Coco Gauff thanked her inspiration, decorated US gymnast Simone Biles, when they met at Arthur Ashe Stadium on Thursday, after the tennis star defeated Donna Vekic 7-6(5), 6-2 in the second round of the 2025 US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-opening-day-korea-japan-malaysia-win-2778721-2025-08-29",
      "headline": "Asia Cup 2025: Champions Korea hammer Chinese Taipei, Malaysia and Japan winChampions South Korea started their Asia Cup title defence with a bang as they swept aside Chinese Taipei. Japan breezed past Kazakhstan and Malaysia overcame an early wobble to defeat Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-india-vs-china-harmanpreet-singh-hat-trick-rajgir-2778805-2025-08-29",
      "headline": "Asia Cup: Hat-trick hero Harmanpreet saves India, edges China 4-3 in RajgirHarmanpreet Singh was the star of the show as India edged past China 4-3 to start their Asia Cup campaign with a win. The Chinese team troubled the hosts throughout the game and pushed them all the way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-vs-putri-wardani-live-score-bwf-world-championships-quarters-2778784-2025-08-29",
      "headline": "Highlights: Heartbreak for PV Sindhu, loses quarterfinal to Putri WardaniBWF World Championships 2025 Highlights: PV Sindhu loses quarterfinal to higher-ranked Putri Wardani 14-21, 21-13, 16-21 as she misses out on a sixth medal in the history of the competition. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-tanisha-crasto-dhruv-kapila-medal-2778733-2025-08-29",
      "headline": "World Championships: Tanisha Crasto and Dhruv Kapila fall short of historic medalBWF World Championships 2025: India's Dhruv Kapila and Tanisha Crasto fell one step short of a historic medal at the world meet. The 17th-ranked pair los to World No. 4 Chen Tangjie and Toh Eewei of Malaysia on Friday in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simone-biles-meets-coco-gauff-inspiring-confidence-us-open-2025-2778729-2025-08-29",
      "headline": "Watch: Coco Gauff meets gymnastics legend Simone Biles at US OpenAmerican star Coco Gauff thanked her inspiration, decorated US gymnast Simone Biles, when they met at Arthur Ashe Stadium on Thursday, after the tennis star defeated Donna Vekic 7-6(5), 6-2 in the second round of the 2025 US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-opening-day-korea-japan-malaysia-win-2778721-2025-08-29",
      "headline": "Asia Cup 2025: Champions Korea hammer Chinese Taipei, Malaysia and Japan winChampions South Korea started their Asia Cup title defence with a bang as they swept aside Chinese Taipei. Japan breezed past Kazakhstan and Malaysia overcame an early wobble to defeat Bangladesh. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}