{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/millennials-vs-gen-z-how-their-crypto-portfolios-and-risk-appetites-differ-2820655-2025-11-16",
      "headline": "Millennials vs Gen Z: How their crypto portfolios and risk appetites differMillennials and Gen Z are both active in the world of crypto, yet they approach it from very different angles. Their portfolios, strategies and risk appetite reveal how differently each generation views money, technology and long-term investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-execute-will-inheritance-property-transfer-documents-time-needed-executor-probate-importance-2820294-2025-11-15",
      "headline": "How to execute a will properly, so your family avoids delays and disputesThe truth is, writing a will is only half the job. The real work begins afterwards. One missing document, one unclear clause or one forgotten instruction is enough to turn a simple inheritance into months of delay and dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-explains-why-your-12-equity-returns-arent-real-2819899-2025-11-14",
      "headline": "Expert explains why your 12% equity returns aren't realMost people believe a 12% equity return is strong growth, but according to an expert, the actual gain after inflation and taxes is much smaller. Here's why your money may not be growing as much as you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fresh-ed-summons-to-anil-ambani-in-fraud-case-after-he-skips-second-date-2819849-2025-11-14",
      "headline": "Fresh ED summons to Anil Ambani in fraud case after he skips second dateIn a continued push to seek clarity in the ongoing investigation, the ED has served another notice to Anil Ambani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-green-bihar-election-nda-win-it-stocks-down-2819839-2025-11-14",
      "headline": "Sensex, Nifty bounce back after volatile day as markets cheer Bihar winThe S&P BSE Sensex gained 84.11 points to close at 84,562.78, while the NSE Nifty50 added 30.90 points to end at 25,910.05.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/corporate-security-india-ceos-face-highest-risk-violence-misinformation-insider-threats-world-security-report-2819791-2025-11-14",
      "headline": "Why safety worries are growing for India's top executivesThe report shows that 71% of corporate security chiefs in India believe the risk of violence against chief executives has increased in the last two years, marking the highest level recorded globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bnpl-india-invisible-debt-trap-salary-repayments-2819772-2025-11-14",
      "headline": "Using BNPL regularly? Your salary may be hiding an invisible debt trapHaving easy access to credit at the tap of your finger via BNPL feels convenient, but could those small pay-later purchases be quietly building into a debt trap that only shows up on payday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-ssy-to-fds-3-smart-investment-schemes-every-parent-should-know-2819741-2025-11-14",
      "headline": "From SSY to FDs: 3 smart investment schemes every parent should knowPlanning for a child's future requires wise financial choices. From government-backed savings to bank deposits, these three investments offer stability and dependable returns for parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/verizon-to-slash-15-percent-of-workforce-whats-driving-the-massive-cuts-2819712-2025-11-14",
      "headline": "Verizon to slash 15% of workforce. What's driving the massive cuts?The telecom giant has been under pressure as rivals AT&T and T-Mobile continue to offer cheaper plans and aggressive promotions, especially during the launch of new iPhone models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bars-coins-or-digital-how-indians-are-buying-gold-differently-after-prices-crossed-rs-1-lakh-2819695-2025-11-14",
      "headline": "Bars, coins or digital: How Indians are buying gold differently after prices crossed Rs 1 lakhFor the first time, gold breached the psychological barrier of Rs 1 lakh, a milestone that once seemed out of reach. Until that point, conversations around gold were filled with speculation: \"Will gold really touch one lakh?\" But once that threshold was crossed, the sentiment changed entirely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-dip-slightly-today-is-the-recent-rally-losing-steam-2819674-2025-11-14",
      "headline": "Gold, silver dip slightly today. Is the recent rally losing steam?At the time of writing, at 12.00 pm, gold on the Multi Commodity Exchange (MCX) was slightly down by 0.30%, trading at Rs 1,26,366 per 10 grams. Silver followed a similar trend, falling 0.69% to Rs 1,61,350 per kg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pine-labs-shares-extend-rally-after-strong-ipo-debut-details-here-2819678-2025-11-14",
      "headline": "Pine Labs shares extend rally after strong IPO debut. Details hereThe stock listed at Rs 242 on the Bombay Stock Exchange, which was a 9.5 percent premium to its issue price. It later surged to Rs 283.70, a gain of 28.5 percent from the issue level. Around 12.33 pm, the shares were trading at Rs 257.35, valuing the company at Rs 29,556.63 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/michael-burry-movie-big-short-predicted-us-housing-market-bubble-closes-hedge-fund-reason-2819665-2025-11-14",
      "headline": "Investor who foresaw 2008 US home crisis closes hedge fund. Here's whyThe investor has spent the past year warning about what he sees as bubbles in the market. He has sharply criticised big technology stocks and the boom in artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-buyback-record-date-retail-investor-guide-18000-crore-2819624-2025-11-14",
      "headline": "Infosys share buyback record date today: What investors should knowInfosys is conducting the buyback through the tender offer route, where it will purchase shares at Rs 1,800 per share. This is more than 18% above the recent market price of around Rs 1,515."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/do-taxpayers-always-get-interest-on-delayed-income-tax-refunds-find-out-2819606-2025-11-14",
      "headline": "Do taxpayers always get interest on delayed income tax refunds? Find outIf your income tax refund is taking longer than expected, you may wonder whether the tax department must pay you interest for the delay. The law does provide for interest, but not in every situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/capillary-technologies-ipo-day-1-check-latest-gmp-and-subscription-status-2819607-2025-11-14",
      "headline": "Capillary Technologies IPO Day 1: Check latest GMP and subscription statusCapillary operates in the AI-led SaaS and customer loyalty solutions space, serving more than 410 brands across 47 countries. The company turned profitable in FY25 after two years of losses, reporting Rs 14.15 crore in profit. Revenue increased to Rs 598 crore in FY25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pine-labs-share-price-today-ipo-listing-premium-hold-or-book-profit-2819597-2025-11-14",
      "headline": "Pine Labs shares list at 10% premium: Should you hold or book profit now?Pine Labs' better-than-expected debut and strong institutional support boosted early sentiment, but analysts say elevated valuations and intense fintech competition mean investors should balance listing-day gains with disciplined, long-term positioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-daughter-name-be-removed-from-pension-records-government-explains-2819582-2025-11-14",
      "headline": "Can a daughter's name be removed from pension records? Government explainsSeveral departments had asked whether a daughter's name should be removed from the family list after an employee retires. To settle the confusion, the DoP&PW issued an Office Memorandum clearly stating that her name must stay in the records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/adani-group-to-invest-over-rs-1-lakh-crore-in-andhra-pradesh-2819565-2025-11-14",
      "headline": "Adani Group to invest over Rs 1 lakh crore in Andhra Pradesh: ReportSpeaking at a state event on Friday, Karan Adani said the investments are aimed at expanding the conglomerate's infrastructure footprint in the southern state and strengthening its long-term presence in high-growth sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sagility-share-price-jumps-over-6-percent-key-reasons-block-deal-2819557-2025-11-14",
      "headline": "Sagility share price jumps over 6% today. What's driving the rally?Sagility's shares jumped after a large block deal hit the tape, with buyers overpowering supply. The stock's sharp rise suggests traders are betting the stake sale won't derail its near-term momentum."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-anuj-sachdeva-defends-friend-gaurav-khanna-against-fake-allegations-2820744-2025-11-16",
      "headline": "Bigg Boss 19: Anuj Sachdeva defends friend Gaurav Khanna against fake allegations Actor Anuj Sachdeva backed his friend, 'Bigg Boss 19' contestant Gaurav Khanna, slamming accusations of him being fake by confirming his genuine nature. Anuj also criticised Amaal Mallik for using abusive language about women and speaking ill of someone's mother, questioning his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rohit-shetty-confirms-khatron-ke-khiladi-15-will-return-in-2026-on-bigg-boss-19-2820823-2025-11-16",
      "headline": "Khatron Ke Khiladi returns with season 15 in 2026: Rohit Shetty on Bigg Boss 19 Director Rohit Shetty confirmed that 'Khatron Ke Khiladi 15' will return next year, making the announcement on the 'Bigg Boss 19' set with Salman Khan. The news assured fans who feared the reality show had been dropped, as Shetty suggested some 'Bigg Boss' contestants could join the next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/imran-khan-acting-comeback-bhumi-pednekar-danish-aslam-new-project-2820801-2025-11-16",
      "headline": "Imran Khan calls comeback a natural progression. Read all about the film here After a decade-long hiatus, actor Imran Khan prepares for his cinematic return with a deeply personal film. His comeback reflects significant life changes and artistic growth, marking a new phase in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-warns-fans-against-whatsapp-impersonator-messaging-for-photoshoots-2820788-2025-11-16",
      "headline": "Aditi Rao Hydari warns fans against WhatsApp impersonator messaging for photoshoots Aditi Rao Hydari warned fans and photographers about an impersonator using her pictures and name on WhatsApp to message people about photoshoots. She confirmed that she never contacts people for work using a personal number and urged followers to only engage through her official team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-manoj-bajpayee-recreates-iconic-dialogue-from-big-b-deewar-in-bhojpuri-2820756-2025-11-16",
      "headline": "KBC 17: Manoj Bajpayee recreates iconic dialogue from Big B's Deewar in Bhojpuri Manoj Bajpayee, Jaideep Ahlawat, and Sharib Hashmi featured in 'Kaun Banega Crorepati 17', where Manoj and Amitabh Bachchan exchanged famous film dialogues in Bhojpuri. The show premieres on Sony Liv and Sony Entertainment Television at 9 pm IST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prem-chopra-discharged-from-hospital-family-says-actor-is-hale-and-hearty-2820710-2025-11-16",
      "headline": "Prem Chopra discharged from hospital, family says actor is hale and hearty Veteran actor Prem Chopra has been discharged from Mumbai's Lilavati Hospital following a precautionary stay. His family confirmed that the actor is back home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-aamir-khan-enjoy-star-studded-musical-night-in-gujarat-2820680-2025-11-16",
      "headline": "Ranveer, Deepika, Aamir enjoy star-studded musical night in Gujarat. See pics Bollywood actors Ranveer Singh, Deepika Padukone and Aamir Khan were seen at a musical event in Gujarat on Saturday. The event featured performances by AR Rahman, Shreya Ghoshal and other renowned singers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atheist-rajamouli-comments-on-lord-hanuman-at-varanasi-event-draws-flak-2820666-2025-11-16",
      "headline": "Emotional Rajamouli says he doesn't believe in God at 'Varanasi' event, draws flak An emotional Rajamouli said he didn't believe in God during the 'Varanasi' launch event. He also said that when his father talked about Lord Hanuman, it angered him. His words have sparked a debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-beast-in-me-review-claire-danes-matthew-rhys-2820665-2025-11-16",
      "headline": "'The Beast in Me' review: Of Claire Danes, Matthew Rhys, secrets and scarsRelease Date:Thu Nov 13, 2025 'The Beast in Me' on Netflix is a psychological suspense drama that teases till the final episode. Claire Danes and Matthew Rhys topline an effective cast"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/de-de-pyaar-de-2-box-office-collection-day-2-ajay-devgn-film-witnesses-close-to-50-jump-2820645-2025-11-16",
      "headline": "De De Pyaar De 2 box office Day 2: Ajay Devgn's film witnesses close to 50% jump Ajay Devgn and Rakul Preet Singh's 'De De Pyaar De 2' witnessed a significant rise in collections on Saturday. The film, a romantic comedy directed by Anshul Sharma, also stars R Madhavan and Meezaan Jafri, amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-written-update-rohit-shetty-host-amaal-mallik-gaurav-khanna-clash-2820620-2025-11-16",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Rohit Shetty steps in as host, Amaal-Gaurav clash Director Rohit Shetty took over hosting duties in actor Salman Khan's absence during 'Bigg Boss 19' Weekend Ka Vaar. He addressed the reaction of contestants during the twist in captaincy tasks and called out contestants over their controversial remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sankranthi-clutter-is-telugu-cinemas-biggest-festival-losing-its-charm-2820129-2025-11-16",
      "headline": "Sankranthi clutter: Is Telugu cinema's biggest festival losing its charm? As multiple big, mid and small films line up for the 2026 Sankranthi window, recent box office patterns raise a question: Is the festival turning from a celebrated showcase into an overcrowded release slot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-returns-4k-re-release-original-ending-final-cut-amitabh-bachchan-dharmendra-jaya-bachchan-hema-malini-2820607-2025-11-16",
      "headline": "Sholay returns in 4K: Iconic film to re-release with its original ending The 4K restored version of 'Sholay' will be released in 1,500 screens across India to mark the film's 50th anniversary. The final cut version will feature the movie's original climax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exclusive-lee-pace-on-edgar-wright-and-the-duality-of-the-running-man-2820526-2025-11-16",
      "headline": "Exclusive: Lee Pace on Edgar Wright and the duality of The Running Man Lee Pace praised director Edgar Wright for crafting the \"unbothered\" and masked McCone, a hunter in the dystopian film The Running Man. Pace highlighted the film's dual narrative, where his character is the network's protagonist despite doing \"grotesque\" violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hawar-you-i-am-hava-hawaie-witty-salman-khan-brings-back-sridevi-memories-2820472-2025-11-15",
      "headline": "Hawar you? I am hava hawaie: Witty Salman Khan brings back Sridevi memories During the Da-Banng Tour in Doha, Salman Khan paid tribute to Sridevi's iconic song, 'Hawa Hawai,' from the film 'Mr India' (1987). The actor shared an image of himself being lifted high in the air by background dancers during the performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-varanasi-event-filmmaker-slams-unauthorised-drone-leak-incident-2820494-2025-11-15",
      "headline": "Rajamouli's Varanasi event: Filmmaker slams unauthorised drone leak incident SS Rajamouli expressed extreme frustration over the Varanasi teaser leak, which he blamed on a drone capturing test footage. The teaser revealed Mahesh Babu's character as 'Rudhra' fiercely yielding a trident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-film-titled-varanasi-mahesh-babu-invokes-lord-shiva-yields-trident-2820365-2025-11-15",
      "headline": "Rajamouli's film titled Varanasi: Mahesh Babu plays Rudhra, yields trident Director SS Rajamouli unveiled the first glimpse of his film 'Varanasi' at the 'GlobeTrotter' event in Ramoji City, Hyderabad. Mahesh Babu's fierce, trident-yielding appearance was revealed in the first teaser from the movie.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-globetrotter-event-varanasi-ss-rajamouli-hyderabad-2820481-2025-11-15",
      "headline": "Bigger, bolder, more audacious: Prithviraj Sukumaran on Rajamouli's Varanasi vision Actor Prithviraj Sukumaran shared insights on his career and collaboration with director SS Rajamouli at the 'GlobeTrotter' event at Ramoji Rao Film City, Hyderabad, highlighting the significance of the project and the collective pride of the Telugu film community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-varanasi-summer-2027-release-new-music-2820471-2025-11-15",
      "headline": "Rajamouli-Mahesh Babu's Varanasi: MM Keeravani reveals release window. Read here MM Keeravani's speech at the event included a key update on 'Varanasi'. The ace music composer revealed the highly anticipated film's release window.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nia-arrests-delhi-bomber-dr-umar-un-nabis-aide-who-helped-procure-the-car-used-in-red-fort-blast-2820820-2025-11-16",
      "headline": "Kashmiri man who helped Delhi bomber procure car used in Red Fort blast arrestedThe National Investigation Agency has made a significant breakthrough in the Red Fort car bomb case by arresting a key conspirator from Kashmir. This development sheds light on the wider network behind the deadly attack that shook Delhi earlier this month.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rohini-acharyas-emotional-daughter-remark-gets-chirag-paswans-rights-backing-2820840-2025-11-16",
      "headline": "Rohini Acharya's emotional 'daughter' remark gets Chirag Paswan's 'rights' backingChirag Paswan urges the Lalu Prasad Yadav family to resolve their internal disputes swiftly, drawing from his own experience with family crises. The political storm intensifies following Rohini Acharya's public allegations against her family amid RJD's electoral setbacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kerala-booth-level-officer-dies-by-suicide-family-alleges-sir-work-pressure-2820787-2025-11-16",
      "headline": "Kerala Booth Level Officer dies by suicide, family alleges SIR work pressureAneesh George, a school employee serving as a Booth Level Officer for the upcoming local body polls, was found hanging at his home in Kannur. His family and locals blamed severe workload linked to the Special Intensive Revision (SIR) of electoral rolls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nia-says-suicide-bomber-used-vehicle-borne-improvised-explosive-device-in-red-fort-attack-2820808-2025-11-16",
      "headline": "Red Fort blast was suicide bombing using vehicle-borne IED, NIA probe revealsNIA confirmed the Red Fort blast was carried out using a vehicle-borne IED driven by suicide bomber Umar Un Nabi, with his aide Amir Rashid Ali, now arrested for procuring the car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/delhi-bomb-blast-terrorist-attack-response-plan-chain-of-command-first-responders-pmo-police-nia-nsg-26-11-mumbai-2820425-2025-11-16",
      "headline": "There's been a blast. Phones ring. Then...This is what happens after that first phone call reporting an explosion, just like in the Red Fort blast case in Delhi. Veterans tell us how central agencies, like the NSG and the NIA, the state police and the forensic science laboratories react and how the entire counter-terror operation is coordinated."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/after-rohini-acharya-lalu-yadavs-3-more-daughters-move-out-of-patna-residence-2820750-2025-11-16",
      "headline": "After Rohini Acharya, Lalu Yadav's 3 more daughters move out of Patna residenceThe RJD family feud intensifies as three daughters of Lalu Prasad Yadav leave their Patna residence following Rohini Acharya's explosive allegations. This marks a significant deepening of the internal crisis within the party's first family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/dk-shivakumar-health-perfectly-fine-dismisses-karnataka-congress-president-resignation-rumours-2820842-2025-11-16",
      "headline": "Health fine: DK Shivakumar junks rumours of quitting as Karnataka Congress chiefKarnataka Congress chief DK Shivakumar dismissed rumours of his resignation, saying his mental and physical health are \"perfectly fine.\" He said there is no reason for him to quit and that he will continue to work as a \"disciplined soldier\" of the party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-bride-to-be-bludgeoned-to-death-by-fiance-on-wedding-day-after-argument-over-saree-2820790-2025-11-16",
      "headline": "Bride-to-be bludgeoned to death by fiance on wedding day after argument over sareeA tragic incident unfolded in Bhavnagar, Gujarat, where a bride was killed by her would-be husband on their wedding day following a dispute over a saree and money. The accused is currently absconding as police intensify their search efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atheist-rajamouli-comments-on-lord-hanuman-at-varanasi-event-draws-flak-2820666-2025-11-16",
      "headline": "Emotional Rajamouli says he doesn't believe in God at 'Varanasi' event, draws flakAn emotional Rajamouli said he didn't believe in God during the 'Varanasi' launch event. He also said that when his father talked about Lord Hanuman, it angered him. His words have sparked a debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-discharged-hospital-kolkata-test-injury-2820830-2025-11-16",
      "headline": "Shubman Gill discharged from Kolkata hospital, unsure if he will travel to GuwahatiIndia Test captain Shubman Gill has been discharged from hospital and is recovering well after his neck injury at Eden Gardens. India now await clarity on his availability for the second Test after a costly defeat in his absence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/have-only-disowned-tejashwi-rohini-acharya-says-lalu-yadav-rabri-devi-backed-her-2820804-2025-11-16",
      "headline": "Have only disowned Tejashwi: Rohini Acharya says Lalu Yadav, Rabri Devi backed herRohini Acharya said she stands by all her allegations and has \"disowned\" her brother, urging reporters to question Tejashwi Yadav and his close aides. She said her parents and sisters were supporting her and that she was leaving for Mumbai to stay with her in-laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-polls-nda-weighs-6-mlas-per-minister-formula-as-bihar-government-formation-gathers-pace-2820722-2025-11-16",
      "headline": "NDA sets Bihar Cabinet formula rolling as government formation gathers paceThe formula is expected to guide the distribution of portfolios among alliance partners as the coalition moves swiftly towards forming the next government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-warns-fans-against-whatsapp-impersonator-messaging-for-photoshoots-2820788-2025-11-16",
      "headline": "Aditi Rao Hydari warns fans against WhatsApp impersonator messaging for photoshootsAditi Rao Hydari warned fans and photographers about an impersonator using her pictures and name on WhatsApp to message people about photoshoots. She confirmed that she never contacts people for work using a personal number and urged followers to only engage through her official team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-assembly-election-result-world-bank-fund-women-payout-jdu-bjp-nda-jan-suraaj-prashant-kishor-2820625-2025-11-16",
      "headline": "Prashant Kishor's party alleges Rs 14,000 crore World Bank funds used in Bihar pollPrashant Kishor's party alleged that the Nitish Kumar government diverted Rs 14,000 crore in World Bank funds to give Rs 10,000 cash transfers to women ahead of  elections, calling it an unethical bid to sway the polls. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lalu-yadavs-daughter-rohini-acharya-emotional-message-day-after-cutting-family-ties-quitting-politics-rjd-2820658-2025-11-16",
      "headline": "Dirty kidney, filthy abuses, slipper raised: Rohini Acharya on Yadav family feudRohini Acharya, Lalu Yadav's daughter, quit politics and severed ties with her family, alleging abuse, humiliation, and betrayal by Tejashwi Yadav's aides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-pakistan-a-live-score-rising-stars-asia-cup-2025-vaibhav-suryavanshi-2820821-2025-11-16",
      "headline": "IND A vs PAK A Live: India struggle as Sadaqat hits rapid 50India A vs Pakistan A, Rising Stars Asia Cup 2025 Live: Pakistan are on course to chase down 137 as Maaz Sadaqat is leading the fightback with a rapid fifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/from-stigma-to-style-glasses-find-a-place-in-indian-bridal-fashion-2819877-2025-11-16",
      "headline": "From stigma to style, glasses find a place in Indian bridal fashionGlasses are becoming an unapologetic addition to bridal trousseaus. The fashion world is also helping brides shake off this unnecessary pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-544-15-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sonbhadra-mine-collapse-update-1-dead-several-feared-trapped-rescue-enters-second-day-fir-registered-2820802-2025-11-16",
      "headline": "Sonbhadra mine collapse: 1 dead, several feared trapped as rescue enters second dayRescue operations in Uttar Pradesh's Sonbhadra district entered their second day after a stone quarry collapse left one worker dead and several others feared trapped beneath large boulders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rohini-acharya-tejashwi-fight-lalu-yadav-family-fight-bihar-election-result-rjd-2820729-2025-11-16",
      "headline": "Rohini Acharya's revolt, Tejashwi's slipper: The inside story of Yadav family feudThe RJD's heavy defeat has set off a bitter breakdown inside Lalu Prasad's family, with Tejashwi Yadav and Rohini Acharya clashing over campaign control and the role of key aides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-navy-commissions-mahe-asw-shallow-water-craft-mumbai-2820837-2025-11-16",
      "headline": "Navy to commission indigenous anti-submarine warfare water craft on November 24The Indian Navy will commission Mahe, its first indigenously built Mahe-class Anti-Submarine Warfare Shallow Water Craft, on November 24 in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-sourav-ganguly-eden-gardens-pitch-row-gautam-gambhir-message-2820785-2025-11-16",
      "headline": "Sourav Ganguly responds to Kolkata Test pitch row, has a message for Gautam GambhirIndia's Eden Gardens collapse has triggered a fresh debate over the pitch and the team's approach. Sourav Ganguly has now weighed in, offering clarity on the controversy and a pointed message for Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-report-sa-1-0-lead-historic-win-kolkata-2820700-2025-11-16",
      "headline": "Rank turner haunts India again as South Africa defend 123 to end 15-year waitSouth Africa finally broke their 15-year drought in India with a gritty win in the opening Test at Eden Gardens on Sunday, taking a 1-0 lead in the two-match series. Set 124 on a crumbling surface that tested every batter's technique and temperament, India folded for 93."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/9mm-cartridges-typically-used-by-army-recovered-from-red-fort-car-blast-site-but-no-weapon-found-sources-2820588-2025-11-16",
      "headline": "9mm cartridges, used by Army, recovered from Red Fort car blast site: SourcesA powerful car explosion near Delhi's Red Fort on November 10 killed 13 people and injured several others, shattering the area. Authorities continue to document the wreckage and aftermath of the high-intensity blast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rubina-abhinav-win-dhamaal-with-pati-patni-aur-panga-crowned-sarvagun-sampann-jodi-2820852-2025-11-16",
      "headline": "Rubina-Abhinav win Dhamaal With Pati Patni Aur Panga; crowned Sarvagun Sampann JodiRubina Dilaik and Abhinav Shukla were crowned the winners of the 'Sarvagun Sampann jodi,' of the reality show Dhamaal With Pati Patni Aur Panga. Excerpts from an exclusive report by India Today.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-anuj-sachdeva-defends-friend-gaurav-khanna-against-fake-allegations-2820744-2025-11-16",
      "headline": "Bigg Boss 19: Anuj Sachdeva defends friend Gaurav Khanna against fake allegationsActor Anuj Sachdeva backed his friend, 'Bigg Boss 19' contestant Gaurav Khanna, slamming accusations of him being fake by confirming his genuine nature. Anuj also criticised Amaal Mallik for using abusive language about women and speaking ill of someone's mother, questioning his legacy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-discharged-hospital-kolkata-test-injury-2820830-2025-11-16",
      "headline": "Shubman Gill discharged from Kolkata hospital, unsure if he will travel to Guwahati India Test captain Shubman Gill has been discharged from hospital and is recovering well after his neck injury at Eden Gardens. India now await clarity on his availability for the second Test after a costly defeat in his absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-former-cricketers-react-social-media-kolkata-eden-gardens-2820827-2025-11-16",
      "headline": "India's skill vs spin gone down: Former stars react after Kolkata Test defeat India's Eden Gardens defeat has prompted sharp reactions from former cricketers, who see deeper issues than a single collapse. Many believe the loss reflects declining spin-batting skills and lessons still unlearned since the New Zealand series setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-pakistan-a-live-score-rising-stars-asia-cup-2025-vaibhav-suryavanshi-2820821-2025-11-16",
      "headline": "IND A vs PAK A Live: India struggle as Sadaqat hits rapid 50 India A vs Pakistan A, Rising Stars Asia Cup 2025 Live: Pakistan are on course to chase down 137 as Maaz Sadaqat is leading the fightback with a rapid fifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-picks-sai-sudharsan-to-replace-shubman-gill-in-guwahati-test-2820805-2025-11-16",
      "headline": "Sai Sudharsan or Devdutt Padikkal? Anil Kumble makes his pick for Guwahati Test IND vs SA, 1st Test: Anil Kumble believes India should turn to Sai Sudharsan if Shubman Gill is unavailable for the Guwahati Test, though adding another left-hander could strengthen Simon Harmer's impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sawasim-jaffer-urges-return-to-virat-kohli-era-pitches-after-kolkata-defeat-2820803-2025-11-16",
      "headline": "Return to Virat Kohli era Indian pitches: Wasim Jaffer after Kolkata Test loss Former cricketer Wasim Jaffer has called for a return to classic Indian pitches from the Virat Kohli era after India's defeat to South Africa. His comments highlight concerns over current pitch conditions affecting India's home dominance and team performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kevin-pietersen-modern-test-approach-blame-run-chase-kolkata-2820800-2025-11-16",
      "headline": "India's Kolkata loss due to modern Test approach, players not to blame: Pietersen Kevin Pietersen believes India's Kolkata collapse reflects a larger shift in modern Test batting. He says today's techniques prioritise power over patience and argues the players should not be blamed for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kolkata-test-eden-pitch-steyn-on-gambhir-remark-2820768-2025-11-16",
      "headline": "Any Test that finishes in 3 days has demons: Steyn on Gambhir's pitch defence Former South Africa fast bowler Dale Steyn countered India coach Gautam Gambhir's defence of the Eden Gardens surface, saying that \"any Test that finishes in three days has demons in it, for sure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eden-gardens-india-vs-south-africa-sourav-ganguly-pitch-controversy-2820798-2025-11-16",
      "headline": "Eden Gardens wasn't the best Test wicket: Sourav Ganguly on pitch controversy IND vs SA, 1st Test: CAB president Sourav Ganguly opened up the controversy surrounding the pitch at the Eden Gardens in Kolkata. The opening Test ended in less than three days with South Africa beating India by 30 runs to take a 1-0 lead in the two-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-disagrees-gautam-gambhir-eden-gardens-pitch-difficulty-india-vs-south-africa-test-2820748-2025-11-16",
      "headline": "Can't blame batters: Pujara, Chopra disagree with Gambhir's Kolkata pitch remark IND vs SA, 1st Test: Cheteshwar Pujara and Aakash Chopra strongly disagreed with Gautam Gambhir's remark that the Eden Gardens pitch wasn't difficult for batting and that the batters should have adapted to the conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-1st-test-gautam-gambhir-full-post-match-press-conference-kolkata-test-2820791-2025-11-16",
      "headline": "124 was chasable irrespective of pitch, we should've absorbed pressure: Gambhir ND vs SA 1st Test: India head coach Gautam Gambhir felt that the target of 124 against South Africa in the first Test was chasable. India lost the series opener by 30 runs after being bundled out for 93 on Day 3 at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-sourav-ganguly-eden-gardens-pitch-row-gautam-gambhir-message-2820785-2025-11-16",
      "headline": "Sourav Ganguly responds to Kolkata Test pitch row, has a message for Gautam Gambhir India's Eden Gardens collapse has triggered a fresh debate over the pitch and the team's approach. Sourav Ganguly has now weighed in, offering clarity on the controversy and a pointed message for Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kolkata-test-eden-pitch-steyn-on-gambhir-remark-2820768-2025-11-16",
      "headline": "Any Test that finishes in 3 days has demons: Steyn on Gambhir's pitch defence Former South Africa fast bowler Dale Steyn countered India coach Gautam Gambhir's defence of the Eden Gardens surface, saying that \"any Test that finishes in three days has demons in it, for sure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eden-gardens-india-vs-south-africa-sourav-ganguly-pitch-controversy-2820798-2025-11-16",
      "headline": "Eden Gardens wasn't the best Test wicket: Sourav Ganguly on pitch controversy IND vs SA, 1st Test: CAB president Sourav Ganguly opened up the controversy surrounding the pitch at the Eden Gardens in Kolkata. The opening Test ended in less than three days with South Africa beating India by 30 runs to take a 1-0 lead in the two-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-disagrees-gautam-gambhir-eden-gardens-pitch-difficulty-india-vs-south-africa-test-2820748-2025-11-16",
      "headline": "Can't blame batters: Pujara, Chopra disagree with Gambhir's Kolkata pitch remark IND vs SA, 1st Test: Cheteshwar Pujara and Aakash Chopra strongly disagreed with Gautam Gambhir's remark that the Eden Gardens pitch wasn't difficult for batting and that the batters should have adapted to the conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-1st-test-gautam-gambhir-full-post-match-press-conference-kolkata-test-2820791-2025-11-16",
      "headline": "124 was chasable irrespective of pitch, we should've absorbed pressure: Gambhir ND vs SA 1st Test: India head coach Gautam Gambhir felt that the target of 124 against South Africa in the first Test was chasable. India lost the series opener by 30 runs after being bundled out for 93 on Day 3 at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-sourav-ganguly-eden-gardens-pitch-row-gautam-gambhir-message-2820785-2025-11-16",
      "headline": "Sourav Ganguly responds to Kolkata Test pitch row, has a message for Gautam Gambhir India's Eden Gardens collapse has triggered a fresh debate over the pitch and the team's approach. Sourav Ganguly has now weighed in, offering clarity on the controversy and a pointed message for Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-gautam-gambhir-criticised-after-test-loss-south-africa-eden-gardens-2820773-2025-11-16",
      "headline": "Worst Indian coach: Fans tear into Gambhir after humiliating Kolkata Test lossIndia head coach Gautam Gambhir faces widespread criticism after the team's 30-run defeat to South Africa in the first Test at Eden Gardens. The loss has intensified pressure on Gambhir ahead of the crucial second Test in the series, with India in a danger of losing second Test series at home in as many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-anil-kumble-reaction-gambhir-remark-eden-gardens-pitch-kolkata-test-2820743-2025-11-16",
      "headline": "Anil Kumble 'confused' by Gautam Gambhir's Eden Gardens pitch remarkFormer India captain Anil Kumble admitted he was \"confused\" after India head coach Gautam Gambhir maintained that the Eden Gardens surface was exactly what the team had asked for ahead of the first Test against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-batter-prepare-eden-gardens-pitches-cheteshwar-pujara-2820741-2025-11-16",
      "headline": "Indian batters need to use their feet, be prepared for pitches like Eden: PujaraIND vs SA, 1st Test: India's collapse on a turning Eden pitch has renewed scrutiny of their batting against spin. Cheteshwar Pujara says the team must adapt quickly, using better footwork and scoring options to handle challenging home surfaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-jasprit-bumrah-reconciles-temba-bavuma-eden-gardens-win-2820735-2025-11-16",
      "headline": "Jasprit Bumrah makes up with Temba Bavuma after disparaging remark in KolkataJasprit Bumrah and Temba Bavuma sorted out their differences after South Africa's landmark Test victory at Eden Gardens. Bumrah had made a comment on Bavuma on Day 1, which didn't go down well with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-west-indies-1st-odi-report-daryl-mitchell-hundred-2820738-2025-11-16",
      "headline": "Daryl Mitchell's century powers New Zealand past West Indies to take 1–0 leadDaryl Mitchell's 119 off 118 deliveries broke open a sluggish game on Sunday as New Zealand edged the West Indies by seven runs in the first ODI to move 1-0 ahead in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-shubman-gill-injury-update-kolkata-test-india-south-africa-2820734-2025-11-16",
      "headline": "India coach Gautam Gambhir provides Shubman Gill update ahead of Guwahati TestIndia coach Gautam Gambhir has said that Shubman Gill's injury is being monitored at the moment after the loss in the Kolkata Test. Gill didn't bat in the second innings after suffering neck spasms in the first one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-reaction-south-africa-kolkata-test-win-15-years-india-2820728-2025-11-16",
      "headline": "Stay in game and believe: Bavuma provides South Africa's Kolkata Test win recipeTemba Bavuma revealed the recipe for South Africa's success in the Kolkata Test against India as they took a 1-0 lead in the series. South Africa ended their 15-year wait for a win on Indian soil in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-eden-gardens-pitch-curator-kolkata-test-2820724-2025-11-16",
      "headline": "Eden pitch had no demons, curator gave exactly what we wanted: Gautam GambhirIndia coach Gautam Gambhir said the pitch had \"no demons\" and insisted that the curator delivered exactly what the team had asked for, even as India slipped to a 30-run defeat to South Africa in the opening Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-west-indies-1st-odi-report-daryl-mitchell-hundred-2820738-2025-11-16",
      "headline": "Daryl Mitchell's century powers New Zealand past West Indies to take 1–0 leadDaryl Mitchell's 119 off 118 deliveries broke open a sluggish game on Sunday as New Zealand edged the West Indies by seven runs in the first ODI to move 1-0 ahead in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-shubman-gill-injury-update-kolkata-test-india-south-africa-2820734-2025-11-16",
      "headline": "India coach Gautam Gambhir provides Shubman Gill update ahead of Guwahati TestIndia coach Gautam Gambhir has said that Shubman Gill's injury is being monitored at the moment after the loss in the Kolkata Test. Gill didn't bat in the second innings after suffering neck spasms in the first one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/temba-bavuma-reaction-south-africa-kolkata-test-win-15-years-india-2820728-2025-11-16",
      "headline": "Stay in game and believe: Bavuma provides South Africa's Kolkata Test win recipeTemba Bavuma revealed the recipe for South Africa's success in the Kolkata Test against India as they took a 1-0 lead in the series. South Africa ended their 15-year wait for a win on Indian soil in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-eden-gardens-pitch-curator-kolkata-test-2820724-2025-11-16",
      "headline": "Eden pitch had no demons, curator gave exactly what we wanted: Gautam GambhirIndia coach Gautam Gambhir said the pitch had \"no demons\" and insisted that the curator delivered exactly what the team had asked for, even as India slipped to a 30-run defeat to South Africa in the opening Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-lowest-fourth-innings-score-south-africa-eden-gardens-test-kolkata-2820713-2025-11-16",
      "headline": "India slump to new low after Kolkata Test defeat to South Africa: Stat PackIND vs SA, 1st Test: India lost the Kolkata Test by 30 runs against South Africa to go 0-1 down in the two-match series. After being asked to chase down 124, India were bowled out for 93 at the Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-report-sa-1-0-lead-historic-win-kolkata-2820700-2025-11-16",
      "headline": "Rank turner haunts India again as South Africa defend 123 to end 15-year waitSouth Africa finally broke their 15-year drought in India with a gritty win in the opening Test at Eden Gardens on Sunday, taking a 1-0 lead in the two-match series. Set 124 on a crumbling surface that tested every batter's technique and temperament, India folded for 93."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-multi-division-champion-islam-makhachev-ties-win-streak-record-with-title-win-2820687-2025-11-16",
      "headline": "Islam Makhachev wins Welterweight title, becomes 11th UFC two-division championIslam Makhachev became the UFC welterweight champion with a unanimous decision over Jack Della Maddalena, making him the 11th fighter in the organistaion's history to hold titles in two divisions. Makhachev tied Anderson Silva's record for the longest UFC win streak, while Valentina Shevchenko defended her flyweight title in the co-main event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-aakash-chopra-kkr-cameron-green-andre-russell-2820683-2025-11-16",
      "headline": "Cameron Green could be upgraded version of Andre Russell for KKR: Aakash ChopraAakash Chopra said that KKR should target Cameron Green in the upcoming Indian Premier League (IPL) 2026 auction, suggesting that the Australian all-rounder could be an \"upgraded version\" of Andre Russell, whom the franchise released ahead of the new season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-pakistan-a-rising-stars-asia-cup-2025-doha-clash-live-streaming-2820675-2025-11-16",
      "headline": "India A vs Pakistan A Live Streaming: When and where to watch Asia Cup Rising Stars clashIndia A and Pakistan A face off in a marquee Rising Stars Asia Cup 2025 clash in Doha, bringing together two of the most exciting young squads in Asia. The focus will be on Vaibhav Suryavanshi, who's fresh from a 32-ball century against the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-defends-curator-eden-gardens-pitch-criticism-india-south-africa-test-2820673-2025-11-16",
      "headline": "India asked for this: Sourav Ganguly defends Kolkata pitch curator amid criticismIND vs SA, 1st Test: Sourav Ganguly defended curator Sujan Mukherjee amid heavy criticism of the bowler-friendly Eden Gardens pitch against South Africa where bowlers have thoroughly dominated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-aims-highest-successful-test-run-chase-eden-gardens-lead-south-africa-series-2820641-2025-11-16",
      "headline": "Can India chase 124 and win Kolkata Test? Here's what history saysIND vs SA, 1st Test: India face a historic challenge at Eden Gardens, needing to pull off the venue's highest-ever run-chase to beat South Africa. India is the only team to chase a 100-plus target in Kolkata. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}