{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-income-tax-recap-and-what-may-change-this-year-relief-focus-area-2848144-2026-01-07",
      "headline": "Budget 2026: Last year's income tax changes and what may be in focus this timeBudget 2025 delivered meaningful relief to a large section of salaried taxpayers, sharply narrowed the gap between the old and new tax regimes, and set the direction for how personal taxation would evolve going forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economy-rebounds-to-74-growth-in-fy26-on-strong-investment-push-2848118-2026-01-07",
      "headline": "India's economy rebounds to 7.4% growth in FY26 on strong investment pushGovernment measures played an important role in supporting growth. Income tax relief and steps to rationalise GST rates helped shore up consumer demand, even as global conditions remained uncertain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-as-auto-energy-stocks-drag-despite-it-gains-2848100-2026-01-07",
      "headline": "Sensex, Nifty end lower as auto, energy stocks drag despite IT gainsThe S&P BSE Sensex was down by 102.20 points to close at 84,961.14, while the NSE Nifty50 lost 37.95 points to end at 26,140.75. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/airfare-spike-under-scanner-as-government-seeks-data-from-major-airlines-report-2848082-2026-01-07",
      "headline": "Airfare spike under scanner as government seeks data from major airlines: ReportIndia's Directorate General of Civil Aviation, which oversees safety, has written to airlines asking for average fares on each route they operated on, for economy and premium economy seats, over the period December 1-15, according to a report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/employer-not-paying-salary-incentives-bonus-legal-rights-india-law-2848058-2026-01-07",
      "headline": "Employer not paying salary or incentives? Here's what you can doCases of delayed salaries, unpaid incentives and withheld bonuses have become more frequent, especially in young companies and firms facing cash stress. Legal experts say salary and incentives are not favours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sebis-15-rule-sets-a-ceiling-on-broker-growth-explains-zerodhas-nithin-kamath-2848010-2026-01-07",
      "headline": "How Sebi's 15% rule sets a ceiling on broker growth, explains Zerodha's Nithin KamathNithin Kamath said Sebi has fixed a 15% open interest limit for brokers in the derivatives market. This means no single broker is allowed to hold more than 15% of the total market open interest at any given time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-silent-leaks-commissions-explained-2848011-2026-01-07",
      "headline": "The hidden cost quietly eating up to 25% of your mutual fund returnsA study by 1 Finance Research shows that over a 10-year holding period, more than 80% of equity mutual fund schemes leave investors in regular plans at least 25% worse off than those invested in the direct plan of the same scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-prices-drop-over-rs-5000-gold-slips-more-than-rs-1100-check-latest-rates-2847994-2026-01-07",
      "headline": "Silver prices drop over Rs 5,000, gold slips more than Rs 1,100. Check latest ratesAfter a strong rally in recent sessions, gold and silver prices turned lower on Wednesday. Silver saw a fall of more than Rs 5,000, while gold also became cheaper by more than Rs 1,100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-mis-selling-agents-india-irdai-rules-explained-2847979-2026-01-07",
      "headline": "Inside India's insurance mis-selling problem and why it remains hard to fixInsurance mis-selling remains widespread even under regulatory watch. How does it keep slipping past rules, checks, and repeated warnings? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/amazon-pay-launches-fixed-deposit-service-with-returns-of-up-to-8-check-details-2847932-2026-01-07",
      "headline": "Amazon Pay launches fixed deposit service with returns of up to 8%. Check detailsAmazon Pay users can now do more than just pay bills and shop online. The company has launched a fixed deposit service that lets customers invest in FDs through the app, with returns going up to 8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-venezuelas-stock-market-jumped-50-percent-after-us-attack-2847896-2026-01-07",
      "headline": "Explained: Why Venezuela's stock market jumped 50% in a day after the US attackThe benchmark Venezuela IBC Index, which tracks shares traded in Caracas (capital of Venezuela), surged 50% in a single session on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-share-price-up-4-percent-why-jhunjhunwala-stock-is-rising-today-q3-results-brokerage-view-2847858-2026-01-07",
      "headline": "Titan share price up 4%: Why is the Jhunjhunwala stock rising today?The stock opened higher at Rs 4,200.45 compared with the previous close of Rs 4,111.10. During the session, it touched an intraday high of Rs 4282.00 and a low of Rs 4,200.45. The volume-weighted average price stood at Rs 4,254.78."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-184-points-lower-nifty-below-26150-titan-up-3-percent-2847854-2026-01-07",
      "headline": "Sensex opens 184 points lower, Nifty below 26,150; Titan up 3%The S&P BSE Sensex was down by 255.21 points to 84,808.13, while the NSE Nifty50 lost 72.90 points to 26,105.80 as of 9:47 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-today-outlook-2026-right-time-to-buy-sell-hold-2847852-2026-01-07",
      "headline": "Gold and silver rates today: Buy, wait or sell?Gold prices in India were largely steady on January 7, 2026, with only a marginal rise seen across purity levels. As per the latest data, 24K gold was priced at Rs 13,883 per gram, up by Rs 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-bccl-latest-gmp-listing-date-price-band-2847827-2026-01-07",
      "headline": "Bharat Coking Coal IPO to open soon: Latest GMP update for investorsThe price band for the IPO of Bharat Coking Coal has been fixed at Rs 21 to Rs 23 per share. The lot size is 600 shares. Based on the upper price band, a retail investor will need to invest at least Rs 13,800 for one lot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/reliance-share-price-biggest-fall-june-2024-what-should-investors-do-2847502-2026-01-06",
      "headline": "Reliance sees worst session since June 2024. What should investors do now?Reliance Industries shares closed 4.5% lower at Rs 1,507.6, marking their steepest decline since June 4, 2024. During the session, the stock slipped as much as 5.1% to Rs 1,496.30, hitting its lowest level since November 11, as selling pressure intensified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-376-points-lower-nifty-below-26200-ril-tanks-4-percent-2847468-2026-01-06",
      "headline": "Sensex ends 376 points lower, Nifty below 26,200; RIL tanks 4%The S&P BSE Sensex declined 376.28 points to close at 85,063.34, while the NSE Nifty50 lost 71.60 points to end at 26,178.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-steel-jsw-sail-antitrust-violation-cci-fine-report-share-price-down-2847441-2026-01-06",
      "headline": "Tata Steel, JSW Steel and SAIL found in breach of antitrust laws: ReportThe Competition Commission of India has also held 56 top executives liable for price collusion over different periods between 2015 and 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/us-venezuela-tensions-impact-global-markets-oil-gold-investors-guide-2847379-2026-01-06",
      "headline": "Why US–Venezuela tensions have global markets watching oil and goldTensions between the US and Venezuela are worrying markets because oil supplies and economic stability could be affected if the situation worsens. Here's all you need to know. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/reliance-ril-share-price-crash-5-percent-is-it-good-time-to-buy-jefferies-venezuela-oil-2847345-2026-01-06",
      "headline": "Reliance share price crashes 5%: Is it good time to buy the stock?RIL share price: The stock opened slightly lower at Rs 1,575.55 and remained under selling pressure through the session. At the time of writing, the share price was at Rs 1,509, down Rs 68.45 or 4.34%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/highest-grossing-indian-film-dhurandhar-ranveer-singh-blockbuster-success-2848071-2026-01-07",
      "headline": "Dhurandhar star Ranveer Singh thanks 'alma mater' YRF after they praise film Ranveer Singh's film Dhurandhar becomes the highest-grossing Indian film in a single language, receiving industry-wide acclaim and marking a significant milestone for the cast and crew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijays-jana-nayagan-gets-uk-clearance-as-indian-censor-board-delays-certification-2848132-2026-01-07",
      "headline": "Vijay's Jana Nayagan gets UK clearance as Indian censor board delays certification While the British Board of Film Classification has approved Vijay's film Jana Nayagan for UK release, the Indian censor board's ongoing review and a legal challenge are holding up its domestic debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-jana-nayagan-trailer-sparks-debate-cinema-already-turning-ai-engineered-2848079-2026-01-07",
      "headline": "Vijay's Jana Nayagan trailer sparks debate: Cinema already turning AI-engineered? Vijay's Jana Nayagan trailer has sparked online debate and meme fest over the use of AI watermark. Experts speak to India Today about the time constraints and the relevance of creativity and VFX artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-ticket-prices-soar-amid-censor-certificate-delay-and-black-market-demand-in-tamil-nadu-2848081-2026-01-07",
      "headline": "Vijay's Jana Nayagan: No censor clearance, but tickets selling at Rs 5,000 Thalapathy Vijay's Jana Nayagan is yet to get a censor certificate just before release, but high ticket prices of the film and revenue-sharing disputes are creating controversy in Tamil Nadu's film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-birthday-karan-singh-grover-unseen-pic-daughter-devi-2848083-2026-01-07",
      "headline": "My whole world: Karan shares unseen pic of Bipasha Basu and daughter Devi On Bipasha Basu's birthday, Karan Singh Grover posted an unseen image with daughter Devi and expressed his affection for his wife in a message on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fan-gifts-prabhas-bhagavad-gita-during-meeting-at-actor-hyderabad-home-video-2848080-2026-01-07",
      "headline": "Fan gifts Prabhas Bhagavad Gita during meeting at actor's Hyderabad home Actor Prabhas recently met fans at his Jubilee Hills residence in Hyderabad before the release of his new film, The Raja Saab. A fan shared her visit on social media, describing how the actor welcomed her personally and accepted gifts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aasif-sheikh-praises-dhurandhar-for-showing-talents-of-television-actors-2848043-2026-01-07",
      "headline": "Aasif Sheikh praises Dhurandhar for showing talents of television actors Aasif Sheikh feels that Aditya Dhar's 'Dhurandhar' (2025) will open up more avenues for television actors. He praised the performances of Saumya Tandon, Rakesh Bedi and Gaurav Gera in the film."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-teaser-reveal-january-8-dark-visual-poster-2848067-2026-01-07",
      "headline": "Yash's Toxic to unveil teaser on actor's birthday; new poster fuels buzz KGF actor Yash's film Toxic will reportedly unveil a teaser visual on his birthday. The reveal raises expectations for the film's gritty narrative and box office clash with Dhurandhar 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/millie-bobby-brown-accepts-elevens-fate-as-stranger-things-finale-divide-fans-2848057-2026-01-07",
      "headline": "Millie Bobby Brown accepts Eleven's fate as Stranger Things finale divide fans Stranger Things comes to a dramatic close as Millie Bobby Brown voices satisfaction with her character Eleven's sacrificial ending. So does Eleven really die at the end?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-sankranti-release-special-interview-sandeep-reddy-vanga-2848039-2026-01-07",
      "headline": "Prabhas' shyness is on another level, it's too much: Sandeep Reddy Vanga As promotions for Prabhas' upcoming horror fantasy film The Raja Saab gather momentum, the makers have unveiled a promo for The King Size Interview, featuring director Sandeep Reddy Vanga as the guest host."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khosla-ka-ghosla-2-filming-delhi-ravi-kishan-boman-irani-2847986-2026-01-07",
      "headline": "Ravi Kishan denies replacing Boman in Khosla Ka Ghosla 2 Ravi Kishan is set to join the cast of 'Khosla Ka Ghosla' 2, currently filming in Delhi, while Boman Irani is confirmed to reprise his role and will join the shoot on January 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sebastian-stan-in-talks-to-join-robert-pattinson-in-the-batman-part-ii-2847988-2026-01-07",
      "headline": "Sebastian Stan in talks to join Robert Pattinson in The Batman Part II Sebastian Stan is in talks to join Robert Pattinson in 'The Batman II'. The film, directed by Matt Reeves, also features Scarlett Johansson and Colin Farrell in pivotal roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-rampal-enjoys-dhurandhar-screening-goa-friends-personalised-desserts-2848002-2026-01-07",
      "headline": "Goa diaries: Arjun Rampal joins friends for Dhurandhar screening. See pics Actor Arjun Rampal attended a screening of Aditya Dhar's Dhurandhar with his close friends in Goa, later sharing moments from the evening on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/at-rs-831-crore-dhuranndhar-becomes-indias-biggest-hindi-film-in-history-2848030-2026-01-07",
      "headline": "At Rs 831 crore, Dhurandhar becomes India's biggest Hindi film in history Dhurandhar tops Hindi box office with Rs 831.40 crore nett in India. Ranveer Singh-led film also sustains record run globally in Week 5, despite no Middle East release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/irrfan-khan-tribute-son-babil-khan-59th-birthday-rare-photos-heartfelt-memories-2848005-2026-01-07",
      "headline": "Pictures of you, pictures of me: Babil remembers Irrfan on 59th birth anniversary Babil Khan marked his late father Irrfan Khan's 59th birth anniversary by sharing heartfelt words and rare family photos, inviting fans to remember the acclaimed actor with him. The actor died in April 2020. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-was-salman-khan-deliberately-biased-on-show-producer-answers-2848025-2026-01-07",
      "headline": "Bigg Boss 19: Was Salman Khan deliberately biased on show? Producer answers Bigg Boss producer Deepak Dhar dismissed allegations of Salman Khan's bias on the show, calling the actor genuine, neutral and the \"soul\" of the reality series. He said the makers stand firmly by Salman and only respond to criticism when necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/twilight-saga-remake-kristen-stewart-directing-vampire-romance-reboot-2848014-2026-01-07",
      "headline": "Kristen Stewart wants to direct Twilight remake with huge budget Kristen Stewart has signalled her willingness to direct a potential remake of the Twilight films, suggesting that a new adaptation with greater financial backing could offer a different approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-irrfan-khan-explained-true-meaning-of-eid-qurbani-and-ramadan-fasting-2848016-2026-01-07",
      "headline": "When Irrfan Khan explained true meaning of Eid qurbani and Ramadan fasting On Irrfan Khan's birth anniversary, a look back at the actor's 2016 remarks on Eid qurbani, Ramadan fasting and terrorism that sparked nationwide debate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-gulshan-devaiah-challenges-promoting-independent-films-evolving-indian-cinema-2847964-2026-01-07",
      "headline": "Gulshan Devaiah opens up on dating ex-wife, rejecting Toxic and quitting a film Actor Gulshan Devaiah opens up about dating his ex-wife after divorce, turning down Yash's Toxic, and quitting a film over non-payment and unprofessional behaviour."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/alliance-with-congress-wont-be-accepted-devendra-fadnavis-warns-bjp-leaders-of-action-akot-ambernath-2848046-2026-01-07",
      "headline": "Unacceptable: Fadnavis blasts local BJP leaders over Congress, AIMIM alliancesAs the stunning 'alliances' between the BJP and Congress and AIMIM caused political tremors, Fadnavis declared that such arrangements had not been approved by the party's top leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jeffrey-sachs-exposes-americas-regime-change-foreign-policy-playbook-after-venezuela-2847780-2026-01-07",
      "headline": "I fear Iran's next, it'll be hotter than Venezuela, economist Jeffrey Sachs warnsRenowned economist Jeffrey Sachs warns that Iran could be Trump's next target after Venezuela, calling the US a \"rogue state\" with no constitutional order. He reveals decades of regime change operations and predicts a potential global explosion if Trump follows through on threats against Tehran.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pm-narendra-modi-said-to-me-sir-may-i-see-you-please-donald-trumps-latest-2847934-2026-01-07",
      "headline": "'Sir, may I see you please,' PM Modi said: Trump's latest in his India remarksUS President Donald Trump claimed that Narendra Modi personally approached him over long-pending Apache helicopter deliveries and trade issues, while acknowledging a strong personal rapport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vhp-leader-sadhvi-prachi-non-hindus-entry-ban-haridwar-ghats-ardh-kumbh-mela-uttarakhand-2847967-2026-01-07",
      "headline": "Non-Hindus can't take a dip: VHP leader seeks restrictions at Haridwar Ganga ghatsVHP leader Sadhvi Prachi has urged the Uttarakhand government to impose strict restrictions on non-Hindus entering the Ganga ghats in Haridwar ahead of the 2027 Ardh Kumbh Mela, citing security and religious concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-parasakthi-censor-delay-tvk-dmk-political-clash-tamil-nadu-2847920-2026-01-07",
      "headline": "Jana Nayagan vs Parasakthi: 2 days left, no censor clearance, TVK-DMK clash deepensVijay's Jana Nayagan and Sivakarthikeyan's Parasakthi face unprecedented censor delays with just 2 days to go for their big Pongal release. The hold-up reveals deep political tensions between TVK and DMK ahead of Tamil Nadu elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-visa-a-privilege-not-right-us-warns-indian-students-against-violations-says-you-may-be-deported-2848130-2026-01-07",
      "headline": "You may be deported: US warns Indian students against violationsThe warning comes months after the Trump administration announced key updates to its student visa process, including higher fees, mandatory social media checks, and a proposed time limit on student stays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dont-chickens-and-goats-have-lives-supreme-court-on-dog-lovers-plea-against-removal-of-strays-2847971-2026-01-07",
      "headline": "Don't chickens and goats have lives? Supreme Court on stray dog lovers' pleaThe Supreme Court questioned arguments by stray dog lovers during a hearing on stray dog management, asking whether the lives of other animals like chickens and goats matter less. The court heard concerns from victims' families and debated solutions ranging from no-dog zones to global sterilisation models.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-mansukh-mandaviya-mohun-bagan-mispronounced-troll-criticism-watch-video-2848036-2026-01-07",
      "headline": "Mohun Began, East Began: Sports Minister trolled over mispronouncing ISL club namesIndia's Sports Minister mispronouncing Mohun Bagan and East Bengal during an ISL press conference sparked instant backlash. The slip-up overshadowed the league's restart announcement and reopened questions around football awareness at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-real-motive-venezuela-greenland-oil-rare-earths-minerals-2847899-2026-01-07",
      "headline": "No pretences. US is brazenly seeking oil and minerals. World order be damnedHandcrafted ByOur Editors After Iraq, as the US carried out another invasion, capturing Venezuelan president Nicolas Maduro, Trump has been brazen and unabashed about his motive. It's all about Venezuela's oil and its minerals. The two other countries he has threatened -- Greenland and Colombia -- have large deposits of rare earths and minerals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economy-rebounds-to-74-growth-in-fy26-on-strong-investment-push-2848118-2026-01-07",
      "headline": "India's economy rebounds to 7.4% growth in FY26 on strong investment pushGovernment measures played an important role in supporting growth. Income tax relief and steps to rationalise GST rates helped shore up consumer demand, even as global conditions remained uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-mla-antony-raju-convicted-drug-case-evidence-tampering-australian-national-andrew-salvatore-cervelli-underwear-2847944-2026-01-07",
      "headline": "How an Aussie's underwear, jailhouse tip led to Kerala MLA's disqualificationKerala court convicted sitting MLA and former minister, Antony Raju, of tampering with evidence in a 1990 drug case, sentencing him to three years in prison and triggering his automatic disqualification from the Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-running-venezuela-armed-militias-hooded-gunmen-phone-searches-journalist-arrests-maduro-arrest-2848001-2026-01-07",
      "headline": "How Trump's running Venezuela: Militia on streets, hooded gunmen searching phonesUS President Donald Trump claims the US is now \"running\" Venezuela. But the streets of Caracas offer a grimmer picture of control enforced through guns, checkpoints and fear. Armed militias are patrolling neighbourhoods, masked gunmen are searching phones and several journalists have been detained in Venezuela."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bare-bodied-hrithik-roshan-serves-25-seconds-of-pure-greek-god-energy-watch-2847945-2026-01-07",
      "headline": "Bare-bodied Hrithik Roshan serves 25 seconds of pure Greek God energy. WatchHrithik Roshan drops a 25-second shirtless video that sets the internet on fire, reminding fans why he's called India's Greek God. From sculpted abs to devilish vibes, the clip has social media in meltdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/at-rs-831-crore-dhuranndhar-becomes-indias-biggest-hindi-film-in-history-2848030-2026-01-07",
      "headline": "At Rs 831 crore, Dhurandhar becomes India's biggest Hindi film in historyDhurandhar tops Hindi box office with Rs 831.40 crore nett in India. Ranveer Singh-led film also sustains record run globally in Week 5, despite no Middle East release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-gaza-news-islamabad-may-or-may-not-go-to-palestine-but-hamas-comes-to-gujranwala-pok-lashkar-e-taiba-let-meet-2848090-2026-01-07",
      "headline": "Pak goes to Gaza or not, Hamas has come to PakVideos of Hamas leader Naji Zaher allegedly at a Lashkar-e-Taiba terror camp in Pakistan have emerged online. This confirms the growing ties between Hamas and Pakistani terrorist groups and comes even as Islamabad debates whether to send troops to Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-local-polls-congress-bjp-devendra-fadnavis-sanjay-raut-2848155-2026-01-07",
      "headline": "Two-headed earthworm: Sanjay Raut slams BJP over tie-up with Congress, AIMIMThe BJP joined hands with arch-rival Congress and Asaduddin Owaisi's  All India Majlis-e-Ittehadul Muslimeen in Ambernath and Akot Municipal Councils, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-dances-to-priyanka-chopra-sunil-grovers-viral-indian-song-great-indian-kapil-show-2847828-2026-01-07",
      "headline": "Nick Jonas can't get Priyanka-Sunil Grover's trending track out of his head. WatchNick Jonas shared a video on Instagram grooving to Priyanka Chopra and Sunil Grover's viral song from The Great Indian Kapil Show. Fans reacted enthusiastically to the couple's playful interaction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-man-drowns-while-fleeing-mob-bangladesh-minority-killings-mount-mithun-sarkar-death-hindus-safety-concerns-2848148-2026-01-07",
      "headline": "Hindu man drowns while fleeing mob in Bangladesh amid attacks on minoritiesThe incident comes amid a series of violent attacks and mob-related killings involving members of Bangladesh's Hindu minority in recent weeks, following a fresh wave of unrest after the killing of radical youth leader Sharif Osman Hadi in early December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lalu-yadav-grandson-rohini-acharya-joins-basic-military-training-programme-singapore-armed-forces-national-service-bmt-2847984-2026-01-07",
      "headline": "Lalu's grandson joins Singapore military training programmeRJD supremo Lalu Prasad Yadav's grandson Aditya, has begun Basic Military Training in Singapore. However, the 18-year-old is not joining the Singapore Armed Forces, and is fulfilling the country's mandatory National Service requirement, which involves two years of training to build discipline, endurance and leadership qualities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-sports-broadcaster-ridhima-pathak-withdraws-bangladesh-premier-league-india-bangladesh-cricket-tensions-2847909-2026-01-07",
      "headline": "Dropped from Bangladesh Premier League? Indian sports presenter clarifies exitIndian sports presenter Ridhima Pathak has clarified her exit from the Bangladesh Premier League, affirming her decision was voluntary amid ongoing India-Bangladesh cricket tensions. Bangladesh banned the broadcast of the IPL 2026 in the country after Mustafizur Rahman's contract was terminated by the BCCI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/this-roadside-stop-in-west-brngal-became-famous-for-just-one-dish-langcha-2846609-2026-01-05",
      "headline": "This roadside stop became famous for just one dishThere's a certain stretch in West Bengal where both sides of the road line up with sweet shops stacked back-to-back, each promising the same thing: Langcha. This is Shaktigarh, or what most travellers now simply recognise as the place to stop for this delectable sweet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rama-duwaji-also-thinks-renting-is-cool-zohran-mamdani-politics-2848008-2026-01-07",
      "headline": "Even Rama Duwaji thinks renting is coolRama Duwaji's inauguration-day wardrobe delivered a message that was easy to miss and hard to dismiss: fashion doesn't have to be owned to be powerful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-ticket-prices-soar-amid-censor-certificate-delay-and-black-market-demand-in-tamil-nadu-2848081-2026-01-07",
      "headline": "Vijay's Jana Nayagan: No censor clearance, but tickets selling at Rs 5,000Thalapathy Vijay's Jana Nayagan is yet to get a censor certificate just before release, but high ticket prices of the film and revenue-sharing disputes are creating controversy in Tamil Nadu's film industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-surgical-instrument-removed-from-woman-stomach-fir-against-era-hospital-doctors-medical-negligence-uttar-pradesh-news-2847981-2026-01-07",
      "headline": "Doctors leave surgical tool in Lucknow woman's stomach; removed after years of painThe woman endured years of agonising pain until doctors at another private hospital finally identified the cause and surgically removed it."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kobbie-mainoo-returns-training-manchester-united-ruben-amorim-sacked-2848126-2026-01-07",
      "headline": "Kobbie Mainoo returns to training for Manchester United after Ruben Amorim's sacking Kobbie Mainoo returned to training as Manchester United prepares for life after Ruben Amorim. The midfielder could feature against Burnley as Darren Fletcher takes interim charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-mobbed-fans-vadodara-airport-ind-vs-nz-odi-series-2848096-2026-01-07",
      "headline": "Virat Kohli mobbed by fans on arrival at Vadodara ahead of New Zealand ODIs: Watch Virat Kohli received a rousing welcome in Vadodara ahead of India's ODI series against New Zealand. The batting great arrives in red-hot form for his first international outing of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-century-five-countries-india-under-19-youth-odi-2848051-2026-01-07",
      "headline": "New Year, same hunger: Vaibhav Suryavanshi smashes 63-ball hundred in South Africa India vs South Africa, 3rd Youth ODI: Vaibhav Suryavanshi hit a 63-ball hundred, bringing up his first three-figure score on South African soil. The 14-year-old was leading India U19 against South Africa on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-recovery-pakistan-t20-world-cup-salman-ali-agha-2848045-2026-01-07",
      "headline": "Pakistan hopeful of pacer Shaheen Afridi's recovery ahead of T20 World Cup Pakistan's T20 captain Salman Ali Agha has expressed optimism over Shaheen Shah Afridi's recovery from a knee injury, saying the premier pacer is on track to regain full fitness in time for next month's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-wins-malaysia-open-opening-match-satwik-chirag-strong-doubles-2848038-2026-01-07",
      "headline": "PV Sindhu, Satwik-Chirag make winning starts to 2026 season Malaysia Open 2026: PV Sindhu made a winning return to the circuit, beating Chinese Taipei's Sung Shuo Yun in straight games. While third seeds Satwiksairaj Rankireddy and Chirag Shetty eased into the second round in men's doubles, Gayatri Gopichand and Treesa Jolly were knocked out in women's doubles first round on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-mansukh-mandaviya-mohun-bagan-mispronounced-troll-criticism-watch-video-2848036-2026-01-07",
      "headline": "Mohun Began, East Began: Sports Minister trolled over mispronouncing ISL club names India's Sports Minister mispronouncing Mohun Bagan and East Bengal during an ISL press conference sparked instant backlash. The slip-up overshadowed the league's restart announcement and reopened questions around football awareness at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-vs-ayush-sindhu-vs-nguyen-tricky-opening-round-draw-indians-india-open-2848031-2026-01-07",
      "headline": "India Open: Lakshya vs Ayush in 1st round as Indian shuttlers handed brutal draw Lakshya Sen opens his title defence against fellow Indian Ayush Shetty in the first round of the India Open 2026, as Indian shuttlers face a demanding draw on home turf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/angad-vir-singh-bajwa-india-shotgun-shooting-switch-nationality-canada-asian-games-2847999-2026-01-07",
      "headline": "India's Asian Games medallist chooses Canada. Why shooter Angad Bajwa made the switch Asian Games hopeful Angad Vir Singh Bajwa has ended his Indian chapter by switching nationality to Canada. Backed by formal NRAI clearance, the move reflects personal roots abroad and a carefully weighed career decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-england-vs-australia-sydney-test-day-4-jacob-bethell-hundred-2847977-2026-01-07",
      "headline": "SCG Test: Bethell's heroic century delays the inevitable for England on Day 4 Jacob Bethell stood between England and defeat for most of Day 4 at the Sydney Cricket Ground, producing a composed maiden Test century in an innings otherwise marked by familiar collapses. The 22-year-old walked off unbeaten on 142 at stumps as England closed on 302 for eight, holding a modest lead of 119 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-bethell-maiden-test-century-ashes-england-vs-australia-scg-2847969-2026-01-07",
      "headline": "Tears in the stands as Jacob Bethell hits maiden Test hundred in Sydney Ashes 2025-26: Jacob Bethell's father was moved to tears after his 22-year-old son hit his maiden Test hundred in Sydney on Wednesday. Bethell remained unbeaten on 142 as England went to Stumps on Day 4 of the fifth Test with a 119-run lead and two wickets in hand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-delhi-capitals-captain-interview-wpl-2026-2847946-2026-01-07",
      "headline": "Jemimah Rodrigues faces stern test of acing huge Delhi Capitals captaincy challenge WPL 2026: Jemimah Rodrigues will lead Delhi Capitals for the first time, but she has prior experience of captaining at the domestic level. The youngster has a big task ahead, replacing the legendary Meg Lanning at the Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-batmobile-collection-luxury-cars-private-jet-batcopter-santos-brazil-fifa-world-cup-2847960-2026-01-07",
      "headline": "Neymar lives Batman dream with million-dollar Batmobile, Batcopter and jet flexNeymar has fulfilled a childhood dream by adding a Batmobile to his collection. Parked beside his Batcopter and private jet, the purchase underlines the Brazilian star's flair for the extraordinary off the pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-denies-icc-ultimatum-t20-world-cup-2026-india-2847950-2026-01-07",
      "headline": "Bangladesh deny claims of ICC ultimatum over not playing T20 World Cup in IndiaThe Bangladesh Cricket Board on Wednesday firmly rejected media reports suggesting it had received an ultimatum from the International Cricket Council regarding Bangladesh's participation in the ICC Men's T20 World Cup 2026, set to be hosted in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-sports-broadcaster-ridhima-pathak-withdraws-bangladesh-premier-league-india-bangladesh-cricket-tensions-2847909-2026-01-07",
      "headline": "Dropped from Bangladesh Premier League? Indian sports presenter clarifies exitIndian sports presenter Ridhima Pathak has clarified her exit from the Bangladesh Premier League, affirming her decision was voluntary amid ongoing India-Bangladesh cricket tensions. Bangladesh banned the broadcast of the IPL 2026 in the country after Mustafizur Rahman's contract was terminated by the BCCI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-restart-aiff-how-much-money-clubs-cost-sponsor-indian-football-2847904-2026-01-07",
      "headline": "Are clubs paying to play ISL? How AIFF is making Indian football cryISL's return masks deeper trouble as clubs are forced to fund the league themselves. Pay cuts, player exits and rushed decisions show Indian football's problems did not end with confirming the 2025–26 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-special-cardigan-mumbai-airport-anushka-sharma-ind-vs-nz-2847889-2026-01-07",
      "headline": "Message to Anushka? Fans spot Virat Kohli's special cardigan at Mumbai airportVirat Kohli made a notable arrival at Mumbai airport on Tuesday evening, wearing a distinctive cardigan that sparked discussion among fans. Kohli will join the Indian ODI squad in Vadodara, which will host the ODI series opener against New Zealand on January 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-series-win-in-australia-2019-sydney-debate-2847876-2026-01-07",
      "headline": "Was India's historic 2018-19 Test series win in Australia overrated?January 7 marks the 7th anniversary of India's historic Test series win in Australia. Today we revisit India's landmark 2018–19 series, and the debate – whether it was overrated?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-injured-ashes-aus-vs-eng-sydney-test-abductor-pain-ecb-statement-2847851-2026-01-07",
      "headline": "Ashes: Ben Stokes injured in Sydney as England's tour goes from bad to worseEngland's Ashes misery deepened in Sydney after Ben Stokes limped off injured on Day 4. The captain's groin problem added to England's growing list of concerns in a tour slipping further away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/why-indian-hockey-needs-manpreet-singh-la-olympics-asian-games-world-cup-2847704-2026-01-07",
      "headline": "With LA 28 qualification in sight, can India move on from Manpreet Singh?As India chase Asian Games gold and LA Olympics qualification, Manpreet Singh's fitness, experience and versatility remain irreplaceable. But with his future now under cloud, can Indian hockey afford to move on from their veteran dynamic midfielder?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-bangladesh-t20-world-cup-plea-rejected-matches-outside-india-mustafizur-rahman-2847835-2026-01-07",
      "headline": "ICC rejects Bangladesh's request to move T20 World Cup matches out of IndiaThe ICC has turned down Bangladesh's request to move T20 World Cup matches out of India, sources tell India Today. The decision deepens tensions after Mustafizur Rahman's IPL exit and security concerns raised by BCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-fun-interview-chatgpt-ai-use-coaching-club-owner-argentina-fifa-world-cup-2847824-2026-01-07",
      "headline": "Lionel Messi gets candid in fun interview, opens up on AI use and being 'weird'Lionel Messi peeled back the layers in a rare, fun-filled interview, speaking openly about solitude, routines and modern technology. From AI to social media, the football icon showed a refreshingly human side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-live-score-today-pv-sindhu-satwiksairaj-chirag-2847809-2026-01-07",
      "headline": "Malaysia Open live score: PV Sindhu wins opening round in straight gamesMalaysia Open 2026 live score and updates: PV Sindhu has made a winning start to the 2026 season. The World No. 18 beats Sung Shuao Yun of Chinese Taipei in straight games to move into the second round of the Super 1000 tournament. Earlier on Tuesday, Lakshya Sen and Ayush Shetty won their first round in men's singles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-pakistan-super-league-ipl-exit-kolkata-knight-riders-icc-bangladesh-2847803-2026-01-07",
      "headline": "After IPL exit, Bangladesh's Mustafizur Rahman joins Pakistan Super LeagueMustafizur Rahman has joined the Pakistan Super League shortly after being released from the IPL. The Bangladesh pacer's move follows KKR's decision to end his contract amid tensed cross-country relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-new-zealand-squad-jacob-duffy-rcb-bowler-maiden-spin-heavy-mitchell-santner-2847797-2026-01-07",
      "headline": "New Zealand announce spin-heavy T20 World Cup squad, include in-form RCB pacerNew Zealand named a spin-focused T20 World Cup squad built for Indian conditions and experience ahead of tournament. In-form pacer Jacob Duffy headlines selection after record-breaking year and maiden global tournament call-up with deserved reward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-phillips-left-handed-batting-switch-t20-world-cup-2026-2847785-2026-01-07",
      "headline": "Glenn Phillips turns left-handed: Is this NZ's secret plan for World Cup?New Zealand's Glenn Phillips is a unique player. He bats, bowls, keeps and is an incredible fielder on the boundary rope. Right-hander Phillips seems to have added one more weapon in his arsenal, batting left-handed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sg-pipers-nine-indian-players-womens-hil-bengal-tigers-shootout-2847769-2026-01-06",
      "headline": "Historic 1st as SG Pipers opt to field 9 Indian stars in Women's Hockey India LeagueIn a historic first in the Women's Hockey India League, the SG Pipers named nine Indian players in their starting XI for the clash against Shrachi Bengal Tigers on Tuesday, January 6. The Pipers went down fighting in the game in a sudden-death shootout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-unfazed-ipl-snub-t20-world-cup-controversy-2847761-2026-01-06",
      "headline": "After IPL snub, Mustafizur Rahman unfazed by India-Bangladesh T20 World Cup sagaAfter his controversial IPL snub, Mustafizur Rahman appears to be unfazed by all the noise surrounding the India-Bangladesh T20 World Cup row. Bangladesh have refused to send their team to India for the upcoming ICC event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vs-nz-t20-world-cup-2847756-2026-01-06",
      "headline": "No need for split coaching in Indian cricket at the moment: HarbhajanFormer India cricketer Harbhajan Singh does not want split coaching in the Indian team. Harbhajan has backed Gautam Gambhir as questions continue to loom about his red-ball credentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ole-gunnar-solskjaer-spotted-cheshire-manchester-united-return-2847742-2026-01-06",
      "headline": "Ole back at Manchester United? Solskjaer seen in Cheshire amid return rumoursAmist Manchester United return rumours, Ole Gunnar Solksjaer was spotted in Cheshire on Tuesday, January 6. Solksjaer is considered to be United's top target for the interim manager role until the end of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-t20-world-cup-squad-sandeep-lamichhane-rohit-paudel-2847714-2026-01-06",
      "headline": "Controversial spinner Lamichhane headlines Nepal's 15-member T20 World Cup squadSandeep Lamichhane will be spearheading Nepal's spin attack as they reveal the 15-member squad for the upcoming T20 World Cup 2026 on Tuesday, January 6. Rohit Paudel will be leading the side with Dipendra Airee acting as his deputy. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}