{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/black-monday-us-jim-cramer-expert-warns-donald-trump-tariffs-could-trigger-worst-crash-since-1987-2704742-2025-04-06",
      "headline": "'Black Monday': US expert warns Trump tariffs could trigger worst crash since 1987Jim Cramer warned that markets might face a bloodbath similar to 1987 - when the Dow Jones suffered its biggest single-day crash to date. He claimed that if the US President didn't 'reach out' to nations which have not imposed retaliatory tariffs and reward them for their compliance, the situation could worsen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-helpline-startups-dukandari-jibe-innovation-startup-maha-kumbh-event-2704717-2025-04-06",
      "headline": "Piyush Goyal announces helpline for startups days after 'dukandari' jibe at themDays after questioning the innovation of Indian startups overtly focussing on food delivery and betting and fantasy sports apps, Commerce and Industry Minister Piyush Goyal announced a helpline for startups if they wanted to make suggestions or file complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-china-us-trade-war-unfolded-a-timeline-of-tariffs-and-countermoves-glbs-2704712-2025-04-06",
      "headline": "How China-US trade war unfolded: A timeline of tariffs and countermovesChina is responding forcefully to Trump's latest tariffs with a 34% tax on US imports, rare earth export curbs, company bans, and WTO action, raising fears of another full-blown trade war. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/british-automobile-maker-jaguar-land-rover-suspend-shipments-to-us-over-tariffs-britain-2704600-2025-04-05",
      "headline": "Jaguar Land Rover to suspend shipments to US over tariffs on BritainJaguar Land Rover, which is owned by India's Tata Motors, confirmed the temporary export suspension after the Times newspaper reported the plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-warns-of-60-chance-of-global-recession-after-donald-trumps-tariffs-2704407-2025-04-05",
      "headline": "JP Morgan warns of 60% chance of global recession after Trump's tariffsFollowing the US-China trade war, global investment firm J.P. Morgan said it now sees a 60% chance of the global economy entering recession by year-end, up from 40% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05",
      "headline": "Wall Street shatters as Trump tariffs trigger worst day in US markets since 2020US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-crashes-2000-points-as-trumps-tariffs-spark-global-market-panic-glbs-2704333-2025-04-05",
      "headline": "Dow crashes 2,000 points as Trump's tariffs spark global market panicGlobal markets plunged as Trump's tariffs triggered a trade war escalation with China. The Dow fell over 2,000 points, crude prices tumbled, and investors feared an impending global recession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-warns-higher-inflation-slower-growth-trump-tariffs-2704280-2025-04-04",
      "headline": "Higher inflation, slower growth: US Federal Reserve chair warns after Trump tariffsUS Federal Reserve chair Jerome Powell spoke as global markets continued a swoon that has wiped some 10 per cent off major US stock indexes since Trump announced a raft of new tariffs on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-opened-sharply-lower-after-chinas-retaliatory-tariff-measure-nasdaq-composite-2704230-2025-04-04",
      "headline": "US stocks plummet after China's retaliatory levies in response to Trump tariffsNasdaq IXIC dropped more than 20 per cent from its all-time closing high touched in December, putting it on course to confirm a bear market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-return-2025-itr-2-filing-now-made-easier-check-latest-updates-2704180-2025-04-04",
      "headline": "Income tax return 2025: ITR-2 filing now made easierITR-2 is meant for individuals whose annual income is above Rs 50 lakh or who earn from sources like rent, capital gains, or other sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jacqueline-fernandezs-mother-dies-due-to-stroke-and-health-complications-2704827-2025-04-06",
      "headline": "Jacqueline Fernandez's mother dies due to health complicationsJacqueline Fernandez is grieving the loss of her mother, who died after being hospitalised in Mumbai. The actor and her family will release a statement soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-unaware-of-acp-pradyuman-track-over-cid-okay-with-it-2704824-2025-04-06",
      "headline": "Shivaji Satam aka ACP Pradyuman has 'no clue' about his track being over in CIDShivaji Satam, who plays ACP Pradyuman on CID, spoke about his character's death on the show, stating he was not informed of the end of his track and is currently on a break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tron-ares-trailer-jared-leto-unleashes-digital-chaos-as-he-enters-the-real-world-2704782-2025-04-06",
      "headline": "Tron Ares trailer: Jared Leto unleashes digital chaos as he enters the real worldTron Ares, the third instalment in the iconic sci-fi series, releases its trailer, showcasing a thrilling chase and digital mayhem. Jared Leto stars as Ares, a program crossing into the real world, with a stellar cast alongside him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-set-to-make-telugu-debut-after-chhaava-success-2704768-2025-04-06",
      "headline": "Akshaye Khanna set to make Telugu debut after Chhaava successAkshaye Khanna has been confirmed to join the cast of Mahakali, the next film in the Prasanth Varma Cinematic Universe. This will also mark the actor's Telugu debut.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/diljit-dosanjh-will-smith-groove-to-dhol-beats-fans-call-it-ultimate-collab-2704762-2025-04-06",
      "headline": "Diljit Dosanjh, Will Smith groove to dhol beats. Fans call it ultimate collabDiljit Dosanjh surprised fans with a viral Instagram video featuring Will Smith. The duo was seen enjoying a vibrant Bhangra dance, sparking excitement online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hugh-grant-criticises-heathrow-officer-for-creepy-questions-with-his-children-fans-react-2704746-2025-04-06",
      "headline": "Hugh Grant criticises Heathrow officer for 'creepy' questions with his children. Fans reactActor Hugh Grant expressed his discontent on social media after a Heathrow immigration officer's comments to his children. The incident has divided opinions online, with many defending the officer's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/miss-mary-review-meena-kumari-gemini-ganesan-kishore-kumar-2704692-2025-04-06",
      "headline": "Miss Mary: The Meena Kumari-Kishore Kumar classic that captured age of innocenceIn this week's Retro Review, we revisit 'Miss Mary', starring Meena Kumari, Gemini Ganesan and Kishore Kumar. Perhaps one of India's most remade films, the comedy movie still remains a classic six decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhota-saif-ali-khan-in-talks-for-race-4-producer-ramesh-taurani-2704640-2025-04-05",
      "headline": "Sidharth Malhotra, Saif Ali Khan in talks for Race 4: Producer Ramesh TauraniProducer Ramesh Taurani clarified the casting rumors surrounding Race 4. He mentioned that only Saif Ali Khan and Sidharth Malhotra are currently in talks for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-10-teen-shows-to-watch-on-netflix-in-april-2025-glbs-2704466-2025-04-05",
      "headline": "Top 10 teen shows to watch on Netflix in April 2025Netflix's April 2025 lineup features ten top-rated teen shows, blending romance, drama, comedy, and fantasy. Highlights include Heartstopper, Stranger Things, Never Have I Ever, and Teenage Bounty Hunters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/burqa-city-director-fabrice-bracq-surprised-by-similarity-with-laapataa-ladies-plot-2704619-2025-04-05",
      "headline": "Burqa City director 'surprised' by similarity with Laapataa Ladies' plotFrench director Fabrice Bracq accused Kiran Rao's Laapataa Ladies of plagiarising his short film Burqa City. The controversy has sparked a debate on originality and creative influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/laapataa-ladies-writer-biplab-goswami-denies-plagiarism-claims-in-social-media-post-2704593-2025-04-05",
      "headline": "Laapataa Ladies writer Biplab Goswami denies plagiarism claims: Completely untrueBiplab Goswami, screenwriter of Laapataa Ladies, denied plagiarism allegations following online comparisons to Burqa City. He asserted the film's originality, citing years of research and screenplay registration since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-calls-jr-ntr-favourite-co-star-wants-to-work-with-christopher-nolan-2704562-2025-04-05",
      "headline": "Hrithik Roshan calls Jr NTR his favourite co-star: He's brilliant and amazingHrithik Roshan, during his Tour marking 25 years in Bollywood, called Jr NTR his favourite co-star. He also spoke about directing Krrish 4 and his desire to work with Christopher Nolan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actors-mugdha-chaphekar-ravish-desai-separation-9-years-of-marriage-2704534-2025-04-05",
      "headline": "Mugdha Chaphekar, Ravish Desai announce separation after 9 years of marriageTV actors Mugdha Chaphekar and Ravish Desai have announced their separation after nine years of marriage. They have been living apart for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-scott-india-debut-circus-maximus-tour-second-show-added-tickets-live-2704500-2025-04-05",
      "headline": "Travis Scott India Tour: Second show added in Delhi due to high demandTravis Scott is set to perform in India for the first time with his Circus Maximus Tour on October 18, 2025. Owing to a huge demand, a second show has also been added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-ott-release-when-and-where-to-watch-vicky-kaushals-blockbuster-film-2704498-2025-04-05",
      "headline": "Chhaava on OTT: When and where to watch Vicky Kaushal's blockbuster filmVicky Kaushal's blockbuster Chhaava is gearing up for its digital release on Netflix, expected on April 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rrr-stars-ram-charan-jr-ntr-to-reunite-with-rajamouli-royal-albert-hall-2704467-2025-04-05",
      "headline": "RRR stars Ram Charan, Jr NTR to reunite with director Rajamouli, but not for filmRam Charan and Jr NTR, stars of the blockbuster RRR, will join director SS Rajamouli and composer MM Keeravaani for a special Q&A session at London's Royal Albert Hall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-funeral-amitabh-bachchan-salim-khan-hug-abhishek-bachchan-arbaaz-khan-2704468-2025-04-05",
      "headline": "Teary-eyed Amitabh Bachchan attends Manoj Kumar's funeral with son AbhishekVeteran actor Manoj Kumar's last rites are being conducted in Juhu, Mumbai, with several celebrities, including Amitabh Bachchan, present to pay their respects. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-box-office-day-9-mohanlal-prithviraj-sukumaran-film-nears-rs-100-crore-domestically-new-malayalam-record-2704445-2025-04-05",
      "headline": "Empuraan box office Day 9: Mohanlal film becomes highest-grossing Malayalam filmL2 Empuraan continues its impressive box office run, earning Rs 2.9 crore on its ninth day. With a total of Rs 91.15 crore in India and strong overseas earnings, it may become the highest-grossing Malayalam film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lost-charm-of-bollywood-music-veer-zaara-urvashi-rautela-tauba-tauba-2704071-2025-04-05",
      "headline": "Echoes of the past: Lost charm of Bollywood music, can the glory days be back?It has been a while since the Hindi film industry produced a full album which boasted some memorable tracks. So does this mean Bollywood music has lost its sheen? Artistes such as Lalit Pandit and Shabana Azmi weigh in."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-inaugurate-pamban-bridge-india-first-vertical-lift-sea-bridge-today-rameshwaram-tamil-nadu-2704733-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi inaugurates India's first vertical lift sea bridge in Tamil NaduRooted in mythology, Pamban Bridge holds deep spiritual significance, as the Ramayana recounts the construction of Ram Setu beginning from Dhanushkodi, near Rameswaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-prime-minister-keir-starmer-to-declare-end-of-globalisation-amid-trumps-trade-war-2704763-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK Prime Minister to declare end of globalisation amid Trump's trade warThe UK Prime Minister Keir Starmer is all set to announce that globalisation - which began with the fall of the Soviet Union in 1991 - has caused disappointment to millions of voters as Trump's unprecedented 10 per cent 'baseline' tariffs slipped the global markets into uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mk-stalin-skips-pm-modi-pamban-event-in-tamil-nadu-demands-fair-delimitation-guarantee-2704840-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stalin skips PM's Pamban event in Tamil Nadu, demands fair delimitation guaranteeTamil Nadu Chief Minister MK Stalin said the Prime Minister should also ensure that the state's share of parliamentary seats, in percentage terms, remains unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/bride-to-be-dies-after-fall-from-roller-coaster-at-delhi-amusement-park-2704753-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bride-to-be, 24, dies after fall from roller coaster at Delhi amusement parkPriyanka, a sales manager from Chanakyapuri, was at Fun and Food Village near the Kapashera border with her future husband, Nikhil, on Wednesday afternoon, when the incident happened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/apples-farming-rajasthan-thai-guava-mp-commercial-farming-reaping-profit-agriculture-dragon-fruit-bihar-kesar-farm-market-2704187-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Apples in Rajasthan, Thai guava in MP: Farming seeing a start-up-like disruptionA new breed of farmers in India are going beyond the lure of paddy and wheat MSP, and sowing unconventional cash crops that are in high demand. They are bending the climate and conventional wisdom in the process by growing apples and saffron in Rajasthan, dragon fruit in Bihar and Thai guava in Madhya Pradesh. If the Green Revolution filled stomachs, Green Revolution 2.0 promises to fill bank accounts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-poses-as-uk-cardiologist-performs-surgeries-patients-die-madhya-pradesh-damoh-2704774-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man poses as UK cardiologist, performs 15 surgeries, 7 patients dieIn a letter to the NHRC, the complainant alleged that the hospital did not report the deaths to the local police or hospital outpost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/na-na-hey-hey-goodbye-white-house-shares-new-deportation-video-x-users-react-2704855-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Na na, hey hey, goodbye': White House's new deportation video sparks backlashThe White House is facing fresh backlash after posting a video celebrating migrant deportations - the second in recent weeks - featuring detainees being processed to the tune of the pop hit 'Na Na Hey Hey Kiss Him Goodbye'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-row-rahul-gandhis-church-land-claim-draws-rajeev-chandrasekhar-ire-2704831-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf row: Rahul Gandhi's church land claim draws Rajeev Chandrasekhar's ireIn response to the Waqf's criticism,  Rajeev Chandrashekhar said that the amended law seeks to undo the injustice Congress had committed in 2013, when the Waqf law was last amended, because of its \"shameless appeasement politics.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-match-preview-predicted-xi-pitch-conditions-2704773-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRH vs GT Match Preview: Can composed Gujarat make life worse for Hyderabad?IPL 2025, Sunrisers Hyderabad vs Gujarat Titans Match Preview: As Sunrisers Hyderabad aim to halt their losing streak, Gujarat Titans ride into the clash brimming with momentum. With high stakes, a batter-friendly pitch, and dew in play, fireworks are expected in this crucial IPL 2025 showdown at Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/black-monday-us-jim-cramer-expert-warns-donald-trump-tariffs-could-trigger-worst-crash-since-1987-2704742-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Black Monday': US expert warns Trump tariffs could trigger worst crash since 1987Jim Cramer warned that markets might face a bloodbath similar to 1987 - when the Dow Jones suffered its biggest single-day crash to date. He claimed that if the US President didn't 'reach out' to nations which have not imposed retaliatory tariffs and reward them for their compliance, the situation could worsen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-sri-lankan-president-anura-kumara-dissanayake-state-banquet-what-unites-india-sri-lanka-curry-cuisine-cricket-2704794-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Curry, cuisine, and cricket: PM Modi on what unites India and Sri LankaThe Prime Minister also highlighted the symbolic significance of shared sacred sites, saying, \"From Bodh Gaya to Anuradhapura and Rameshwaram to Thirukoneswaram, the Buddhist and Ramayana-linked pilgrimage sites reflect our cultural ties.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/land-of-gods-kingdom-of-godmen-where-superstition-overpowers-faith-standpoint-2704812-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Land of Gods, kingdom of godmen: Where superstition overpowers faithIn India, where faith and spirituality are deeply rooted in culture, self-styled godmen often exploit the vulnerability of millions, manipulating devotion to build powerful, lucrative empires. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-woman-collapses-dies-while-giving-farewell-speech-in-college-maharashtra-dharashiv-2704751-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman, 20, collapses and dies while giving farewell speech in collegeThe video circulating online shows Varsha laughing and addressing the gathering moments before she loses consciousness and collapses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jacqueline-fernandezs-mother-dies-due-to-stroke-and-health-complications-2704827-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jacqueline Fernandez's mother dies due to health complicationsJacqueline Fernandez is grieving the loss of her mother, who died after being hospitalised in Mumbai. The actor and her family will release a statement soon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-employee-leash-walking-knees-chained-dogs-alleged-workplace-harassment-2704727-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala employee made to crawl like dog for failing targets, viral video showsA video showing a man being tied with a leash around his neck and forced to walk on his knees by a man who did not fulfill his targets at a private marketing firm went viral. The Kerala Labour Department ordered a probe into the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/does-a-happy-relationship-really-make-you-gain-weight-2703613-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Does being in a happy relationship really make you gain weight?Experts explain that having a healthy relationship at times leads to one's weight gain, but it varies with everyone too. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-470-04-04-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamras-letter-to-mumbai-police-after-skipping-three-summons-in-eknath-shinde-row-2704765-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra's letter to Mumbai Police after skipping third summon in Shinde rowKunal Kamra sparked a massive row after a clip from his stand-up show went viral on social media where he made a joke at Shiv Sena leader Eknath Shinde and referred to him as a 'traitor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-trashes-mans-rs-55-lakh-to-rs-20000-pay-cut-claim-to-skip-maintenance-2704779-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court trashes techie's Rs 5.5 lakh to Rs 20,000 pay cut claim to skip maintenanceTearing apart the engineer's claims, the Bombay High Court said it was hard to believe that his salary had dropped to Rs 20,000 per month when his updated matrimonial profile listed his annual income as being between Rs 35 and Rs 50 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/miss-mary-review-meena-kumari-gemini-ganesan-kishore-kumar-2704692-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Miss Mary: The Meena Kumari-Kishore Kumar classic that captured age of innocenceIn this week's Retro Review, we revisit 'Miss Mary', starring Meena Kumari, Gemini Ganesan and Kishore Kumar. Perhaps one of India's most remade films, the comedy movie still remains a classic six decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-vs-rcb-jasprit-bumrah-2704783-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai Indians tease Jasprit Bumrah return ahead of RCB clashStar fast bowler Jasprit Bumrah might play Mumbai Indians' next match against Royal Challengers Bengaluru, the team teased on Sunday, April 6. MI put up a post for Bumrah who joined the team ahead of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/hands-off-protests-thousands-unite-across-us-to-protest-trump-and-musk-policies-glbs-2704720-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Hands Off!' protests: Thousands unite across US to oppose Trump and Musk's policiesThe Hands Off! protests are a series of demonstrations organized to express dissatisfaction with the Trump administration's policies, particularly federal layoffs, mass deportations, and other controversial actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/madhya-pradesh-man-pours-water-for-kuno-national-park-cheetahs-video-2704769-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man pours water for Kuno cheetahs. Video comes days after clashes with villagersA video of a man pouring water for a cheetah and its cubs went viral on social media. Authorities at Kuno National Park said the video is currently under review."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-ipl-2025-nitish-reddy-abhishek-sharma-2704841-2025-04-06",
      "headline": "Not Travishek, Nitish Reddy needs to change batting approach for SRH: JafferSRH vs GT: Former batter Wasim Jaffer has said all-rounder Nitish Reddy needs to bat better in the IPL. Jaffer has asked Nitish to provide stability to the line-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-kl-rahul-kevin-pietersen-paint-on-dry-wall-watch-2704826-2025-04-06",
      "headline": "KL Rahul reminds Pietersen of old 'paint on a wall dry' tweet after CSK knockDelhi Capitals batter KL Rahul, in what was a fun banter with his side's mentor Kevin Pietersen, reminded the former England skipper about his old tweet that criticised the India batter's batting style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-simon-helmot-travis-head-abhishek-sharma-2704694-2025-04-06",
      "headline": "SRH vs GT: Travishek duo won't tone down aggression, says assistant coachIPL 2025, SRH vs GT: SunRIsers Hyderabad assistant coach Simon Helmot said Travis Head and Abhishek Sharma will continue being aggressive despite results not going their way early in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-japan-grand-prix-result-max-verstappen-norris-piastri-2704789-2025-04-06",
      "headline": "Max Verstappen wins his 4th straight Japan Grand Prix. Norris, Piastri finish 2nd and 3rd.Red Bull's Max Verstappen won his 4th straight Japan Grand Prix on Sunday, April 6. McLaren's Lando Norris and Oscar Piastri finished 2nd and 3rd respectively."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-live-score-ipl-2025-updates-sunrisers-hyderabad-gujarat-titans-2704787-2025-04-06",
      "headline": "SRH vs GT Live Score, IPL 2025: Sunrisers Hyderabad look to arrest the slideSunrisers Hyderabad (SRH) vs Gujarat Titans (GT) Live Score, IPL 2025: Sunrisers Hyderabad will take on Gujarat Titans at their home ground at the Rajiv Gandhi Stadium in Hyderabad. SRH have lost three games on the trot and will look to arrest the slide against a confident Gujarat side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-vs-rcb-jasprit-bumrah-2704783-2025-04-06",
      "headline": "Mumbai Indians tease Jasprit Bumrah return ahead of RCB clashStar fast bowler Jasprit Bumrah might play Mumbai Indians' next match against Royal Challengers Bengaluru, the team teased on Sunday, April 6. MI put up a post for Bumrah who joined the team ahead of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-match-preview-predicted-xi-pitch-conditions-2704773-2025-04-06",
      "headline": "SRH vs GT Match Preview: Can composed Gujarat make life worse for Hyderabad?IPL 2025, Sunrisers Hyderabad vs Gujarat Titans Match Preview: As Sunrisers Hyderabad aim to halt their losing streak, Gujarat Titans ride into the clash brimming with momentum. With high stakes, a batter-friendly pitch, and dew in play, fireworks are expected in this crucial IPL 2025 showdown at Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-vikram-solanki-srh-vs-gt-2704663-2025-04-06",
      "headline": "Siraj has been exceptional, don't be quick to judge: Vikram SolankiIPL 2025, SRH vs GT: Director of Cricket Operations at Gujarat Titans, Vikram Solanki, praised Mohammed Siraj for being exceptional for the team. Siraj won the Player of the Match award against the Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-shubman-gill-ishan-mohammed-siraj-batting-watch-video-2704764-2025-04-06",
      "headline": "SRH vs GT: Shubman Gill and Ishan Kishan hilariously rate 'batter' Mohammed SirajAhead of GT and SRH's Hyderabad showdown, close friends Ishan Kishan and Shubman Gill shared a light-hearted moment hyping up Mohammed Siraj's batting in the nets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-ashutosh-sharma-interact-batting-watch-2704752-2025-04-06",
      "headline": "Watch: MS Dhoni talks batting with DC's Ashutosh Sharma after Chepauk clashDelhi Capitals batter Ashutosh Sharma took to Instagram to share a glimpse of his interaction with Chennai Super Kings star-man MS Dhoni after the Chepauk clash between the two sides. Although Ashutosh was dismissed for 1 against CSK, he has been key to DC's success in \r\nIPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-villian-chennai-struggle-2704750-2025-04-06",
      "headline": "CSK's identity crisis could turn MS Dhoni into the villainIPL 2025: MS Dhoni wasn't meant to carry CSK in IPL 2025. He planned and trained to just finish with a flourish. But a timid, unrecognisable CSK now risks rewriting his farewell as a fall from grace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-match-preview-predicted-xi-pitch-conditions-2704773-2025-04-06",
      "headline": "SRH vs GT Match Preview: Can composed Gujarat make life worse for Hyderabad?IPL 2025, Sunrisers Hyderabad vs Gujarat Titans Match Preview: As Sunrisers Hyderabad aim to halt their losing streak, Gujarat Titans ride into the clash brimming with momentum. With high stakes, a batter-friendly pitch, and dew in play, fireworks are expected in this crucial IPL 2025 showdown at Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-vikram-solanki-srh-vs-gt-2704663-2025-04-06",
      "headline": "Siraj has been exceptional, don't be quick to judge: Vikram SolankiIPL 2025, SRH vs GT: Director of Cricket Operations at Gujarat Titans, Vikram Solanki, praised Mohammed Siraj for being exceptional for the team. Siraj won the Player of the Match award against the Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-shubman-gill-ishan-mohammed-siraj-batting-watch-video-2704764-2025-04-06",
      "headline": "SRH vs GT: Shubman Gill and Ishan Kishan hilariously rate 'batter' Mohammed SirajAhead of GT and SRH's Hyderabad showdown, close friends Ishan Kishan and Shubman Gill shared a light-hearted moment hyping up Mohammed Siraj's batting in the nets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-ashutosh-sharma-interact-batting-watch-2704752-2025-04-06",
      "headline": "Watch: MS Dhoni talks batting with DC's Ashutosh Sharma after Chepauk clashDelhi Capitals batter Ashutosh Sharma took to Instagram to share a glimpse of his interaction with Chennai Super Kings star-man MS Dhoni after the Chepauk clash between the two sides. Although Ashutosh was dismissed for 1 against CSK, he has been key to DC's success in \r\nIPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-villian-chennai-struggle-2704750-2025-04-06",
      "headline": "CSK's identity crisis could turn MS Dhoni into the villainIPL 2025: MS Dhoni wasn't meant to carry CSK in IPL 2025. He planned and trained to just finish with a flourish. But a timid, unrecognisable CSK now risks rewriting his farewell as a fall from grace."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}