{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-1-check-latest-subscription-gmp-expected-listing-gains-2623281-2024-10-25",
      "headline": "Afcons Infrastructure IPO Day 1: Check latest subscription, GMP Afcons Infrastructure's IPO aims to raise Rs 5,430 crore and consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-dalal-street-losing-streak-foreign-investor-exodus-dull-q2-earnings-2623206-2024-10-25",
      "headline": "Sensex, Nifty continue losing streak amid ongoing FII exodus, dull Q2 earnings At the closing bell, the Sensex was down 662.87 points at 79,402.29, while the NSE Nifty50 settled 189.55 points lower at 24,209.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-view-will-it-double-your-money-gmp-here-what-experts-say-2623194-2024-10-25",
      "headline": "Waaree Energies IPO: Will it double your investment? Here's what experts sayWaaree Energies IPO attracted significant interest from investors and was subscribed 79.44 times by the end of the bidding process on October 23, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex falls 800 points: Should investors buy the dip or hold back?Stock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's estate worth Rs 10,000 crore: Who gets what in his will Ratan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dixon-technologies-shares-fall-over-9-percent-after-rally-short-lived-hit-record-high-should-you-buy-2623056-2024-10-25",
      "headline": "Explained: Why Dixon Technologies share price tumbled over 9% after early rallyThe company's stock reached a peak of Rs 15,999.95, rising by 6.21% after releasing impressive Q2 earnings on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-opens-for-bidding-subscribe-skip-good-bad-latest-gmp-review-2623022-2024-10-25",
      "headline": "Afcons Infrastructure IPO opens for bidding: Should you subscribe or skip? Afcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-check-latest-gmp-stock-market-debut-date-and-expected-listing-gains-2623028-2024-10-25",
      "headline": "Waaree Energies IPO: Check GMP, allotment details, listing date and expected gainsWaaree Energies IPO: With allotments finalised on October 24, the public issue is expected to have a bumper listing on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-key-reasons-behind-decline-foreign-investors-fiis-volatility-overvaluation-2622987-2024-10-25",
      "headline": "Sensex drops below 80,000 as market slide continues. What's behind the dip? Sensex plunges below 80,000. What's fueling the sharp decline? Check the key factors behind the distress on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-declines-18-percent-q2-net-profit-tumbles-buy-hold-sell-brokerage-views-2622974-2024-10-25",
      "headline": "IndusInd Bank share price dips 18% after Q2 results. Should you buy, sell or hold?In the second quarter, IndusInd Bank's net profit plunged 39% year-on-year to Rs 1,325 crore, falling significantly short of what the market had expected. In comparison, the profit stood at Rs 2,181.47 crore in the same quarter a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-volatility-itc-indusind-bank-share-price-q2-results-2622971-2024-10-25",
      "headline": "Sensex, Nifty continue slide amid volatility; IndusInd Bank tumbles 15%The S&P BSE Sensex was down 370.19 points to 79,694.97 at 10:02 am, while the NSE Nifty50 declined 141 points to trade at 24,258.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-25-2024-precious-metals-witness-dip-on-mcx-latest-rates-2622961-2024-10-25",
      "headline": "Gold, silver price today, October 25, 2024: Precious metals witness dip on MCXGold Price Today October 25, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-canada-tensions-hit-trade-leaving-business-owners-in-a-bind-2622688-2024-10-24",
      "headline": "India-Canada tensions hit trade, leaving business owners in a bindTotal trade between both nations since 2021, was at roughly $6 billion, increased to $9 billion in 2022, but dropped to $8 billion in 2023 as per data from the consulate general of India on commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-mukesh-ambani-nvidia-jensen-huang-partner-to-build-large-scale-ai-infrastructure-in-india-2622561-2024-10-24",
      "headline": "Reliance, Nvidia partner to build large-scale AI infrastructure in IndiaThe partnership will see Reliance deploying Nvidia's latest GB 200 supercomputer technology to build a massive AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-date-expectations-double-investors-wealth-listing-over-rs-3000-latest-gmp-2622558-2024-10-24",
      "headline": "Waaree Energies IPO to double investors wealth? Here is what we knowWith the latest grey market premium (GMP) suggesting a sharp increase, Waaree Energies IPO is expected to deliver substantial returns to investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-fmcg-stocks-hul-nestle-india-top-losers-2622526-2024-10-24",
      "headline": "Sensex, Nifty end flat as FMCG stocks fall; HUL, Nestle India top losersThe S&P BSE Sensex was down 16.82 points to 80,065.16 at the closing bell, while the NSE Nifty50 ended 36.10 points lower at 24,399.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-platform-fee-hike-details-share-price-falls-q2fy25-results-brokerage-2622510-2024-10-24",
      "headline": "Not a rumour: Zomato clarifies on platform fee hike, shares tumble 4%In its statement, Zomato highlighted that the information about the fee hike was sourced directly from its public mobile application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nvidia-ceo-jensen-huang-ai-plans-in-india-making-ai-and-exporting-intelligence-2622492-2024-10-24",
      "headline": "Nvidia CEO's AI Plans in India: Making AI and exporting intelligenceHe pointed out that India possesses the crucial elements needed for AI development: data, energy resources, and infrastructure, that can be created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-ceo-aims-for-expanded-growth-in-india-through-new-partnerships-2622409-2024-10-24",
      "headline": "Nvidia CEO Jensen Huang aims for growth in India through new partnershipsIndia is seen as a key player in the AI market, with its population of 1.4 billion increasingly adopting AI across various sectors such as agriculture, education, and manufacturing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-parliamentary-panel-foreign-affairs-israel-gaza-ukraine-russia-sources-2623418-2024-10-25",
      "headline": "Centre briefs parliamentary panel about Canada row, says issue 'sensitive': SourcesIn the meeting, Foreign Secretary Vikram Misri shared some details about the diplomatic standoff between India and Canada. Misri also told the panel that since the issue is very sensitive, more details will be shared at a later time, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-upset-favouritism-suggested-candidate-names-sources-2623471-2024-10-26",
      "headline": "Rahul Gandhi upset with 'favouritism' in suggested candidate names: SourcesCongress leader Rahul Gandhi was upset over the names of probable candidates, suggested for the upcoming Assembly polls in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwaran-nitish-reddy-border-gavaskar-trophy-series-india-squad-rohit-sharma-2623430-2024-10-25",
      "headline": "Abhimanyu Easwaran, Nitish Reddy in India's jumbo squad for Australia TestsThe BCCI has announced a jumbo 18-member squad for the Border Gavaskar Trophy series against Australia. Abhimanyu Easwaran returned to the Test squad with Nitish Reddy and Harshit Rana earning a maiden call-up in the format. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/49-drugs-formulations-fail-quality-tests-cdsco-flags-spurious-medicines-2623455-2024-10-25",
      "headline": "Calcium, Vitamin D3 tablets among 49 drugs that fail quality testsThe drugs control panel also flagged four medicines which were manufactured by fake companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/what-eating-raw-vegetables-does-to-your-gut-2623032-2024-10-25",
      "headline": "What eating raw vegetables does to your gutPlanning to enjoy a bowl of salad for your next meal? Raw vegetables are generally a healthier choice, but many people have concerns about hygiene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-claims-arvind-kejriwal-attacked-delhi-vikaspuri-bjp-denies-2623420-2024-10-25",
      "headline": "AAP claims attack bid on Arvind Kejriwal by BJP-linked people, party deniesAAP leaders launched an attack against the BJP on Friday, alleging that people linked to the party attempted to attack Arvind Kejriwal. The Delhi BJP chief refuted the charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-today-impact-sting-operation-fake-ghee-leads-to-raids-uttar-pradesh-hathras-2623207-2024-10-25",
      "headline": "India Today impact: Sting op on fake ghee leads to raids in UP's HathrasAn India Today TV report revealed disturbing details about ghee sold in local markets in Uttar Pradesh's Hathras. The sting operation on adulteration in ghee led to the officials taking note of the issue, with raids being conducted on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-2024-donald-trump-supporter-elon-musk-contact-putin-report-kremlin-russia-2623477-2024-10-26",
      "headline": "Trump supporter Elon Musk in contact with Putin, claims report; Kremlin deniesThe Wall Street Journal report on Friday claimed that Elon Musk is in regular contact with Russian President Vladimir Putin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-dil-luminati-india-tour-delhi-concert-jawaharlal-nehru-stadium-2623464-2024-10-25",
      "headline": "Diljit Dosanjh builds anticipation for Dil-Luminati India TourSinger Diljit Dosanjh shared his excitement ahead of the Dil-Luminati India Tour. He is set to perform in Delhi on October 26 and 27 at Jawaharlal Nehru Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-bjp-udhayanidhi-stalin-incorrect-rendition-state-song-tamil-thai-vaazhthu-dravida-row-2623429-2024-10-25",
      "headline": "Tamil Nadu BJP criticises Udhayanidhi over incorrect rendition of state songAfter the parts of the state song, Tamil Thai Vaazhthu, were sung incorrectly at an event attended by Tamil Nadu Deputy Chief Minister Udhayanidhi Stalin, the state BJP leaders slammed the DMK minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/will-there-be-any-end-to-dynastic-politics-democratic-newsroom-debates-2623360-2024-10-25",
      "headline": "Will there be any end to dynastic politics? Democratic Newsroom debatesIn this episode of Democratic Newsroom, the focus is on Maharashtra's dynastic politics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/ias-officer-tina-dabi-greets-bjp-leader-5-times-7-seconds-viral-video-triggers-debate-2623378-2024-10-25",
      "headline": "IAS officer Tina Dabi greets BJP leader 5 times in 7 seconds. Video sparks debateIn the viral video, Tina Dabi is seen bowing her head five times in a row – all in seven seconds – with folded hands as she greeted BJP leader Satish Poonia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-joe-biden-apology-native-american-boarding-schools-gaza-war-protester-2623474-2024-10-26",
      "headline": "Joe Biden apologises for Native American boarding schools, gets interruptedFrom 1819 through the 1970s, these boarding schools' purpose was to culturally assimilate Native Americans by forcibly removing them from their families, communities, religions and cultural beliefs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hoax-bomb-threats-indian-airlines-items-railway-tracks-government-social-media-meta-and-x-2623473-2024-10-26",
      "headline": "Centre ropes in Meta, X to trace those threatening Indian flights, railwaysThe Aviation Ministry, along with the IT Ministry, is looking at all the threats, while the Railway Ministry is also very closely monitoring all the incidents involving objects and dangerous items being found on railway tracks across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-row-captain-amarinder-singh-canadian-prime-minister-justin-trudeau-2623475-2024-10-26",
      "headline": "Amarinder Singh slams Justin Trudeau amid India-Canada diplomatic rowThe former Punjab Chief Minister said that India and Canada enjoyed a good relationship over the years but Justin Trudeu spoilt it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhuri-dixit-vidya-balan-house-down-ami-je-tomar-30-live-duet-2623431-2024-10-25",
      "headline": "Watch: Madhuri-Vidya bring the house down with their Ami Je Tomar live duetActors Madhuri Dixit and Vidya Balan performed live at Mumbai's Royal Opera House as they launched their track Ami Je Tomar from Bhool Bhulaiyaa 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-an-iim-ahmedabad-students-suicide-continues-to-be-discussed-a-month-later-2622678-2024-10-24",
      "headline": "Why an IIM-Ahmedabad student's suicide continues to be discussed a month laterAllegations of involvement of top institute officials in the 24-year-old death just ahead of a major event follow rows over campus restoration and change of logo"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-welcomes-germanys-move-to-increase-skilled-labour-visas-to-indians-2623251-2024-10-25",
      "headline": "PM welcomes Germany's move to grant 90,000 skilled labour visas to IndiansPrime Minister Narendra Modi has welcomed Germany's move to significantly increase the annual cap on skilled labour visas and work permits for Indian professionals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-samajwadi-party-abu-asim-azim-mva-shiv-sena-ncp-congress-seat-sharing-2623348-2024-10-25",
      "headline": "Give 5 seats or will contest on 25: Samajwadi leader's warning to MVA alliesAbu Asim Azmi, chief of Samajwadi Party's Maharashtra unit, gave a deadline to his MVA allies till Saturday afternoon to agree on his demand for five seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/william-higinbotham-physicist-invented-worklds-first-video-game-tennis-for-two-2622810-2024-10-25",
      "headline": "A physicist created the world's first-ever video gameAmerican physicist William Higinbotham's creation of Tennis for Two showed that even a physicist can serve up fun! His simple game developed in 1958 laid the foundation for the coruscating world of video gaming we enjoy today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-will-share-siblings-dog-tito-butler-cook-part-too-shantanu-naidu-share-dog-lover-prince-charles-2623113-2024-10-25",
      "headline": "In Ratan Tata's will, share not just for siblings but dog Tito and butler tooIndustrialist-philanthropist Ratan Tata, whose estate is estimated to be around Rs 10,000 crore, has left behind a share not just for his siblings but also for his butler and German Shepherd Tito. In his will, Tata has waived loans given to his executive assistant Shantanu Naidu as well.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-orders-customs-department-release-artworks-all-nude-painting-not-obscene-2623397-2024-10-25",
      "headline": "Not every nude painting is obscene: Court directs Customs to release artworksThe Bombay High Court in its observation pointed out that \"sex and obscenity are not always synonymous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ariha-shah-case-india-germany-baby-fostered-since-2021-diplomatic-channels-repatriation-2623300-2024-10-25",
      "headline": "Ariha Shah, 3, fostered in Germany since 2021, government says environment 'not natural'Ariha Shah has been under German state custody since September 2021 following allegations of abuse. The government has been working on her repatriation since then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-dil-luminati-india-tour-delhi-concert-jawaharlal-nehru-stadium-2623464-2024-10-25",
      "headline": "Diljit Dosanjh builds anticipation for Dil-Luminati India TourSinger Diljit Dosanjh shared his excitement ahead of the Dil-Luminati India Tour. He is set to perform in Delhi on October 26 and 27 at Jawaharlal Nehru Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/varun-dhawan-rides-gaiety-galaxy-grand-citadel-honey-bunny-event-samantha-raj-and-dk-2623462-2024-10-25",
      "headline": "Varun Dhawan rides into Gaiety Galaxy for grand Citadel Honey Bunny eventActor Varun Dhawan arrived in style at Gaiety Galaxy to promote his next series, Citadel Honey Bunny. The series will release on November 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhuri-dixit-vidya-balan-house-down-ami-je-tomar-30-live-duet-2623431-2024-10-25",
      "headline": "Watch: Madhuri-Vidya bring the house down with their Ami Je Tomar live duetActors Madhuri Dixit and Vidya Balan performed live at Mumbai's Royal Opera House as they launched their track Ami Je Tomar from Bhool Bhulaiyaa 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/madhuri-dixit-vidya-balan-kartik-aaryan-ami-je-tomar-30-song-bhool-bhulaiyaa-3-2623413-2024-10-25",
      "headline": "Madhuri Dixit, Vidya Balan, Kartik Aaryan and others at Ami Je Tomar song launchThe team of Bhool Bhulaiyaa 3 including Vidya Balan, Madhuri Dixit and others gathered to launch the song Ami Je Tomar 3.0 from the upcoming spooky film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturajs-only-mistake-is-wearing-yellow-jersey-fans-upset-with-exclusion-2623468-2024-10-25",
      "headline": "Ruturaj's only mistake is wearing yellow jersey: Fans upset with exclusionA certain section of fans was upset about Ruturaj Gaikwad's exclusion from both of India's T20I and Test squads against South Africa and Australia respectively. He last featured in the Indian team during the T20I series against Zimbabwe in July 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimahs-father-rubbishes-claims-of-holding-religious-activities-at-gymkhana-2623466-2024-10-25",
      "headline": "Jemimah's father rubbishes claims of holding 'religious activities' at gymkhanaJemimah Rodrigues' father, Ivan, denied allegations of misusing her Khar Gymkhana membership for religious gatherings, clarifying that prayer meetings followed club protocols. Despite the controversy, the Gymkhana acknowledged Jemimah's cricketing achievements and wished her continued success in her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-ramandeep-singh-vijay-kumar-vyshak-maiden-call-ups-2623465-2024-10-25",
      "headline": "Ramandeep and Vijaykumar Vyshak earn maiden India call-ups for SA T20IsRamandeep Singh and Vijaykumar Vyshak, IPL 2024 breakout stars, earned maiden call-ups for India's T20I squad against South Africa. Their performances provide fresh promise as India navigates key injuries ahead of the four-match series starting November 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-reddy-and-harshit-rana-earn-maiden-test-call-ups-for-australia-series-2623461-2024-10-25",
      "headline": "Nitish Reddy and Harshit Rana earn maiden Test call-ups for Australia seriesNitish Reddy and Harshit Rana earned their maiden Test call-up following their exploits in the white ball format. The BCCI announced an 18-member squad for the upcoming Border Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-knocked-out-emerging-asia-cup-afghanistan-a-tilak-varma-abhishek-sharma-2623458-2024-10-25",
      "headline": "India A knocked out of Emerging Asia Cup by a fiery Afghanistan AIndia A's journey in the Emerging Asia Cup ended with a 20-run semi-final defeat to Afghanistan A, as Tilak Varma's side fell short of a 207-run target in Al Amerat, despite a determined last push from Ramandeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-team-squad-selection-explained-2623457-2024-10-25",
      "headline": "Shami out, Axar dropped: India's jumbo squad for Border-Gavaskar Trophy explainedIndia tour of Australia: The BCCI announced a jumbo 18-man squad for the five-Test series on Friday, October 25. While Mohammed Shami was not picked, India handed maiden Test call-ups to all-rounder Nitish Kumar Reddy and fast bowler Harshit Rana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-squad-announcement-suryakumar-yadav-mayank-yadav-injured-2623452-2024-10-25",
      "headline": "India name 15-man squad for South Africa T20Is, Mayank Yadav out injuredThe BCCI has announced a 15-man squad, led by Suryakumar Yadav, for the T20I series against South Africa, blending experienced players with promising newcomers. In a big update, Mayank Yadav will miss the series due to an injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwaran-nitish-reddy-border-gavaskar-trophy-series-india-squad-rohit-sharma-2623430-2024-10-25",
      "headline": "Abhimanyu Easwaran, Nitish Reddy in India's jumbo squad for Australia TestsThe BCCI has announced a jumbo 18-member squad for the Border Gavaskar Trophy series against Australia. Abhimanyu Easwaran returned to the Test squad with Nitish Reddy and Harshit Rana earning a maiden call-up in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-morne-morkel-comeback-day-2-2623427-2024-10-25",
      "headline": " Cricket a funny game: Morne Morkel not writing off India's chances in Pune TestIndia vs New Zealand: While calling for a smarter approach from India batters, Morne Morkel said the hosts have not given up hopes of mounting a comeback and winning the second Test in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/india-hockey-team-krishan-pathak-goalkeeper-exclusive-germany-bilateral-series-2623421-2024-10-25",
      "headline": "Krishan Pathak 'thankful' to finally represent India Hockey teamIndia hockey goalkeeper Krishan Pathak shared with India Today his experience of becoming a regular choice for the national team and the responsibility of following in PR Sreejesh's footsteps after the latter's retirement post-India's Olympic bronze medal win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-el-clasico-coach-carlo-ancelotti-not-losing-sleep-la-liga-2623419-2024-10-25",
      "headline": "Real Madrid coach Ancelotti not losing any sleep for El Clasico vs BarcelonaCarlo Ancelotti downplayed pressure ahead of El Clasico, acknowledging both Real Madrid and Barcelona's strong form. With high stakes and recent success against Barcelona, Ancelotti emphasised staying focused without overthinking this highly anticipated clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-squad-announcement-suryakumar-yadav-mayank-yadav-injured-2623452-2024-10-25",
      "headline": "India name 15-man squad for South Africa T20Is, Mayank Yadav out injuredThe BCCI has announced a 15-man squad, led by Suryakumar Yadav, for the T20I series against South Africa, blending experienced players with promising newcomers. In a big update, Mayank Yadav will miss the series due to an injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwaran-nitish-reddy-border-gavaskar-trophy-series-india-squad-rohit-sharma-2623430-2024-10-25",
      "headline": "Abhimanyu Easwaran, Nitish Reddy in India's jumbo squad for Australia TestsThe BCCI has announced a jumbo 18-member squad for the Border Gavaskar Trophy series against Australia. Abhimanyu Easwaran returned to the Test squad with Nitish Reddy and Harshit Rana earning a maiden call-up in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-morne-morkel-comeback-day-2-2623427-2024-10-25",
      "headline": " Cricket a funny game: Morne Morkel not writing off India's chances in Pune TestIndia vs New Zealand: While calling for a smarter approach from India batters, Morne Morkel said the hosts have not given up hopes of mounting a comeback and winning the second Test in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/india-hockey-team-krishan-pathak-goalkeeper-exclusive-germany-bilateral-series-2623421-2024-10-25",
      "headline": "Krishan Pathak 'thankful' to finally represent India Hockey teamIndia hockey goalkeeper Krishan Pathak shared with India Today his experience of becoming a regular choice for the national team and the responsibility of following in PR Sreejesh's footsteps after the latter's retirement post-India's Olympic bronze medal win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-el-clasico-coach-carlo-ancelotti-not-losing-sleep-la-liga-2623419-2024-10-25",
      "headline": "Real Madrid coach Ancelotti not losing any sleep for El Clasico vs BarcelonaCarlo Ancelotti downplayed pressure ahead of El Clasico, acknowledging both Real Madrid and Barcelona's strong form. With high stakes and recent success against Barcelona, Ancelotti emphasised staying focused without overthinking this highly anticipated clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-couldnt-execute-plans-vs-new-zealand-in-pune-morne-morkel-2623417-2024-10-25",
      "headline": "Indian team couldn't execute plans vs New Zealand in Pune: Morne MorkelIndian team bowling coach Morne Morkel admitted that the players couldn't execute the plans against New Zealand on Day 2 of the 2nd Test against New Zealand in Pune. The Kiwis lead by 301 on Day 2 stumps. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-virat-kohli-form-in-tests-2623415-2024-10-25",
      "headline": "Undroppable no more? Virat Kohli not living up to reputation in Test cricketStar India batter Virat Kohli has been struggling to find his form in the longest format for a long time as his numbers have plummeted significantly since 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistans-sajid-khan-braves-stitches-vs-england-playing-for-nation-such-things-dont-matter-2623412-2024-10-25",
      "headline": "Sajid Khan braves stitches vs England: Playing for nation, such things don't matterPakistan's Sajid Khan braved his way through stitches and bleeding to score an unbeaten 48 on Day 2 of the 3rd Test against England in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-morne-morkel-backing-strong-response-bowlers-jasprit-bumrah-2623389-2024-10-25",
      "headline": "Bowling coach Morne Morkel backs India for 'strong response' in Pune TestIndia's bowling coach Morne Morkel expressed optimism, urging his team to mount a comeback after New Zealand gained a dominant lead on Day 2 of the Pune Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-virat-kohli-mitchell-santner-washington-sundar-pune-test-2623384-2024-10-25",
      "headline": "IND vs NZ: Virat Kohli getting out to full toss, a shock for Mitchell Santner tooNew Zealand left-arm spinner Mitchell Santner revealed that he was left shocked after Virat Kohli's dismissal on a full toss on Day 2 of the second Test against New Zealand in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-hopes-not-lost-when-india-chased-down-300-plus-target-in-4th-innings-at-home-2623382-2024-10-25",
      "headline": "All hopes not lost: When India chased down 300-plus target in 4th innings at homeIndia will be chasing a 300-plus target in their 4th innings vs New Zealand in the 2nd Test in Pune. The only instance of a team chasing down this many runs was when India chased down 387 runs against England in Chennai in 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-hockey-vs-germany-krishan-pathak-exclusive-goalkeeper-pr-sreejesh-successor-2623376-2024-10-25",
      "headline": "Krishan Pathak exclusive: '6 years with PR Sreejesh big help for my career'India goalkeeper Krishan Pathak credited his six-year experience with PR Sreejesh as essential to his growth, showing his skills with a crucial performance in India's 5-3 comeback win over Germany, marking a new era in Indian hockey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-recalls-ugly-ipl-episode-with-virender-sehwag-punjab-kings-ipl-2623339-2024-10-25",
      "headline": "Glenn Maxwell recalls ugly IPL episode with Virender Sehwag: We never spoke againAustralia all-rounder Glenn Maxwell has revealed his ugly episode with Virender Sehwag in Punkab Kings during the Indian Premier League 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-virat-kohli-mitchell-santner-washington-sundar-pune-test-2623384-2024-10-25",
      "headline": "IND vs NZ: Virat Kohli getting out to full toss, a shock for Mitchell Santner tooNew Zealand left-arm spinner Mitchell Santner revealed that he was left shocked after Virat Kohli's dismissal on a full toss on Day 2 of the second Test against New Zealand in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-hopes-not-lost-when-india-chased-down-300-plus-target-in-4th-innings-at-home-2623382-2024-10-25",
      "headline": "All hopes not lost: When India chased down 300-plus target in 4th innings at homeIndia will be chasing a 300-plus target in their 4th innings vs New Zealand in the 2nd Test in Pune. The only instance of a team chasing down this many runs was when India chased down 387 runs against England in Chennai in 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-hockey-vs-germany-krishan-pathak-exclusive-goalkeeper-pr-sreejesh-successor-2623376-2024-10-25",
      "headline": "Krishan Pathak exclusive: '6 years with PR Sreejesh big help for my career'India goalkeeper Krishan Pathak credited his six-year experience with PR Sreejesh as essential to his growth, showing his skills with a crucial performance in India's 5-3 comeback win over Germany, marking a new era in Indian hockey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-recalls-ugly-ipl-episode-with-virender-sehwag-punjab-kings-ipl-2623339-2024-10-25",
      "headline": "Glenn Maxwell recalls ugly IPL episode with Virender Sehwag: We never spoke againAustralia all-rounder Glenn Maxwell has revealed his ugly episode with Virender Sehwag in Punkab Kings during the Indian Premier League 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-rawalpindi-test-score-day-2-saud-shakeel-nomal-ali-2623320-2024-10-25",
      "headline": "Rawalpindi Test: Pakistan sniff rare home series win after Saud Shakeel heroics Pakistan vs England, 3rd Test: Saud Shakeel's sensational 134 and gritty 40s from Noman Ali and Sajid Khan helped Pakistan recover from 177 for 7 and post 344 in the first innings. England were reeling at 24 for 3, still trailing Pakistan by 53 runs at Stumps on Day 2. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-yells-at-fielders-after-rohit-spills-a-tough-catch-in-pune-2623323-2024-10-25",
      "headline": "Watch: Virat Kohli yells at fielders after Rohit spills a tough catch in PuneVirat Kohli was visibly furious at the Indian fielders as they failed to save a boundary after a tough catch spilt out of Rohit Sharma's hands. New Zealand have a hefty lead by 301 runs at Day 2 stumps in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-first-retention-pick-harbhajan-singh-uncapped-player-2623319-2024-10-25",
      "headline": "MS Dhoni will be the first retention pick for CSK: Harbhajan Singh opinesHarbhajan Singh urged Chennai Super Kings to prioritize retaining MS Dhoni for IPL 2025, pending Dhoni's decision. With Dhoni qualifying as an \"uncapped\" player under new rules, CSK could secure the icon at a reduced cost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-saba-karim-pune-test-rohit-sharma-virat-kohli-2623302-2024-10-25",
      "headline": "Indian batters lack defensive technique to survive against spin: Saba KarimFormer India wicketkeeper batter Saba Karim has mentioned that Indian batters' lack good defensive technique to survive against spinners."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}