{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/octafx-ferox-firm-run-by-russian-national-dupes-crores-from-indian-investors-pavel-prozorov-exclusive-2656797-2024-12-29",
      "headline": "Exclusive: Firm run by Russian national dupes Rs 800 crore from Indian investorsThe ED filed a second chargesheet against Octafx India, its operating company overseas, OctaMarkets, its founder Pavel Prozorov, OctaFX CEO, who handled India operations, Anna Rudaia, and nine other individuals accused apart from a total of 41 companies and entities. Read this IndiaToday Exclusive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/directorate-general-of-civil-aviation-suspends-akasa-air-officials-lapses-in-pilots-training-2656500-2024-12-27",
      "headline": "Aviation regulator suspends 2 Akasa Air officials for lapses in pilots trainingThe two senior executives of the airline have reportedly failed to ensure compliances with the civil aviation requirements, Directorate General of Civil Aviation said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-ceo-sridhar-vembu-revives-debate-on-70-hour-work-week-advocated-by-infosys-founder-narayana-murthy-2656318-2024-12-27",
      "headline": "Zoho CEO Sridhar Vembu revives debate on 70-hour work weekZoho CEO Sridhar Vembu weighs in on the 70-hour work week debate initiated by Infosys founder Narayana Murthy. Here's his perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dearness-allowance-da-rise-again-in-2025-check-details-how-it-is-calculated-all-you-need-to-know-2656247-2024-12-27",
      "headline": "Will DA rise again in 2025? All you need to knowCentral government employees await a potential DA hike in January 2025, which could offer modest relief amid rising costs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rise-for-2nd-straight-day-as-auto-stocks-rally-2656246-2024-12-27",
      "headline": "Sensex, Nifty rise for 2nd straight day as auto stocks rally The S&P BSE Sensex settled 226.59 points higher at 78,690.07, while the NSE Nifty50 gained 63.20 points to end at 23,813.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-indian-economy-global-standing-key-reforms-1991-economic-liberalisation-2656166-2024-12-27",
      "headline": "How Manmohan Singh revitalised India's economy and global standingAs the chief architect of India's 1991 economic liberalisation, Manmohan Singh's policies helped steer India away from a severe financial crisis, positioning the country as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/osamu-suzuki-former-suzuki-motor-corporation-chairman-dies-at-94-2656153-2024-12-27",
      "headline": "Osamu Suzuki, former Suzuki Motor Corporation chairman, dies at 94Osamu Suzuki steered Suzuki Motor's rise, from pioneering Maruti 800 in India to building a global automotive legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-stock-market-benefitted-under-manmohan-singh-death-news-sensex-nifty-1991-2656149-2024-12-27",
      "headline": "How Indian stock market benefitted under Manmohan SinghManmohan Singh's policies, introduced during a time of economic crisis in the early 1990s, reshaped India's economy and transformed the Indian stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/15-income-tax-changes-in-2024-what-you-need-to-know-for-filing-itr-in-2025-income-tax-rules-stmp-2656139-2024-12-27",
      "headline": "10 income tax changes in 2024: What you need to know for filing ITR in 2025The 2024 income tax reforms introduce revised tax slabs, higher deductions, and simplified TDS and capital gains rules, making tax filing easier and offering potential savings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bumper-market-debut-for-mamata-machinery-should-you-book-profit-or-wait-2656140-2024-12-27",
      "headline": "Bumper stock market debut for Mamata Machinery: Should you book profit or wait? Mamata Machinery stock market listing: A 147% premium debut for Mamata Machinery leaves investors wondering: Is this the peak, or should they hold on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-stock-market-listing-long-term-bet-or-not-expert-views-2656116-2024-12-27",
      "headline": "DAM Capital Advisors makes strong market debut: Is it a long-term bet?DAM Capital Advisors market listing: The listing matched market predictions, as analysts and the grey market premium (GMP) had anticipated a 40%-50% premium, driven by robust demand and positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-market-listing-31-percent-premium-over-ipo-price-hold-or-sell-2656091-2024-12-27",
      "headline": "Sanathan Textiles shares list at 31% premium over IPO price. Hold or sell? Sanathan Textiles stock market debut: The listing comes after the company's initial public offering (IPO) witnessed robust demand, with subscriptions exceeding 36 times the total shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-strong-price-is-down-50-percent-on-some-trading-apps-today-explained-stmp-2656077-2024-12-27",
      "headline": "Explained: Why Mazagon Dock share price is down 50% on some trading apps todayMazagon Dock stock price: Certain trading apps may be displaying the unadjusted previous closing price, leading to the perception of a 50% fall. Adjusted for the split, Mazagon Dock shares were trading 2.13% lower on the Bombay Stock Exchange (BSE) at 11:09 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/transrail-lighting-ipo-share-price-listing-stock-open-at-36-percent-premium-dalal-street-debut-stmp-2656057-2024-12-27",
      "headline": "Transrail Lighting shares list at 36% premium on Dalal Street debut Transrail Lighting share price: The shares opened at Rs 585.15 per share on the Bombay Stock Exchange (BSE). The market debut aligns with market expectations, which was oversubscribed by 81 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-share-price-listing-strong-debut-39-percent-premium-nse-bse-rs-393-stmp-2656049-2024-12-27",
      "headline": "DAM Capital Advisors makes strong debut, shares list at 39% premium DAM Capital Advisors listing: On the BSE, the shares began trading at Rs 392.90, marking a 38.83% premium compared to the issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-listing-share-price-bumper-debut-147-percent-premium-rs-600-nse-bse-stmp-2656037-2024-12-27",
      "headline": "Mamata Machinery shares make bumper debut with 147% premium over IPO priceMamata Machinery listing: Shares of Mamata Machinery made a bumper debut and listed at Rs 600 per share on the NSE, a lot higher than the IPO issue price of Rs 243 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-auto-stocks-shine-tata-motors-bajaj-2656032-2024-12-27",
      "headline": "Sensex, Nifty open higher as auto stocks fuel early rally; Tata Motors up 2%The S&P BSE Sensex was up 323.12 points to 78,795.60, while the NSE Nifty50 gained 101.95 points to 23,852.15 as of 9:44 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-mamata-machinery-concord-transrail-sanathan-textiles-gmp-5-ipos-market-debut-today-2656022-2024-12-27",
      "headline": "Dam Capital to Mamata Machinery: GMPs of 5 IPOs ahead of D-Street debut todayThese initial public offerings (IPOs), which opened for subscription on December 19 and closed on December 23, collectively raised over Rs 2,900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-death-3-key-economic-reforms-liberalisation-licence-raj-mnrega-shaped-modern-india-2656013-2024-12-27",
      "headline": "Manmohan Singh's key reforms that shaped Indian economyDr Manmohan Singh's tenure as Finance Minister in the early 1990s and later as Prime Minister from 2004 to 2014 introduced policies that continue to influence India's growth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-on-work-life-balance-spend-four-hours-with-family-2655881-2024-12-26",
      "headline": "Gautam Adani on work-life balance: Spend at least 4 hours with familyChairperson of Adani Group, Gautam Adani, shared his take on work-life balance and said one must try to spend at least four hours with their families."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-funeral-memorial-space-congress-bjp-controversy-priyanka-rahul-gandhi-jp-nadda-2656765-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress vs BJP over Manmohan Singh's funeral site: 'Display of disrespect'The Congress accused the Centre of disrespecting former Prime Minister Manmohan Singh by conducting his last rites at a public crematorium, while the BJP countered by accusing the Congress of politicising the issue, despite assurances of a dedicated memorial space."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/azerbaijani-plane-crash-russia-vladimir-putin-apologises-kazakhstan-accident-kremlin-2656741-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vladimir Putin apologises for Azerbaijan Airlines plane crash: Tragic incidentRussian President Vladimir Putin apologised to the Azerbaijan President for the crash of the Azerbaijani airliner in Kazakhstan that killed 38 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-istanbul-indigo-flight-chhatrapati-shivaji-maharaj-international-airport-delay-cancel-2656783-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "100 IndiGo passengers stranded at Mumbai airport as fight delayed for 16 hoursAn IndiGo flight from Mumbai to Istanbul was delayed for over 16 hours and eventually cancelled, leaving passengers stranded at the Chhatrapati Shivaji Maharaj International Airport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korea-yoon-suk-yeol-authorise-shooting-during-martial-law-bid-prosecutors-allege-2656804-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "South Korea's Yoon authorised shooting during martial law bid, prosecutors claimYoon Suk Yeaol's legal team dismissed the prosecutors' report and said that it was a one-sided account that neither corresponded to objective circumstances nor common sense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-funeral-cremation-state-mourning-resting-place-congress-2656392-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India bids farewell to Manmohan Singh, last rites conducted with state honoursManmohan Singh was cremated with full state honours today. The Centre agreed to allocate space for a memorial of the former Prime Minister after a war of words broke out between the BJP and the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-4th-test-day-3-report-nitish-reddy-sundar-pant-melbourne-2656604-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sparkling Nitish hundred, Sundar rearguard cut India's deficit on Day 3Australia vs India: Nitish Reddy's maiden Test hundred, combined with Washington Sundar's fighting fifty, helped India cut Australia's first-innings lead on Day 3 of the ongoing Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/octafx-ferox-firm-run-by-russian-national-dupes-crores-from-indian-investors-pavel-prozorov-exclusive-2656797-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Exclusive: Firm run by Russian national dupes Rs 800 crore from Indian investorsThe ED filed a second chargesheet against Octafx India, its operating company overseas, OctaMarkets, its founder Pavel Prozorov, OctaFX CEO, who handled India operations, Anna Rudaia, and nine other individuals accused apart from a total of 41 companies and entities. Read this IndiaToday Exclusive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-marine-accused-bias-motivated-attack-tv-reporter-in-denver-colorado-donald-trump-america-2656801-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US man accused of bias-motivated attack on TV reporter: This is Trump's AmericaPatrick Thomas Egan, 39, was arrested on December 18 in Grand Junction, Colorado, after police say he followed KKCO/KJCT reporter Ja'Ronn Alex's vehicle for around 40 miles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-cinema-2024-hits-misses-hema-committee-report-manjummel-boys-premalu-aavesham-bramayugam-2656297-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manjummel Boys to Aavesham: 2024 truly belonged to Malayalam cinema From big hits to bigger misses to the explosive Hema Committee report, Malayalam cinema experienced highs and lows in 2024. Here's a round-up of what transpired in Mollywood this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/drunken-driving-checks-limited-parking-delhi-police-traffic-advisory-for-new-years-eve-2656743-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drunken driving checks, limited parking: Delhi Police advisory for New Year's EveDelhi gears up for New Year celebrations with traffic restrictions around Connaught Place and India Gate. Limited parking, diversions, and strict checks aim to ensure safety and smooth traffic flow.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-boxing-day-stampede-perth-streetwear-store-viral-video-2656578-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Stealing' the spotlight: Australian store's invite to 'rob' sees stampedeAs soon as the store in Perth opened its shutters on Thursday, hundreds of teens pushed and shoved their way into the shop, resulting in a massive stampede."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/how-dubais-viral-kunafa-chocolates-took-over-social-media-and-inspired-a-global-trend-lindt-2656685-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Dubai kunafa chocolate went viral and inspired a global trendUnless you've been living under a rock, you're likely aware of just how viral Dubai's kunafa chocolates have gone. Experts suggest that this widespread appeal heralds a brilliant business opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cyber-attack-italy-foreign-ministry-airports-milan-pro-russian-hacker-group-claims-responsibility-2656799-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russian hackers launch cyber attack on Italy's Foreign Ministry, airportsPro-Russian hacker group Noname057(16) claimed the responsibility of the cyber attack on Telegram, saying Italy's that Russophobes got a well-deserved cyber response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-minor-girl-father-three-people-arrested-for-raping-impregnating-her-auraiya-2656798-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Girl's father among 3 arrested for raping, impregnating her in UP's AuraiyaThe girl, accompanied by a woman relative, approached the local police with the complaint on Friday, following which an FIR was lodged, and an investigation was launched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-firozabad-police-remove-loudspeakers-from-mosque-noise-complaints-2656792-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Police remove loudspeakers from mosque after noise complaints in UP's FirozabadFirozabad Superintendent of Police Ravi Shankar Prasad said that multiple complaints were received regarding loud sounds from mosques."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-teaser-salman-khan-high-octane-action-eid-2025-ar-murugadoss-rashmika-mandanna-sajid-nadiadwala-2656669-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar teaser: Salman Khan gears up for high-octane action on Eid 2025Salman Khan's Sikandar teaser is finally out. The movie, directed by AR Murugadoss, will release in theatres on Eid 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-entertainment-politics-cricket-440-28-12-2024?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-cafe-owner-assaulted-for-refusing-to-pay-rs-1-crore-attack-caught-on-cam-2656810-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Caught on cam: Haryana café owner assaulted for refusing to pay Rs 1 croreFinanciers attacked Jasmeet Singh after he refused to pay them Rs 1 crore, despite him already settling their dues by paying them Rs 15 lakh more than he owed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-bjp-welfare-schemes-mahila-samman-yojana-lt-governor-order-2656649-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Working to stop AAP: Arvind Kejriwal attacks BJP and Congress after probe orderFormer Delhi Chief Minister Arvind Kejriwal on Saturday (December 28) attacked the BJP and Congress and accused them of attempting to sabotage Aam Aadmi Party's (AAP) welfare schemes. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-trolls-chess-federation-with-jeans-pant-rapid-blitz-championship-2656545-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Carlsen trolls Chess Federation with OOTD post after quitting championshipThe world's best chess player Magnus Carlsen quit the 2024 World Rapid and Blitz Championship after being fined by FIDE over dress code. Carlsen trolled the tournament with a cheeky post on social media after quitting.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-north-india-himachal-pradesh-jammu-kashmir-weather-cold-wave-conditions-rainfall-2656683-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cold wave to continue in Delhi as North India braces for chilly start to 2025As intermittent rain continued in several parts of North India, the IMD has predicted a fall in the minimum temperature by 3-5 degrees Celsius in the next two days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/joe-biden-first-lady-jill-pay-tribute-to-manmohan-singh-2656689-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Joe Biden, first lady Jill pay tribute to Manmohan Singh: 'True statesman'The former Prime Minister, who was India's first Sikh prime minister, died in New Delhi on Thursday night (December 26). He was 92."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-fathers-sacrifices-melbourne-test-century-rescuing-2656624-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dreams come true at MCG: How father's sacrifice fuelled Nitish's journeyNitish Kumar Reddy's maiden Test century at the MCG was a historic and emotional moment, showcasing his resilience and honouring his father's sacrifices. The 21-year-old all-rounder scripted a remarkable recovery for India in the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/shabana-azmi-javed-akhtar-naseeruddin-shah-shyam-benegal-prayer-meet-2656753-2024-12-28",
      "headline": "Video: Shabana-Javed Akhtar, Naseeruddin, celebs at Shyam Benegal's prayer meetVeteran actors Naseeruddin Shah, Shabana Azmi, Javed Akhtar, Urmila Matondkar, and other Bollywood celebrities gathered for a prayer meeting in honour of legendary filmmaker Shyam Benegal.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/story/uorfi-javed-walking-out-of-samay-raina-show-indias-got-latent-abused-on-stage-mia-khalifa-2656752-2024-12-28",
      "headline": "Uorfi Javed on walking out of Samay Raina's show: I was abused on stageUorfi Javed expressed her anger after contestants made derogatory remarks against her on India's Got Latent show. The social media sensation shared that she was compared to Mia Khalifa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-slams-hansal-mehta-criticising-manmohan-singh-biopic-the-accidental-prime-minister-2656732-2024-12-28",
      "headline": "Anupam Kher slams Hansal Mehta for criticising Manmohan Singh biopicActor Anupam Kher called out director Hansal Mehta for criticising the film, The Accidental Prime Minister. He even called him a 'hypocrite.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-birthday-bash-jamnagar-vantura-ambanis-sohail-khan-2656698-2024-12-28",
      "headline": "Family, friends, fireworks: Inside Salman Khan's grand birthday bash in JamnagarSalman Khan, along with his family, celebrated his 59th birthday in Jamnagar. Several pictures from the grand bash have emerged online. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-live-score-day-4-live-scores-reactions-melbourne-updates-boxing-day-2656779-2024-12-28",
      "headline": "4th Test Day 4 LIVE: Nitish Reddy key as India aim to reduce deficitAustralia (AUS) vs India (IND) 4th Test, Day 4 Live: After keeping themselves alive in the Test match courtesy of a century from Nitish Kumar Reddy and a half century from Washington Sundar, India still trail by 116 runs in the first innings. The onus would be on Nitish Reddy, who's on an unbeaten 105*, to help India reduce as much deficit as they can. India will resume their innings on 358/9 with Mohammed Siraj (2) and Nitish Reddy at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahmat-shahs-record-231-leads-afghanistans-fightback-after-zims-record-total-2656794-2024-12-28",
      "headline": "Rahmat Shah's record 231* leads Afghanistan's fightback after ZIM's record totalRahmat Shah's unbeaten 231 and Hashmatullah Shahidi's 141* powered Afghanistan to a record 361-run stand, their highest in Tests. It also marked Zimbabwe's first wicket-less day in Test cricket, highlighting Afghanistan's dominance on Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nitish-reddy-reveals-reason-behind-his-hundred-celebration-at-mcg-was-saluting-indian-flag-2656789-2024-12-28",
      "headline": "Nitish Reddy reveals reason behind his hundred celebration at MCGNitish Kumar Reddy's maiden century at the MCG was not only a personal milestone but also a tribute to his father's unwavering support. His emotional celebration, saluting the Indian flag, reflected the deep gesture towards making his country proud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/carlsen-refused-to-follow-rules-left-us-with-little-choice-viswanathan-anand-2656780-2024-12-28",
      "headline": "Carlsen refused to follow rules, left us with little choice: Viswanathan AnandMagnus Carlsen withdrew from the FIDE World Rapid and Blitz Championship after refusing to follow the tournament's dress code. Viswanathan Anand stated that FIDE had no choice but to enforce rules, ensuring fairness for all players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-shakeel-pakistan-pacers-shine-as-1st-test-set-for-thrilling-finish-2656778-2024-12-28",
      "headline": "PAK vs SA: Shakeel, Pakistan pacers shine as 1st Test set for thrilling finishSouth Africa need 121 runs with seven wickets in hand as Pakistan's fiery bowling, led by Abbas, sets up a nail-biting finish at Centurion. Can Markram steer the hosts to victory, or will Pakistan script a stunning turnaround?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-criticizes-rishabh-pant-for-his-dismissal-in-melbourne-aus-vs-ind-border-gavaskar-trophy-2024-25-2656773-2024-12-28",
      "headline": "Rishabh Pant thinks rash shots are the only way to score runs: Sunil GavaskarFormer India cricketer turned commentator criticised India wicketkeeper batter Rishabh Pant for his careless shot on Day 3 of the fourth Test against Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-u-16-coach-kumar-swamy-aus-vs-ind-ind-vs-aus-melbourne-test-2656769-2024-12-28",
      "headline": "Nitish Reddy's Under 16 coach recalls days of struggle after Melbourne hundredIndia all rounder Nitish Kumar Reddy's under 16 coach Kumar Swamy recalled his early days in cricket as he notched up his maiden Test hundred on Day 3 of the fourth Test against Australia in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-injury-will-return-better-than-ever-fc-barcelona-laliga-2656762-2024-12-28",
      "headline": "Will return better than ever: Lamine Yamal gives strong promise amidst injuryLamine Yamal vowed to return stronger after injuries disrupted his promising season, leaving Barcelona struggling in his absence as they lost their LaLiga top spot. The 17-year-old assured fans of his commitment to overcoming setbacks and regaining peak form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-womens-emerging-cricketer-of-the-year-indias-rising-player-nominated-2656755-2024-12-28",
      "headline": "ICC Women's emerging cricketer of the year: India's rising player nominatedShreyanka Patil's stellar performances in 2024, including 15 T20I wickets and key contributions in major tournaments, earned her a nomination for ICC Women's Emerging Cricketer of the Year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-pat-cummins-mentality-heinrich-klaasen-gameplan-melbourne-2656754-2024-12-28",
      "headline": "Nitish borrows Cummins' mentality, Klaasen's gameplan for MCG Test hundredNitish Kumar Reddy became the first Indian No.8 to score a Test century in Australia. Nitish's incredible innings not only helped India save follow-on, but nearly helped India massively cut down the deficit against Australia's massive first innings total of 474."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-criticizes-rishabh-pant-for-his-dismissal-in-melbourne-aus-vs-ind-border-gavaskar-trophy-2024-25-2656773-2024-12-28",
      "headline": "Rishabh Pant thinks rash shots are the only way to score runs: Sunil GavaskarFormer India cricketer turned commentator criticised India wicketkeeper batter Rishabh Pant for his careless shot on Day 3 of the fourth Test against Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-u-16-coach-kumar-swamy-aus-vs-ind-ind-vs-aus-melbourne-test-2656769-2024-12-28",
      "headline": "Nitish Reddy's Under 16 coach recalls days of struggle after Melbourne hundredIndia all rounder Nitish Kumar Reddy's under 16 coach Kumar Swamy recalled his early days in cricket as he notched up his maiden Test hundred on Day 3 of the fourth Test against Australia in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-injury-will-return-better-than-ever-fc-barcelona-laliga-2656762-2024-12-28",
      "headline": "Will return better than ever: Lamine Yamal gives strong promise amidst injuryLamine Yamal vowed to return stronger after injuries disrupted his promising season, leaving Barcelona struggling in his absence as they lost their LaLiga top spot. The 17-year-old assured fans of his commitment to overcoming setbacks and regaining peak form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-womens-emerging-cricketer-of-the-year-indias-rising-player-nominated-2656755-2024-12-28",
      "headline": "ICC Women's emerging cricketer of the year: India's rising player nominatedShreyanka Patil's stellar performances in 2024, including 15 T20I wickets and key contributions in major tournaments, earned her a nomination for ICC Women's Emerging Cricketer of the Year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-pat-cummins-mentality-heinrich-klaasen-gameplan-melbourne-2656754-2024-12-28",
      "headline": "Nitish borrows Cummins' mentality, Klaasen's gameplan for MCG Test hundredNitish Kumar Reddy became the first Indian No.8 to score a Test century in Australia. Nitish's incredible innings not only helped India save follow-on, but nearly helped India massively cut down the deficit against Australia's massive first innings total of 474."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-nitish-kumar-reddy-scott-boland-aus-vs-ind-border-gavaskar-trophy-2024-25-ind-vs-aus-2656751-2024-12-28",
      "headline": "Nitish Kumar Reddy has got pretty much every shot in the book: Scott BolandAustralia fast bowler Scott Boland praised young India all-rounder Nitish Kumar Reddy, saying that he has almost every shot in the book. Reddy scored his maiden Test hundred on Day 3 of the fourth Test against Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/babar-azam-ends-his-two-year-long-test-fifty-drought-sa-vs-pak-centurion-test-day-3-2656745-2024-12-28",
      "headline": "SA vs PAK: Babar Azam ends two-year-long 50 drought in Centurion TestStar Pakistan batter Babar Azam brought up his first Test half century after a long gap of two years on Day 3 of the first Test against South Africa in Centurion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-mcg-test-history-analysis-2656706-2024-12-28",
      "headline": "Can India win MCG Test if they concede lead? Here's what history says Border Gavaskar Trophy, IND vs AUS: At Stumps on Day 3 of the MCG Test, India trialed by 116 runs after Nitish Kumar Reddy's maiden Test hundred. But can India secure victory or salvage a draw from the position they are in? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pm-narendra-modi-meets-d-gukesh-receives-signed-chess-board-from-world-champion-2656738-2024-12-28",
      "headline": "PM Modi meets D Gukesh, receives signed chess board from world championPM Narendra Modi hailed D Gukesh's historic World Chess Championship victory during their meeting. The young champion gifted the Prime Minister a signed chessboard, symbolising his triumph and India's growing prominence in the global chess arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-nitish-kumar-reddy-washington-sundar-saw-through-evert-phase-melbourne-2656736-2024-12-28",
      "headline": "Nitish and I saw through every phase quite well: Washington SundarIndia all-rounder Washington Sundar heaped praise on Nitish Kumar Reddy's batting on Day 3 of the Melbourne Test against Australia, while also complementing how they both carried out a great rescue act for their side with their partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-pat-cummins-claps-from-behind-as-nitish-reddy-celebrates-hundred-at-mcg-2656735-2024-12-28",
      "headline": "Watch: Pat Cummins claps from behind as Nitish Reddy celebrates hundred at MCGPat Cummins' applause for Nitish Reddy's maiden Test century at the MCG showcased true sportsmanship. The SRH teammates shared a moment of mutual respect, as Cummins celebrated Reddy's stellar knock with heartfelt claps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravindra-jadeja-practice-against-spin-sanjay-manjrekar-nathan-lyon-melbourne-2656734-2024-12-28",
      "headline": "Jadeja needs to practise against spin: Manjrekar points out drawbacksSanjay Manjrekar opined Ravindra Jadeja needs to improve his batting against spin after struggling against Nathan Lyon, whose brilliance led to Jadeja's dismissal and further exposed India's vulnerabilities on Day 3 of the Melbourne Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-day-4-melbourne-weather-report-border-gavaskar-trophy-nitish-kumar-reddy-2656731-2024-12-28",
      "headline": "AUS vs IND Melbourne Weather Update: Will rain spoil the party on Day 4?The day 4 of the fourth Test between India and Australia promises to be another action-packed passage of play. However, rain could once again play spoilsport for both fans and players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-nitish-kumar-reddy-washington-sundar-saw-through-evert-phase-melbourne-2656736-2024-12-28",
      "headline": "Nitish and I saw through every phase quite well: Washington SundarIndia all-rounder Washington Sundar heaped praise on Nitish Kumar Reddy's batting on Day 3 of the Melbourne Test against Australia, while also complementing how they both carried out a great rescue act for their side with their partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-pat-cummins-claps-from-behind-as-nitish-reddy-celebrates-hundred-at-mcg-2656735-2024-12-28",
      "headline": "Watch: Pat Cummins claps from behind as Nitish Reddy celebrates hundred at MCGPat Cummins' applause for Nitish Reddy's maiden Test century at the MCG showcased true sportsmanship. The SRH teammates shared a moment of mutual respect, as Cummins celebrated Reddy's stellar knock with heartfelt claps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravindra-jadeja-practice-against-spin-sanjay-manjrekar-nathan-lyon-melbourne-2656734-2024-12-28",
      "headline": "Jadeja needs to practise against spin: Manjrekar points out drawbacksSanjay Manjrekar opined Ravindra Jadeja needs to improve his batting against spin after struggling against Nathan Lyon, whose brilliance led to Jadeja's dismissal and further exposed India's vulnerabilities on Day 3 of the Melbourne Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-day-4-melbourne-weather-report-border-gavaskar-trophy-nitish-kumar-reddy-2656731-2024-12-28",
      "headline": "AUS vs IND Melbourne Weather Update: Will rain spoil the party on Day 4?The day 4 of the fourth Test between India and Australia promises to be another action-packed passage of play. However, rain could once again play spoilsport for both fans and players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nitish-reddy-impressed-me-from-1st-test-sachin-tendulkar-praises-mcg-star-aus-vs-ind-2656718-2024-12-28",
      "headline": "Nitish Reddy impressed me from 1st Test: Sachin Tendulkar praises MCG starSachin Tendulkar lauded Nitish Kumar Reddy's composure during his maiden Test hundred at the MCG, calling it \"a knock to remember.\" He also praised Washington Sundar's valuable support in a crucial 127-run partnership that kept India in contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravi-shastri-nitish-kumar-reddy-aus-vs-ind-border-gavaskar-troph-2024-25-melbourne-test-2656710-2024-12-28",
      "headline": "Nitish Reddy should go up the order to correct the balance of the side: ShastriFormer India cricketer and head coach has suggested promoting all-rounder Nitish Kumar Reddy up the order after his magnificent maiden century on Day 3 of the fourth Test against Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-nitish-kumar-reddy-gets-emotional-on-meeting-family-after-mcg-heroics-2656703-2024-12-28",
      "headline": "Watch: Nitish Kumar Reddy gets emotional on meeting family after MCG heroicsNitish Kumar Reddy's emotional reunion with his family after his maiden Test century at the MCG highlighted years of sacrifice and resilience. Tears flowed as his heroic knock became a testament to his hard work and unwavering family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-washington-sundar-fight-no-matter-what-attitude-gautam-gambhir-melbourne-2656690-2024-12-28",
      "headline": "Washington reveals 'fight no matter what' attitude behind MCG heroicsWashington Sundar credited India's fightback to the dressing room's message of unwavering fighting spirit, led by Gautam Gambhir and Rohit Sharma, as he and Nitish Kumar Reddy stitched a crucial 127-run partnership in the Melbourne Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}