{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-resurgence-june-july-rs-26000-crore-fundraising-hdb-financial-services-2742517-2025-06-18",
      "headline": "IPO market heats up with Rs 26,000 crore fundraising in JuneA resurgence in initial public offerings is evident as several major companies plan to launch IPOs in June and July, raising substantial funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-fall-expiry-day-shift-thursday-market-share-impact-2742491-2025-06-18",
      "headline": "Explained: Why BSE shares are falling today The drop comes as the company announced a shift in the expiry day of its equity derivative contracts from Tuesdays to Thursdays, effective from September 1, after regulatory approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dlf-privana-north-luxury-homes-sell-out-seven-days-gurugram-2742472-2025-06-18",
      "headline": "DLF's Rs 11,000 crore Privana North luxury project sells out in a weekSituated in the expansive 116-acre township in Gurugram, this project notched up sales beyond Rs 11,000 crore, highlighting the robust market appetite for premium homes in India's big cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-property-prices-low-rental-yields-renting-better-than-buying-mumbai-delhi-ncr-2742430-2025-06-18",
      "headline": "Is buying a home in major Indian cities a mistake? Financial advisor explainsFinancial advisor Lovish Anand questions the wisdom of homeownership in high-cost Indian metros, highlighting the economic realities of renting versus buying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-rise-stock-price-gain-6-percent-nomura-rating-positive-outlook-2742426-2025-06-18",
      "headline": "Explained: Why IndusInd Bank shares rose 6% todayOver the last year, IndusInd Bank's stock had fallen by 43.51%. However, it has shown signs of recovery in recent weeks, rising around 8.63% in the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/middle-class-financial-stress-india-stagnant-wages-high-living-costs-2742421-2025-06-18",
      "headline": "Middle class has eroded: Startup founder flags growing financial stress in IndiaOnce a marker of steady growth, India's middle class now faces rising costs, slower salary gains, and shifting financial priorities in an economy where old assumptions no longer hold true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-above-24800-indusind-bank-gains-3-2742396-2025-06-18",
      "headline": "Sensex, Nifty rise as markets stay calm despite Iran-Israel flare-upThe S&P BSE Sensex was up by 70.97 points to 81,654.27, while the NSE Nifty50 gained 44.50 points to 24,897.90 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-allotment-finalised-strong-subscription-june-18-latest-gmp-2742391-2025-06-18",
      "headline": "Oswal Pumps IPO allotment: Step-by-step guide to check statusOswal Pumps IPO allotment is set to be finalised on June 18, 2025, after a robust subscription. Investors can check their allotment status through BSE and Link Intime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-flat-june-18-trade-setup-middle-east-tensions-rising-crude-oil-prices-key-levels-2742370-2025-06-18",
      "headline": "Indian stock market to open flat as Middle East tensions raise oil pricesAs of 8:23 am, Gift Nifty futures were trading at 24,852. This suggests that Nifty50 is likely to begin the day close to Tuesday's closing level of 24,853.4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-focus-june-18-nse-trading-bse-delhivery-bharat-forge-vedanta-ola-electric-2742362-2025-06-18",
      "headline": "Stocks to watch on June 18: BSE, Delhivery, Bharat Forge, Vedanta, Ola ElectricAs investors wait to see how global events unfold, several stocks such as BSE, Delhivery, Bharat Forge, Vedanta, Ola Electric, are expected to remain in focus on Wednesday, June 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-213-points-lower-nifty-below-24900-tata-motors-down-2-percent-2742082-2025-06-17",
      "headline": "Sensex ends 213 points lower, Nifty below 24,900; Tata Motors down 2%The S&P BSE Sensex lost 212.85 points to close at 81,583.30, while the NSE Nifty50 declined by 93.10 points to end at 24,853.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/savings-accounts-interest-rates-fall-rbi-cuts-fixed-deposits-debt-mutual-funds-2742063-2025-06-17",
      "headline": "Savings account interest rates see sharp drop. Do you really need one?A look into the declining utility of savings accounts as interest rates fall, questioning their role in financial growth and suggesting alternative investment options."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-jokes-about-aamir-finding-love-at-60-tells-kapil-sharma-he-has-his-own-league-2742566-2025-06-18",
      "headline": "Salman Khan jokes about Aamir finding love at 60, tells Kapil he has his own leagueComedian Kapil Sharma asked Salman Khan to take inspiration from his friend and actor Aamir Khan, who is still searching for love at 60. The superstar gave a funny response and then burst into laughter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-update-jolly-llb-3-opens-up-about-working-with-arshad-warsi-2742557-2025-06-18",
      "headline": "Akshay Kumar shares update on Jolly LLB 3, says working with Arshad Warsi was funAfter 'Housefull 5', Akshay Kumar is now preparing for 'Jolly LLB 3', in which he reunites with Arshad Warsi. Directed by Subhash Kapoor, the film is inspired by real-life incidents, much like its predecessors. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-on-her-break-from-malayalam-films-lot-of-people-trolled-me-2742467-2025-06-18",
      "headline": "Lot of people trolled me: Anupama Parameswaran on her break from Malayalam filmsActor Anupama Parameswaran recently opened up about her hiatus from Malayalam cinema. She shared that she chose to focus on meaningful films despite facing social media trolling over her acting skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-takes-a-dig-at-sikandar-failure-on-the-kapil-sharma-show-watch-trailer-2742548-2025-06-18",
      "headline": "Salman Khan takes a dig at Sikandar failure on The Kapil Sharma Show. Watch trailerIn the first promo for 'The Kapil Sharma Show', superstar Salman Khan took a dig at the box office failure of his film 'Sikandar'. He joked on stage and then burst out laughing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-retro-limited-series-netflix-director-karthik-subbaraj-2742525-2025-06-18",
      "headline": "Retro director explains why Netflix rejected limited series pitch for Suriya-starrerDirector Karthik Subbaraj revealed his plans to adapt 'Retro' into a limited Netflix series to explore its full story, which was restricted in the film due to runtime. He shared insights into the creative challenges and scenes that had to be cut, including emotional flashbacks and key character moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-advises-son-yashwardhan-not-to-copy-govinda-make-his-own-style-2742500-2025-06-18",
      "headline": "He'll be a bigger name: Sunita advises son not to copy Govinda, make his own styleBollywood actor Govinda's wife Sunita Ahuja told their son Yashwardhan not to copy his father and come up with his own style. She is also confident that he'll make a bigger name than Govinda. Yashwardhan is shooting for his upcoming film with filmmaker Sai Rajesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-nishaanchi-set-to-release-this-september-2742485-2025-06-18",
      "headline": "Anurag Kashyap's Nishaanchi set to release this September, fans say moment haiAnurag Kashyap's upcoming crime drama 'Nishaanchi' is set to release in theatres on September 19, 2025. Featuring debutant Aaishvary Thackeray, the film promises a gripping story of love, betrayal, and redemption."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/derek-dixon-sues-tyler-perry-for-260-million-dollar-over-sexual-harassment-and-assault-2742463-2025-06-18",
      "headline": "Actor Derek Dixon sues Tyler Perry for $260 million over alleged sexual assaultActor and filmmaker Tyler Perry has been hit with a $260 million lawsuit by his fellow 'The Oval' actor Derek Dixon, who alleges sexual assault and harassment. Perry has denied the allegations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-drops-her-stage-name-breast-cancer-battle-going-back-to-rehana-2742504-2025-06-18",
      "headline": "Actor Rozlyn Khan drops her stage name after cancer battle: Going back to RehanaActor Rozlyn Khan dropped her stage name after her cancer battle. She stated that she would now be called Rehana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rs-prasanna-directing-aamir-khan-sensitive-film-sitaare-zameen-par-2742493-2025-06-18",
      "headline": "Aamir Khan is a liberator, not micromanager: Sitaare Zameen Par directorRS Prasanna discusses his journey directing the emotionally sensitive film 'Sitaare Zameen Par' starring Aamir Khan. He highlights the importance of empathy and collaboration in navigating sensitive themes in today's digital age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/jackson-wang-documents-india-visit-shares-pics-with-roshans-karan-johar-and-tiger-shroff-2742484-2025-06-18",
      "headline": "Jackson Wang documents India visit, shares pics with Roshans, KJo and Tiger ShroffK-pop idol Jackson Wang finally shared his India visit photo dump, and it included everything. From his dinner with The Roshans and meeting Karan Johar to airport selfies and the dishes he tried during his stay. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/welcome-to-jungle-shooting-paused-due-pahalgam-attack-not-dues-akshay-kumar-2742468-2025-06-18",
      "headline": "Welcome to Jungle shooting paused due to Pahalgam attack, not dues: ReportAkshay Kumar's 'Welcome To The Jungle' is delayed again, and this time it's not due to financial issues. After several reports claimed that the shooting halted due to money problems, it is now reported that the shooting is delayed due to the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdev-anniversary-post-goes-viral-after-death-2742455-2025-06-18",
      "headline": "Sunjay Kapur's wife Priya Sachdev's anniversary post goes viral after his deathBusinessman Sunjay Kapur's wife Priya Sachdev's emotional anniversary post is going viral after his death. Kapur died after suffering a heart attack in London earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-grover-says-air-india-fixing-chalta-hai-attitude-not-taking-risks-after-ahmedabad-plane-crash-2742442-2025-06-18",
      "headline": "Varun Grover says Air India fixing chalta hai attitude, not taking risks after crashComedian and screenwriter Varun Grover said he was relieved about Air India taking stricter safety measures after the Ahmedabad plane crash. He referred to the Delhi-Paris flight in his note, which was cancelled on Tuesday due to safety issues.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-woodburn-how-clean-is-your-house-dies-family-and-friends-share-tributes-2742432-2025-06-18",
      "headline": "Reality TV star Kim Woodburn dies at 83, family and friends pay tributesTributes have been pouring in after the death of How Clean Is Your House star Kim Woodburn on Tuesday. She was 83 and died following a short illness. The news of her death was confirmed by her manager.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-posts-emotional-note-says-in-constant-state-of-missing-you-2742418-2025-06-18",
      "headline": "Liam Payne's girlfriend posts emotional note, says in constant state of missing youLiam Payne's girlfriend, Kate Cassidy, has opened up about her grief and memories of her late boyfriend in an emotional note. The 'One Direction' singer died after falling from a hotel balcony last year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-jonathan-baileys-kiss-lights-up-jurassic-world-rebirth-premiere-2742402-2025-06-18",
      "headline": "Scarlett Johansson, Jonathan Bailey's kiss lights up Jurassic World premiereActors Scarlett Johansson and Jonathan Bailey sparked online buzz after they were seen kissing at the 'Jurassic World Rebirth' premiere in London. The clip quickly went viral, prompting a wave of fan reactions across social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/alfred-brendel-austrian-pianist-famous-for-playing-of-beethoven-dies-at-94-2742385-2025-06-18",
      "headline": "Alfred Brendel, Austrian pianist famous for his playing of Beethoven, dies at 94Alfred Brendel, one of the greatest pianists of the 20th century, died peacefully at his London home at the age of 94. Known for his profound interpretations of Beethoven, his career spanned over sixty years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/marjorie-grande-singer-ariana-grandes-grandmother-dies-at-99-2742382-2025-06-18",
      "headline": "Marjorie Grande, singer Ariana Grande's grandmother, dies at 99Singer Ariana Grande's beloved \"Nonna\", Marjorie Grande, has died. She was 99 years old. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/halted-op-sindoor-after-pak-pleaded-us-played-no-role-in-truce-pm-modi-to-trump-during-35-minute-call-2742393-2025-06-18",
      "headline": "No trade deal talk or US mediation behind Pak truce: PM gets blunt with TrumpDonald Trump has repeatedly claimed that he mediated the ceasefire between India and Pakistan last month and the threat of cutting off trade forced the countries to stop the hostilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-weighs-tehran-strike-as-israel-iran-conflict-enters-sixth-day-glbs-2742341-2025-06-18",
      "headline": "Iran fires hypersonic missile at Israel, Trump demands Tehran's surrender  Live Updates As the Israel-Iran conflict entered its sixth day, Iran fired a Fattah-1 missile at Tel Aviv shortly after United States President Donald Trump demanded Tehran's 'unconditional surrender'.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-air-defence-systems-arrow-missile-low-tel-aviv-iron-dome-thaad-2742543-2025-06-18",
      "headline": "Israel running low on air defence, missiles can last just 10-12 days: ReportIsraeli interceptors are under severe strain, with Arrow missiles costing $3 million each and defence operations reportedly burning through nearly $285 million a night, raising doubts over how long Israel can hold out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hardeep-singh-nijjar-khalistani-terrorist-killing-canada-mark-carney-said-after-bilateral-meeting-india-ties-pm-narendra-modi-g7-summit-2742374-2025-06-18",
      "headline": "What Mark Carney said on Nijjar killing after bilateral meet with PM ModiCanadian Prime Minister Mark Carney appeared cautious as he commented on discussions he had with Prime Minister Narendra Modi on the June 2023 killing of Khalistani terrorist Hardeep Singh Nijjar in British Columbia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/fighting-on-twitter-pm-narendra-modi-emmanuel-macron-french-president-g7-donald-trump-iran-israel-2742549-2025-06-18",
      "headline": "Fighting on Twitter? PM's joke with Macron, big laugh, Trump chatter onlineAt the G7 Summit, PM Narendra Modi told the French President, Emmanuel Macron, \"Nowadays, you are fighting on Twitter,\" drawing laughter and setting off a viral wave online. Social media users quickly connected the remark to Macron's recent spat with US President Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-phone-call-congress-asim-munir-invite-bjp-hits-back-2742554-2025-06-18",
      "headline": "'Triple jhatka', 'congenital liar': BJP, Congress trade barbs over PM-Trump callAfter the telephonic conversation between PM Modi and US President Donald Trump, Congress leader Jairam Ramesh stressed that India has received 'triple jhatka' in foreign policy and diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bhopal-aishbagh-bridge-with-90-degree-turn-to-be-redesigned-2742503-2025-06-18",
      "headline": "Bhopal's 90-degree bridge to be redesigned after wild turn stumps people PWD officials stated that the project will move forward as soon as the railway completes the land transfer, with construction expected to commence shortly thereafter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/goa/story/bengaluru-young-woman-killed-in-goa-by-boyfriend-days-after-couple-arrives-for-marriage-2742417-2025-06-18",
      "headline": "Bengaluru couple travel to Goa to get married, he kills her thereA 22-year-old woman from Bengaluru was found murdered in a forest in South Goa. She had travelled to the coastal state with her boyfriend to get married, where a dispute reportedly led him to kill her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/spicejet-passengers-force-staff-to-eat-biryani-airline-reacts-to-viral-video-2742545-2025-06-18",
      "headline": "Angry SpiceJet passengers force staff to eat biryani served to them, airline reactsSeveral SpiceJet passengers forced a staffer to eat biryani served to them after a flight was delayed. The airline later condemned the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-day-5-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2741862-2025-06-17",
      "headline": "Live: Israel began planning Iran strikes in December, says reportIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other for the sixth consecutive day. Amid the ongoing crisis in the Middle East, G7 leaders gathered in Canada urged an end to hostilities between Iran and Israel, with French President Emmanuel Macron revealing that his US counterpart, Donald Trump, has already initiated a truce deal between the two warring nations. Israeli strikes on Iran have killed 585 people and wounded 1,326 others, AP reports citing a human rights group. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/air-india-crash-flight-anxiety-mental-health-experts-2742221-2025-06-18",
      "headline": "Anxiety in the air: The mental health aftermath of the Air India crashThe recent Air India crash has triggered widespread flight anxiety, with many travellers reconsidering air travel and experiencing heightened anxiety. Mental health experts explain how to cope with emotional unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/governments-new-rs-3000-fastag-pass-for-private-vehicles-all-you-need-to-know-2742537-2025-06-18",
      "headline": "Government's new Rs 3000 FASTag pass for private vehicles: All you need to knowTo make highway travel simpler and more cost-effective for private vehicle owners, the Government of India has introduced a FASTag-based annual pass priced at Rs 3000. From activation to usage limits, here's everything you need to know.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-takes-a-dig-at-sikandar-failure-on-the-kapil-sharma-show-watch-trailer-2742548-2025-06-18",
      "headline": "Salman Khan takes a dig at Sikandar failure on The Kapil Sharma Show. Watch trailerIn the first promo for 'The Kapil Sharma Show', superstar Salman Khan took a dig at the box office failure of his film 'Sikandar'. He joked on stage and then burst out laughing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/locating-haldighati-between-myth-and-reality-2742425-2025-06-18",
      "headline": "Locating Haldighati - Between myth and realityThe Battle of Haldighati, fought between Maharana Pratap of Mewar and the Mughal forces led by Man Singh of Amber, has since passed into legend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-youtuber-kamal-kaur-bhabhi-post-mortem-report-strangled-marks-private-parts-2742482-2025-06-18",
      "headline": "Punjab YouTuber strangled, marks found near private parts, reveal autopsyKamal Kaur, known for her bold and often controversial content, was found dead inside a car parked near Adesh University in Bathinda on June 11."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-abhishek-banerjee-is-putting-the-centre-in-the-dock-2741980-2025-06-17",
      "headline": "How Abhishek Banerjee is putting the Centre in the dockWith his five questions pointedly aimed at the government that has largely dominated the discourse around Operation Sindoor, the TMC leader has turned the focus back on Pahalgam in the war of narrative.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/indian-students-choose-middle-east-for-mbbs-but-can-they-practise-back-home-2742520-2025-06-18",
      "headline": "Indian students choose Middle East for MBBS: But can they practise back home?As competition tightens and medical seats shrink at home, a growing number of Indian students are looking west not to the US or UK, but to the Middle East. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-pm-benjamin-netanyahu-rising-lion-iran-khamenei-regime-change-strikes-whats-next-explained-2742212-2025-06-18",
      "headline": "Is Israel's Rising Lion a push for Iranians to rise up?Israeli PM Benjamin Netanyahu's handwritten prayer at Jerusalem's Western Wall, \"the people shall rise up as a lion\", could be more than what meets the eye. The \"people\" may not be Israelis, but Iranians. Some analysts believe the line nods to Iran's own citizens, who are increasingly disillusioned with Khamenei's regime."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-to-meet-pakistans-asim-munir-at-white-house-glbs-2742346-2025-06-18",
      "headline": "Days after denying parade invite, Trump to meet Pak's Asim Munir over lunchPakistan Army Chief Field Marshal Asim Munir will hold a closed-door lunch with US President Donald Trump on Wednesday at the White House. The visit, part of a five-day US trip, aims to boost strategic ties and includes meetings with top officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/demoralising-supreme-court-raps-madras-high-court-for-ordering-arrest-of-top-cop-in-kidnapping-case-2742473-2025-06-18",
      "headline": "Supreme Court raps Madras High Court, tells Tamil Nadu to reinstate top copCalling the suspension of a Tamil Nadu ADGP \"demoralising\", the Supreme Court questioned the state government's decision and expressed shock at Madras High Court's decision to order the officer's arrest.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/space-militarisation-hypersonic-missile-iran-israel-conflict-fattah-1-golden-dome-2742478-2025-06-18",
      "headline": "Space becomes the new war zone as Iran-Israel conflict escalatesThe air war between the two longtime enemies entered a sixth day despite a call from US President Donald Trump for Tehran's unconditional surrender. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-grover-says-air-india-fixing-chalta-hai-attitude-not-taking-risks-after-ahmedabad-plane-crash-2742442-2025-06-18",
      "headline": "Varun Grover says Air India fixing chalta hai attitude, not taking risks after crashComedian and screenwriter Varun Grover said he was relieved about Air India taking stricter safety measures after the Ahmedabad plane crash. He referred to the Delhi-Paris flight in his note, which was cancelled on Tuesday due to safety issues.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-giorgia-meloni-meeting-photo-g7-summit-melodi-memes-2742436-2025-06-18",
      "headline": "Melodi moment at G7: PM Modi bonds with Italy's Giorgia MeloniA picture of her meeting with PM Narendra Modi was shared on Instagram by the Italian Prime Minister - enough to trigger a barrage of 'Melodi' memes on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-caught-with-lover-married-woman-jumps-off-hotel-roof-in-up-2742440-2025-06-18",
      "headline": "Video: Caught with lover, married woman jumps off hotel roof in UPAs per the police complaint, the woman was married in 2019 to a man from Kakore village, and the couple has a son. The husband alleged that his wife was involved with several men before the marriage and that those relationships continued afterward. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2025-26-fixtures-manchester-united-arsenal-liverpool-sunderland-leeds-2742559-2025-06-18",
      "headline": "Premier League 2025-26 fixtures: Manchester United face Arsenal in opening weekThe Premier League has unveiled its fixtures for the 2025-26 season, and fans are in for a thrilling start as Manchester United host Arsenal on the opening Super Sunday at Old Trafford. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/joe-root-bazball-england-cricket-team-india-tour-2742538-2025-06-18",
      "headline": "Root on how Bazball works: More method to it than probably perceivedJoe Root opened up about what it means to play the Bazball way, highlighting how the past few years have been among the most enjoyable of his career—especially as he was one of the highest run-scorers in the previous World Test Championship campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-england-plotting-all-out-attack-on-india-on-leeds-pitch-2742530-2025-06-18",
      "headline": "England plotting 'all-out attack' on India with tailor-made Leeds pitchEngland are planning an all-out attack against India in the first Test at Headingley, Leeds, beginning from June 20, with a tailor-made pitch to support their aggressive batting approach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-dissects-virat-kohlis-outside-off-stump-woes-2742483-2025-06-18",
      "headline": "Joe Root dissects Virat Kohli's off-stump woes: Technical changes can backfireStar England batter Joe Root has shared his views on Virat Kohli's outside off-stump woes, saying that it gets difficult for a batter to make changes midway through the series with little turnaround time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/daniel-levy-on-ange-postecoglou-exit-tottenham-hotspur-2742452-2025-06-18",
      "headline": "Spurs chairman explains Ange Postecoglou exit: We need to win Premier LeagueTottenham Hotspur chairman Daniel Levy felt that removing Ange Postecoglou as manager was necessary, believing the club needed to compete strongly on all fronts. Despite winning the Europa League, the team had a disappointing domestic season, finishing 17th in the Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-virat-kohli-fighting-spirit-india-england-test-series-2742464-2025-06-18",
      "headline": "India will miss Virat Kohli's fighting spirit in Test series: Ben StokesEngland captain Ben Stokes has praised Virat Kohli, saying India will miss his \"fighting spirit\" during the upcoming five-match Test series against England, which begins on 20 June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bombay-high-court-verdict-ipl-kochi-tuskers-538-crore-award-case-2742434-2025-06-18",
      "headline": "Setback for BCCI as court affirms Rs 538-crore arbitral awards to Kochi TuskersIn a major blow to the Board of Control for Cricket in India (BCCI), the Bombay High Court has upheld arbitral awards totalling over Rs 538 crore in favour of the former Indian Premier League (IPL) franchise Kochi Tuskers Kerala."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-faced-biryani-criticism-by-ravi-shastri-in-south-africa-2018-2742431-2025-06-18",
      "headline": "Mohammed Shami faced Biryani criticism, responded with five wickets: Ravi ShastriFormer India head coach Ravi Shastri has recently revealed how he called out fast bowler Mohammed Shami for having a large plate of Biryani and the speedster replied with a match-winning five wicket haul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/glenn-maxwell-major-league-cricket-rohit-sharma-t20-hundred-washington-freedom-2742427-2025-06-18",
      "headline": "Maxwell emulates Rohit Sharma with superb T20 hundred for Washington FreedomAustralian all-rounder Glenn Maxwell equalled the likes of David Warner and Aaron Finch, Indian legend Rohit Sharma, and England's Jos Buttler as the player with the joint-fourth-most centuries in T20 cricket. Maxwell notched his eighth century in the shortest format during a Major League Cricket (MLC) match for his team, Washington Freedom (WSF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-commercial-importance-ashes-wtc-ecb-chief-executive-2742423-2025-06-18",
      "headline": "India Test series as commercially important as Ashes: ECB chief executiveThe upcoming five-match Test series between India and England is commercially as important as the Ashes, according to ECB Chief Executive Richard Gould."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/simone-inzaghi-denies-pre-clfinal-al-hilal-deal-praises-commitment-to-inter-milan-2742409-2025-06-18",
      "headline": "Simone Inzaghi downplays Al-Hilal agreement timeline: Gave everything to InterSimone Inzaghi said he gave his all to Inter Milan before becoming the new manager of Al-Hilal earlier this month. Inzaghi made these remarks after Al-Hilal's CEO said that the move had been agreed before Inter's 5-0 loss to Paris St Germain in the Champions League final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bombay-high-court-verdict-ipl-kochi-tuskers-538-crore-award-case-2742434-2025-06-18",
      "headline": "Setback for BCCI as court affirms Rs 538-crore arbitral awards to Kochi TuskersIn a major blow to the Board of Control for Cricket in India (BCCI), the Bombay High Court has upheld arbitral awards totalling over Rs 538 crore in favour of the former Indian Premier League (IPL) franchise Kochi Tuskers Kerala."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-faced-biryani-criticism-by-ravi-shastri-in-south-africa-2018-2742431-2025-06-18",
      "headline": "Mohammed Shami faced Biryani criticism, responded with five wickets: Ravi ShastriFormer India head coach Ravi Shastri has recently revealed how he called out fast bowler Mohammed Shami for having a large plate of Biryani and the speedster replied with a match-winning five wicket haul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/glenn-maxwell-major-league-cricket-rohit-sharma-t20-hundred-washington-freedom-2742427-2025-06-18",
      "headline": "Maxwell emulates Rohit Sharma with superb T20 hundred for Washington FreedomAustralian all-rounder Glenn Maxwell equalled the likes of David Warner and Aaron Finch, Indian legend Rohit Sharma, and England's Jos Buttler as the player with the joint-fourth-most centuries in T20 cricket. Maxwell notched his eighth century in the shortest format during a Major League Cricket (MLC) match for his team, Washington Freedom (WSF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-commercial-importance-ashes-wtc-ecb-chief-executive-2742423-2025-06-18",
      "headline": "India Test series as commercially important as Ashes: ECB chief executiveThe upcoming five-match Test series between India and England is commercially as important as the Ashes, according to ECB Chief Executive Richard Gould."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/simone-inzaghi-denies-pre-clfinal-al-hilal-deal-praises-commitment-to-inter-milan-2742409-2025-06-18",
      "headline": "Simone Inzaghi downplays Al-Hilal agreement timeline: Gave everything to InterSimone Inzaghi said he gave his all to Inter Milan before becoming the new manager of Al-Hilal earlier this month. Inzaghi made these remarks after Al-Hilal's CEO said that the move had been agreed before Inter's 5-0 loss to Paris St Germain in the Champions League final."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}