{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-day-1-check-latest-subscription-gmp-subscribe-skip-review-2635963-2024-11-19",
      "headline": "NTPC Green Energy IPO Day 1: Check latest subscription, GMPThe initial public offering (IPO) of NTPC Green Energy Limited opened for bidding on Tuesday looking to raise Rs 10,000 crore through a fresh issue entirely of 92.59 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-3-reasons-why-sensex-nifty-failed-to-sustain-stock-market-relief-rally-2635939-2024-11-19",
      "headline": "Explained: 3 reasons why Sensex, Nifty failed to sustain relief rallyThe benchmark indices, Sensex and Nifty, surged over 1% in early trade, with the Sensex climbing more than 1,000 points intraday. However, by the end of the session, most of these gains were erased."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-warns-public-about-deepfake-videos-of-top-officials-giving-financial-advice-2635922-2024-11-19",
      "headline": "RBI warns public about deepfake videos of top officials giving financial adviceIn a press release, the central bank clarified that these videos are fake and warned people not to engage with or believe in them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-but-bears-still-hold-control-ril-shares-down-2-percent-2635883-2024-11-19",
      "headline": "Sensex and Nifty bounce back but bears still hold control; RIL down 2%The S&P BSE Sensex added 239.37 points to close at 77,578.38, while the NSE Nifty50 was up 64.70 points to end at 23,518.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-crypto-replace-gold-which-is-better-to-buy-expert-comment-bitcoin-prices-2635826-2024-11-19",
      "headline": "Can cryptocurrency be the next gold? With strong support and remarkable returns, Bitcoin is now increasingly seen as a potential alternative to gold, despite its volatility and regulatory challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rebound-dalal-street-whats-next-2635848-2024-11-19",
      "headline": "Sensex, Nifty rebound: Will the relief rally on D-Street continue or fizzle out?Stock market today: While the market did show some signs of recovery today, the sharp decline in the final hours has left retail investors in an uncertain situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-over-1000-points-all-you-need-to-know-in-5-points-2635828-2024-11-19",
      "headline": "Sensex surges 1,000 points. All you need to know in 5 pointsThe rally saw the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) jump by Rs 6.06 lakh crore to Rs 435.14 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-subscription-review-3-reasons-why-you-should-subscribe-latest-gmp-2635800-2024-11-19",
      "headline": "NTPC Green Energy IPO: 3 reasons why you should subscribeNTPC Green Energy IPO: The subscription for NTPC Green Energy IPO will close on November 22, 2024 and the price band is set between Rs 102 and Rs 108 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/honasa-consumer-mamaearth-share-price-today-30-percent-drop-two-sessions-what-next-for-stock-2635777-2024-11-19",
      "headline": "Honasa Consumer share price tumbles over 30% in two trading sessions. What next?Honasa Consumer share price: The sharp sell-off was triggered by a disappointing set of September quarter results and concerns over the company's near-term growth outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-jumps-morgan-stanley-upgrade-good-opportunity-to-buy-2635752-2024-11-19",
      "headline": "Explained: Why Suzlon Energy share price hit 5% upper circuit today Suzlon Energy share price: The jump in its share price came after brokerage Morgan Stanley upgraded the stock to 'Overweight' from 'Equal-weight.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-is-it-a-good-time-to-buy-3-things-you-should-know-expert-views-future-outlook-2635736-2024-11-19",
      "headline": "Is it a good time to buy gold? 3 things you should knowGold Price: On the MCX, gold futures maturing on December 5, 2024, were priced at Rs 75,450 per 10 grams, reflecting an increase of Rs 403 or 0.54%. The previous close was Rs 75,047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irfc-rvnl-irctc-ircon-railway-stocks-surge-stock-market-rally-2635731-2024-11-19",
      "headline": "IRFC, RVNL, IRCTC, IRCON: Why these railway stocks are gaining todayRailway stocks saw sharp gains during the session, led by IRFC, which rose over 5%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-other-details-2635692-2024-11-19",
      "headline": "Zinka Logistics IPO allotment: How to check status, latest GMP and other detailsZinka Logistics IPO allotment: Investors can check their allotment status on the Bombay Stock Exchange (BSE) website or through the registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-calls-for-affordable-interest-rates-after-piyush-goyals-remarks-rbi-governor-shaktikanta-das-2635670-2024-11-19",
      "headline": "Nirmala Sitharaman calls for 'affordable' interest rates after Piyush GoyalThe Reserve Bank of India's (RBI) Monetary Policy Committee (MPC) has kept key interest rates unchanged since February 2023, citing persistent inflation pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-bull-run-sensex-up-1000-points-nifty-jumps-worst-over-key-things-to-know-2635666-2024-11-19",
      "headline": "Sensex surges 1,000 points, snaps 7-session losing streak. Is the worst over?Sensex today: At 11:36 am, the Sensex was up 1044.89 points at 78,383.90, while the NSE Nifty50 advanced 304.50 points to 23,758.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amazon-flipkart-executives-foreign-direct-investment-rules-violation-ed-probe-2635634-2024-11-19",
      "headline": "ED likely to summon top Amazon, Flipkart executives over FDI rule violationsThe ED's investigation stems from multiple complaints alleging that Amazon and Flipkart have been violating Foreign Direct Investment (FDI) rules by directly or indirectly favouring select vendors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-aerospace-giant-boeing-layoffs-washington-oregon-south-carolina-financial-crisis-2635628-2024-11-19",
      "headline": "Boeing to cut over 2,500 workers in US amid financial crisisNearly 2,200 layoff notices went to workers in Washington and another 220 in South Carolina, the two states where Boeing builds commercial airliners. Boeing declined to comment on the layoffs on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-19-2024-precious-metals-record-hike-on-mcx-2635621-2024-11-19",
      "headline": "Gold, silver price today, November 19, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/meta-competition-commission-of-india-penalty-213-crore-decision-whatsapp-policy-disagree-plan-to-appeal-2635616-2024-11-19",
      "headline": "Meta to appeal India's Rs 213-crore penalty order over WhatsApp policyThe Competition Commission of India (CCI) on Monday imposed a penalty of Rs 213.14 crore on social media major Meta for unfair business ways with respect to WhatsApp privacy policy update done in 2021."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-open-for-bidding-subscribe-skip-good-bad-review-latest-gmp-2635615-2024-11-19",
      "headline": "NTPC Green Energy IPO open for bidding: Should you subscribe? Check latest GMPNTPC Green Energy IPO: The initial public offering (IPO) makes NTPC Green Energy the third-largest IPO of the year, following Hyundai Motors India's Rs 28,756 crore IPO and Swiggy's Rs 11,327 crore issue."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-says-ukraine-fired-us-made-atacms-missiles-after-ban-lifted-2635948-2024-11-19",
      "headline": "Russia says Ukraine fired 6 American-made missiles after US lifts banThe announcement came after Biden authorised Ukraine to use US-supplied missiles to strike deeper inside Russia, easing limitations on the longer-range weapons after Russia deployed thousands of North Korean troops in the conflict."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-polls-bjp-leader-vinod-tawde-accused-distributing-money-denies-claim-2635769-2024-11-19",
      "headline": "Maharashtra BJP leader accused of distributing cash, poll body files caseA video that has gone viral shows Bahujan Vikas Aghadi (BVA) workers storming into the Vivanta Hotel in Palghar during a meeting between Tawde and Rajan Naik. Vinod Tawde has denied the accusations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-air-pollution-aqi-shashi-tharoor-shift-capital-indonesia-jakarta-2635809-2024-11-19",
      "headline": "As Shashi Tharoor suggests capital switch over smog, Indonesia is already at itDelhi AQI: Shashi Tharoor's post sparked a debate on social media, with several users suggesting shifting India's capital to one of the southern cities, like Chennai or Hyderabad. In 2022, Indonesia passed legislation to shift its capital from Jakarta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-renames-karimganj-district-sribhumi-himanta-biswa-sarma-government-2636004-2024-11-19",
      "headline": "Assam government renames Karimganj district as SribhumiHimanta Biswa Sarma government in Assam renames Karimganj district Sribhumi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nuclear-war-risk-high-world-war-three-european-countries-ask-people-stock-food-water-2635926-2024-11-19",
      "headline": "Risk of nuclear war high, European countries ask people to stock up food, waterWorld War III might not be too far, some countries believe. While US President Joe Biden has supplied the US with long-range American missiles, Vladimir Putin has decreased the threshold for the use of nuclear weapons in Russia. Nato countries, afraid, issued pamphlets to their citizens, advising them on how to prepare for World War III."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-president-joe-biden-canadian-prime-minister-justin-trudeau-missing-from-g20-leaders-group-picture-miss-traditional-photo-shoot-2635758-2024-11-19",
      "headline": "Biden, Trudeau, Italy's Meloni MIA from G20 leaders' group pictureFrustrated US officials blamed \"logistical issues\" for the blunder, which meant that Joe Biden missed out on the shot, along with the Canadian and Italian Prime Ministers Justin Trudeau and Giorgia Meloni, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tamil-nadu-politicians-slam-lic-default-hindi-setting-on-website-corporate-office-calls-technical-glitch-2635901-2024-11-19",
      "headline": "LIC calls default Hindi on website 'technical issue' after outrage in Tamil NaduThe LIC website's default Hindi setting has sparked backlash, especially from Tamil Nadu leaders. EPS and CM Stalin condemned the move, calling it an imposition on linguistic diversity and demanding the default language be changed to English."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-1000-days-pictures-2635781-2024-11-19",
      "headline": "1000 days of Russia-Ukraine war: Life in picturesA photo essay capturing 1,000 days of the Russia-Ukraine war—depicting destruction, resilience, and hope through images of survival, loss, and the enduring spirit to rebuild and dream of peace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/shah-rukh-khan-announces-son-aryan-khan-debut-netflix-series-release-2025-2636016-2024-11-19",
      "headline": "Shah Rukh Khan announces son Aryan's debut series on NetflixAryan Khan is set to make his directorial debut with an untitled Bollywood series on Netflix, produced by Gauri Khan. It is expected to release in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/iit-bombay-alumnus-viral-post-on-daughter-rs-4-lakh-school-fee-for-class-1-sparks-debate-2635912-2024-11-19",
      "headline": "IITian's post on daughter's Rs 4 lakh school fee for Class 1 sparks debateAn IIT Bombay alumnus sparked an online debate by sharing his daughter's hefty school fees, highlighting the financial strain on middle-class families seeking quality education."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2015-air-pollution-what-delhi-could-learn-from-beijing-2635315-2024-11-18",
      "headline": "From the archives (2015) | Air pollution: What Delhi could learn from BeijingChina's crackdown on smog in its cities after the 2013 'airpocalypse' is a story of prioritising public health at all costs. Could India follow in its footsteps?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-rafael-nadal-farewell-roger-federer-message-malaga-2635748-2024-11-19",
      "headline": "Retiring Rafael Nadal gets heartfelt message from 'fan' Roger FedererRoger Federer wrote an emotional farewell message to Rafael Nadal as the Spaniard gets ready for his last tournament as a professional tennis player. Nadal will turn up for Spain in the Davis Cup Finals between November 19 and 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musks-spacex-starship-super-heavy-to-launch-on-6th-flight-today-with-trump-watching-2635655-2024-11-19",
      "headline": "Starship Super Heavy to launch tonight with Donald Trump watchingThis latest flight aims to build on the successes of previous tests while introducing new objectives to enhance the rocket's capabilities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/diljit-dosanjh-replaces-alcohol-with-coke-in-lyrics-at-hyderabad-concert-coca-cola-reacts-2635702-2024-11-19",
      "headline": "Diljit Dosanjh replaces alcohol with Coke in song's lyrics, Coca-Cola reacts Diljit Dosanjh Hyderabad Concert Video: Diljit Dosanjh replaced the lyrics of his song which mentioned alcohol with Coca-Cola at his Hyderabad concert. The company reacted to one of the viral videos of his performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-ukraine-nuclear-missile-doctrine-vladimir-putin-2635843-2024-11-19",
      "headline": "Russia revises nuclear doctrine as US allows Ukraine to use American missilesThis follows US President Joe Biden's decision to let Ukraine strike targets inside Russia with US-supplied longer-range missiles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/comedian-samay-raina-wants-ad-revenue-from-deepika-padukone-depression-joke-on-indias-got-latent-2635768-2024-11-19",
      "headline": "Comedian Samay Raina wants 'ad revenue' from Deepika Padukone depression jokeIndia's Got Latent creator and comedian Samay Raina asked people to help him monetise the Deepika Padukone depression 'joke' from his show. He reacted on Instagram after outrage over the contentious joke. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/toe-tally-painful-how-to-deal-with-ingrown-nails-2635749-2024-11-19",
      "headline": "Toe-tally painful! How to deal with ingrown nails If you're experiencing redness and pain around your nail that is becoming increasingly unbearable, you may be dealing with an ingrown nail. It can cause significant discomfort and complications if left untreated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shiv-sena-worli-candidate-milind-deora-car-checked-mumbai-shares-video-support-free-fair-maharashtra-elections-2635895-2024-11-19",
      "headline": "Milind Deora's car checked in Mumbai, he shares video: 'Support free, fair polls'In the Sena vs Sena battle, Milind Deora, who left the Congress and joined the Eknath Shinde-led Shiv Sena in January, will face off against Aaditya Thackeray. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-environment-minister-gopal-rai-writes-centre-seeks-nod-artificial-rain-air-crisis-2635680-2024-11-19",
      "headline": "Artificial rain needed: Delhi flags air emergency, seeks Centre's nodDelhi AQI: The Delhi Minister's letter to the Centre comes as the national capital is battling with deteriorating air pollution levels. On Tuesday, the Air Quality Index stood at 494 under the 'severe plus' category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-rise-as-pan-india-star-north-belt-pushpa-2-patna-launch-iconic-2635792-2024-11-19",
      "headline": "Decoding rise and rise of Allu Arjun and why Pushpa 2 Patna launch is iconicAllu Arjun is the first South Indian actor to host the trailer launch event of his upcoming film Pushpa 2 in Patna, the heartland of the Hindi belt. Pushpa 2: The Rule will release in theatres on December 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-clash-donald-trump-inner-circle-cabinet-picks-boirs-ephsteyn-rift-power-centre-2635868-2024-11-19",
      "headline": "Is first buddy Elon Musk already clashing with Trump's inner circle?Both Elon Musk and Boris Ephsteyn have been central to President-elect Donald Trump's Cabinet picks and now there are reports of a massive blow-up between them. But is Musk, who calls himself the 'first buddy' of the US, becoming a concern for Trump's inner circle?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-air-pollution-authorities-urge-private-mncs-work-from-home-2635925-2024-11-19",
      "headline": "Gurugram private firms urged to work from home as pollution impacts daily lifeGurugram's AQI was recorded at 404 at 5 pm on Tuesday, which falls under the 'severe' category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-health-how-space-station-commander-tracks-her-sleep-in-space-2635772-2024-11-19",
      "headline": "Sunita Williams's health: How the astronaut tracks her sleep in spaceStudies have revealed that crew members sleep significantly less during spaceflight compared to pre- and post-mission periods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/johnny-tiger-travels-300-km-from-maharashtra-to-telangana-in-search-of-mate-2635718-2024-11-19",
      "headline": "From Maharashtra to Telangana: Tiger Johnny travels 300 km in search of mateA male tiger, named Johnny, travelled 300 km from Maharashtra to Telangana, apparently to find a mate. The tiger's journey, which began in the third week of October, was tracked by a radio collar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/shah-rukh-khan-announces-son-aryan-khan-debut-netflix-series-release-2025-2636016-2024-11-19",
      "headline": "Shah Rukh Khan announces son Aryan's debut series on NetflixAryan Khan is set to make his directorial debut with an untitled Bollywood series on Netflix, produced by Gauri Khan. It is expected to release in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-says-abram-has-not-seen-many-of-his-films-2636000-2024-11-19",
      "headline": "Shah Rukh Khan says AbRam hasn't seen many of his filmsShah Rukh Khan shared his desire for his son AbRam to experience his stardom. The actor also discussed his approach to appealing to a younger audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-and-priya-celebrate-10-years-of-marriage-2635942-2024-11-19",
      "headline": "Watch: Atlee and Priya celebrate 10 years of marriage    Jawan director Atlee and his wife Priya celebrated a decade of togetherness with a heartfelt Instagram post, sharing a video collage that chronicled their relationship milestones."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-cuts-birthday-cake-delhi-airport-husband-vignesh-shivan-uyir-ulag-dhanush-netflix-documentary-2635994-2024-11-19",
      "headline": "Watch: Nayanthara cuts birthday cake at Delhi airport with husband Vignesh, sonsIn a viral video from  Delhi airport, Nayanthara was seen cutting her birthday cake. The actor was clicked at the airport alongside her husband, Vignesh Shivan, and their sons, Uyir and Ulag.\r\n\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-hussey-india-vs-pakistan-border-gavaskar-trophy-2024-25-australia-vs-india-2635976-2024-11-19",
      "headline": "Border Gavaskar Trophy not at par with India vs Pakistan rivalry: Michael HusseyFormer Australia cricketer Michael Hussey has said that India vs Australia rivalry will never be able to compete with India vs Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-ipl-2025-mega-auction-sanjay-manjrekar-gujarat-titans-2635944-2024-11-19",
      "headline": "Mohammed Shami might see a drop in his price tag at IPL auction: Sanjay ManjrekarFormer India cricketer Sanjay Manjrekar feels fast bowler Mohammed Shami is likely to experience a price drop at the IPL 2025 mega auction due to his injury issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-sam-kerr-kirstie-mewis-chelsea-pride-baby-announcement-2635945-2024-11-19",
      "headline": "Sam Kerr faces 'hate' after baby announcement, Chelsea Pride slams critics Australian football player Sam Kerr was greeted with hate and abuse on social media after she announced her pregnancy with Kirstie Mewis of the United States on Monday, November 18. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-gerald-coetzee-found-guilty-of-icc-code-of-conduct-breach-during-india-t20i-2635940-2024-11-19",
      "headline": "Gerald Coetzee found guilty of ICC Code of Conduct breach during India T20ISouth Africa pacer Gerald Coetzee was found guilty of breaching the ICC Code Of Conduct during the 4th T20I against India. Coetzee was found guilty of breaching Article 2.8 of the ICC Code of Conduct for Players and Player Support Personnel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sledging-australia-vs-india-shane-watson-tip-border-gavaskar-2635911-2024-11-19",
      "headline": "Don't poke Virat Kohli: Shane Watson warns Australia ahead of Test seriesBorder-Gavaskar Trophy: Shane Watson said Australia will be well served if they don't get into the nerves of Virat Kohli and get him pumping. Kohli has had a lean run in Tests, but it is widely expected that the former captain will find his best in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-temba-bavuma-returns-wtc-final-race-2635910-2024-11-19",
      "headline": "SA vs SL: Bavuma returns as South Africa captain as WTC Final race heats upSouth Africa's Test captain Temba Bavuma is back from an elbow injury to lead in the home series against Sri Lanka. The team aims for a spot in the ICC World Test Championship final, needing to win all remaining home Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wbbl-smriti-mandhana-catch-perth-scorchers-adelaide-strikers-2635905-2024-11-19",
      "headline": "Watch: Smriti Mandhana takes stunning diving catch in clash vs ScorchersWBBL 2024: Smriti Mandhana took a stupendous catch running backwards during the clash between Adelaide Strikers and Perth Scorchers on Tuesday at the Karen Rolton Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-ipl-2025-auction-strategy-rohit-sharma-jasprit-bumrah-trent-boult-piyush-chawla-2635427-2024-11-19",
      "headline": "IPL auction prediction: Will MI look to re-sign Ishan Kishan with Rs 45 crore purse?The five-time IPL champions Mumbai Indians have a lot to ponder about as they head into the IPL 2025 auction with a purse amount of INR 45 Crore after retaining their five star players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2024-25-2635878-2024-11-19",
      "headline": "Virat Kohli is India's best bet at no 3 in Perth: 1983 World Cup winning playerStar India batter Virat Kohli is India's best bet to bat at number three in the upcoming five-match Test series against Australia, feels former India cricketer Kirti Azad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-blind-t20-world-cup-india-withdraw-government-permission-pakistan-travel-2635829-2024-11-19",
      "headline": "India pull out of Blind T20 World Cup in Pakistan after no government clearanceSailendra Yadav, general secretary of the Indian blind cricket association, speaking to India Today, confirmed that the government denied nod for the team to travel to Pakistan, which will host the Blind T20 World Cup from November 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-key-to-success-perth-test-2635827-2024-11-19",
      "headline": "Border-Gavaskar Trophy: Jasprit Bumrah reveals India's key to success in seriesJasprit Bumrah has revealed the Indian team's key to success in Australia ahead of the upcoming Border-Gavaskar Trophy, starting on November 22. Bumrah will lead India in the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wbbl-smriti-mandhana-catch-perth-scorchers-adelaide-strikers-2635905-2024-11-19",
      "headline": "Watch: Smriti Mandhana takes stunning diving catch in clash vs ScorchersWBBL 2024: Smriti Mandhana took a stupendous catch running backwards during the clash between Adelaide Strikers and Perth Scorchers on Tuesday at the Karen Rolton Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-ipl-2025-auction-strategy-rohit-sharma-jasprit-bumrah-trent-boult-piyush-chawla-2635427-2024-11-19",
      "headline": "IPL auction prediction: Will MI look to re-sign Ishan Kishan with Rs 45 crore purse?The five-time IPL champions Mumbai Indians have a lot to ponder about as they head into the IPL 2025 auction with a purse amount of INR 45 Crore after retaining their five star players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2024-25-2635878-2024-11-19",
      "headline": "Virat Kohli is India's best bet at no 3 in Perth: 1983 World Cup winning playerStar India batter Virat Kohli is India's best bet to bat at number three in the upcoming five-match Test series against Australia, feels former India cricketer Kirti Azad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-blind-t20-world-cup-india-withdraw-government-permission-pakistan-travel-2635829-2024-11-19",
      "headline": "India pull out of Blind T20 World Cup in Pakistan after no government clearanceSailendra Yadav, general secretary of the Indian blind cricket association, speaking to India Today, confirmed that the government denied nod for the team to travel to Pakistan, which will host the Blind T20 World Cup from November 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-key-to-success-perth-test-2635827-2024-11-19",
      "headline": "Border-Gavaskar Trophy: Jasprit Bumrah reveals India's key to success in seriesJasprit Bumrah has revealed the Indian team's key to success in Australia ahead of the upcoming Border-Gavaskar Trophy, starting on November 22. Bumrah will lead India in the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-rishabh-pant-delhi-capitals-replacement-ishan-kishan-sunil-gavaskar-2635791-2024-11-19",
      "headline": "No Rishabh Pant? Delhi may spend Rs 15-20 crore for his replacement, says GavaskarSunil Gavaskar has said that Delhi Capitals would be willing to splash Rs. 15-20 crores for a replacement for Rishabh Pant during the IPL 2025 auction. Gavaskar feels DC could target Ishan Kishan as the replacement for Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-focus-on-slip-catching-on-first-training-day-at-perth-stadium-highlights-2635786-2024-11-19",
      "headline": "India focus on slip catching on first training day at Perth Stadium: Top highlightsTeam India kicked off their preparations for the upcoming Test series with an intensive training session at the iconic Optus Stadium in Perth. The session focused on fielding, batting drills, and acclimatization to Australian conditions three days ahead of the series opener.\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marnus-labuschagne-perth-test-india-weakened-new-zealand-series-defeat-2635784-2024-11-19",
      "headline": "India low on confidence, but Australia won't underestimate them: LabuschagneBorder_Gavaskar Trophy: Marnus Labuschagne, speaking to reporters in Perth on Tuesday, cautioned against underestimating India even as the visitors arrived in Australia on the back of a shocking 0-3 defeat to New Zealand in a home Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-nathan-mcsweeney-opening-marnus-labuschagne-david-warner-2635754-2024-11-19",
      "headline": "Give Nathan McSweeney time, hope Marnus Labuschagne has a big series: WarnerDavid Warner has urged the Australia selectors to be patient with Nathan McSweeney in the opener's role. Warner also expects Marnus Labuschagne to return to form against India during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rajitha-embuldeniya-back-sri-lanka-test-squad-south-africa-2635750-2024-11-19",
      "headline": "Rajitha, Embuldeniya back in Sri Lanka Test squad for South Africa seriesSouth Africa vs Sri Lanka: Fast-bowler Kasun Rajitha has been named in Sri Lanka's squad for the two-match Test series against South Africa beginning on November 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-rafael-nadal-farewell-roger-federer-message-malaga-2635748-2024-11-19",
      "headline": "Retiring Rafael Nadal gets heartfelt message from 'fan' Roger FedererRoger Federer wrote an emotional farewell message to Rafael Nadal as the Spaniard gets ready for his last tournament as a professional tennis player. Nadal will turn up for Spain in the Davis Cup Finals between November 19 and 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-batting-slip-cordon-rahul-jurel-padikkal-jaiswal-2635695-2024-11-19",
      "headline": "India's slip cordon picture from nets hints at batting order for Perth TestIndia's practice session ahead of the Perth Test offered some intriguing hints about the potential playing XI. With Shubman Gill and Rohit Sharma unavailable, the team is searching for replacements at the top of the order. Visuals from the nets, shared on social media, suggest that Devdutt Padikkal and Dhruv Jurel are likely to get a nod. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-nathan-mcsweeney-opening-marnus-labuschagne-david-warner-2635754-2024-11-19",
      "headline": "Give Nathan McSweeney time, hope Marnus Labuschagne has a big series: WarnerDavid Warner has urged the Australia selectors to be patient with Nathan McSweeney in the opener's role. Warner also expects Marnus Labuschagne to return to form against India during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rajitha-embuldeniya-back-sri-lanka-test-squad-south-africa-2635750-2024-11-19",
      "headline": "Rajitha, Embuldeniya back in Sri Lanka Test squad for South Africa seriesSouth Africa vs Sri Lanka: Fast-bowler Kasun Rajitha has been named in Sri Lanka's squad for the two-match Test series against South Africa beginning on November 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-rafael-nadal-farewell-roger-federer-message-malaga-2635748-2024-11-19",
      "headline": "Retiring Rafael Nadal gets heartfelt message from 'fan' Roger FedererRoger Federer wrote an emotional farewell message to Rafael Nadal as the Spaniard gets ready for his last tournament as a professional tennis player. Nadal will turn up for Spain in the Davis Cup Finals between November 19 and 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-batting-slip-cordon-rahul-jurel-padikkal-jaiswal-2635695-2024-11-19",
      "headline": "India's slip cordon picture from nets hints at batting order for Perth TestIndia's practice session ahead of the Perth Test offered some intriguing hints about the potential playing XI. With Shubman Gill and Rohit Sharma unavailable, the team is searching for replacements at the top of the order. Visuals from the nets, shared on social media, suggest that Devdutt Padikkal and Dhruv Jurel are likely to get a nod. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-shubman-gill-number-three-rahul-dravid-2635694-2024-11-19",
      "headline": "Not like Pujara or me, but Shubman Gill will succeed at No. 3 in Australia: DravidRahul Dravid has backed Shubman Gill to excel in the No.3 role for India during the upcoming Border-Gavaskar trophy, starting from November 22. Gill has performed will since taking over the No.3 spot from Cheteshwar Pujara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-rohit-sharma-missing-perth-test-michael-clarke-2635669-2024-11-19",
      "headline": "Rohit Sharma's call to miss Perth Test defended by Michael Clarke: Family firstMichael Clarke has come out in support of Rohit Sharma's decision to miss the Perth Test and be with his family as he welcomed his second child. Rohit and his wife Ritika welcomed a baby boy on November 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-retention-rishabh-pant-delhi-capitals-reason-money-sunil-gavaskar-2635664-2024-11-19",
      "headline": "Rishabh Pant breaks silence on leaving Delhi Capitals: 'Not about money' IPL Auction: Wicketkeeper-batter Rishabh Pant, in a surprising move, was not retained by Delhi Capitals ahead of the mega auction. Pant took to social media and said their split was not because of money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/champions-trophy-backdoor-talks-on-to-convince-pakistan-on-hybrid-model-2635654-2024-11-19",
      "headline": "Backdoor talks on to convince Pakistan on hybrid Champions Trophy Top cricket administrators are trying to convince Pakistan to start working towards a hybrid model for the marquee eight-team tournament. PCB chairman Mohsin Naqvi, on Monday, reiterated Pakistan's stance, offering to ease India's safety concerns."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}