{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-nasdaq-rises-1-percent-on-inflation-relief-tesla-soars-6-nvidia-up-4-2679839-2025-02-14",
      "headline": "Nasdaq rises over 1% on inflation relief; Tesla soars 6%, Nvidia up 4%The Nasdaq Composite jumped 1.5%, the S&P 500 gained 1.04%, and the Dow Jones Industrial Average rose 0.77%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-a-married-couple-save-more-taxes-using-both-old-and-new-tax-regime-2678890-2025-02-13",
      "headline": "Can a married couple save more taxes using both old and new tax regime?Married couples need to determine which tax regime offers lower tax liability for each spouse considering their income structure and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-dips-to-431-percent-in-january-2678907-2025-02-12",
      "headline": "India's retail inflation dips to 4.31% in January, hits a five-month lowThe country's retail inflation witnessed a drop in January majorly due to declining food prices, according to data released by the National Statistics Office on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-dalal-street-2678823-2025-02-12",
      "headline": "Sensex, Nifty recover sharply but end in red; M&M falls 3%The S&P BSE Sensex settled 122.52 points lower at 76,171.08. Earlier in the day, the 30-share index had plunged 850 points. Nifty, too, recovered strongly to end 26.55 points lower at 23,045.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-inflows-see-slight-dip-in-january-heres-why-2678801-2025-02-12",
      "headline": "Mutual fund inflows see slight dip in January. Here's whyThe flows declined 3.6% month-on-month to 396.88 billion rupees ($4.57 billion) from 411.56 billion rupees in December 2024, according to data by the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to introduce simpler 'tax year' concept: All you need to knowWhen the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-bloodbath-on-dalal-street-us-trade-tariffs-weak-q3-earnings-2678603-2025-02-12",
      "headline": "Sensex tumbles over 850 points as US tariff fears spook Dalal StreetThe S&P BSE Sensex nosedived 834.39 points to 75,459.21 at 10 am, while the NSE Nifty50 fell 251.95  points to trade at 22,819.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-chief-minister-mohan-yadav-rs-1553-crore-for-ladli-behna-yojana-released-check-eligibility-2678366-2025-02-11",
      "headline": "Madhya Pradesh: Rs 1,553 crore for Ladli Behna Yojana released. Check eligibilityLadli Behna Yojana aims to improve women's well-being, health, nutrition and economic independence. Presently, Rs 1,250 per month is given to all the eligible women under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-will-its-implementation-face-delays-time-salary-hike-for-central-government-employee-2678368-2025-02-11",
      "headline": "8th Pay Commission: Will its implementation face delays?Despite several measures announced for taxpayers in the Union Budget 2025, there was no mention of the financial impact of implementing the 8th Pay Commission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-you-eligible-for-fixed-medical-allowance-under-nps-check-details-2678298-2025-02-11",
      "headline": "Are you eligible for fixed medical allowance under NPS? Check details Retired central government civilian employees who are covered under the National Pension System will now be eligible for fixed medical allowance, announced the Department of Pension & Pensioners' Welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reason-behind-stock-market-crash-sensex-ends-1000-points-lower-tariff-threat-weak-rupee-fii-selling-2678293-2025-02-11",
      "headline": "Sensex ends 1,000 points lower: 5 factors behind today's stock market crashInvestors lost nearly Rs 10 lakh crore as selling pressure intensified across sectors due to various factors that dampened investor sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-bears-feast-on-dalal-street-as-stock-markets-decline-for-5th-straight-session-trump-tariff-2678247-2025-02-11",
      "headline": "Sensex falls 1,000 points, investors lose Rs 10 lakh crore on Dalal StreetThe S&P BSE Sensex tanked by 1,1018.20 points to end at 76,293.60, while the NSE Nifty50 fell by 309.80 points to close at 23,071.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-inflation-likely-to-dip-to-a-five-month-low-of-460-percent-in-january-report-2678212-2025-02-11",
      "headline": "India's inflation likely to dip to a 5-month low of 4.60% in January: ReportThe country's consumer inflation is expected to fall to a five-month low of 4.60% in January 2025, as compared to 5.22% which was recorded in December last year, as per Reuters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-keep-ban-on-chinese-investments-for-now-says-chief-economic-adviser-v-anantha-nageswaran-2678213-2025-02-11",
      "headline": "India to keep ban on Chinese investments for now, says Chief Economic AdviserSpeaking at an event in Mumbai on Tuesday, Chief Economic Adviser (CEA) V. Anantha Nageswaran said that any changes to the current restrictions would take time and require a deeper understanding between both countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coimbatore-company-rewards-employees-with-rs-145-crore-bonus-here-is-why-2677783-2025-02-11",
      "headline": "Coimbatore company rewards employees with Rs 14.5 crore bonus. Here's whyA few days ago, the CEO, Saravana Kumar, formally announced the release of the bonus. He shared that he deliberately did not choose to offer employee stock options (ESOPS) or performance-based incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hotmail-co-founder-sabeer-bhatia-critisises-aadhaar-and-upi-in-a-podcast-2678145-2025-02-11",
      "headline": "Hotmail co-founder Sabeer Bhatia critisises Aadhaar and UPI in a podcast Sabeer Bhatia mentioned that the use of video and voiceprint technology for the Aadhaar project, which is already embedded in smartphones, could have been a better approach which could have achieved the same results at much lower costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-mumbai-bengaluru-this-indian-city-tops-luxury-home-price-surge-delhi-knight-frank-prime-global-cities-index-q4-2024-2678161-2025-02-11",
      "headline": "Not Mumbai or Bengaluru, this Indian city leads in luxury home price surgeMumbai, traditionally known for its expensive real estate, was placed seventh in the global rankings for luxury home price surge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-key-reasons-behind-bloodbath-dalal-street-2678153-2025-02-11",
      "headline": "Sensex crashes over 1,000 points: What's behind today's stock market bloodbath?Stock market crash: At 1:12 pm, the Sensex was down 1051.88 points to 76,261.90, and the Nifty fell 321.15 points to 23,060.45. Most broader market indices were also in the red as volatility spiked sharply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-expected-soon-table-parliament-heres-what-taxpayers-can-expect-2678132-2025-02-11",
      "headline": "New Income Tax Bill expected soon: Here's what taxpayers can expect The new bill aims to make direct tax laws simpler, reduce litigation, and remove ambiguities in the current system. Experts believe it will be easier to understand, more user-friendly, and free of unnecessary complexities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-layoffs-fired-trainee-employees-share-ordeal-after-mass-termination-this-is-inhumane-2678097-2025-02-11",
      "headline": "Sacked Infosys trainees share ordeal after mass termination: 'This is inhumane'The sacked trainee employees, who were onboarded after 2.5 years of wait, were called in batches of 50 starting from 9.30 am on February 7. They were escorted to a room guarded by security and bouncers where they were made to sign a mutual separation letter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-inaugurates-india-energy-week-2025-outlines-green-energy-targets-2678112-2025-02-11",
      "headline": "PM Modi inaugurates India Energy Week 2025, outlines green energy targetsPrime Minister Narendra Modi virtually launched India Energy Week 2025, reaffirming India's commitment to green energy. He announced plans to add 500 GW of renewable capacity and outlined ambitious 2030 sustainability goals, citing India's strong track record over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-falls-over-5-today-key-reasons-behind-decline-2678081-2025-02-11",
      "headline": "Explained: Why Zomato share price plunged over 5% todayZomato stock price: Shares of the company have been under pressure ever since global brokerage firm Jefferies raised concerns over rising competition in the quick commerce space."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-meets-with-accident-undergoing-treatment-2679715-2025-02-13",
      "headline": "Singer-composer Vishal Dadlani meets with an accident, undergoes treatmentVishal Dadlani of the Vishal-Sheykhar duo is undergoing treatment after an accident, leading to the postponement of their upcoming concert scheduled for March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-unfiltered-india-tour-shows-across-nation-cancelled-indias-got-latent-controversy-2679669-2025-02-13",
      "headline": "Not just Gujarat, all Samay Raina shows cancelled amid India's Got Latent rowSamay Raina's shows in India have been cancelled following controversy around India's Got Latent, with Gujarat shows being the first to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-jonita-gandhi-to-perform-at-lollapalooza-india-will-open-for-shawn-mendes-2679497-2025-02-13",
      "headline": "Singer Jonita Gandhi to perform at Lollapalooza India, will open for Shawn MendesJonita Gandhi will perform at Lollapalooza India on March 8, opening for Shawn Mendes. Her latest single Channa has also been nominated for a Juno Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twilight-star-taylor-lautner-to-return-as-werewolf-in-self-aware-werewolf-series-2679572-2025-02-13",
      "headline": "Twilight star Taylor Lautner to return as werewolf in self-aware werewolf seriesTwilight star Taylor Lautner is returning to portray a werewolf in the self-aware Amazon series. Details of the show are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/anupamaa-actor-rupali-ganguly-seeks-blessings-at-maha-kumbh-2679484-2025-02-13",
      "headline": "Anupamaa actor Rupali Ganguly seeks blessings at Maha KumbhActor Rupali Ganguly visited Maha Kumbh in Prayagraj with her family. She shared moments from her spiritual visit, including performing aarti, attending a hawan, and meeting a saint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-begins-raat-akeli-hai-2-shooting-in-lucknow-2679426-2025-02-13",
      "headline": "Nawazuddin Siddiqui begins Raat Akeli Hai 2 shooting in LucknowActor Nawazuddin Siddiqui has begun Raat Akeli Hai 2 shooting in Lucknow. The actor will be seen sharing screen space with Chitragandha Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/olivia-swann-on-ncis-sydney-her-characters-growth-challenges-2679301-2025-02-13",
      "headline": "Olivia Swann on NCIS: Sydney, her character's growth & challenges In this exclusive interview with India Today's Bhavna Agarwal, Olivia Swann dives deep into her role in NCIS: Sydney, sharing insights into her character's journey, development, and challenges throughout the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-sues-ankita-lokhande-for-defamation-over-cheap-remark-2679295-2025-02-13",
      "headline": "Rozlyn Khan sues Ankita Lokhande for defamation over 'cheap' remark TV actor Rozlyn Khan took legal action against Ankita Lokhande's recent comments. Ankita had called her 'cheap', for her claims about Hina Khan's cancer battle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-makes-a-powerful-comeback-with-high-alone-from-magic-man-2-2679273-2025-02-13",
      "headline": "Jackson Wang makes a powerful comeback with High Alone from Magic Man 2Jackson Wang drops a new single, High Alone, that marks the beginning of his new album, MAGIC MAN 2. The album promises a deep dive into themes of identity and personal transformation, set against a backdrop of atmospheric production and introspective lyrics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-lithgow-approached-to-play-albus-dumbledore-in-harry-potter-series-2679264-2025-02-13",
      "headline": "Actor John Lithgow approached to play Albus Dumbledore in Harry Potter seriesAward-winning American actor John Lithgow has reportedly been approached to play the iconic character of Hogwarts principal Albus Dumbledore in HBO's Harry Potter series. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-donald-trump-meeting-tariffs-trade-deal-f35-jets-immigration-2679813-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "26/11 plotter extradition, F-35 jets, trade deal: Takeaways from Modi-Trump meetModi-Trump meet: The key takeaways from the Modi-Trump meeting were the extradition of 26/11 Mumbai terror attack accused Tahawwur Rana to India and the F-35 jet deal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/donald-trump-clears-extradition-of-2611-mumbai-terror-attack-plotter-tahawwur-rana-to-india-2679785-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump clears 26/11 plotter Tahawwur Rana's extradition: Giving violent man backUS President Donald Trump announced the approval of 26/11 Mumbai terror attack convict Tahawwur Rana's extradition to India, stating he will face justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-meeting-white-house-peace-russia-ukraine-2679778-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not neutral, we stand for peace: PM Modi on Russia-Ukraine war at Trump meet  Live UpdatesAfter talks with US President Donald Trump at the White House, Prime Minister Narendra Modi said that India is not neutral in conflicts and firmly stands for peace, asserting that this is not an era of war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-bilateral-meeting-white-house-trade-deal-tariffs-prime-minister-2679777-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says US to make wonderful deals for India, PM talks of $500 billion targetUS President Donald Trump welcomed Prime Minister Modi to the White House hours after he announced reciprocal tariffs that levies tariffs on US imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-pm-modi-gift-photobook-our-journey-together-autograph-us-visit-trade-defence-2679829-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's special gift for 'friend' Modi, signs it 'Mr Prime Minister, you are great'Trump gifted PM Modi a signed copy of 'Our Journey Together', a photobook chronicling his first term in the White House. He personally signed the book, inscribing: \"Mr Prime Minister, you are great.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-modi-tougher-and-better-negotiator-than-me-trump-2679797-2025-02-14?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "PM Modi tougher and better negotiator than me: TrumpDuring a joint press briefing with PM Modi, US President Donald Trump was questioned about who is a better negotiator between him and PM Modi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/miga-maga-mega-partnership-pm-modi-donald-trump-india-us-relations-boost-trade-official-visit-2679804-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MAGA + MIGA = MEGA partnership, says PM Modi as India, US vow to boost tradePrime Minister Narendra Modi, during his official two-day visit to the US, said that India is moving towards MIGA (Make India Great Again), which is his version of MAGA (Make America Great Again)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-reciprocal-tariff-level-playing-field-eu-canada-india-2679749-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump declares reciprocal tariffs: Whatever countries charge US, we charge themDonald Trump announced reciprocal tariffs, vowing to match duties imposed on American goods. The policy, which he said was aimed at fairness, could take effect within weeks, impacting global trade, including high tariff rates for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/chhaava-movie-review-vicky-kaushal-rashmika-mandanna-laxman-utekar-2679812-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava review: Vicky Kaushal's film growls, but doesn't roarReleased-Fri Feb 14, 2025Chhaava movie review: Director Laxman Utekar's Chhaava, starring Vicky Kaushal and Rashmika Mandanna, is based on the life of Maratha King Chhatrapati Sambhaji Maharaj. Brilliant Vicky Kaushal uplifts this strenuous film, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/are-red-aloe-vera-products-a-scam-stmp-2679571-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are red aloe vera products a scam?Aloe sanguinalis, also known as Somali red aloe or 'red aloe vera' gel, is gaining attention as a better alternative to aloe vera gel. However, experts seem to disagree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-russia-return-to-g7-mistake-to-expel-moscow-vladimir-putin-2679768-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump bats for Russia's return to G7: Was mistake to expel themRussia had been a member of the G7, then known as the G8, until Moscow was excluded following its annexation of Ukraine's Crimea region in 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/whats-keralas-half-price-csr-scam-ananthu-krishnan-modus-operandi-explained-vijayan-ed-probe-2679425-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala's Rs 1,000-crore half-price scam: Victims explain how they got dupedIn one of the biggest scams in Kerala, a 26-year-old graduate duped 40,000 people across the state with a Ponzi-style network, offering scooters, mobiles, laptops and other household items at half their price. This is how Ananthu Krishnan pulled off the state-wide Rs 1,000-crore scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elon-with-3-musk-eteers-at-meeting-with-pm-modi-2679684-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon with 3 Musk-eteers at meeting with PM ModiTech titan Elon Musk met Prime Minister Narendra Modi on Thursday at the Blair House. Several videos surfaced online, showing Musk's children seated attentively as their father engaged with the Indian Prime Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-swept-into-us-tariff-war-as-donald-trump-announces-sweeping-trade-changes-2679755-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India swept into Donald Trump's trade war: 'They charge more tariffs than most'Just hours before his meeting with Prime Minister Narendra Modi, US President Donald Trump announced his decison to impose reciprocal tariffs, adding that no exemptions would be made for any country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/prime-minister-narendra-modi-at-white-house-holds-bilateral-talks-with-us-president-donald-trump-2679781-2025-02-14?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "In pics: PM Modi at White House, holds bilateral talks with US President TrumpPrime Minister Narendra Modi on Thursday held bilateral talks with US President Donald Trump at the White House. The two leaders discussed a host of issues of mutual interest, including trade, tariffs on imports, energy, defence and security, technological partnership and strategic cooperation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-elon-musk-thomson-reuters-pentagon-contract-social-deception-misleading-trss-2679794-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump, Elon Musk bash Reuters over government 'social deception' contractElon Musk sparked the controversy on social media, suggesting that Reuters was paid by the US government to engage in \"social deception\". Trump followed up with a demand that the company return the funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/what-to-do-when-your-in-laws-pressure-you-about-kids-even-in-2025-2679569-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What to do when your in-laws pressure you about kids - even in 2025It's 2025, but some people are still stuck with the idea that all married couples, whether they want kids or not, should have them. But with DINK (Dual Income, No Kids) couples at an all-time high, how can you tackle the family pressure with the utmost subtlety?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-post-budget-agenda-how-to-make-gst-good-and-simple-tax-2679465-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The post-Budget agenda: How to make GST 'Good and Simple Tax'The Goods and Services Tax (GST), introduced in 2017, has been good intention undone by poor implementation. How can it be reformed?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/illegal-indian-immigrants-from-us-second-batch-land-amritsar-punjab-saturday-2679585-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2nd flight with Indians deported from US to land in Amritsar on Saturday: SourcesA second flight carrying Indians deported from the US is likely to land in Amritsar on February 15. Sources said that another flight carrying illegal Indian immigrants is likely to arrive after that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-gifts-kevin-pietersen-son-signed-jersey-india-vs-england-2679817-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kohli gifts signed India jersey to Pietersen's son: Fits like a gloveVirat Kohli gifted a signed India jersey to Kevin Pietersen's son, Dylan, prompting a heartfelt Instagram post from the former England captain, who expressed gratitude for the special gesture.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-political-crisis-bjps-failure-to-choose-next-chief-minister-presidents-rule-n-biren-singh-2679748-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What led to imposition of President's Rule in Manipur?Despite having long meetings with state BJP leaders, party state in-charge Sambit Patra could not zero in on and propose any name to Governor Ajay Kumar Bhalla, even after meeting him twice within 12 hours earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-senate-confirms-robert-f-kennedy-jr-as-health-secretary-2679722-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Senate confirms Robert F Kennedy Jr as Health SecretaryThe confirmation paves the way for Robert F Kennedy to be sworn in to lead the massive Department of Health and Human Services, overseeing multiple high-profile agencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasan-str-49-str-51-composer-sai-abhyankkar-katchi-sera-aasa-kooda-2679843-2025-02-14",
      "headline": "'Katchi Sera' composer Sai Abhyankkar onboard for Silambarasan's STR 49, STR 51Young composer Sai Abhyankkar of 'Katchi Sera' and 'Aasa Kooda' fame has been roped in for two upcoming films featuring Silambarasan. He will make his composing debut in films with Suriya and director RJ Balaji's film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-katrina-kaif-chhaava-premiere-watch-2679838-2025-02-14",
      "headline": "Vicky Kaushal, Katrina Kaif's sweet PDA steals the show at Chhaava premiere. WatchVicky Kaushal attended Chhaava's premiere with wife Katrina Kaif, holding her hand throughout. His family, including Sunny Kaushal, attended the premiere. The film, now in theatres, has received mixed reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-left-speechless-by-ex-girlfriend-malaika-aroras-stunning-dance-performance-2679828-2025-02-14",
      "headline": "Arjun Kapoor left speechless by Malaika Arora's dance on her showActor Arjun Kapoor was left speechless after witnessing his former partner Malaika Arora's captivating dance performance on India's Best Dancer vs Super Dancer. Arjun appeared on the show to promote his upcoming movie, Mere Husband Ki Biwi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-cinemas-valentines-day-special-beyond-controversies-and-classic-love-orange-surya-so-krishnana-laila-brahma-anandam-2679586-2025-02-14",
      "headline": "Telugu cinema's Valentine's Day 2025: Beyond controversies and classic loveThis Valentine's Day, Telugu cinema steps beyond the usual romantic cliches. While re-releases like Orange and Surya S/O Krishnan promise a nostalgic trip, new films such as Laila and Brahma Anandam explore unconventional love stories — from familial bonds to survival in disguise."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-diego-schwartzman-fights-tears-home-crowd-chants-name-retirement-argentina-open-2679844-2025-02-14",
      "headline": "Watch: Schwartzman fights tears as home crowd bids emotional farewellDiego Schwartzman received an emotional farewell in Buenos Aires as fans chanted his name before his final career point, marking the end of an inspiring journey in professional tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rachin-ravindra-injury-update-new-zealand-head-coach-gary-stead-few-more-steps-away-2679833-2025-02-14",
      "headline": "Rachin Ravindra few more steps away from being fit: New Zealand coach SteadNew Zealand head coach Gary Stead confirmed that Rachin Ravindra is still recovering from his facial injury, raising concerns over his availability for the Champions Trophy opener against Pakistan on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-squad-analysis-predicted-xi-team-news-steve-smith-jake-fraser-mcgurk-2679827-2025-02-14",
      "headline": "Champions Trophy 2025: Can Steve Smith guide depleted Australia to title glory?Australia are always considered favourites heading into ICC events, but things seem to be a little different this time. The Aussies will look for inspiration from Steve Smith and a bit of magic from their remaining ODI World Cup heroes to win the Champions Trophy for the first time since 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-gifts-kevin-pietersen-son-signed-jersey-india-vs-england-2679817-2025-02-14",
      "headline": "Kohli gifts signed India jersey to Pietersen's son: Fits like a gloveVirat Kohli gifted a signed India jersey to Kevin Pietersen's son, Dylan, prompting a heartfelt Instagram post from the former England captain, who expressed gratitude for the special gesture.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-fights-draw-alireza-firouzja-freestyle-grand-slam-final-round-2679805-2025-02-14",
      "headline": "Gukesh fights back to hold Firouzja in Freestyle Chess Grand SlamD Gukesh staged a remarkable comeback to secure a crucial draw against Alireza Firouzja, while Magnus Carlsen and Hikaru Nakamura dominated with black pieces in the Freestyle Chess Grand Slam Tour's final round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-live-streaming-squads-schedule-rcb-mi-dc-2678915-2025-02-14",
      "headline": "WPL 2025: Squads, schedule and all you need to know WPL 2025: Royal Challengers Bengaluru (RCB) will look to defend their title when they begin their campaign on February 14 against Gujarat Giants at the Kotambi Stadium in Vadodara. The final will take place on March 15 at the Brabourne Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jp-duminy-backs-rohit-sharma-to-put-up-big-performances-2679705-2025-02-13",
      "headline": "JP Duminy backs Rohit Sharma to put up big performances in Champions TrophyFormer South Africa cricketer JP Duminy has backed India captain Rohit Sharma to put up big performances in the upcoming ICC Champions Trophy 2025. Rohit recently bounced back to form in the 2nd ODI vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-hopeful-of-hosting-more-icc-events-after-champions-trophy-2025-2679675-2025-02-13",
      "headline": "Pakistan hopeful of hosting more ICC events after Champions Trophy 2025Pakistan Cricket Board (PCB) Chairman Mohsin Naqvi is hopeful that the upcoming ICC Champions Trophy 2025 will open opportunities to host more ICC events in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-mohammad-rizwan-press-pakistan-vs-new-zealand-odi-tri-series-final-2679668-2025-02-13",
      "headline": "Babar Azam not in form? Pakistan captain backs star batter with interesting takeODI tri-series final: Speaking on the eve of the final, Pakistan captain Mohammad Rizwan defended Babar Azam, saying the star batter is facing additional pressure because of 'extreme expectations'. Babar failed in the first two matches of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brendon-mccullum-hits-back-at-factually-incorrect-criticism-over-englands-practice-sessions-2679632-2025-02-13",
      "headline": "McCullum hits back at 'factually incorrect' criticism over England's practiceEngland head coach Brendon McCullum has hit back at the criticism over England holding fewer practice sessions during their recent white-ball series against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-shreyas-iyers-admission-reveals-indias-think-tank-problem-2679623-2025-02-13",
      "headline": "Champions Trophy: Shreyas Iyer's admission reveals India's think-tank problemWhy fix something that isn't broken? India seem to be overcomplicating their combination in the ODI series against England, which is a worrying sign ahead of the Champions Trophy. There appears to be a real problem of plenty for coach Gautam Gambhir and captain Rohit Sharma. Why on earth did they leave out Shreyas Iyer for the series opener in Nagpur? An injury to Virat Kohli meant Shreyas got an opportunity after a late phone call from the skipper. The star batter revealed he was not in the XI as late as the eve of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jp-duminy-backs-rohit-sharma-to-put-up-big-performances-2679705-2025-02-13",
      "headline": "JP Duminy backs Rohit Sharma to put up big performances in Champions TrophyFormer South Africa cricketer JP Duminy has backed India captain Rohit Sharma to put up big performances in the upcoming ICC Champions Trophy 2025. Rohit recently bounced back to form in the 2nd ODI vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-hopeful-of-hosting-more-icc-events-after-champions-trophy-2025-2679675-2025-02-13",
      "headline": "Pakistan hopeful of hosting more ICC events after Champions Trophy 2025Pakistan Cricket Board (PCB) Chairman Mohsin Naqvi is hopeful that the upcoming ICC Champions Trophy 2025 will open opportunities to host more ICC events in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-mohammad-rizwan-press-pakistan-vs-new-zealand-odi-tri-series-final-2679668-2025-02-13",
      "headline": "Babar Azam not in form? Pakistan captain backs star batter with interesting takeODI tri-series final: Speaking on the eve of the final, Pakistan captain Mohammad Rizwan defended Babar Azam, saying the star batter is facing additional pressure because of 'extreme expectations'. Babar failed in the first two matches of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brendon-mccullum-hits-back-at-factually-incorrect-criticism-over-englands-practice-sessions-2679632-2025-02-13",
      "headline": "McCullum hits back at 'factually incorrect' criticism over England's practiceEngland head coach Brendon McCullum has hit back at the criticism over England holding fewer practice sessions during their recent white-ball series against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-shreyas-iyers-admission-reveals-indias-think-tank-problem-2679623-2025-02-13",
      "headline": "Champions Trophy: Shreyas Iyer's admission reveals India's think-tank problemWhy fix something that isn't broken? India seem to be overcomplicating their combination in the ODI series against England, which is a worrying sign ahead of the Champions Trophy. There appears to be a real problem of plenty for coach Gautam Gambhir and captain Rohit Sharma. Why on earth did they leave out Shreyas Iyer for the series opener in Nagpur? An injury to Virat Kohli meant Shreyas got an opportunity after a late phone call from the skipper. The star batter revealed he was not in the XI as late as the eve of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yashasvi-jaiswal-ranji-trophy-mumbai-vs-vidarbha-semifinal-champions-trophy-snub-2679619-2025-02-13",
      "headline": "After Champions Trophy snub, Yashasvi Jaiswal to play Ranji Trophy semifinalAfter missing out on a place in India's final 15-man squad for the Champions Trophy, Yashasvi Jaiswal was drafted into Mumbai's Ranji Trophy squad for their semi-final against Vidarbha in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-when-and-where-to-watch-pakistan-vs-new-zealand-tri-series-final-live-streaming-details-2679604-2025-02-13",
      "headline": "PAK vs NZ, tri-series final Live Streaming: When and where to watch?Tri-Series in Pakistan 2025: Pakistan and New Zealand are all set to clash in the final of the tri-series on February 14 in Karachi. Here are the complete details of where to watch the match live on TV and on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-captaincy-rajat-patidar-explained-andy-flower-mo-babat-2679600-2025-02-13",
      "headline": "IPL: Did Virat Kohli say no to returning as RCB captain for 2025 season?IPL 2025: After retiring from T20Is last year, Virat Kohli was widely expected to return as RCB captain. However, on February 13, the franchise appointed Rajat Patidar as their skipper for the upcoming season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-premier-league-parunika-sisodia-mumbai-rcb-pooja-vastrakar-2679590-2025-02-13",
      "headline": "Unsold in auction, teenager gets Mumbai Indians call-up after World Cup heroicsWomen's Premier League 2025: Mumbai Indians roped in U19 World Cup star Parunika Sisodia as a replacement for injured Pooja Vastrakar. Defending champions RCB will miss the services of Asha Sobhana as the leg-spinner has been ruled out due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-appoint-mehidy-hasan-miraz-as-vice-captain-2679584-2025-02-13",
      "headline": "Bangladesh appoint Mehidy Hasan Miraz as vice captain for Champions TrophyBangladesh Cricket Board (BCB) announced Mehidy Hasan Miraz as their vice-captain for the upcoming ICC Champions Trophy 2025. Bangladesh will start their campaign against India on February 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-crcket-team-families-not-to-travel-dubai-bcci-rules-2679535-2025-02-13",
      "headline": "Families not to travel with Indian players for Champions Trophy to Dubai: Report Champions Trophy 2025: The Indian team is set to leave for Dubai on February 15. However, families won't accompany the players for the three-week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-deepti-sharma-up-warriorz-brand-wpl-2025-press-meet-2679505-2025-02-13",
      "headline": "UP Warriorz focused on playing positive brand of cricket: Deepti Sharma WPL 2025: In the Star Sports Press Room - WPL Captain's Huddle, newly-appointed skipper Deepti Sharma said that the UP Warriorz will be looking to play a positive brand of cricket and turn their fortunes around after failing last season when they couldn't go beyond the league stage.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-appoint-mehidy-hasan-miraz-as-vice-captain-2679584-2025-02-13",
      "headline": "Bangladesh appoint Mehidy Hasan Miraz as vice captain for Champions TrophyBangladesh Cricket Board (BCB) announced Mehidy Hasan Miraz as their vice-captain for the upcoming ICC Champions Trophy 2025. Bangladesh will start their campaign against India on February 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-crcket-team-families-not-to-travel-dubai-bcci-rules-2679535-2025-02-13",
      "headline": "Families not to travel with Indian players for Champions Trophy to Dubai: Report Champions Trophy 2025: The Indian team is set to leave for Dubai on February 15. However, families won't accompany the players for the three-week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-deepti-sharma-up-warriorz-brand-wpl-2025-press-meet-2679505-2025-02-13",
      "headline": "UP Warriorz focused on playing positive brand of cricket: Deepti Sharma WPL 2025: In the Star Sports Press Room - WPL Captain's Huddle, newly-appointed skipper Deepti Sharma said that the UP Warriorz will be looking to play a positive brand of cricket and turn their fortunes around after failing last season when they couldn't go beyond the league stage.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rawalpindi-cricket-stadium-venue-ct-25-fixtures-full-details-2679458-2025-02-13",
      "headline": "Rawalpindi Cricket StadiumThe Rawalpindi Cricket Stadium is one of the three venues in Pakistan hosting the Champions Trophy 2025. Established in 1992, the stadium has a seating capacity of 15,000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-venue-gadaffi-stadium-lahore-fixtures-full-details-2679460-2025-02-13",
      "headline": "Gadaffi Stadium, LahoreWith a seating capacity of 34,000-plus, the Gadaffi stadium in Lahore is the biggest stadium in Lahore. The stadium will be hosting 4 matches during the upcoming ICC Champions Trophy 2025, including the semi-final 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-squad-analysis-predicted-xi-team-news-temba-bavuma-heinrich-klaasen-2679456-2025-02-13",
      "headline": "Can South Africa overcome poor ODI form to strike gold in Champions Trophy?South Africa eye redemption in the Champions Trophy, aiming to shake off their \"chokers\" tag. With a strong batting lineup, spin concerns, and injury woes, Bavuma's men must step up to reclaim past ICC glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-rajasthan-royals-appoint-sairaj-bahutule-as-spin-bowling-coach-2679449-2025-02-13",
      "headline": "IPL 2025: Rajasthan Royals appoint Sairaj Bahutule as spin bowling coachRajasthan Royals appointed former India wrist spinner Sairaj Bahutule as their spin-bowling coach for the upcoming season of the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-forgets-t20-world-cup-win-virat-kohli-explains-new-ad-2679448-2025-02-13",
      "headline": "Rohit forgets T20 World Cup win? Kohli hilariously explains in new adRohit Sharma hilariously forgets India's T20 World Cup triumph in a new Dream11 ad, featuring Virat Kohli, Rishabh Pant, and KL Rahul, as the team sets its sights on Champions Trophy glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-squad-varun-chakravarthy-kuldeep-yadav-r-ashwin-dubai-2679431-2025-02-13",
      "headline": "2 spinners too many: R Ashwin not a fan of India's Champions Trophy squadFormer spinner R Ashwin admitted that he isn't a fan of India's squad for the upcoming Champions Trophy 2025 and feels that India are carrying 2 spinners more than needed. India have 5 spinners in the squad for the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-shaheen-afridi-heavily-fined-pakistan-vs-south-africa-tri-series-altercation-2679417-2025-02-13",
      "headline": "Pakistan's Shaheen Afridi fined heavily for altercation during ODI tri-seriesShaheen Afridi was fined 25 percent of his match fee for making deliberate physical contact with Matthew Breetzke, while Saud Shakeel and Kamran Ghulam also faced penalties for aggressive celebrations during Pakistan's win over South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-jasprit-bumrah-trains-hard-at-nca-after-being-ruled-out-of-champions-trophy-2025-2679421-2025-02-13",
      "headline": "Jasprit Bumrah trains hard at NCA after being ruled out of Champions Trophy Star India fast bowler Jasprit Bumrah shared a glimpse of his training at the National Cricket Academy (NCA) in Bengaluru after being ruled out of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-selfless-r-ashwin-odi-cricket-transformation-aggression-2679390-2025-02-13",
      "headline": "Rohit Sharma is selfless, he has led India's ODI transformation: R AshwinChampions Trophy: Former India spinner R Ashwin said that India were late to embrace modern-day one-day international cricket, but Rohit Sharma, with his selfless approach, transformed the team's mindset in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/national-stadium-karachi-pakistan-venue-fixtures-full-details-2679384-2025-02-13",
      "headline": "National Stadium KarachiChampions Trophy 2025 Venue: The National Stadium in Karachi, now revamped as the National Bank Cricket Arena, is set to host the ICC Champions Trophy opener, marking a historic return for Pakistan's cricketing fortress after an extensive renovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-up-warriorz-deepti-sharma-alyssa-healy-press-meet-2679366-2025-02-13",
      "headline": "UP Warriorz will miss Alyssa Healy, but I'm not under pressure: Deepti WPL 2025: Skipper Deepti Sharma admitted that the UP Warriorz will miss Alyssa Healy, but also sounded confident of her team making strong comeback after failing to qualify for the final in the first two seasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venue-dubai-international-cricket-stadium-fixtures-full-details-2679362-2025-02-13",
      "headline": "Dubai International Cricket StadiumThe Dubai International Cricket Stadium, also known as the Ring Of Fire, will host all of India's matches during the Champions Trophy 2025 and also the semi-final. If India qualifies for the final, the match will be played in Dubai. The stadium has a capacity of 25,000. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}