{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-day-2-check-gmp-subscription-status-and-more-2799000-2025-10-07",
      "headline": "Tata Capital IPO Day 2: Check GMP, subscription status and moreThe Tata Capital IPO is set to close on Wednesday, October 8, with allotment scheduled for October 9 and listing on October 13.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-processed-but-tax-refund-still-pending-here-is-what-you-should-do-2798989-2025-10-07",
      "headline": "ITR processed but tax refund still pending? Here's what you should doMany taxpayers are finding themselves in a fix this year; their Income Tax Returns (ITRs) show \"processed\", but the refund hasn't reached their bank accounts yet. If you're one of them, here's what might be causing the delay and what you can do about it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/is-the-auto-sector-rally-over-for-now-analysts-bet-on-these-sectors-next-cement-infra-housing-2798962-2025-10-07",
      "headline": "Is the auto sector rally over for now? Analysts bet on these sectors nextThe latest report from the Federation of Automobile Dealers Associations (FADA) shows historic sales during Navratri, backed by strong demand and the recent GST rationalisation. However, analysts believe that while the short-term growth looks impressive, the auto rally may soon stabilise as pent-up demand fades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-sensex-nifty-dalal-street-rally-2798950-2025-10-07",
      "headline": "Sensex jumps 400 points: 3 factors behind today's rally on Dalal StreetMarket analysts pointed to a combination of factors driving the rally—upbeat Q2 updates from large-cap firms, an early pick-up in festive season spending, and improved GST collections reflecting resilient consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-140-points-higher-nifty-above-25100-power-grid-up-1-percent-2798924-2025-10-07",
      "headline": "Sensex opens 140 points higher, Nifty above 25,100; Power Grid up 1%The S&P BSE Sensex added 215.94 points to 82,006.06, while the NSE Nifty50 gained 64.90 points to 25,142.55, as of 9:38 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-india-ipo-opens-check-gmp-price-band-subscribe-skip-2798923-2025-10-07",
      "headline": "LG Electronics IPO opens today: Check GMP, price band, and should you subscribe?The company has set a price band of Rs 1,080–Rs 1,140 per share for the offer, which comprises an offer for sale (OFS) worth Rs 11,600 crore, representing a 15% stake divestment by the South Korean parent, LG Electronics Inc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-review-good-risk-points-details-gmp-should-you-invest-opening-date-2798913-2025-10-07",
      "headline": "LG Electronics IPO: The good, the bad, and what investors should knowIncorporated in 1997, LG Electronics India Ltd is one of the country's largest manufacturers and distributors of home appliances and consumer electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/job-creation-tier-2-cities-more-than-metro-tier-1-mumbai-pune-delhi-hyderabad-chennai-2798902-2025-10-07",
      "headline": "Are Tier-2 and Tier-3 cities beating metros in job creation? Check hereThe strong growth in hiring in Tier-2 cities has been supported by expansion in e-commerce warehousing, retail networks, customer support hubs, and festive tourism demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-vs-lg-electronics-ipo-more-profit-long-term-gain-where-to-invest-gmp-details-2798864-2025-10-07",
      "headline": "Tata Capital IPO vs LG Electronics IPO: Which one should you bet onWhile Tata Capital marks one of the largest financial services IPOs in India, LG Electronics India's offer is among the biggest in the consumer electronics space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/heres-a-step-by-step-guide-to-checking-and-updating-kyc-for-mutual-funds-2798640-2025-10-06",
      "headline": "Here's a step-by-step guide to checking and updating KYC for mutual fundsBefore investing in mutual funds, keeping your KYC up to date is essential. Here's a simple step-by-step guide to checking and updating your KYC details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-in-talks-with-insurers-for-climate-linked-insurance-scheme-report-2798572-2025-10-06",
      "headline": "Government in talks with insurers for climate-linked insurance scheme: ReportIndia ranks among the most climate-exposed nations, and to address this, the government has started talks with insurers to build a nationwide climate-linked insurance plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-monday-sensex-nifty-continue-positive-run-banking-it-hospital-shares-2798555-2025-10-06",
      "headline": "Sensex, Nifty continue positive run as banking stocks fuel rallyThe S&P BSE Sensex climbed 582.95 points to settle at 81,790.12, while the NSE Nifty50 advanced 183.40 points to finish above the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-here-is-why-not-every-gift-you-receive-is-tax-free-says-expert-2798498-2025-10-06",
      "headline": "Diwali 2025: Here's why not every gift you receive is tax-free, says expertWhile exchanging gifts is the highlight of Diwali, some presents may surprise you at tax time. Here's what an expert says about taxable gifts this festive season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-pharma-major-eli-lilly-to-invest-1-billion-in-telangana-in-big-boost-to-manufacturing-sector-2798531-2025-10-06",
      "headline": "US pharma major Eli Lilly to invest $1 billion in HyderabadThe company will work with local contract manufacturers and set up a new Manufacturing and Quality hub in Hyderabad to oversee production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-day-1-check-latest-subscription-status-gmp-and-more-2798486-2025-10-06",
      "headline": "Tata Capital IPO: Check latest subscription status, GMP and moreAnalysts have mixed views on the offering. While Tata Capital's strong financials and growth prospects make it appealing for long-term investors, some caution that provisioning for non-performing assets and changes in the company's loan mix may pose risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renault-may-cut-3000-jobs-worldwide-amid-global-market-pressures-report-trump-tariffs-2798478-2025-10-06",
      "headline": "Renault may cut 3,000 jobs worldwide amid global market pressures: ReportFacing slower growth in Europe and increasing competition from rivals, Renault is reportedly planning cuts to its workforce, which could affect around 3,000 employees worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-rises-500-points-dalal-street-rally-key-factors-explained-2798475-2025-10-06",
      "headline": "Sensex jumps over 500 points: Why is the stock market rising today?After a flat opening, the rally on Dalal Street gained momentum as banking, IT, and healthcare stocks led the charge, supported by robust corporate results and steady economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/canara-robeco-ipo-opens-on-october-9-check-price-band-other-key-details-2798448-2025-10-06",
      "headline": "Canara Robeco IPO opens on October 9: Check price band, other key detailsThe Canara Robeco IPO is entirely an Offer for Sale, with 4.98 crore shares being sold at a price band of Rs 253 to Rs 266 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-cyber-insurance-has-become-a-must-have-for-individuals-in-india-2796140-2025-10-06",
      "headline": "Why cyber insurance has become a must-have for individuals in IndiaFrom UPI payments to social media, our lives are increasingly online. With cybercrime on the rise, personal cyber insurance is no longer optional—it's a must-have shield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-all-time-high-can-the-rally-last-btc-prices-cryptocurrency-market-crypto-prices-2798416-2025-10-06",
      "headline": "Bitcoin hits all-time high. Can the rally last?Bitcoin has surged to a new all-time high, crossing $125,000, sparking excitement among investors worldwide. With institutional demand and strong ETF inflows driving the rally, the question remains, can this momentum continue?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-immanuel-dominates-as-housemates-ignore-nagarjunas-warning-2799011-2025-10-07",
      "headline": "Bigg Boss Telugu 9: Immanuel dominates as housemates ignore Nagarjuna's warning On October 6, 'Bigg Boss Telugu 9' turned intense as Bigg Boss nominated every contestant for eviction. The immunity task tested strength, strategy, and alliances. Immanuel stood out, winning immunity while bonds and rivalries continued to drive the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/monster-the-ed-gein-story-review-charlie-hunnam-2799005-2025-10-07",
      "headline": "Monster The Ed Gein story review: Disturbing, stylish and self indulgentRelease Date:Fri Oct 03, 2025 'Monster: The Ed Gein Story' review: Netflix's show dives into the life of America's most infamous killer with chilling performances by Charlie Hunnam and Laurie Metcalf. Check if Ryan Murphy's show is worth the hype. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-posts-emotional-note-as-the-smashing-machine-takes-lowest-opening-2798997-2025-10-07",
      "headline": "Dwayne Johnson posts emotional note as The Smashing Machine takes lowest opening Actor Dwayne Johnson's sports drama 'The Smashing Machine' opened to a disappointing $6 million. The film struggled against Taylor Swift's surprise concert film release, raising questions about box office dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-talks-about-love-marriage-and-life-with-wife-sobhita-dhulipala-2799003-2025-10-07",
      "headline": "Naga Chaitanya talks about love, marriage, and life with wife Sobhita Dhulipala Naga Chaitanya opened up about his love story and married life with Sobhita Dhulipala on 'Jayammu Nischayammuraa'. He also shared how they met online and emphasised the importance of fights in a real relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bengaluru-filmmaker-hemanth-arrested-sexual-harassment-actress-2798995-2025-10-07",
      "headline": "Bengaluru filmmaker Hemanth arrested for allegedly sexually harassing actor Bengaluru police have arrested filmmaker Hemanth following allegations of sexual harassment made by a female actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-3-not-planned-producer-confirms-universe-expansion-epic-re-release-2798980-2025-10-07",
      "headline": "No Baahubali 3, but surprise awaits: Producer Shobu ahead of The Epic's release 'Baahubali 3' is not in the works, confirmed producer Shobu Yarlagadda. 'Baahubali - The Epic', a combined film of the two parts, will release in theatres on October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-collection-day-5-detailed-report-kantara-hindi-dominates-varun-dhawan-janhvi-kapoor-film-2798985-2025-10-07",
      "headline": "Sunny Sanskari... box office Day 5: Kantara Hindi dominates Varun-Janhvi's film Varun Dhawan and Janhvi Kapoor's 'Sunny Sanskari Ki Tulsi Kumari' saw a major Monday drop, collecting Rs 3 crore on Day 5 and taking its total to Rs 33 crore in India. Meanwhile, Rishab Shetty's 'Kantara: A Legend Chapter-1' continues to dominate the Hindi box office with record-breaking numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-john-woodvine-of-the-crown-an-american-werewolf-in-london-fame-dies-at-96-2798969-2025-10-07",
      "headline": "Actor John Woodvine of The Crown, An American Werewolf In London fame dies at 96 Olivier Award-winning British stage and screen actor John Woodvine, known for The Crown and An American Werewolf in London, has died at 96."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhpjpuri-superstar-pawan-singh-breaks-silence-on-wife-jyoti-singh-cheating-claims-she-wanted-to-contest-elections-2798963-2025-10-07",
      "headline": "Pawan Singh on wife Jyoti's cheating claims: She wanted to contest elections Bhojpuri superstar Pawan Singh has responded to wife Jyoti Singh's cheating allegations, clarifying that she visited his home asking for help to contest elections. The actor also denied calling the police, saying they were present only to prevent any untoward incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-they-call-him-og-becomes-highest-grossing-telugu-film-of-2025-2798526-2025-10-07",
      "headline": "Pawan Kalyan's 'They Call Him OG' becomes highest-grossing Telugu film of 2025 Pawan Kalyan's 'They Call Him OG' has enjoyed an impressive run at the box office, emerging as the highest-grossing Telugu film of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-and-zayn-malik-to-team-up-for-first-ever-song-2798944-2025-10-07",
      "headline": "BLACKPINK's Jisoo and Zayn Malik to team up for first-ever song BLACKPINK's Jisoo and Zayn Malik are set to collaborate on the song 'Eyes Closed', combining her dreamy pop style with his soulful vocals. The track has fans excited, marking a special moment for both 'One Direction' and K-pop enthusiasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasan-vetri-maaran-kalaippuli-s-thanu-announce-tamil-film-arasan-2798929-2025-10-07",
      "headline": "Silambarasan and Vetri Maaran's film titled Arasan, first-look poster out Actor Silambarasan, director Vetri Maaran, and producer Kalaippuli S Thanu announced their film's title with a special poster. Further information about the cast and crew is to be released soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ben-affleck-jennifer-lopez-reunite-at-premiere-nine-months-after-divorce-2798930-2025-10-07",
      "headline": "Ben Affleck-Jennifer Lopez reunite at premiere nine months after divorce Ben Affleck and Jennifer Lopez reunited for the first time since their divorce at the 'Kiss of the Spider Woman' premiere, sharing smiles and warm moments on the red carpet. Their appearance sparked fan speculation about a possible reconciliation, while Affleck praised Lopez and the film during the screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/my-hero-academia-final-season-episode-1-review-2798816-2025-10-07",
      "headline": "My Hero Academia final season opener: Recap-heavy episode sets stage for finale The final season of the popular anime series 'My Hero Academia' began streaming on October 4. While Deku and the rest of the heroes are engaged in their own battles, All Might faces off against his greatest rival one last time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-khanna-shares-behind-the-scenes-pics-from-barsaat-on-30th-anniversary-bobby-deol-reacts-2798914-2025-10-07",
      "headline": "Twinkle Khanna shares BTS pics from Barsaat on 30th anniversary, Bobby Deol reacts Twinkle Khanna and Bobby Deol marked 30 years of their Bollywood debut 'Barsaat' with nostalgic behind-the-scenes photos and heartfelt memories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-collection-crosses-rs-300-crore-globally-2798907-2025-10-07",
      "headline": "Kantara Chapter 1 box office Day 5: Solid Monday, film beats KGF 2 in Karnataka Rishab Shetty's 'Kantara: Chapter 1' has grossed Rs 300 crore worldwide in just four days. The film has surpassed Yash's 'KGF: Chapter 2' in Karnataka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-recalls-shah-rukh-khan-and-aryan-khan-reaction-to-samay-raina-cruise-t-shirt-2798904-2025-10-07",
      "headline": "Raghav Juyal recalls SRK and Aryan Khan's reaction to Samay Raina's cruise T-shirt Comedian Samay Raina grabbed attention at Aryan Khan's directorial debut with his witty \"Say No To Cruise\" T-shirt, a playful nod to Aryan's past controversy. Actor Raghav Juyal revealed that both Shah Rukh and Aryan took the joke sportingly, laughing along with everyone at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-tests-mahindra-formula-e-car-plans-indian-cinema-promotion-2798894-2025-10-07",
      "headline": "Ajith Kumar tests Formula E Gen 2 car in Spain, thanks Anand Mahindra. See pics Actor Ajith Kumar recently experienced the Mahindra Formula E Gen 2 car during a test drive in Andalucia, Spain. He plans to use motorsports as a platform to promote Indian cinema in the upcoming racing championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-praises-selena-gomez-wedding-look-santa-barbara-2798883-2025-10-07",
      "headline": "Taylor Swift can't stop gushing over Selena Gomez's wedding look in viral video Taylor Swift praised Selena Gomez's wedding look at her ceremony to Benny Blanco. Gomez shared a video and a few photos indicating Swift's presence at her wedding."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-allotted-type-7-bungalow-at-95-lodhi-estate-in-delhi-cm-sheeshmahal-2799013-2025-10-07",
      "headline": "After bitter legal fight, Arvind Kejriwal scores sprawling government bungalowAfter repeated interventions by the Delhi High Court, central agencies eventually identified 95 Lodhi Estate for AAP chief and former Delhi Chief Minister Arvind Kejriwal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-united-nations-blasts-pakistan-kashmiri-women-security-2798903-2025-10-07",
      "headline": "Sanctioned mass rape of 400,000: India flips script as Pak rakes up KashmirDuring a debate on women and security at the United Nations, India tore into Pakistan over its continuing 'delusional tirades', particularly regarding Jammu and Kashmir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cough-syrup-deaths-coldrif-tamil-nadu-report-ima-sresan-pharmaceutical-doctor-arrested-2798890-2025-10-07",
      "headline": "Illegal chemicals, 350 violations: Inside factory that made 'killer' cough syrupInspectors found Coldrif cough syrup was manufactured in filthy conditions with non-functional air filters, rusted equipment, and illegal use of non-pharma grade chemicals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-gaza-war-hamas-two-years-benjamin-netanyahu-bonding-trump-iran-missile-2798941-2025-10-07",
      "headline": "Great powers need allies: Netanyahu's Iran nuclear missile warning to TrumpBenjamin Netanyahu, in a wide-ranging interview with Ben Shapiro, offered candid insights into his relationship with Donald Trump, Iran's threat, and the need to destroy Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/gujarati-motels-usa-patel-gas-stations-convenience-stores-us-gujaratis-killed-shootouts-drug-overdose-murders-indians-2798542-2025-10-07",
      "headline": "Why motel business is getting Gujaratis killed in USThree Gujarati people linked to the motel business were killed last week in Pennsylvania and North Carolina in two separate incidents. In all, seven Gujarat-origin people have been killed in motel crimes across the US this year. Gujaratis own 60% of the motel business in the US. Why is the motel business so risky, and how are Gujaratis coming in harm's way?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-mamata-banerjee-trade-sharp-barbs-after-bjp-leaders-attacked-amid-bengal-floods-2798893-2025-10-07",
      "headline": "PM Modi, Mamata Banerjee spar over assault on BJP leaders in BengalPM Narendra Modi condemned the TMC over law and order, calling the attack on BJP MP Khagen Murmu and Siliguri MLA Sankar Ghosh \"appalling,\" while Mamata Banerjee accused him of politicising a natural disaster and criticised his unverified allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-karur-vijay-tvk-stampede-bjp-annamalai-slams-mnm-kamal-haasan-dmk-mk-stalin-2798953-2025-10-07",
      "headline": "Sold his soul for Rajya Sabha seat: Annamalai slams Kamal Haasan over Karur visitBJP's K Annamalai criticised MNM chief Kamal Haasan for backing the DMK over the Karur stampede, saying he \"sold his soul for a Rajya Sabha seat.\" Haasan had visited victims' families and defended the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-island-singapore-fans-google-maps-location-panchayat-phulera-pradhan-ji-sachiv-area-51-hogwarts-9-34-platform-2798603-2025-10-07",
      "headline": "Zubeen Island in Singapore, Bhutkun ki tapri in MP: What's going on online?Fans are rewriting maps, one pin at a time. Weeks after Assam's cultural icon Zubeen Garg's death in Singapore, fans have put up a label on Google Maps, calling the island where he last went for an outing, \"Zubeen Garg Island\". The craze isn't new. Earlier, fans tagged spots from the web series Panchayat in a Madhya Pradesh village where it was shot. Similar fan-made pins have popped up at Area 51 in the US and Harry Potter's Platform 9¾ in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/break-ups-have-no-rulebook-shobhaa-de-suggestions-the-sensual-self-explorations-of-love-sex-and-romance-2798988-2025-10-07",
      "headline": "Break-ups have no rulebook, but Shobhaa De offers some suggestions all the sameAs provocative and frank as ever, Shobhaa De offers instructions such as \"abandon good sense\" when it comes to owning one's sensuality in her latest book. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-man-kapil-raghu-visa-revoked-after-arkansas-police-misidentify-perfume-as-opium-us-deportation-ice-2798645-2025-10-06",
      "headline": "Perfume mistaken for opium, Indian man has US visa revoked, faces deportationAn Indian-origin man in US' Arkansas is seeking to restore his visa after he was wrongly arrested when police mistook a designer perfume labelled \"opium\" for drugs. Though the narcotics charge was dropped, following the arrest, Kapil Raghu was detained for 30 days by the ICE and had his visa revoked. Now facing deportation and unable to work, he and his family are under severe financial and emotional stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/one-third-of-silicon-valley-is-indian-thats-not-flex-its-an-escape-iit-education-nep-jee-advanced-2798990-2025-10-07",
      "headline": "One-third of Silicon Valley is Indian. That's not a flex, it's an escapeBragging that one-third of Silicon Valley tech workers are Indian is no longer impressive. With record placement failures at IITs and a decaying syllabus, it's time we stopped hiding behind diaspora success. Here are six reasons why we strongly believe so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-captaincy-rahul-dravid-rp-singh-revelation-2798961-2025-10-07",
      "headline": "Dravid saw it early: When ex-coach backed Shubman Gill for full-time captaincyEntrusted with the reins in two of the three international formats, Shubman Gill's ascent to leadership has unfolded under Gautam Gambhir's watch. Yet, it was Rahul Dravid who first sensed the spark in him as early as 2020–21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-the-perfect-parent-image-is-just-toxic-2798534-2025-10-07",
      "headline": "Why the perfect parent image is just toxicTired of seeing parents on social media who seem to have it all together while you feel like you're barely keeping up? That's a toxic trap you need to ditch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/20-cases-filed-against-hairstylist-jawed-habib-son-over-multi-crore-crypto-fraud-up-sambhal-police-lookout-notice-2798970-2025-10-07",
      "headline": "20 cases filed against hairstylist Jawed Habib, son over multi-crore crypto fraudLookout notices have been issued against all family members, and Habib has been summoned to Sambhal for questioning. Police teams are investigating properties in Delhi and Mumbai, with potential action under the Gangster Act."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/cough-syrup-child-deaths-supreme-court-plea-inquiry-nationwide-testing-2798996-2025-10-07",
      "headline": "Cough syrup deaths case in Supreme Court, plea seeks probe, mass testingAmid the controversy over deaths of children linked to cough syrups in Madhya Pradesh and Rajasthan, a plea has sought a judicial inquiry into the tragedy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bengal-cm-mamata-banerjee-was-panned-after-a-freak-weather-event-north-bengal-landslides-2798697-2025-10-06",
      "headline": "Why Bengal CM Mamata Banerjee was panned after a freak weather eventAs North Bengal faced a weekend of horror with collapsed bridges and washed away roads, CM Mamata Banerjee's presence at a Durga Puja Carnival in Kolkata drew political brickbats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ben-affleck-jennifer-lopez-reunite-at-premiere-nine-months-after-divorce-2798930-2025-10-07",
      "headline": "Ben Affleck-Jennifer Lopez reunite at premiere nine months after divorceBen Affleck and Jennifer Lopez reunited for the first time since their divorce at the 'Kiss of the Spider Woman' premiere, sharing smiles and warm moments on the red carpet. Their appearance sparked fan speculation about a possible reconciliation, while Affleck praised Lopez and the film during the screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rajdeep-sardesa-x-factors-bihar-polls-nda-nitish-kumar-tejashwi-yadav-india-bloc-2798762-2025-10-06",
      "headline": "Rajdeep Sardesai's 5 X-factors that could decide Bihar poll winnerIndia Today's Consulting Editor, Rajdeep Sardesai, breaks down the five key \"X-factors\" in Bihar that could determine whether the ruling NDA holds on to power or the opposition alliance springs a surprise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/hyderabad-student-shot-dead-in-us-texas-man-arrested-gas-station-killing-2798926-2025-10-07",
      "headline": "23-year-old Texas man who shot dead Indian student at US gas station arrestedChandrashekar Pole, a 28-year-old student from Hyderabad, was shot dead at a Dallas gas station last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/who-is-rakesh-kishore-lawyer-who-tried-attacking-cji-br-gavai-with-shoe-in-supreme-court-2798818-2025-10-06",
      "headline": "Who is Rakesh Kishore, lawyer who tried attacking CJI with shoe in Supreme Court?The senior advocate is known within the legal fraternity for his long-standing membership in multiple bar associations. Police found Kishore carrying membership cards from the Supreme Court Bar Association, Shahdara Bar Association, and the Bar Council of Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/winter-uttarakhand-himachal-pradesh-first-snow-fall-winters-arrive-temples-mountains-hills-2798976-2025-10-07",
      "headline": "Pics: From Kedarnath to Gulmarg, the hills turn white with season's first snowThe Himalayas turned white this week as Uttarakhand, Himachal Pradesh and Kashmir witnessed the season's first snowfall, marking an early onset of winter. From Kedarnath to Gulmarg and Manali, the fresh snow brought cheer to tourists and locals alike, reviving hopes for a strong tourism season after monsoon losses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurugram-businessman-clicks-on-whatsapp-wedding-invite-loses-rs-97000-to-cyber-fraud-2798952-2025-10-07",
      "headline": "Gurugram man clicks on WhatsApp wedding invite, loses Rs 97,000 to cyber fraudThe link in the message allowed cybercriminals to hack his phone and make unauthorised transactions from his bank account. The incident was reported to the Cyber Crime West police station, and an investigation is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2025-in-physics-to-be-announced-today-all-eyes-on-sweden-2798766-2025-10-07",
      "headline": "Nobel Prize 2025 in Physics to be announced today, all eyes on SwedenThe Nobel Prize in Physics recognises contributions that have fundamentally advanced human understanding of the natural world. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/nails-scattered-on-bengaluru-nelamangala-road-spark-puncture-mafia-scare-2798946-2025-10-07",
      "headline": "Nails scattered on Bengaluru's Nelamangala road spark 'puncture mafia' scareBengaluru motorists have been urged to stay alert as police investigate the \"puncture mafia\" behind nails scattered across Nelamangala Road."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-vizag-pitch-report-australia-2798986-2025-10-07",
      "headline": "Women's World Cup: Vizag pitch set to aid struggling India batters A balanced and batting-friendly pitch awaits India's women's cricket team at Vizag. This is expected to boost the confidence of the batters ahead of their matches against South Africa and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithali-raj-ravi-kalpana-vizag-stadium-stands-smriti-mandhana-nara-lokesh-2798972-2025-10-07",
      "headline": "Smriti Mandhana's idea becomes reality: Mithali Raj stand at Vizag stadium The ACA-VDCA Stadium in Visakhapatnam will honour Mithali Raj and Ravi Kalpana by naming stands after them, acknowledging their impact on Indian women's cricket, after a public suggestion by Smriti Mandhana that received backing from Andhra Pradesh IT Minister Nara Lokesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-rishabh-pant-injury-update-comeback-2798971-2025-10-07",
      "headline": "Rishabh Pant eager to make Ranji Trophy comeback after injury break: Report Injured Rishabh Pant is eager to make his comeback in red ball cricket. If reports are to be believed, then the wicketkeeper-batter wants to make his return in the Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-captaincy-rahul-dravid-rp-singh-revelation-2798961-2025-10-07",
      "headline": "Dravid saw it early: When ex-coach backed Shubman Gill for full-time captaincy Entrusted with the reins in two of the three international formats, Shubman Gill's ascent to leadership has unfolded under Gautam Gambhir's watch. Yet, it was Rahul Dravid who first sensed the spark in him as early as 2020–21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-india-vs-australia-odi-vice-captain-2798905-2025-10-07",
      "headline": "From outcast to leader: New ODI VC Shreyas Iyer finally gets recognition Shreyas Iyer has finally received the recognition he deserves, as the 30-year-old has been named the new vice-captain of the Indian ODI team. Never one to seek the spotlight, Shreyas has quietly gone about his work, letting his performances speak for themselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-odi-squad-vs-india-cummins-maxwell-2798900-2025-10-07",
      "headline": "Maxwell, Cummins out as Australia announce ODI squad for India series Australia have announced their 15-member squad for the 3-match ODI series against India. Glenn Maxwell and Pat Cummins have not made it to the team due to respective injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-india-vs-australia-odi-squad-2798888-2025-10-07",
      "headline": "Sanju Samson's selection saga: Talent, versatility on display yet chances go missing Despite a century in his last ODI and strong Asia Cup performances, Sanju Samson remains sidelined from the ODI side. His selection saga raises tough questions about consistency, faith, and the logic behind India's ever-changing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-england-vs-bangladesh-nigar-sultana-press-conference-2798849-2025-10-06",
      "headline": "World Cup is the biggest stage for Bangladesh to show talent: Nigar Sultana Nigar Sultana feels that the Women's World Cup 2025 is the biggest stage for Bangladesh to show their talent and get big teams to play against them in the coming years. Bangladesh won their first match in the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/well-look-to-negate-in-form-marufa-akters-swing-early-on-charlie-dean-2798848-2025-10-06",
      "headline": "We'll look to negate in-form Marufa Akter's swing early on: Charlie Dean England's vice-captain admitted that they will be looking to tackle Bangladesh's Marufa Akter's swing early on in their upcoming clash in the Women's World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-nat-sciver-brunt-charlotte-edwards-charlie-dean-leadership-experience-2798844-2025-10-06",
      "headline": "Having Nat Sciver-Brunt, Charlotte Edwards feels like a fresh start: Charlie Dean England vice-captain Charlie Dean says having Natalie Sciver-Brunt as captain and Charlotte Edwards as coach has brought a \"fresh start\" to the team, with renewed focus, clarity, and a shared determination to play fearless, detail-driven cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-vs-mumbai-maharashtra-practice-match-ranji-trophy-2025-26-2798839-2025-10-06",
      "headline": "Shaw to face Mumbai in Maharashtra practice match ahead of Ranji Trophy Prithvi Shaw will play against his former Mumbai teammates after moving to Maharashtra, as both teams prepare for the upcoming Ranji Trophy season with a practice match at MCA Stadium, Gahunje. Shardul Thakur leads a Shreyas Iyer-less Mumbai, with Ruturaj Gaikwad and Jalaj Saxena included in the Maharashtra squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-india-vs-australia-odi-squad-2798888-2025-10-07",
      "headline": "Sanju Samson's selection saga: Talent, versatility on display yet chances go missing Despite a century in his last ODI and strong Asia Cup performances, Sanju Samson remains sidelined from the ODI side. His selection saga raises tough questions about consistency, faith, and the logic behind India's ever-changing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-england-vs-bangladesh-nigar-sultana-press-conference-2798849-2025-10-06",
      "headline": "World Cup is the biggest stage for Bangladesh to show talent: Nigar Sultana Nigar Sultana feels that the Women's World Cup 2025 is the biggest stage for Bangladesh to show their talent and get big teams to play against them in the coming years. Bangladesh won their first match in the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/well-look-to-negate-in-form-marufa-akters-swing-early-on-charlie-dean-2798848-2025-10-06",
      "headline": "We'll look to negate in-form Marufa Akter's swing early on: Charlie Dean England's vice-captain admitted that they will be looking to tackle Bangladesh's Marufa Akter's swing early on in their upcoming clash in the Women's World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-nat-sciver-brunt-charlotte-edwards-charlie-dean-leadership-experience-2798844-2025-10-06",
      "headline": "Having Nat Sciver-Brunt, Charlotte Edwards feels like a fresh start: Charlie Dean England vice-captain Charlie Dean says having Natalie Sciver-Brunt as captain and Charlotte Edwards as coach has brought a \"fresh start\" to the team, with renewed focus, clarity, and a shared determination to play fearless, detail-driven cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-vs-mumbai-maharashtra-practice-match-ranji-trophy-2025-26-2798839-2025-10-06",
      "headline": "Shaw to face Mumbai in Maharashtra practice match ahead of Ranji Trophy Prithvi Shaw will play against his former Mumbai teammates after moving to Maharashtra, as both teams prepare for the upcoming Ranji Trophy season with a practice match at MCA Stadium, Gahunje. Shardul Thakur leads a Shreyas Iyer-less Mumbai, with Ruturaj Gaikwad and Jalaj Saxena included in the Maharashtra squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-nigar-sultana-marufa-akter-greatest-bangladesh-fast-bowler-2798817-2025-10-06",
      "headline": "Marufa Akter can become Bangladesh's greatest pacer ever: Nigar SultanaBangladesh captain Nigar Sultana feels that Marufa Akter can become the greatest pacer produced by the nation. Marufa was in fine form during the first match of the tournament against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-anvay-karnataka-captain-vinoo-mankad-trophy-2798808-2025-10-06",
      "headline": "Rahul Dravid's son, Anvay set to lead Karnataka in Vinoo Mankad TrophyLike father, like son — that seems to be the story in the Dravid household, as Anvay Dravid, son of legendary India batter Rahul Dravid, is set to lead Karnataka in the upcoming Vinoo Mankad Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-sophie-devine-new-zealand-south-africa-defeat-indore-2798795-2025-10-06",
      "headline": "Can't play half games in World Cups: Devine slams New Zealand's poor show in IndoreNew Zealand women's skipper, Sophie Devine, was critical of their showcase in the defeat against South Africa, suggesting that they need to put in their all across all facets of the game to ensure they get their first points on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tazmin-brits-breaks-meg-lanning-record-7th-odi-hundred-south-africa-vs-new-zealand-2798786-2025-10-06",
      "headline": "Tazmin Brits' day in Indore: Breaking Lanning's record, celebration picked by fansSouth Africa Tazmin Brits reacted to breaking Meg Lanning's record and the reason behind her arrow celebration after the win over New Zealand. Brits scored 101 as the Proteas women recorded their first win of the Women's World Cup 2025 on Monday, October 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-nz-vs-sa-tazmin-britz-nonkululeko-mlaba-crushing-win-new-zealand-sophie-devine-2798771-2025-10-06",
      "headline": "South Africa bounce back with resounding win as New Zealand's woes continueWomen's World Cup: South Africa have their first points on the board as they took a rather resounding win over New Zealand, riding on the back of brilliant performances by the centurion, Tazmin Britz and Nonkululeko Mlaba's four-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-injury-where-is-ballon-dor-winner-manchester-city-spain-injury-world-cup-qualifiers-2798755-2025-10-06",
      "headline": "Where is the 2024 Ballon d'Or winner?Rodri's persistent injuries have kept him off the field, leaving fans and pundits wondering if and when he will return to the form that made him Europe's elite midfielder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-indian-team-dinner-invitation-delhi-test-vs-west-indies-2798708-2025-10-06",
      "headline": "Gautam Gambhir to host Indian team for dinner ahead of Delhi Test vs West IndiesIndia head coach Gautam Gambhir has invited the entire Indian squad and support staff for dinner ahead of the second Test in Delhi. This sets up as a good chance for the team to unwind ahead of a busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laura-wolvaardt-stunning-catch-womens-world-cup-2025-sa-vs-nz-2798706-2025-10-06",
      "headline": "Catch of the tournament? Laura Wolvaardt produces screamer in SA vs NZ clashLaura Wolvaardt produced the catch of the tournament as she took a one-handed stunner to dismiss Lea Tahuhu during the South Africa vs New Zealand clash in the Women's World Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-nz-vs-sa-tazmin-britz-nonkululeko-mlaba-crushing-win-new-zealand-sophie-devine-2798771-2025-10-06",
      "headline": "South Africa bounce back with resounding win as New Zealand's woes continueWomen's World Cup: South Africa have their first points on the board as they took a rather resounding win over New Zealand, riding on the back of brilliant performances by the centurion, Tazmin Britz and Nonkululeko Mlaba's four-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-injury-where-is-ballon-dor-winner-manchester-city-spain-injury-world-cup-qualifiers-2798755-2025-10-06",
      "headline": "Where is the 2024 Ballon d'Or winner?Rodri's persistent injuries have kept him off the field, leaving fans and pundits wondering if and when he will return to the form that made him Europe's elite midfielder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-indian-team-dinner-invitation-delhi-test-vs-west-indies-2798708-2025-10-06",
      "headline": "Gautam Gambhir to host Indian team for dinner ahead of Delhi Test vs West IndiesIndia head coach Gautam Gambhir has invited the entire Indian squad and support staff for dinner ahead of the second Test in Delhi. This sets up as a good chance for the team to unwind ahead of a busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laura-wolvaardt-stunning-catch-womens-world-cup-2025-sa-vs-nz-2798706-2025-10-06",
      "headline": "Catch of the tournament? Laura Wolvaardt produces screamer in SA vs NZ clashLaura Wolvaardt produced the catch of the tournament as she took a one-handed stunner to dismiss Lea Tahuhu during the South Africa vs New Zealand clash in the Women's World Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-abhishek-sharma-love-australian-conditions-t20i-tour-2798704-2025-10-06",
      "headline": "Abhishek Sharma backed by AB de Villiers to thrive in Australian conditionsAB de Villiers believes that Abhishek Sharma can thrive in the Australian conditions as India prepare for their white-ball tour Down Under later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-rohit-sharma-2027-world-cup-warning-2798685-2025-10-06",
      "headline": "Rohit Sharma non-committal about World Cup? Expect more bad news then, says GavaskarSunil Gavaskar sent a warning to Rohit Sharma and told him to expect more bad news if he remains non-committal about his participation in the 2027 ODI World Cup. Rohit was removed as the captain of the Indian ODI team on October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-australia-2nd-t20i-sells-out-mcg-virat-kohli-rohit-sharma-retirement-2798651-2025-10-06",
      "headline": "No Virat Kohli or Rohit Sharma, but IND vs AUS 2nd T20I at MCG sells out anywayPublic tickets for the second T20I between India and Australia at the Melbourne Cricket Ground were sold out more than three weeks before the fixture, underlining the enduring appeal of the contest even without superstars Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yusuf-dikec-turkish-shooter-european-championship-gold-medal-aura-farming-2798649-2025-10-06",
      "headline": "Yusuf Dikec returns with his aura farming: Turkish shooter wins European goldYusuf Dikec, the popular and viral Turkish shooter, is back in the spotlight with European gold. At 52, his trademark \"aura farming\" style continues to charm fans and deliver results.\f"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-atherton-slams-icc-commercialising-india-pakistan-cricket-rivalry-2798529-2025-10-06",
      "headline": "Stop arranging IND vs PAK fixtures, cricket now propaganda tool: Ex-England captainFormer England captain Michael Atherton has argued against 'arranging' for India vs Pakistan fixtures in International Cricket Council tournaments even if they are a cash cow for the global body. In the wake of the Asia Cup tournament, Atheton has argued that the marquee fixture has turned into a tool for political theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-under-pressure-aakash-chopra-womens-world-cup-2025-2798634-2025-10-06",
      "headline": "Harmanpreet Kaur under pressure in what could be her final World Cup: Aakash ChopraAakash Chopra has claimed that Harmanpreet Kaur will be under pressure after enduring a lean patch in the ongoing Women's World Cup 2025. Harmanpreet has failed to make an impact in the first two matches of the World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sidra-amin-reprimanded-bat-abuse-india-beats-pakistan-icc-womens-world-cup-2025-2798614-2025-10-06",
      "headline": "Pakistan batter reprimanded for breaching ICC Code of Conduct in IND vs PAK clashIndia defeated Pakistan by 88 runs in the ICC Women's World Cup, while Sidra Amin received a reprimand for equipment abuse during the match. India's win highlights their continuous unbeaten streak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-hero-welcome-cairo-egypt-world-cup-qualifier-djibouti-2798568-2025-10-06",
      "headline": "Watch: Salah gets hero's welcome in Cairo after missing out on Ballon d'OrMohamed Salah got a hero's welcome in Cairo after missing out on winning the Ballon d'Or this year. Salah finished fourth in the rankings behind Ousmane Dembele, Lamine Yamal and Vitinha. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}