{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-eastern-airlines-daily-delhi-shanghai-flights-expansion-glbs-2837009-2025-12-17",
      "headline": "China Eastern Airlines to run daily flights on Delhi-Shanghai route from JanuaryFlight services between the two countries were suspended following the Covid-19 pandemic in 2020 and were not restored due to the over four-year border face-off in eastern Ladakh, which ended in October last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-historic-low-of-91-against-us-dollar-what-is-behind-this-drop-2836767-2025-12-16",
      "headline": "Rupee hits historic low of 91 against US dollar. What's behind this drop?The rupee breached the 91 mark against the US dollar for the first time on Tuesday, extending its run of losses amid sustained foreign fund outflows and market uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-the-december-advance-tax-deadline-this-is-the-interest-you-may-have-to-pay-2836738-2025-12-16",
      "headline": "Missed the December advance tax deadline? This is the interest you may have to payIf you missed the December advance tax deadline, don't panic just yet. There is no direct penalty, but interest will apply. Here's what the Income Tax Act says and how much it may cost you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-533-points-lower-nifty-below-25900-axis-bank-down-5-percent-2836736-2025-12-16",
      "headline": "Sensex ends 533 points lower, Nifty below 25,900; Axis Bank down 5%The S&P BSE Sensex lost 533.50 points to close at 84,679.86, while the NSE Nifty50 was down by 167.20 points to end at 25,860.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-debt-borrowing-global-finance-comparison-us-dollar-weak-rupee-world-inequality-report-2026-2836731-2025-12-16",
      "headline": "India loses billions yearly as global finance favours rich nations: ReportPoorer and emerging economies like India consistently pay more to the global financial system than they receive back, while rich countries continue to benefit from lower costs and higher returns.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-loan-emi-fall-sbi-cuts-lending-rates-lowers-interest-on-select-fd-2836668-2025-12-16",
      "headline": "Will your loan EMI fall? SBI cuts lending rates, lowers interest on select FDThe State Bank of India has announced reductions in both lending and select deposit rates, aiming to balance relief for borrowers with steady returns for most deposit holders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gifts-from-family-are-tax-free-but-who-exactly-qualifies-as-family-2836644-2025-12-16",
      "headline": "Gifts from family are tax-free. But who exactly qualifies as 'family'?Received money or property from a family member and assumed it is tax-free? Do you know whether the Income Tax Act actually treats that person as 'family'? Let's find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-gmp-today-rising-above-15-percent-check-subscription-allotment-listing-details-2836639-2025-12-16",
      "headline": "ICICI Prudential AMC IPO GMP today. Check allotment and listing detailsThe trend in the unofficial market has strengthened as the ICICI Prudential AMC IPO moved closer to closing, supported by improving subscription numbers across investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-is-young-india-really-investing-money-hint-its-not-just-stocks-or-gadgets-2836209-2025-12-16",
      "headline": "How is young India really investing money? Hint: It's not just stocks or gadgetsFrom digital assets to experiences, India's younger generation is investing in ways that reflect changing priorities and lifestyles. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-meesho-founder-vidit-aatrey-turns-billionaire-share-price-jump-52-week-high-bumper-ipo-listing-growth-outlook-2836578-2025-12-16",
      "headline": "Who is Meesho founder Vidit Aatrey, latest entrant to India's billionaire clubVidit Aatrey, the co-founder of Meesho Ltd, has entered the billionaire club as the company's shares climbed sharply to hit a fresh 52-week high in today's trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-scrutiny-fake-donation-political-parties-itr-refund-delay-claim-tight-check-2836531-2025-12-16",
      "headline": "Income Tax Department flags fake donation claims, tightens checks on tax refundsSeveral taxpayers claimed refunds by showing fake donations to political parties and charitable institutions, often with the help of intermediaries. The Income Tax department has now warned that such practices are under close watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-arrear-date-salary-hike-pension-start-january-1-2026-latest-update-2836495-2025-12-16",
      "headline": "8th Pay Commission arrears to start from January 1, 2026? Here's latest updateIn November 2025, central government approved the terms of reference for the 8th Pay Commission and granted it 18 months to submit its report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-300-points-lower-nifty-below-26000-eternal-down-3-percent-2836484-2025-12-16",
      "headline": "Sensex opens 300 points lower, Nifty below 26,000; Eternal down 3%The S&P BSE Sensex lost 381.44 points to 84,831.92, while the NSE Nifty50 was down by 114.55 points to 25,912.75 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-last-day-latest-subscription-gmp-status-expected-profit-bid-or-skip-review-2836476-2025-12-16",
      "headline": "ICICI Prudential IPO closes today: Should you bid as GMP crosses 10% gain?ICICI Prudential AMC IPO opened for bidding on December 12, 2025, and will close today, December 16, 2025. Share allotment is expected to be finalised on December 17, while listing on BSE and NSE is scheduled for December 19, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wpi-inflation-stays-negative-in-november-despite-food-price-uptick-2836286-2025-12-15",
      "headline": "WPI inflation stays negative in November despite food price uptickGovernment data released on Monday showed Wholesale Price Index (WPI) inflation at (-) 0.32% in November, compared with (-) 1.21% in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-jump-19-in-november-trade-deficit-hits-5-month-low-2836273-2025-12-15",
      "headline": "India's exports jump 19% in November, trade deficit hits 5-month lowThe US remained India's largest export destination from April to November 2025, despite the imposition of a 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-rebound-to-end-marginally-lower-as-fii-outflow-trouble-markets-2836204-2025-12-15",
      "headline": "Sensex, Nifty rebound to end marginally lower as FII outflow troubles marketThe S&P BSE Sensex was down by 54.30 points to close at 85,213.36, while the NSE Nifty50 lost 19.65 points to end at 26,027.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-home-loan-rate-decrease-emis-rbi-repo-cut-check-new-rates-personal-finance-housing-demand-2836181-2025-12-15",
      "headline": "SBI reduces lending rates, EMIs likely to drop: Check new home loan ratesWith several major banks already passing on the benefit, SBI's move will directly help customers whose loans are linked to different lending benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-at-record-highs-should-investors-buy-now-or-wait-2836126-2025-12-15",
      "headline": "Gold and silver at record highs. Should investors buy now or wait?Gold and silver prices are trading near record highs after a powerful rally this year. With both metals delivering strong returns, many investors are now wondering whether it still makes sense to buy or wait for a correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/december-15-advance-tax-deadline-is-here-who-must-pay-and-what-happens-if-you-dont-2836086-2025-12-15",
      "headline": "December 15 advance tax deadline is here: Who must pay and what happens if you don'tThe third advance tax instalment is due today, December 15. For many taxpayers, missing this deadline could mean mandatory interest and a larger payment at the time of filing returns."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/400-crore-dhurandhar-box-office-success-highlights-ranveer-singh-understated-performance-2836989-2025-12-16",
      "headline": "Saumya Tandon praises Ranveer's maturity: He's giving the stage to Akshaye Saumya Tandon discussed Ranveer Singh's role in the film Dhurandhar, calling attention to his mature approach as praise continues to center on Akshaye Khanna. The film has surpassed the Rs 400 crore mark across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mehreen-pirzada-denies-marriage-rumours-chiranjiv-makwana-wikipedia-edits-2836966-2025-12-16",
      "headline": "Mehreen Pirzada denies secret wedding rumours, says she stayed silent for 2 years Mehreen Pirzada has denied reports alleging her secret marriage, criticised the spread of misinformation online, and called for greater accountability from digital platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-raftaar-urges-faculty-move-aside-better-crowd-energy-mumbai-college-fest-2836932-2025-12-16",
      "headline": "Raftaar chides college faculty for killing the vibe during live performance. Watch Rapper Raftaar called for a change in seating arrangements at a recent Mumbai college festival after faculty members in the front row dampened the crowd's energy, requesting that future events place students closer to the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-joins-dhurandhar-meme-fest-comparing-his-performance-with-akshaye-khanna-2836886-2025-12-16",
      "headline": "R Madhavan joins Dhurandhar meme fest comparing his performance with Akshaye Khanna R Madhavan highlighted fan comparisons of his role to Akshaye Khanna's performance in 'Dhurandhar' (2025) by re-sharing fan memes on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-directorial-debut-the-bads-of-bollywood-tops-imdb-most-popular-series-india-2836917-2025-12-16",
      "headline": "Watch: Aryan Khan dodges paps, hides from cameras at Nirvan Khan's birthday Aryan Khan was seen avoiding cameras while attending Nirvan Khan's birthday celebration in Mumbai. Several videos of the director stepping out have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-padayappa-emerges-as-fifth-highest-grossing-re-release-2836892-2025-12-16",
      "headline": "Rajinikanth's Padayappa emerges as fifth highest-grossing re-release The restored version of the 1999 blockbuster Padayappa, starring Rajinikanth, recorded strong collections worldwide, emerging as one of the highest-grossing re-releases in Tamil cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreya-dhanwanthary-screen-time-doesnt-matter-the-family-man-is-a-testament-2836912-2025-12-16",
      "headline": "Shreya Dhanwanthary: I want to do films that destroy you emotionally Actor Shreya Dhanwanthary, in an exclusive interview with India Today, spoke about how screen time does not matter to her. She cited an example from The Family Man and said how it's a selfish thing to demand more time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vrusshabha-trailer-mohanlal-steps-into-larger-than-life-story-of-reincarnation-2836901-2025-12-16",
      "headline": "Vrusshabha trailer: Mohanlal steps into larger-than-life story of reincarnation The trailer of Mohanlal's magnum opus 'Vrusshabha' was unveiled in Kochi on Tuesday. Centred around the theme of reincarnation, the movie is positioned as one of 2025's most anticipated releases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shashi-tharoor-urges-union-ministry-to-lift-ban-on-19-films-at-kerala-film-festival-2836890-2025-12-16",
      "headline": "Shashi Tharoor urges Union Ministry to lift ban on 19 films at Kerala film festival Shashi Tharoor urged the Union Ministry to lift the ban on 19 films at the International Film Festival of Kerala (IFFK). He said that the arbitrary censorship diminishes India's cultural standing and risks stifling one of the nation's finest film celebrations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-the-final-cut-does-gabbars-death-in-climax-make-it-richer-50-years-on-2836895-2025-12-16",
      "headline": "Sholay The Final Cut: Does Gabbar's death in climax make it richer, 50 years on? Sholay: The Final Cut revisits its censored climax. Does Gabbar's death change the film's impact 50 years later, or does the legend remain intact?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pradeep-ranganathan-to-return-as-director-after-love-today-confirms-producer-2836863-2025-12-16",
      "headline": "Pradeep Ranganathan to return as director after Love Today, confirms producer Actor Pradeep Ranganathan is set to act and direct his upcoming project, marking his third collaboration with AGS after Love Today and Dragon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-volume-2-trailer-finale-release-netflix-2836873-2025-12-16",
      "headline": "Stranger Things 5 Vol 2 trailer: Vecna rises, Steve-Dustin team up for big showdown Netflix has released a new trailer for the second volume of Stranger Things Season 5. The final three episodes of the series will premiere on December 25, 2025. The trailer features key revelations about the Upside Down and sets up major confrontations for the series' concluding episodes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/r-ashwin-defends-rajinikanths-coolie-questions-online-review-culture-2836797-2025-12-16",
      "headline": "R Ashwin defends Rajinikanth's Coolie, questions online review culture The former India cricketer R Ashwin said he watched Rajinikanth's Coolie in one stretch on OTT and did not agree with the negative social media verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-box-office-vs-the-attention-span-dhurandhar-debunks-the-panic-2836850-2025-12-16",
      "headline": "The box office vs the attention-span: Dhurandhar debunks the panic The success of films like the 3-hour, 34-minute 'Dhurandhar' challenges the shrinking attention-span narrative. Audiences, including Gen Z, are rejecting filler, not length; they commit when storytelling is compelling, proving that content holds creators accountable for every minute used.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonarika-bhadoria-vikas-parashar-name-newborn-daughter-virika-2836858-2025-12-16",
      "headline": "Sonarika Bhadoria-Vikas Parashar name daughter Virika. Here's what it means Television actor Sonarika Bhadoria and her husband Vikas Parashar have named their newborn daughter Virika Parashar, blending elements from their own names. The couple shared the news and photos from the naming ceremony on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/team-india-watches-dhurandhar-in-lucknow-before-t20-match-with-south-africa-2836787-2025-12-16",
      "headline": "Team India watches Dhurandhar in Lucknow before T20 match with South Africa Ahead of their high-stakes match against South Africa, the Indian T20 team spent Monday evening in Lucknow watching Ranveer Singh's 'Dhurandhar' at the Phoenix Palassio mall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/films-denied-permission-will-be-screened-at-kerala-festival-cm-pinarayi-vijayan-2836805-2025-12-16",
      "headline": "Films denied permission, will be screened at Kerala festival: CM Pinarayi Vijayan Kerala Chief Minister Pinarayi Vijayan said that all films that were denied screening at the International Film Festival of Kerala (IFFK), would still be screened as part of the festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahan-shetty-shares-what-suniel-shetty-advised-him-for-border-2-2836776-2025-12-16",
      "headline": "Ahan Shetty shares what Suniel Shetty advised him for Border 2 At the teaser launch event in Mumbai, Ahan Shetty spoke about the guidance he received from his father, Suniel Shetty, for 'Border 2'. The actor said his father advised him not to compare the film to the iconic 1997 film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arun-khetarpal-war-hero-biopic-ikkis-release-december-25-abhishek-bachchan-support-2836737-2025-12-16",
      "headline": "Abhishek Bachchan praises nephew Agastya's Ikkis role: You are a sincere actor As Agastya Nanda prepares for his role as Second Lieutenant Arun Khetarpal in Sriram Raghavan's war film Ikkis, his uncle Abhishek Bachchan shared a post and highlighted the significance of portraying the decorated Indian Army officer."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shanti-bill-tabled-lok-sabha-biggest-nuclear-energy-reform-features-significance-2836874-2025-12-16",
      "headline": "SHANTI Bill tabled: Your cheat sheet on India's biggest nuclear energy reformThe government tabled the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Bill, 2025 in the Lok Sabha, signalling a major overhaul of India's civil nuclear framework. The Bill aims to end the decades-long state monopoly on nuclear power and enable private sector participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-full-list-sold-unsold-retained-players-base-price-csk-pbks-srh-dc-rr-gt-lsg-rcb-mi-kkr-2836741-2025-12-16",
      "headline": "IPL Auction 2026 full list: Green, uncapped players bag record dealsIPL 2026 Auction: The accelerated round gathered momentum as Mustafizur Rahman, Rahul Tripathi and Jason Holder all found takers for healthy sums, adding depth and experience to their respective squads. While Cameron Green and Matheesha Pathirana continued to stand tall as the two costliest buys of the auction, the real talking point of the phase was the emergence of three uncapped Indian players, who turned heads with a field day at the bidding table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signs-order-further-restrict-entry-foreign-nationals-us-glbs-2837011-2025-12-17",
      "headline": "US bans travel from 7 countries, adds limits on others amid immigration crackdownThe new proclamation builds on earlier travel restrictions and applies full or partial entry limits on nationals from more than 30 countries, while tightening rules on certain travel documents and narrowing some family-based visa exemptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-prithvi-shaw-returns-delhi-capitals-2836952-2025-12-16",
      "headline": "Shaw returns home to DC: Maharashtra batter reacts after IPL 2026 auction dealPrithvi Shaw posted an emotional message after the former India U-19 captain returned to his former side during the IPL 2026 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vijay-diwas-december-16-pakistan-surrendered-to-india-why-bangladesh-marks-independence-day-march-26-2836911-2025-12-16",
      "headline": "Pak surrendered on Dec 16. So why does Bangladesh mark Independence Day in March?While India marks December 16 as Vijay Diwas to commemorate the defeat of Pakistani forces in the 1971 Bangladesh Liberation War, Dhaka celebrates March 26 as its Independence Day. It precedes the defeat of Pakistani forces by 10 months. So, what's the history and logic behind it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bondi-beach-shooters-hyderabad-connection-family-says-cut-ties-with-him-for-marrying-a-christian-terror-attack-2836750-2025-12-16",
      "headline": "Bondi shooter migrated from Hyderabad, family cut ties for marrying ChristianSajid Akram, one of the Sydney Bondi Beach shooters, migrated from Hyderabad in 1998, says Telangana Police. He had limited contact with his family in India and visited the country only six times in 27 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bondi-beach-shooting-heroes-confront-terrorists-sydney-jewish-event-2836970-2025-12-17",
      "headline": "New video shows Jewish couple confronting Bondi Beach gunman before attackFor Boris and Sofia Gurman, taking shelter like others was never an option. While bystanders sought refuge at a nearby bus stop, an undeterred Boris charged towards the attacker and tackled the shooter to the ground, attempting to snatch his rifle as his wife stood beside him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mit-professor-nuno-loureiro-shot-dead-at-his-massachusetts-home-glbs-2837010-2025-12-17",
      "headline": "MIT professor Nuno Loureiro shot at his Brookline home, dies of injuriesMIT's office confirmed Nuno Loureiro's identity and said he held senior academic and leadership roles at the institute. He was a professor in the departments of Nuclear Science & Engineering and Physics, and also served as Director of MIT's Plasma Science and Fusion Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-visits-vantara-wildlife-centre-indian-traditions-modern-conservation-2836961-2025-12-16",
      "headline": "Messi goes desi: Football great prays, poses with tiger at Anant Ambani's VantaraVantara founder Anant Ambani hosted global football icon Lionel Messi at the wildlife rescue, rehabilitation and conservation centre, where the football legend's time was marked by guided tours, traditional rituals and close interactions with wildlife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-jordan-king-ethiopia-pm-abiy-ahmed-drives-pm-modi-in-his-car-in-special-gesture-2836887-2025-12-16",
      "headline": "After Jordan King, Ethiopian PM drives PM Modi in his car in special gestureAfter Jordan, Ethiopia's Nobel Peace Prize-winning Prime Minister Abiy Ahmed personally received PM Modi at Addis Ababa airport on Tuesday, drove him to his hotel, and made an unscheduled stop at the Science Museum and Friendship Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/italian-meloni-surprised-mozambican-president-chapo-height-rome-glbs-2837006-2025-12-17",
      "headline": "Watch: 5'2 Meloni's reaction to meeting 6'8 Mozambique President goes viralFootage shows her looking up at the Mozambican leader before breaking into a sheepish smile, with her expression suggesting surprise as the two posed for photographs. At one point, she also appeared to mutter a remark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mgnrega-new-bill-vb-gram-g-bill-2025-bjp-pm-modi-government-faces-questions-tdp-opposition-funding-burden-states-2836649-2025-12-16",
      "headline": "Key BJP ally concerned over G RAM G jobs scheme. And it's not about the nameThe VB-G RAM G Bill proposes to replace the existing MGNREGA. It has created an uproar in the Opposition benches over the dropping of Mahatma Gandhi's name from India's flagship rural employment scheme. However, the Bill has also faced concerns from a key BJP ally, the Chandrababu Naidu-led TDP. It warned that the changes could strain state finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/500-workers-20-days-one-city-how-dhurandhar-recreated-lyari-in-bangkok-2836747-2025-12-16",
      "headline": "500 workers, 20 days, one city: How Dhurandhar recreated Lyari in BangkokDhurandhar's production designer reveals how Lyari was recreated on a six-acre set in Bangkok with 500 workers in just 20 days.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-warns-sheltering-separatist-groups-threatening-indias-seven-sisters-region-2836840-2025-12-16",
      "headline": "Will cut off 7 Sisters from India, says Bangladesh leader; Assam CM reactsBangladesh NCP leader Hasnat Abdullah warned that Dhaka could shelter anti-India forces and threatened to \"sever the seven sisters,\" referring to India's northeastern states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-refuses-to-take-note-of-ed-chargesheet-against-sonia-rahul-gandhi-in-national-herald-case-2836551-2025-12-16",
      "headline": "National Herald case against Sonia, Rahul collapses; court throws out ED chargesheetThe Court said the complaint filed by ED under the Prevention of Money Laundering Act was not maintainable as the case was based on a private complaint and not an FIR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-ms-dhoni-surely-retire-ex-teammate-claim-csk-youth-2837001-2025-12-16",
      "headline": "MS Dhoni will surely retire: Ex-CSK teammate makes big claim after mini-auctionIPL 2026 auction: Former CSK batter Robin Uthappa says MS Dhoni's final act is imminent, citing the franchise's youth-focused auction strategy as a clear sign of the legend's impending transition to a mentor role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/do-you-know-what-the-colour-of-the-sun-is-its-not-yellow-or-orange-2836777-2025-12-16",
      "headline": "Do you know what the colour of the Sun is? It's not yellow or orangeOn Earth, the Sun often appears yellow or even orange and red, particularly at sunrise and sunset. This visual shift occurs due to a phenomenon known as Rayleigh scattering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistans-1971-surrender-commission-blamed-wine-women-sex-2836537-2025-12-16",
      "headline": "How Pak let off Generals Ayub, Niazi but damned women, wine and sex for '71 defeatHalf a nation gone, 93,000 soldiers captured. And in the years that followed, Pakistan would ask itself one haunting question: How? The answer, according to the Pakistani government's own investigation, would prove more scandalous than the defeat itself. Here's a look back at the scandal as India celebrates Vijay Diwas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-conferred-with-great-honour-nishan-of-ethiopia-he-dedicates-it-to-140-crore-indians-2836988-2025-12-16",
      "headline": "PM receives 'Great Honour Nishan of Ethiopia', dedicates it to 140 crore IndiansPM Modi was conferred the award in recognition of his outstanding contributions to strengthening the India-Ethiopia partnership and his visionary leadership as a global statesman."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-farmer-sells-kidney-in-cambodia-after-rs-1-lakh-loan-escalates-to-rs-74-lakh-2836900-2025-12-16",
      "headline": "Farmer sells kidney to pay off lenders after Rs 1 lakh loan soars to Rs 74 lakhRoshan Sadashiv Kude from Maharashtra was forced to sell a kidney after illegal moneylenders drove him into extreme debt by charging high daily interest on a Rs 1 lakh loan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/will-skyroot-make-vikram-i-reusable-like-spacexs-falcon-9-we-have-the-answer-2836730-2025-12-16",
      "headline": "Will Skyroot develop a reusable rocket like Falcon-9? Founder answersThe idea of reusable rockets has transformed global spaceflight economics. SpaceX's success in routinely recovering and reflighting its boosters has reset expectations, lowering launch costs and increasing cadence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-bans-tandoor-as-it-fights-air-pollution-control-commission-air-quality-management-caqm-grap-4-2836528-2025-12-16",
      "headline": "Desperate Delhi bans tandoors in its fight against pollutionWith AQI at hazardous levels and no solution in sight to fight pollution, the Delhi government has banned tandoors that use coal or firewood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-arrear-date-salary-hike-pension-start-january-1-2026-latest-update-2836495-2025-12-16",
      "headline": "8th Pay Commission arrears to start from January 1, 2026? Here's latest updateIn November 2025, central government approved the terms of reference for the 8th Pay Commission and granted it 18 months to submit its report."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/apologise-to-delhi-but-its-also-impossible-for-any-government-to-fix-pollution-in-10-months-delhi-minister-2836734-2025-12-16",
      "headline": "Sorry, Delhi, but impossible for any…: Minister's half-apology over pollutionDelhi Environment Minister, while speaking at a press briefing, apologised to the people of Delhi and said it was impossible for any elected government to completely reduce pollution levels within nine to ten months."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-auction-highlights-10-points-csk-kkr-most-expensive-2837003-2025-12-17",
      "headline": "IPL 2026 auction review: 10 things we learnt from bidding wars in Abu Dhabi IPL Auction: The Indian Premier League mini-auction saw a total of 77 players being sold on Tuesday. Here is a concise review of the event in 10 points. From trust in uncapped players to unique auction strategies, here's everything that unfolded in Abu Dhabi on December 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-ms-dhoni-surely-retire-ex-teammate-claim-csk-youth-2837001-2025-12-16",
      "headline": "MS Dhoni will surely retire: Ex-CSK teammate makes big claim after mini-auction IPL 2026 auction: Former CSK batter Robin Uthappa says MS Dhoni's final act is imminent, citing the franchise's youth-focused auction strategy as a clear sign of the legend's impending transition to a mentor role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matheesha-pathirana-emotional-csk-farewell-ms-dhoni-kkr-ipl-2026-auction-2836992-2025-12-16",
      "headline": "Forever grateful to Dhoni bhai, CSK: Pathirana's emotional note to Chennai Matheesha wrote an emotional message to CSK, MS Dhoni and fans of Chennai after the Sri Lankan pacer moved on to join KKR during the IPL 2026 auction on Tuesday, December 26. Pathirana spent four seasons with CSK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/video/bhaichung-bhutia-excluive-interview-messi-goat-tour-rajdeep-sardesai-2836984-2025-12-16",
      "headline": "If corporates, fans can pay for Messi, they can back Indian football: Bhaichung Speaking to India Today's Consulting Editor Rajdeep Sardesai, Indian football great Bhaichung Bhutia urged corporates and fans, who paid big money to watch Lionel Messi on his GOAT tour in India, to support Indian football. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ipl-2026-auction-meet-prashant-veer-the-rs1420-crore-uncapped-star-bought-by-csk-ytvd-2836986-2025-12-16",
      "headline": "IPL 2026 Auction: Meet Prashant Veer, The ₹14.20 Crore Uncapped Star Bought By CSK In this special report, RD INDIA TODAY speaks to Prashant Veer, the uncapped cricketer from Uttar Pradesh who created history at the IPL 2026 auction. The 20-year-old all-rounder was bought by Chennai Super Kings (CSK) for a staggering ₹14.20 crore. Prashant shares his excitement about joining his 'dream team' and the prospect of sharing the dressing room with MS Dhoni. He says, 'I am very excited to meet Dhoni. I will try to learn as much as I can from him.' He reflects on his journey from the UP T20 League, where he shone for Noida Super Kings, to becoming one of the most expensive uncapped players. He also credits his coach Raju Goyal and the UPCA for their support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-visits-vantara-wildlife-centre-indian-traditions-modern-conservation-2836961-2025-12-16",
      "headline": "Messi goes desi: Football great prays, poses with tiger at Anant Ambani's Vantara Vantara founder Anant Ambani hosted global football icon Lionel Messi at the wildlife rescue, rehabilitation and conservation centre, where the football legend's time was marked by guided tours, traditional rituals and close interactions with wildlife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-prithvi-shaw-returns-delhi-capitals-2836952-2025-12-16",
      "headline": "Shaw returns home to DC: Maharashtra batter reacts after IPL 2026 auction deal Prithvi Shaw posted an emotional message after the former India U-19 captain returned to his former side during the IPL 2026 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-kartik-sharma-csk-dhoni-reaction-2836935-2025-12-16",
      "headline": "MS Dhoni fan Kartik Sharma in tears after fetching record Rs 14.2 crore from CSK MS Dhoni fan Kartik Sharma revealed that he broke down after seeing the bidding war for him during the IPL 2026 auction. Kartik became the joint-costliest uncapped player in the history of the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shivam-dube-backs-suryakumar-yadav-t20-world-cup-india-2836933-2025-12-16",
      "headline": "Suryakumar can win you 5 out 5 games alone: Dube backs out-of-form India captain All-rounder Shivam Dube on Tuesday backed out-of-form India T20 captain Suryakumar Yadav, describing him as a player capable of winning matches single-handedly and insisting that his touch will return at the right time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-2026-csk-sarfaraz-khan-prithvi-shaw-2836931-2025-12-16",
      "headline": "IPL auction: CSK reward Sarfaraz Khan's resilience, Delhi buy Prithvi Shaw IPL 2026 auction: Sarfaraz Khan secured an IPL contract with Chennai Super Kings for Rs 75 lakh in the 2026 mini-auction. After missing out on the last two seasons, the Mumbai batter, who has worked hard on his fitness, will be back in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/prashant-veer-csk-deal-ipl-2026-auction-interview-2836926-2025-12-16",
      "headline": "Prashant Veer surprised with Rs 14.20 crore CSK deal: Didn't expect this much IPL 2026: In an interview with India Today, Prashant Veer said that he was surprised after the Chennai Super Kings bought him for Rs 14.20 crore in the auction on Tuesday in Abu Dhabi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-most-expensive-bangladeshi-player-ipl-2026-auction-kkr-bid-2836909-2025-12-16",
      "headline": "Mustafizur Rahman shatters records, becomes most expensive Bangladesh player in IPLMustafizur Rahman made history at the IPL 2026 auction as Kolkata Knight Riders snapped him up for Rs 9.20 crore after a fierce bidding war, making him the most expensive Bangladeshi player ever and reinforcing his value as a proven match-winning T20 pacer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-prashant-veer-kartik-sharma-price-hike-cameron-green-2836897-2025-12-16",
      "headline": "Uncapped players rule IPL auction: Massive hikes for lesser-known facesIt was a field day for Prashant Veer and Kartik Sharma as CSK broke the bank to bring the uncapped stars home. Here's a look at the six players who saw an incredible price rise during the IPL 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prashant-veer-csk-ipl-auction-2026-record-bid-ms-dhoni-2836889-2025-12-16",
      "headline": "Prashant Veer exclusive: Mahi bhai's CSK pays this Yuvraj Singh fan Rs 14.2 croreIPL Auction 2026: Uttar Pradesh's Prashant Veer was signed by Chennai Super Kings for Rs 14.20 crore at the Indian Premier League auction held in Abu Dhabi on Tuesday. In an interview with India Today, Prashant spoke about his excitement at the prospect of playing alongside MS Dhoni and named Yuvraj Singh as his idol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-psg-salary-dispute-paris-court-orders-60-million-payment-2836865-2025-12-16",
      "headline": "Paris St Germain ordered to pay Kylian Mbappe 60 million eurosParis St-Germain have been ordered by a French court to pay former striker Kylian Mbappe 60 million euros (£52.5 million) in unpaid salary and bonuses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-csk-who-is-prashant-veer-ravinra-jadeja-2836814-2025-12-16",
      "headline": "Jadeja 2.0? CSK buy uncapped Prashant Veer for record sum of Rs 14.2 croreIPL 2026 auction: Chennai Super Kings bought spin-bowling all-rounder Prashant Veer for Rs 14.20 crore, making him the joint-most expensive uncapped player in the history of the auction. They also spent Rs 14.2 crore for Rajasthan's Kartik Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-buy-kartik-sharma-14-2-crore-ipl-2026-auction-2836818-2025-12-16",
      "headline": "New Dhoni in making? CSK make Kartik Sharma joint-most expensive uncapped playerCSK have identified their long-term replacement for MS Dhoni as they made Kartik Sharma the joint-most expensive uncapped player in the history of the IPL auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/auqib-nabi-delhi-capitals-ipl-2026-auction-jammu-kashmir-pacer-2836795-2025-12-16",
      "headline": "Who is Auqib Nabi? J&K all-rounder bags Rs 8.40 crore IPL deal with DCIPL 2026 Auction: Delhi Capitals bought Jammu and Kashmir all-rounder Auqib Nabi Dar for Rs 8.40 crore at the IPL 2026 auction, which is being held in Abu Dhabi on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tata-motors-gifts-sierra-to-indian-womens-cricket-team-icc-womens-world-cup-2025-win-2836779-2025-12-16",
      "headline": "Tata honours India women's world cup-winning team with Sierra carTata Motors honoured the Indian women's cricket team with Tata Sierra cars for their historic World Cup win. India registered their maiden World Cup triumph after beating South Africa by 52 runs in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-steal-buys-david-miller-ben-duckett-ipl-2026-auction-2836746-2025-12-16",
      "headline": "Delhi Capitals play it smart, buy David Miller and Ben Duckett at steal priceDelhi Capitals made key bargain buys by signing David Miller and Ben Duckett in the IPL 2026 auction. Miller became the first player to be sold at the auction for Rs 2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-venkatesh-iyer-massive-pay-cut-rcb-rs-7-crore-2836743-2025-12-16",
      "headline": "Venkatesh Iyer takes 70 percent pay cut, sold to RCB for Rs 7 croreIPL 2026 mini auction: Venkatesh Iyer and David Miller endured significant pay cuts in the auction. Royal Challengers Bengaluru outbid Kolkata Knight Riders to buy Venkatesh for Rs 7 crore in Abu Dhabi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-full-list-sold-unsold-retained-players-base-price-csk-pbks-srh-dc-rr-gt-lsg-rcb-mi-kkr-2836741-2025-12-16",
      "headline": "IPL Auction 2026 full list: Green, uncapped players bag record dealsIPL 2026 Auction: The accelerated round gathered momentum as Mustafizur Rahman, Rahul Tripathi and Jason Holder all found takers for healthy sums, adding depth and experience to their respective squads. While Cameron Green and Matheesha Pathirana continued to stand tall as the two costliest buys of the auction, the real talking point of the phase was the emergence of three uncapped Indian players, who turned heads with a field day at the bidding table."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-cameron-green-most-expesnisve-overseas-kolkata-knight-riders-2836706-2025-12-16",
      "headline": "Cameron Green is IPL's most expensive overseas playerCameron Green's name lit up the IPL 2026 auction room and the bidding followed. Kolkata Knight Riders outlasted Chennai Super Kings to land the Australian all-rounder for a record Rs 25.20 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhigyan-kundu-double-century-u19-asia-cup-india-record-2836672-2025-12-16",
      "headline": "Abhigyan Kundu scripts history in Youth ODIs with 209 vs Malaysia in U19 Asia CupAbhigyan Kundu became only the second batter in Youth ODIs to score a double hundred when India and Malaysia locked horns in the U19 Asia Cup clash on Tuesday in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-premanand-maharaj-visit-anushka-sharma-skips-lionel-messi-india-tour-2836654-2025-12-16",
      "headline": "Virat Kohli, wife Anushka visit Premanand Maharaj, video captures emotional momentVirat Kohli skipped the spotlight surrounding Lionel Messi's India tour. The former India captain instead visited Premanand Ji Maharaj in Vrindavan with wife Anushka Sharma for spiritual reflection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-rapid-fifty-u19-asia-cup-india-malaysia-2836636-2025-12-16",
      "headline": "Vaibhav Suryavanshi keeps growing in stature, with 25-ball fifty vs MalaysiaVaibhav Suryavanshi has been the driving force of India's U19 Asia Cup campaign, producing explosive knocks including a 25-ball fifty and a record-breaking 171 to underline his growing stature as a match-winner in youth cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/izaz-sawariya-ipl-2026-auction-uncapped-spinner-instagram-reels-2836602-2025-12-16",
      "headline": "How Instagram cricketer Izaz Sawariya made his way into IPL 2026 auction listIzaz Sawariya, a 20-year-old Instagram creator from Bidar, has been listed in the IPL 2026 auction without any professional cricket experience. The talented wrist spinner has given trials for CSK and PBKS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-4th-t20i-lucknow-sanju-samson-predicted-xi-2836590-2025-12-16",
      "headline": "India vs South Africa, 4th T20I Predicted XI: Will Samson get a chance in Lucknow?IND vs SA, 4th T20I: Sanju Samson has an average of 72 and a strike-rate of 194.59 against South Africa, but the right-handed batter is yet to play a match in the ongoing series. Will he get a chance in Lucknow? \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-kolkata-knight-riders-matheesha-pathirana-target-death-overs-robin-uthappa-2836582-2025-12-16",
      "headline": "KKR can find their death overs answer in Matheesha Pathirana: Robin UthappaIPL 2026 auction: Robin Uthappa feels Matheesha Pathirana could be the answer to KKR's death-overs struggles. With the biggest purse at the IPL 2026 mini-auction, KKR are well placed to make a decisive move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-ipl-2026-auction-jamie-smith-rehan-ahmed-gus-atkinson-ben-duckett-2836534-2025-12-16",
      "headline": "MS Dhoni-like star will be the costliest English buy at IPL auction: Monty PanesarFormer England spinner Monty Panesar has backed Jamie Smith to become the most expensive English player at the IPL 2026 auction. Smith is among 21 England players registered for the auction."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}