{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-salary-kras-for-tesla-details-market-cap-robo-taxi-financial-targets-2815112-2025-11-07",
      "headline": "What does it take to earn $1 trillion pay? Here are Tesla's KRAs for Elon MuskTo actually collect on this historic paycheck, Musk must achieve what Tesla's board calls \"Mars-shot milestones\", a suite of operational and financial targets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-today-sensex-falls-500-points-nifty-tumbles-key-factors-explained-2815100-2025-11-07",
      "headline": "Sensex tumbles over 500 points: Why is the stock market down today?The broad-based weakness comes as investors continue to digest a mix of global uncertainties, ranging from geopolitical tensions to expectations of prolonged high interest rates in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-allotment-status-gmp-listing-date-details-2025-11-07-2815093-2025-11-07",
      "headline": "Lenskart IPO allotment out: Check latest GMP, listing date and moreLenskart's IPO allotment is done, but all eyes are now on its stock market debut. With strong demand and a steady GMP, will India's eyewear leader deliver clear gains?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-shares-tumble-4-percent-in-early-trade-whats-behind-the-fall-2815078-2025-11-07",
      "headline": "Bharti Airtel shares tumble 4% in early trade. What's behind the fall?At 9:29 am, Bharti Airtel shares were down 3.66% at Rs 2,018 on the Bombay Stock Exchange (BSE), with heavy volumes recorded in the opening minutes of trade. The decline came even as broader market sentiment remained weak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-below-25400-airtel-falls-over-3-2815067-2025-11-07",
      "headline": "Sensex falls 500 points, Nifty below 25,400; Airtel falls over 3%At 9:19 am, the S&P BSE Sensex was down 456.75 points at 82,854.26, while the NSE Nifty50 slipped 129.40 points to 25,380.30. All major sectoral indices opened lower, led by losses in banking, IT and metal stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-tesla-pay-package-usd-1-trillion-approved-tech-ceo-salary-comparison-apple-google-meta-2815061-2025-11-07",
      "headline": "Musk's $1 trillion payout approved: How it compares to Apple, Google, Meta CEOsThe pay approval, backed by over 75% of voting shareholders, grants Musk stock options that could fundamentally reshape how CEOs are paid in Silicon Valley and beyond.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-premium-more-costly-metro-tier-1-cities-why-pollution-rising-medical-treatment-costs-irda-insurer-2815039-2025-11-07",
      "headline": "Your health insurance premiums might go up if you live in these citiesWhile higher premiums may sound like an unfair penalty for metro city dwellers, experts say it reflects the growing health and cost gap between metros and smaller towns due to numerous factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trade-talks-with-us-eu-in-full-force-india-awaits-final-nodnirmala-sitharaman-2814761-2025-11-06",
      "headline": "US, EU trade talks still on; atmanirbharta is resilient interdependence: SitharamanFinance Minister Nirmala Sitharaman on Thursday said efforts to finalise trade agreements with the US and the EU are in \"full force.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-ipo-opens-on-november-11-check-price-size-gmp-and-key-details-2814674-2025-11-06",
      "headline": "Physicswallah IPO opens on November 11: Check price, size, GMP and key detailsThe wait is nearly over for investors tracking PhysicsWallah. The edtech firm will open its IPO on November 11, aiming to raise significant capital as it prepares for its stock market debut. Here's everything you need to know in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-end-in-red-metal-sector-slide-fii-outflows-2814663-2025-11-06",
      "headline": "Sensex, Nifty erase early gains to close lower, FII selling dampens marketThe S&P BSE Sensex lost 148.14 points to close at 83,311.01, while the NSE Nifty50 was down by 87.95 points to end at 25,509.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-opens-tomorrow-review-check-price-band-minimum-amount-gmp-details-2814655-2025-11-06",
      "headline": "Pine Labs IPO opens tomorrow for bidding: Check price band, GMP, other detailsPine Labs IPO involves the sale of 9.41 crore new shares aggregating to Rs 2,080 crore, while the offer for sale includes 8.23 crore shares worth Rs 1,819.91 crore, being sold by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-philanthropy-list-2025-shiv-nadar-tops-with-rs-2708-crore-check-others-2814643-2025-11-06",
      "headline": "Shiv Nadar tops Hurun Philanthropy List 2025. Here's who else made the top 10Shiv Nadar and family have retained the top spot for the fourth time in five years. The HCL founder donated Rs 2,708 crore in 2025, averaging Rs 7.4 crore per day, up 26% from last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-bpnl-buy-now-pay-later-a-lifesaver-or-a-debt-trap-the-hidden-side-of-easy-credit-explains-expert-2814617-2025-11-06",
      "headline": "Is BPNL a lifesaver or a debt trap? The hidden side of easy credit, explains expertBuy Now, Pay Later (BNPL) has made shopping feel easier than ever — no paperwork, no waiting, just buy now and pay in instalments. But beneath the convenience lies a growing concern: is it really a smart money tool or a slippery debt trap? Let's have a look."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/reliance-moves-to-sell-middle-east-crude-as-sanctions-reshape-trade-report-2814568-2025-11-06",
      "headline": "Reliance moves to sell Middle East crude as sanctions reshape trade: ReportThe company has reportedly offered grades such as Murban and Upper Zakum to both domestic and overseas buyers in recent days. While it is not yet clear how much crude Reliance is seeking to offload, the approach itself has caught the oil market's attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-icici-hdfc-to-sbi-personal-loan-interest-rates-across-7-top-banks-2814542-2025-11-06",
      "headline": "From ICICI, HDFC to SBI: Personal loan interest rates across 7 top banksIf you're planning to take a personal loan, comparing interest rates can save you a lot of money. Here's a quick look at what seven major banks, including SBI, ICICI, HDFC and Canara, are currently charging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-summoned-by-ed-for-second-time-in-rs-17000-crore-loan-fraud-case-asked-to-appear-on-november-14-2814537-2025-11-06",
      "headline": "ED summons Anil Ambani for second time on November 14 in loan fraud caseHe was earlier summoned and interrogated by the ED in August 2025 as part of the ongoing probe into alleged financial irregularities involving loans taken by his group companies from Indian banks, including the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-today-silver-market-outlook-wedding-season-safe-haven-demand-2814527-2025-11-06",
      "headline": "Gold, silver prices are rising again. Is there more upside left?On the Multi Commodity Exchange (MCX), December gold futures hovered around Rs 1.20 lakh per 10 grams through the morning session, rebounding slightly from levels seen earlier this week. Silver saw a bigger gain after recent weakness and was trading at around Rs 1.47 lakh per kg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/richest-candidates-bihar-elections-2025-highest-assets-politicians-affidavits-maximum-adr-report-2814511-2025-11-06",
      "headline": "Bihar Elections 2025: Who are the richest politicians contesting this time?Bihar, often seen as a political pulse point for national trends, is set for a two-phase election that will decide the leadership of a state rich in history and political influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pension-rules-clarified-how-does-your-last-working-day-impact-benefits-2814509-2025-11-06",
      "headline": "Pension rules clarified: How does your last working day impact benefits?Under the Central Civil Services (Pension) Rules, 2021, an employee's pension will now be calculated based on the rules that are active on their final day of service. This could be the day they retire, resign, are discharged from duty, or pass away — whichever happens first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambanis-reliance-group-faces-government-probe-what-we-know-so-far-2814478-2025-11-06",
      "headline": "Anil Ambani's Reliance Group faces government probe. What we know so farThe probe escalation follows aggressive enforcement actions by the ED. In the past week, the ED attached assets worth nearly Rs 7,500 crore in connection with alleged fund diversion. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-hints-at-orlando-bloom-split-in-emotional-new-song-bandaids-2815096-2025-11-07",
      "headline": "Katy Perry hints at Orlando Bloom split in emotional new song Bandaids Katy Perry's new single 'Bandaids' captures the heartbreak and emotional turmoil of her split from Orlando Bloom after nearly a decade together. The song and its visuals trace the painful unravelling of their relationship with raw honesty and poetic depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boogie-woogie-original-team-reunites-with-meezaan-jaaferi-for-viral-dance-off-to-3-shaukk-2815073-2025-11-07",
      "headline": "Boogie Woogie stars Jaaved, Naved and Ravi Behl's dance-off wins hearts. Watch Jaaved Jaaferi, Naved Jafri, and Ravi Behl join Meezaan Jaaferi for a special performance on the song '3 Shaukk' from the upcoming film De De Pyaar De 2, sparking nostalgia among fans and celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-netflix-unveils-first-5-minutes-and-its-already-spine-chilling-2815076-2025-11-07",
      "headline": "Stranger Things 5: Netflix unveils first 5 minutes, and it's already spine-chilling The final season of Stranger Things opens with a tense scene featuring Will Byers and Vecna, as Hawkins faces military quarantine and the characters confront new dangers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayakan-re-release-2025-kamal-haasan-legacy-vigilante-justice-2814708-2025-11-07",
      "headline": "Revisiting Nayakan in 2025: What aged well, what didn't in Kamal Haasan's classic 'Nayakan' has been re-released in 2025 to celebrate Kamal Haasan's 70th birthday. The film's themes of vigilante justice and patriarchy invite renewed debate on its legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bramayugam-selected-only-indian-film-los-angeles-academy-museum-folklore-series-2815081-2025-11-07",
      "headline": "Mammootty's Bramayugam is the only Indian film to be screened at Academy Museum Director Rahul Sadasivan's Malayalam film 'Bramayugam' is set to be the sole Indian film screened at the Academy Museum of Motion Pictures in Los Angeles in February. Actor Mammootty shared his excitement in a post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maharani-season-4-review-huma-qureshi-political-saga-stings-hard-but-shows-fatigue-2814984-2025-11-07",
      "headline": "Maharani S4 review: Huma Qureshi's political saga stings hard, but shows fatigueRelease Date:Fri Nov 07, 2025 If politics fascinates you, 'Maharani Season 4' is a must-watch. And even if it doesn't, the timing, coinciding with the Bihar Assembly Elections, makes it an intriguing mirror to the real world outside your screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thode-door-thode-paas-review-pankaj-kapur-digital-detox-family-drama-2815060-2025-11-07",
      "headline": "Thode Door Thode Paas review: Pankaj Kapur leads a warm family drama on digital detoxRelease Date:Fri Nov 07, 2025 Thode Door Thode Paas series review: 'Thode Door Thode Paas' explores a family's digital detox journey led by Pankaj Kapur. The series highlights emotional disconnection and the need to rediscover familial bonds in today's tech-driven world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/millie-bobby-brown-shares-laugh-hugs-david-harbour-after-harassment-claims-2815062-2025-11-07",
      "headline": "Millie Bobby Brown shares laugh, hugs David Harbour after harassment claims Millie Bobby Brown and David Harbour surprised fans with a warm reunion at the 'Stranger Things 5' premiere in Los Angeles, putting rumours of a workplace dispute to rest. The duo shared smiles and hugs as they greeted fans despite recent allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-first-look-poster-release-ss-rajamouli-november-15-film-launch-2815047-2025-11-07",
      "headline": "Rajamouli to launch Prithviraj's first-look poster today, grand event on Nov 15 Director SS Rajamouli has announced the upcoming release of the first-look poster featuring Prithviraj Sukumaran from his new film, with the poster set to be revealed today. The announcement comes just days before the film's major launch event at Ramoji Film City in Hyderabad on November 15."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/predator-badlands-review-proof-franchise-should-stay-extinct-2814480-2025-11-07",
      "headline": "Predator: Badlands review – Proof the franchise should've stayed extinctRelease Date:Fri Nov 07, 2025 'Predator: Badlands' review — Dan Trachtenberg's sci-fi sequel tries to blend 'Godzilla', 'Avatar', and 'Transformers', but ends up a chaotic mess. Starring Dimitrius Koloamatangi and Elle Fanning, the film struggles with weak writing, predictable twists, and a forgettable climax.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chateau-miraval-legal-dispute-brad-pitt-sues-angelina-jolie-2021-winery-stake-sale-2815042-2025-11-07",
      "headline": "Brad Pitt sues ex-wife Angelina Jolie over winery sale Brad Pitt has filed a new legal action against Angelina Jolie over their shared Chateau Miraval winery. The dispute stems from Jolie's 2021 sale of her stake, with Pitt's team submitting fresh court documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-hypes-fiance-rashmika-mandanna-the-girlfriend-2815041-2025-11-07",
      "headline": "Vijay Deverakonda thrilled for Rashmika's The Girlfriend release: It's powerful Vijay Deverakonda shared his enthusiasm for Rashmika Mandanna's new film 'The Girlfriend', set to release in theatres on November 7, highlighting the film's powerful impact and technical team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahhi-vij-hospitalised-high-fever-divorce-rumours-tv-comeback-2815028-2025-11-07",
      "headline": "Mahhi Vij hospitalised amid divorce rumours, her team shares health update Television actor Mahhi Vij has been hospitalised due to a high fever and extreme weakness, her publicist confirmed. This development comes amid ongoing reports of her rumoured separation from husband Jay Bhanushali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gouri-kishan-calls-out-body-shaming-question-chennai-press-meet-others-release-2815017-2025-11-07",
      "headline": "Tamil actor Gouri Kishan blasts reporter's body-shaming question: You're a disgrace Actor Gouri Kishan responded strongly to a journalist's question about her weight at a Chennai press event for her film, sparking widespread online debate and support for her stance against objectification and body-shaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-kylie-jenner-keep-relationship-private-film-promotions-2815016-2025-11-07",
      "headline": "Timothee Chalamet dodges questions on Kylie Jenner romance, stays private Timothée Chalamet declined to discuss his relationship with Kylie Jenner in a recent interview, emphasising personal privacy while reflecting on family values and his work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-great-ott-shift-is-indias-love-story-with-theatres-on-the-wane-2814858-2025-11-07",
      "headline": "The great OTT shift: Is India's love story with theatres on the wane? Once the heart of every Friday, the theatre experience now struggles to compete with the comfort of home screens. Rising costs, shorter attention spans, and the OTT boom have changed how India watches movies today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-attends-the-running-man-screening-praises-glen-powell-crushed-it-2815010-2025-11-07",
      "headline": "Tom Cruise cheers Glen Powell at The Running Man screening: You crushed it Tom Cruise attended the screening of Glen Powell's new film 'The Running Man'. The film is scheduled for release in theaters on November 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-testament-of-ann-lee-teaser-trailer-amanda-seyfried-historical-musical-drama-2815004-2025-11-07",
      "headline": "The Testament of Ann Lee teaser: Amanda Seyfried captivates as a spiritual leader The teaser for Mona Fastvold's musical drama 'The Testament of Ann Lee', starring Amanda Seyfried, is out. The actor is seen playing the Shaker movement's founder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-tales-from-85-animated-series-teaser-netflix-2815002-2025-11-07",
      "headline": "Stranger Things Tales From '85: Netflix revives Hawkins in animated form Netflix offers a first glimpse at the animated series 'Stranger Things: Tales From '85', set between seasons two and three, along with a new voice cast for the beloved Hawkins characters."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-elections-2025-first-phase-record-turnout-voting-pattern-analysis-nda-mahagathbandhan-2815090-2025-11-07",
      "headline": "Record Phase 1 turnout in Bihar polls. Who should be more worried?In the first phase of the Bihar elections, the voter turnout touched 64.66%, a jump from the 56.1% recorded in the 2020 assembly polls. What do the record voting figures in Bihar indicate?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-land-deal-probe-rs-1800-crore-plot-sold-for-rs-300-crore-questions-over-ajit-pawars-son-parths-role-2815019-2025-11-07",
      "headline": "Rs 1,800-crore plot sold for just Rs 300 crore: Ajit Pawar's son Parth faces heatThe Maharashtra government has launched a high-level probe into a Rs 1,800-crore land scam linked to Parth Pawar, following an interim report exposing serious irregularities. The investigation aims to uncover procedural lapses and recover state losses in a controversial Pune property deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/several-flights-delayed-at-delhi-airport-due-to-technical-snag-with-air-traffic-control-system-2815057-2025-11-07",
      "headline": "Chaos at Delhi airport: Air traffic control snag delays over 100 flightsA technical glitch in the Air Traffic Control system at Indira Gandhi International Airport caused significant flight delays on Friday morning. Efforts are ongoing to resolve the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bihar-elections-why-bjp-cannot-dump-nitish-kumar-yet-2814883-2025-11-07",
      "headline": "Why BJP cannot dump Nitish Kumar yetThe 'Nimo' (Nitish Kumar, Narendra Modi) jodi is a Made in Bihar special — one where past antagonisms are quickly forgotten in the desperate attempt to stay in power at all costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/afghanistan-pakistan-babrra-massacre-1948-pathan-khudai-khidmatgars-frontier-gandhi-bacha-khan-pashtun-2810750-2025-11-07",
      "headline": "When Pakistan slaughtered Frontier Gandhi's 600 unarmed PathansOn August 12, 1948, the Babrra village in the Pathan-dominated Charsadda of the North-West Frontier Province (NWFP), was drenched in the blood of hundreds of unarmed Khudai Khidmatgars. They were followers of Frontier Gandhi, Khan Abdul Ghaffar Khan, and peacefully demanding their rights. The Pakistani state, led by Muhammad Ali Jinnah, opened fire without mercy. This massacre, referred to as the \"Karbala of the Pashtuns\", is one of the darkest stains on Pakistan's early history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-nuclear-weapons-testing-sites-locations-us-russia-china-india-pakistan-france-2814810-2025-11-07",
      "headline": "Nuclear hotspots: Where the world tests its most dangerous weaponsThe US and Russia have announced their intent to test nuclear weapons. Other countries could follow suit. Here is a look at where countries have tested their most dangerous weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-salary-kras-for-tesla-details-market-cap-robo-taxi-financial-targets-2815112-2025-11-07",
      "headline": "What does it take to earn $1 trillion pay? Here are Tesla's KRAs for Elon MuskTo actually collect on this historic paycheck, Musk must achieve what Tesla's board calls \"Mars-shot milestones\", a suite of operational and financial targets. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-student-found-dead-in-russia-ufa-dam-ajit-chaudhary-rajasthan-alwar-embassy-moscow-2815077-2025-11-07",
      "headline": "Body of Indian MBBS student, missing for 19 days in Russia, found in damAjit Singh Chaudhary, a 22-year-old MBBS student from Rajasthan's Alwar, who had been missing in Russia since October 19, was found dead near a dam in Ufa after 19 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-great-ott-shift-is-indias-love-story-with-theatres-on-the-wane-2814858-2025-11-07",
      "headline": "The great OTT shift: Is India's love story with theatres on the wane?Once the heart of every Friday, the theatre experience now struggles to compete with the comfort of home screens. Rising costs, shorter attention spans, and the OTT boom have changed how India watches movies today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pharma-executive-collapses-behind-trump-during-drug-price-announcement-glbs-2814980-2025-11-07",
      "headline": "Video: Pharma executive collapses behind Trump during drug price announcementThe event, which featured top pharmaceutical executives and administration officials, was intended to spotlight the administration's new Most Favored Nations drug pricing initiative, a plan to make GLP-1 medications more affordable for millions of Americans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/couples-are-using-the-bird-theory-to-test-their-love-but-should-you-2814627-2025-11-07",
      "headline": "Couples are using the bird theory to test their love, but should you?Another day, another social media trend. This time, couples are testing their love with the bird theory. But should a trend really define your relationship?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-rising-star-asia-cup-trophy-controversy-2815037-2025-11-07",
      "headline": "Asia Cup trophy yet to return home, but India ready for another Asia CupIt's been over a month since India defeated Pakistan in the Asia Cup T20 final, yet the trophy has still not reached Indian hands. With no presentation or closure, the triumph feels oddly unfinished. Now, as the BCCI confirms participation in the Rising Star Asia Cup, another chapter begins. The familiar rivalry is set to resume, but questions over the ACC's governance continue to linger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gouri-kishan-calls-out-body-shaming-question-chennai-press-meet-others-release-2815017-2025-11-07",
      "headline": "Tamil actor Gouri Kishan blasts reporter's body-shaming question: You're a disgraceActor Gouri Kishan responded strongly to a journalist's question about her weight at a Chennai press event for her film, sparking widespread online debate and support for her stance against objectification and body-shaming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/surat-man-beaten-humiliated-knife-attack-viral-video-police-probe-2815056-2025-11-07",
      "headline": "Please forgive me: Man beaten, forced to lick feet on cameraA disturbing video from Surat has surfaced showing a man being beaten, humiliated, and threatened with a knife. The incident, involving a migrant worker from Madhya Pradesh, prompted police action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/delhi-high-aqi-smog-pm-25-can-feel-like-a-mild-concussion-says-top-neurologist-2814703-2025-11-07",
      "headline": "Delhi's high AQI smog can feel like a mild concussion, says top neurologistDelhi's air pollution can cause brain effects similar to a mild concussion. Beyond the lungs, the neurological impact of toxic air heavy with PM 2.5 particles is worrying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shilpa-shetty-loan-fraud-case-raj-kundra-best-deal-tv-diversion-of-funds-mumbai-police-eow-2815038-2025-11-07",
      "headline": "Cops find proof of fund diversion by Shilpa Shetty, Raj Kundra in loan fraud caseOfficials found that vendors linked to Shilpa Shetty and Raj Kundra's company were never paid, even as the couple allegedly diverted funds and showed inflated expenses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vande-matram-commemoration-nehru-dropped-stanzas-durga-bjp-attacks-congress-2815049-2025-11-07",
      "headline": "Nehru dropped Maa Durga stanzas from Vande Mataram in 1937: BJP attacks CongressBJP spokesperson CR Kesavan accused the Congress of \"deliberately distorting\" Vande Mataram under Nehru's leadership, claiming stanzas hailing Goddess Durga were removed in 1937 to appease communal sensitivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/techie-in-germany-clears-rs-53-lakh-delhi-home-loan-in-6-years-shares-6-key-lessons-2815110-2025-11-07",
      "headline": "Techie in Germany clears Rs 53 lakh Delhi home loan in 6 years, shares 6 key lessons\"I paid off my Rs 53 lakh home loan in 6 years - here's what I learnt,\" read the title of the post where he said that he took the loan in September 2019 and cleared it by November 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-netflix-unveils-first-5-minutes-and-its-already-spine-chilling-2815076-2025-11-07",
      "headline": "Stranger Things 5: Netflix unveils first 5 minutes, and it's already spine-chillingThe final season of Stranger Things opens with a tense scene featuring Will Byers and Vecna, as Hawkins faces military quarantine and the characters confront new dangers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-today-sensex-falls-500-points-nifty-tumbles-key-factors-explained-2815100-2025-11-07",
      "headline": "Sensex tumbles over 500 points: Why is the stock market down today?The broad-based weakness comes as investors continue to digest a mix of global uncertainties, ranging from geopolitical tensions to expectations of prolonged high interest rates in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thode-door-thode-paas-review-pankaj-kapur-digital-detox-family-drama-2815060-2025-11-07",
      "headline": "Thode Door Thode Paas review: Pankaj Kapur leads a warm family drama on digital detoxRelease Date:Fri Nov 07, 2025Thode Door Thode Paas series review: 'Thode Door Thode Paas' explores a family's digital detox journey led by Pankaj Kapur. The series highlights emotional disconnection and the need to rediscover familial bonds in today's tech-driven world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chateau-miraval-legal-dispute-brad-pitt-sues-angelina-jolie-2021-winery-stake-sale-2815042-2025-11-07",
      "headline": "Brad Pitt sues ex-wife Angelina Jolie over winery saleBrad Pitt has filed a new legal action against Angelina Jolie over their shared Chateau Miraval winery. The dispute stems from Jolie's 2021 sale of her stake, with Pitt's team submitting fresh court documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boogie-woogie-original-team-reunites-with-meezaan-jaaferi-for-viral-dance-off-to-3-shaukk-2815073-2025-11-07",
      "headline": "Boogie Woogie stars Jaaved, Naved and Ravi Behl's dance-off wins hearts. WatchJaaved Jaaferi, Naved Jafri, and Ravi Behl join Meezaan Jaaferi for a special performance on the song '3 Shaukk' from the upcoming film De De Pyaar De 2, sparking nostalgia among fans and celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayakan-re-release-2025-kamal-haasan-legacy-vigilante-justice-2814708-2025-11-07",
      "headline": "Revisiting Nayakan in 2025: What aged well, what didn't in Kamal Haasan's classic'Nayakan' has been re-released in 2025 to celebrate Kamal Haasan's 70th birthday. The film's themes of vigilante justice and patriarchy invite renewed debate on its legacy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-focus-future-ronaldo-criticism-issues-2815107-2025-11-07",
      "headline": "Manchester United's Ruben Amorim urges focus on future after Ronaldo criticism Manchester United manager Ruben Amorim has responded to Cristiano Ronaldo's sharp remarks that he cannot \"work miracles\" with the current squad, insisting that the club is focused on rebuilding its future rather than revisiting its mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-suryakumar-yadav-r-ashwin-2815106-2025-11-07",
      "headline": "Suryakumar Yadav's 10-ball 20 might be more valuable than you think: Ashwin Former India spinner Ravichandran Ashwin has defended out of form Suryakumar Yadav. Ashwin said that Surya's short bursts might be much more effective in T20Is than what his numbers reflect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-investigates-sexual-harassment-allegations-jahanara-alam-2815082-2025-11-07",
      "headline": "Bangladesh Board to investigate Jahanara Alam's sexual harassment allegations The Bangladesh Cricket Board (BCB) has announced the formation of a committee to investigate sexual harassment allegations made by former women's team captain Jahanara Alam against former team officials. The board stated that the enquiry panel has been directed to submit its findings and recommendations within 15 working days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-hong-kong-sixes-match-today-2815079-2025-11-07",
      "headline": "India vs Pakistan, Hong Kong Sixes: Livestreaming details, full squads India and Pakistan are set to play against each other in the Hong Kong Sixes. The match will be telecasted and livestreamed in India. Dinesh Karthik will lead the Indian side in the 6-over game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/historic-indias-world-cup-winners-meet-pm-modi-deepti-sharma-reveals-teams-mindset-ytvd-2815075-2025-11-07",
      "headline": "Deepti Sharma on India's Historic Women's World Cup Win & Meeting PM Modi This special report focuses on the Indian women's cricket team's historic 2025 World Cup victory and their subsequent meeting with Prime Minister Narendra Modi, with insights from all-rounder Deepti Sharma. On her stellar performance, Deepti Sharma stated, 'I think God has already written it. And it has already happened.' Following their maiden World Cup title win against South Africa, where she was named Player of the Tournament, Sharma spoke to India Today's Nitin Srivastav. She reflected on the journey from being runners-up in 2017 to becoming world champions on home soil in 2025. Sharma credited her brother for her success and discussed the challenging start to the tournament, the team's unwavering belief, and the honour of meeting the Prime Minister after achieving their ultimate goal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ollie-robinson-bowls-steve-smith-ashes-warm-up-australia-cricket-2815065-2025-11-07",
      "headline": "Ashes: England's Robinson helps Australia star Steve Smith prepare in Sydney nets Out-of-favour England pacer Ollie Robinson bowled to Australia's stand-in captain Steve Smith during a net session in Sydney on Thursday. Robinson is in Australia to play club cricket for Sydney University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-rising-star-asia-cup-trophy-controversy-2815037-2025-11-07",
      "headline": "Asia Cup trophy yet to return home, but India ready for another Asia Cup It's been over a month since India defeated Pakistan in the Asia Cup T20 final, yet the trophy has still not reached Indian hands. With no presentation or closure, the triumph feels oddly unfinished. Now, as the BCCI confirms participation in the Rising Star Asia Cup, another chapter begins. The familiar rivalry is set to resume, but questions over the ACC's governance continue to linger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-venues-bengaluru-snubbed-ahmedabad-final-2815036-2025-11-07",
      "headline": "Bengaluru snubbed again, Ahmedabad set to host T20 World Cup final: Report Bengaluru is unlikely to host matches in the T20 World Cup 2026. According to a PTI report, the city has been snubbed once again due in the aftermath of the 2025 stampede incident which claimed the life of 11 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-ms-dhoni-comparison-india-vs-south-africa-test-series-rishabh-pant-2815027-2025-11-07",
      "headline": "Why Dhoni-esque Dhruv Jurel deserves spot in Test team alongside Rishabh Pant Dhruv Jurel once again showcased his composure under pressure with a measured knock against South Africa A in the second unofficial Test. But with Rishabh Pant set to return for the South Africa series, the key question remains — can Jurel retain his place as a specialist batter alongside the Indian vice-captain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-irfan-pathan-varun-aaron-india-vs-australia-2815020-2025-11-07",
      "headline": "You need Gill in T20I side: Ex-cricketers slam India vice-captain's critics Former India cricketers Varun Aaron and Irfan Pathan rallied behind Shubman Gill after his composed innings in the fourth T20I against Australia. Gill's 46-run knock, though restrained, proved instrumental in guiding India to victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-beats-faustino-oro-pranav-pranesh-progress-fide-world-cup-2025-2814973-2025-11-06",
      "headline": "Vidit Gujrathi downs Argentine prodigy, Pranav and Pranesh win in 3rd round Vidit Gujrathi held his nerve to outplay 12-year-old sensation Faustino Oro in the rapid tiebreaks, while Pranav V and Pranesh M also secured clutch wins to extend India's strong run at the FIDE World Cup 2025. The Indian contingent now features seven players in Round 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-rising-star-asia-cup-trophy-controversy-2815037-2025-11-07",
      "headline": "Asia Cup trophy yet to return home, but India ready for another Asia Cup It's been over a month since India defeated Pakistan in the Asia Cup T20 final, yet the trophy has still not reached Indian hands. With no presentation or closure, the triumph feels oddly unfinished. Now, as the BCCI confirms participation in the Rising Star Asia Cup, another chapter begins. The familiar rivalry is set to resume, but questions over the ACC's governance continue to linger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-venues-bengaluru-snubbed-ahmedabad-final-2815036-2025-11-07",
      "headline": "Bengaluru snubbed again, Ahmedabad set to host T20 World Cup final: Report Bengaluru is unlikely to host matches in the T20 World Cup 2026. According to a PTI report, the city has been snubbed once again due in the aftermath of the 2025 stampede incident which claimed the life of 11 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-ms-dhoni-comparison-india-vs-south-africa-test-series-rishabh-pant-2815027-2025-11-07",
      "headline": "Why Dhoni-esque Dhruv Jurel deserves spot in Test team alongside Rishabh Pant Dhruv Jurel once again showcased his composure under pressure with a measured knock against South Africa A in the second unofficial Test. But with Rishabh Pant set to return for the South Africa series, the key question remains — can Jurel retain his place as a specialist batter alongside the Indian vice-captain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-irfan-pathan-varun-aaron-india-vs-australia-2815020-2025-11-07",
      "headline": "You need Gill in T20I side: Ex-cricketers slam India vice-captain's critics Former India cricketers Varun Aaron and Irfan Pathan rallied behind Shubman Gill after his composed innings in the fourth T20I against Australia. Gill's 46-run knock, though restrained, proved instrumental in guiding India to victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-beats-faustino-oro-pranav-pranesh-progress-fide-world-cup-2025-2814973-2025-11-06",
      "headline": "Vidit Gujrathi downs Argentine prodigy, Pranav and Pranesh win in 3rd round Vidit Gujrathi held his nerve to outplay 12-year-old sensation Faustino Oro in the rapid tiebreaks, while Pranav V and Pranesh M also secured clutch wins to extend India's strong run at the FIDE World Cup 2025. The Indian contingent now features seven players in Round 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/quinton-de-kock-unbeaten-123-leads-south-africa-to-eight-wicket-odi-win-over-pakistan-2814965-2025-11-06",
      "headline": "Quinton de Kock's first hundred after return blows away Pakistan in 2nd ODIQuinton de Kock's unbeaten 123 powered South Africa to a comprehensive victory in the second ODI against Pakistan, levelling the three-match series 1-1. De Kock's hundred anchored a dominant chase of 270, with support from Tony de Zorzi and strong bowling performances from Nandre Burger and Nqaba Peter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-waugh-calls-virat-kohli-greatest-odi-player-of-all-time-2814919-2025-11-06",
      "headline": "Steve Waugh ends the debate, calls Virat Kohli greatest ODI player of all timeLegendary Australia captain has named Virat Kohli as the best ODI cricketer in history. Kohli is the second-highest run scorer in the 50-over format with 14,255 runs, including a record 51 centuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-explains-absence-diogo-jota-funeral-2814912-2025-11-06",
      "headline": "Cristiano Ronaldo reveals why he did not attend Diogo Jota's funeralCristiano Ronaldo explains why he chose not to attend Diogo Jota's funeral, saying his presence would have shifted attention away from the grieving family during an emotional time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/deepti-sharma-on-winning-world-cup-pm-modi-lord-hanuman-jai-shree-ram-2814904-2025-11-06",
      "headline": "Winning the World Cup was destiny, God had already written this: Deepti SharmaAll-rounder Deepti Sharma reflected on the team's Women's World Cup 2025 triumph and said the win was written in destiny and God had already planned it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-pm-modi-notices-lord-hanuman-tattoo-india-womens-cricket-world-cup-2814894-2025-11-06",
      "headline": "PM Modi noticing my lord Hanuman tattoo and Insta bio meant a lot: Deepti SharmaIndia all-rounder Deepti Sharma shares her excitement after meeting Prime Minister Narendra Modi. The PM acknowledged her Lord Hanuman tattoo and Instagram bio, highlighting her unique connection with the leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/i-was-trying-to-improve-my-bowling-it-was-not-happening-shivam-dube-2814895-2025-11-06",
      "headline": "I was trying to improve my bowling, it was not happening: Shivam DubeAustralia vs India, 4th T20I: Shivam Dube credited Gautam Gambhir, Suryakumar Yadav and Morne Morkel for helping him improve his bowling skills. Dube took two crucial wickets in India's 48-run win in Gold Coast on Thursday, November 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-shivam-dube-bowling-skills-gautam-gambhir-morne-morkel-2814891-2025-11-06",
      "headline": "Bindaas bowling daal: Shivam Dube enjoys Gautam Gambhir's trust in secondary skillAUS vs IND, 2nd T20I: Once seen as only a middle-order hitter, Shivam Dube is finally earning the trust he waited years for with the ball. Backed by Gautam Gambhir, guided by Morne Morkel and captained by Suryakumar Yadav, Dube is getting opportunities to bowl under pressure and test himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-devi-selected-able-bodied-junior-archery-team-asia-cup-stage-3-2814876-2025-11-06",
      "headline": "Armless archer Sheetal Devi scripts history, picked in India's able-bodied teamWorld champion para archer Sheetal Devi made history by earning selection to India's able-bodied junior archery team. The armless archer made the cut after finishing third at the national trials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-pm-modi-notices-lord-hanuman-tattoo-india-womens-cricket-world-cup-2814894-2025-11-06",
      "headline": "PM Modi noticing my lord Hanuman tattoo and Insta bio meant a lot: Deepti SharmaIndia all-rounder Deepti Sharma shares her excitement after meeting Prime Minister Narendra Modi. The PM acknowledged her Lord Hanuman tattoo and Instagram bio, highlighting her unique connection with the leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/i-was-trying-to-improve-my-bowling-it-was-not-happening-shivam-dube-2814895-2025-11-06",
      "headline": "I was trying to improve my bowling, it was not happening: Shivam DubeAustralia vs India, 4th T20I: Shivam Dube credited Gautam Gambhir, Suryakumar Yadav and Morne Morkel for helping him improve his bowling skills. Dube took two crucial wickets in India's 48-run win in Gold Coast on Thursday, November 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-shivam-dube-bowling-skills-gautam-gambhir-morne-morkel-2814891-2025-11-06",
      "headline": "Bindaas bowling daal: Shivam Dube enjoys Gautam Gambhir's trust in secondary skillAUS vs IND, 2nd T20I: Once seen as only a middle-order hitter, Shivam Dube is finally earning the trust he waited years for with the ball. Backed by Gautam Gambhir, guided by Morne Morkel and captained by Suryakumar Yadav, Dube is getting opportunities to bowl under pressure and test himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-devi-selected-able-bodied-junior-archery-team-asia-cup-stage-3-2814876-2025-11-06",
      "headline": "Armless archer Sheetal Devi scripts history, picked in India's able-bodied teamWorld champion para archer Sheetal Devi made history by earning selection to India's able-bodied junior archery team. The armless archer made the cut after finishing third at the national trials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-unbeaten-132-india-a-recover-against-south-africa-a-first-class-cricket-2814850-2025-11-06",
      "headline": "IND A vs SA A: Jurel makes big statement before South Africa series with 132India A recovered from a severe top-order collapse to post 255 all out against South Africa A, thanks to a composed, unbeaten 132 from Dhruv Jurel. Kuldeep Yadav added valuable support with a gritty 20 as the pair rebuilt the innings after the team slumped to 126 for 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-retentions-releases-full-list-2814869-2025-11-06",
      "headline": "WPL 2026: Full list of players retained and released by all five teamsThe field is set as the five franchises have retained their players ahead of the upcoming Women's Premier League 2026 auction. There were some big and bold calls by all five teams as they revealed the retentions and releases before the new season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/up-warriorz-release-deepti-sharma-stars-retain-shweta-sehrawat-wpl-auction-2814865-2025-11-06",
      "headline": "UP Warriorz explain surprising releases of Deepti Sharma, Alyssa HealyWPL 2026: UP Warriorz released most of their star players, including Deepti Sharma ahead of the Women's Premier League mega auction. The franchise aims for a fresh start with a clean slate and the biggest auction purse for the 2026 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/did-pratika-rawal-receive-womens-world-cup-winners-medal-as-icc-altered-its-rules-2814740-2025-11-06",
      "headline": "Did Pratika receive Women's World Cup winner's medal after ICC rule change?Pratika Rawal, initially denied a medal due to ICC rules despite her significant role in India's Women's World Cup victory, was later seen wearing the medal in a photo with President Draupadi Murmu. Rawal was India's second-highest run scorer of the tournament with 308 runs from six innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-harmanpreet-sacrifices-1-crore-mi-second-retention-2814833-2025-11-06",
      "headline": "After World Cup win, Harmanpreet sacrifices Rs 1 crore, slips to MI's 2nd retentionMumbai Indians opted to make a rather interesting call by retaining the captain, Harmanpreet Kaur as their second-choice pick at Rs 2.5 crore and giving the top spot to the England all-rounder, Nat Sciver-Brunt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-4th-t20i-axar-patel-player-of-the-match-gold-coast-2814818-2025-11-06",
      "headline": "Axar Patel credits slow pitch, unexpected bounce for match-winning spellIndia all-rounder Axar Patel credited the slow surface and unexpected bounce at the Carrara Oval following his match-winning all-round show in the fourth T20I against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-deepti-sharma-sree-charani-players-released-2814824-2025-11-06",
      "headline": "WPL retentions: Deepti Sharma, Sree Charani among big India World Cup stars releasedWomen's World Cup 2025 Player Of The Tournament Deepti Sharma and Sree Charani were among the big names released by their respective franchises during the WPL 2026 retentions. The likes of Renuka Thakur and Kranti Goud will also be looking for new teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-t20i-shubman-gill-axar-patel-gold-coast-2814786-2025-11-06",
      "headline": "India trade flair for precision to skittle Australia in tacky Gold CoastAustralia (AUS) vs India (IND), 4th T20I: India did not need a flamboyant show on a sluggish pitch that resembled home in Gold Coast on Thursday. Riding on a solid batting show and a disciplined bowling performance, India sealed a 48-run win. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}