{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-370-points-nifty-above-24950-adani-ports-tata-motors-among-top-gainers-2773517-2025-08-19",
      "headline": "Sensex, Nifty close higher on GST buzz, easing global tensionsThe S&P BSE Sensex gained 370.64 points, while the NSE Nifty50 rose 103.70 points to settle at 24,980.65. Broader markets also ended in the green, with mid- and small-cap stocks outperforming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pm-viksit-bharat-rozgar-yojana-who-can-get-rs-15000-and-other-benefits-2773508-2025-08-19",
      "headline": "PM Viksit Bharat Rozgar Yojana: Who can get Rs 15,000 and other benefitsFirst-time employees under Part A can receive a one-time incentive equal to about one month's basic pay, up to Rs 15,000, paid in two instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-quicker-pf-access-here-are-the-updated-epfo-rules-2772871-2025-08-18",
      "headline": "Want quicker PF access? Here are the updated EPFO rulesUnder the updated rules, if your name, gender and date of birth match in both Aadhaar and UAN records, you no longer need EPFO approval to link the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-676-points-higher-nifty-above-24800-maruti-gains-9-percent-2772869-2025-08-18",
      "headline": "Sensex ends 676 points higher, Nifty above 24,800; Maruti gains 9%The S&P BSE Sensex gained 676.09 points to end at 81,273.75, while the NSE Nifty50 added 245.65 points to close at 24,876.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-tax-cut-festive-season-diwali-save-money-common-man-shopkeepers-cheaper-items-food-appliance-prices-2772865-2025-08-18",
      "headline": "GST bonanza before festive rush? Here's what it could mean for youThe biggest change for middle-class families could be in aspirational goods such as televisions, refrigerators, and washing machines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crorepati-on-paper-cash-poor-in-reality-ca-explains-why-liquidity-matters-more-than-net-worth-2772767-2025-08-18",
      "headline": "Crorepati on paper, cash-poor in reality? CA explains why liquidity matters moreA high net worth can be misleading if most of your wealth is tied up in property or long-term investments. An expert believes that true financial security comes from having liquid assets that can be accessed at short notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/sunjay-kapurs-sister-raises-concern-over-treatment-of-family-claims-being-sidelined-2772711-2025-08-18",
      "headline": "Exclusive: Sunjay Kapur's sister raises concern over treatment of familyMandhira Kapur Smith, sister of late Sona Comstar Chairperson Sunjay Kapur, has raised concerns over her family's treatment by the automotive firm founded by their late father. She said her 80-year-old mother Rani Kapur has been sidelined, claiming the family has been treated \"like strangers\" and excluded from obituaries and public acknowledgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-1000-points-nifty-jump-stock-market-rally-auto-maruti-suzuki-mahindra-tata-motors-bajaj-gst-reform-diwali-2772619-2025-08-18",
      "headline": "Maruti Suzuki rallies 8%: Why GST relief is driving auto stocks higherEarly trade clearly showed strong buying in auto and financial stocks, while IT and pharma names dragged at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-rallies-893-points-nifty-above-24900-maruti-suzuki-share-price-jumps-6-percent-2772611-2025-08-18",
      "headline": "Sensex, Nifty surge as PM hints at GST reforms by Diwali; Maruti jumps 7%The S&P BSE Sensex was up 1,062.91 points to 81,659.75, while the NSE Nifty50 jumped 356 points to 24,987.30 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mandhira-kapur-family-excluded-sona-comstar-after-sunjay-kapur-death-2772541-2025-08-17",
      "headline": "Treated like strangers: Sunjay Kapur's sister alleges family sidelined by companyMandhira Kapur Smith alleged that the family has been treated as strangers and everyone's forgotten the legacy, forgotten that her mother's still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-let-ai-analyse-your-online-spending-habits-ai-and-spending-habits-ai-for-budgeting-ai-personal-finance-tools-2772315-2025-08-17",
      "headline": "Should you let AI analyse your online spending habits?Artificial intelligence is gradually slipping into our wallets. From tracking what we buy to predicting our next expense, AI-based tools are becoming popular. But should you really let AI analyse your online spending habits?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/trade-deal-talks-hit-roadblock-as-us-delegations-india-visit-could-be-delayed-2772307-2025-08-17",
      "headline": "Trade deal talks hit roadblock as US delegation's India visit could be delayedThe India-US trade deal talks face a potential roadblock as the US delegation may delay its August 25 visit to India. This postponement impacts scheduled negotiations that were crucial for preventing additional tariffs. A 50% tariff on Indian goods is set to take effect from August 27. Currently, a 25% tariff is already in place, impacting exporters. The deferment of the meeting does not signify cancellation, but rather a delay. Reasons for the delay could be operational or related to geopolitical outcomes. \"A 50% tariff will be imposed on us from August 27 in totality.\" The BTA deal is anticipated by the end of September or October, with expectations for a meeting by the end of August, contingent on geopolitical developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-negotiators-visit-to-new-delhi-for-bilateral-trade-talks-deferred-to-be-rescheduled-report-2772226-2025-08-16",
      "headline": "Trade deal in limbo as US team's India visit deferred amid tariff warThe United States has been pressing India to open its agriculture and dairy sectors, but New Delhi has ruled out concessions, saying such moves would endanger small farmers and cattle rearers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cuts-rationalisation-simpler-tax-structure-good-simple-tax-cheaper-goods-2772146-2025-08-16",
      "headline": "Real wallet-friendly shake-up: GST 2.0 to feel like 'Good and Simple Tax'The government is set to launch GST 2.0 with major rate cuts, making essentials cheaper and simplifying tax slabs. The overhaul promises lower prices, fewer complications, and a true 'Good and Simple Tax'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-subpoena-dispute-isabela-ferrer-blake-lively-legal-case-it-ends-with-us-2773842-2025-08-20",
      "headline": "Inappropriate attack: Justin Baldoni slams Isabela Ferrer's harassment claimsThe subpoena dispute between Justin Baldoni and Isabela Ferrer escalated with allegations of misconduct and legal manoeuvring, as Ferrer's counsel challenged Baldoni's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-release-date-out-new-teaser-flawed-president-2773734-2025-08-19",
      "headline": "The Diplomat Season 3 release date out: New teaser introduces a flawed PresidentThe new teaser of 'The Diplomat Season 3' has been released along with the date announcement. Global diplomacy and foreign negotiations get tougher this time, led by a flawed President in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-boman-irani-mourn-achyut-potdar-death-3-idiots-actor-2773706-2025-08-19",
      "headline": "Achyut Potdar dies: Aamir Khan, Boman Irani pay last respects to 3 Idiots co-starActors Aamir Khan and Boman Irani mourned the death of veteran actor Achyut Potdar. They paid their last respects to their '3 Idiots' co-star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-yuzvendra-chahal-court-divorce-proceedings-tshirt-controversy-2773694-2025-08-19",
      "headline": "Dhanashree Verma on divorce with Yuzvendra Chahal: I started howling in courtChoreographer Dhanashree Verma shared that she had an emotional breakdown during her divorce proceedings with cricketer Yuzvendra Chahal. She also reacted to her ex-husband's controversial T-shirt that said 'Be Your Sugar Daddy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-comeback-mahesh-narayanan-film-september-release-2773578-2025-08-19",
      "headline": "Actor Mammootty to resume shoot after taking a break due to health complicationsMalayalam actor Mammootty, who had recently faced some health complications, has recovered completely and will be joining the sets of his upcoming film with Mahesh Narayanan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-south-stars-humble-god-fearing-compared-to-bollywood-rajinikanth-coolie-2773666-2025-08-19",
      "headline": "Shruti Haasan says South stars are more humble, God-fearing, compared to BollywoodShruti Haasan discusses the cultural and psychological differences between South Indian cinema and Bollywood. She reflects on how humility and spirituality shape her approach to acting and her career choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-shah-rukh-khan-national-award-win-bollywood-without-him-would-not-be-same-2773696-2025-08-19",
      "headline": "Bosco Martis on SRK's National Award win: Bollywood without him would not be sameChoreographer Bosco Martis reflected on Shah Rukh Khan's National Award win. In an exclusive interaction with India Today, he stated how the industry will never be the same without him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-cryptic-response-ex-boyfrioend-utsav-dahiya-cute-little-red-flag-song-2773577-2025-08-19",
      "headline": "Influencer Apoorva Mukhija reacts to ex-partner's hate songInfluencer Apoorva Mukhija indirectly reacted to the song 'Cute little red flag' by her ex Utsav Dahiya, on Monday, August 18. In the song, Dahiya accused the influencer of lying, cheating, and using their relationship for content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-100-day-shoot-atlee-pan-india-film-all-you-need-to-know-2773661-2025-08-19",
      "headline": "Deepika Padukone to begin 100-day shoot for Atlee's film - all you need to knowActor Deepika Padukone will commence a 100-day shoot for Atlee's film. The pan-India project would feature Padukone in an action-packed warrior avatar. She is paired opposite actor Allu Arjun in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thama-teaser-desi-vampire-story-ayushmann-rashmika-diwali-2025-2773497-2025-08-19",
      "headline": "Thama hidden gems: Moments you might have missed in Ayushmaan-Rashmika's film teaserThe Thama teaser introduces a unique desi vampire romance starring Ayushmann Khurrana and Rashmika Mandanna. The film promises a fresh take on horror and is set to release this Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pala-suresh-kerala-mimicry-artist-dies-aged-53-2773640-2025-08-19",
      "headline": "Malayalam actor Pala Suresh dies of cardiac arrest at 53Suresh Krishna, popularly known as Pala Suresh, reportedly had a heart condition and was undergoing treatment at Kottayam Medical College. He was found in an unresponsive state at his residence and was pronounced dead upon arrival at the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-sonali-bendre-prem-preeti-reunion-exclusive-bigg-boss-19-premiere-2773572-2025-08-19",
      "headline": "Exclusive: Salman, Sonali's Prem-Preeti reunion on Bigg Boss 19 - Here's all we knowActor Salman Khan will be joined by his 'Hum Saath-Saath Hain' co-star Sonali Bendre at 'Bigg Boss 19' premiere. Sonali will be present at the show to promote her new reality series 'Pati Patni Aur Panga'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/explained-direct-action-day-noakhali-riots-at-the-heart-of-the-bengal-files-2773665-2025-08-19",
      "headline": "Explained: Direct Action Day, Noakhali riots at the heart of The Bengal FilesAs Vivek Agnihotri's film 'The Bengal Files' sparks debate, a look back at the violence of Direct Action Day and the Noakhali riots that shaped Bengal's partition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-bapat-on-bollywood-journey-stereotype-maharashtrian-identity-andhera-prime-video-2773635-2025-08-19",
      "headline": "Andhera actor Priya Bapat urges filmmakers not to typecast her in BollywoodActor Priya Bapat, in an exclusive conversation with India Today, spoke about being stereotyped in Bollywood. Proud of her Maharashtrian roots, the actor discussed how she wants to be seen beyond her identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-madison-square-garden-performance-just-soften-global-borders-for-indian-comedy-2773463-2025-08-19",
      "headline": "Indian comedy's global debut? Zakir Khan may have just set the stageZakir Khan's historic Hindi comedy show at Madison Square Garden marks a proud moment for Indian stand-up on the global stage. This breakthrough signals a new era where Indian humour, rooted in culture and relatability, is set to become a major cultural export like Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-confirmed-contestants-ashnoor-gaurav-awez-nagma-2773617-2025-08-19",
      "headline": "Bigg Boss 19 confirmed contestants include Ashnoor Kaur, Gaurav Khanna and moreBigg Boss 19 is set to start on August 24 with Salman Khan as the host. The season features 15 confirmed celebrity contestants, which includes names like Gaurav Khanna, Ashnoor Kaur and Awez–Nagma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-welcome-new-family-asit-kumarr-modi-teases-fun-gokuldham-2773521-2025-08-19",
      "headline": "Taarak Mehta to welcome new family, Asit Kumarr Modi teases more fun at Gokuldham'Taarak Mehta Ka Ooltah Chashmah' team is set to welcome a new family to the Gokuldham society. The show's creator, Asit Kumarr Modi, promised more entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jimin-enjoys-beach-day-with-v-after-missing-movie-weeks-clip-2773573-2025-08-19",
      "headline": "BTS' Jimin enjoys beach day with V after his absence from Movie Weeks clip. WatchBTS ARMY were left stunned and emotional after a newly released band's Movie Weeks clip excluded Jimin's solo segment, prompting widespread disappointment and debate across social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishal-bhardwaj-recalls-working-with-priyanka-chopra-on-kaminey-sets-2773528-2025-08-19",
      "headline": "Vishal Bhardwaj says he wrote poem on tissue for Priyanka Chopra to lift her moodFilmmaker Vishal Bhardwaj fondly recalls writing a poem on a tissue to cheer up Priyanka Chopra during the shooting of their film 'Kaminey', which completed 16 years of release on August 14. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/government-to-introduce-bills-in-lok-sabha-tomorrow-on-removal-of-pm-chief-minister-arrested-for-30-days-2773799-2025-08-19",
      "headline": "Centre to bring bills on removal of PM, chief ministers arrested on serious chargesThe government is set to introduce bills regarding the removal of the Prime Minister and chief ministers arrested for 30 days, today in Lok Sabha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-imposed-sanctions-india-pressure-russia-end-ukraine-war-white-house-glbs-2773836-2025-08-20",
      "headline": "Trump imposed sanctions on India to pressure Russia over Ukraine war: White HouseWhite House Press Secretary Karoline Leavitt said Trump increased India's tariffs to 50% as part of sanctions designed to pressure Russia to end the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-agree-resume-direct-flights-re-open-border-trade-glbs-2773825-2025-08-20",
      "headline": "India, China agree to resume direct flights, re-open border tradeIndia and China agree to reopen border trade at three points, resume direct flights, expand the Mount Kailash pilgrimage, and set up new mechanisms to manage border issues.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-slams-pakistan-sexual-violence-claims-un-minority-women-abuse-2773852-2025-08-20",
      "headline": "Shameful record since 1971: India shreds Pakistan at UN over sexual violenceIndia strongly rebutted Pakistan's allegations of sexual violence in Jammu and Kashmir at the UN. The Indian diplomat highlighted Pakistan's own poor record on crimes against minority women, calling for justice and survivor support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-ommision-ajit-agarkar-2773802-2025-08-20",
      "headline": "Asia Cup 2025: Shreyas Iyer knocks hard, but T20I doors stay shutShreyas Iyer continues to find himself out of T20I contention despite knocking hard on the selectors' doors with his unprecedented IPL and domestic numbers. As chief selector Ajit Agarkar says that there's no place for Iyer in the T20I team for now, the question remains: what more does he have to do to get back into the reckoning?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-weather-forecast-live-update-news-heavy-rainfall-monsoon-airlines-travel-advisory-2773851-2025-08-20",
      "headline": "Live: Mumbai rain news live: Red alert issued for next 3 hours, airlines issue travel advisoryMumbai rain Live updates: A Red Warning has been issued for Mumbai, with the Indian Meteorological Department forecasting moderate to intense spells of rain today. The rains have already left 1 dead and 3 injured in the city. Tune in to intoday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-profiteering-from-russian-crude-us-treasury-secretary-scott-bessent-renews-attack-2773699-2025-08-19",
      "headline": "India profiteering from Russian crude: US Treasury Secretary renews attackIn the past 10 days, US Treasury Secretary Scott Bessent has repeatedly targeted India for its energy trade with Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/two-schools-in-delhis-malviya-nagar-and-prasad-nagar-receive-bomb-threat-via-email-2773853-2025-08-20",
      "headline": "2 schools in Delhi's Malviya Nagar, Karol Bagh receive bomb threat via emailTwo schools in Delhi received bomb threat emails on Wednesday, just two days after 32 schools across the capital were targeted in a similar manner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/i-want-to-try-and-get-to-heaven-trump-ties-ukraine-peace-push-to-higher-calling-glbs-2773820-2025-08-20",
      "headline": "Want to try and get to heaven: Trump ties Ukraine peace push to higher callingPresident Donald Trump told Fox & Friends that he hopes brokering peace in Ukraine could help him \"get into heaven,\" joking he's \"at the bottom of the totem pole\" but emphasising his ultimate goal is saving lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-monorail-breaks-down-amid-heavy-rain-passengers-stuck-inside-train-being-evacuated-2773692-2025-08-19",
      "headline": "Video: All 582 rescued from stranded Mumbai monorail after 4 hours amid heavy rainThe monorail services in Mumbai were disrupted between Chembur and Bhakti Park due to a technical snag amid heavy rain. Passengers dialled the civic body helpline number, following which fire officials arrived at the scene and rescued them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-approves-rs-62000-crore-deal-for-97-indigenous-light-combat-aircraft-2773785-2025-08-19",
      "headline": "Government approves Rs 62,000-crore deal to buy 97 Light Combat Aircraft Mark 1AThe new order will help the Indian Air Force phase out its ageing MiG-21 fleet, which is set to be retired in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-vice-president-pick-sudershan-reddy-jurist-salwa-judum-telangana-caste-census-important-cases-explained-2773537-2025-08-19",
      "headline": "Sudershan Reddy the jurist: From Salwa Judum verdict to Telangana caste censusFrom striking down Chhattisgarh's Salwa Judum militia, aimed at countering Naxalite activities with local tribal recruits, as unconstitutional, to criticising the Union government in 2011 for its laxity in investigating black money cases, the Opposition's VP pick, Sudershan Reddy, has been a jurist known for his firm stands. Most recently, as an expert, Reddy steered the Revanth Reddy-led Telangana caste census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-yuzvendra-chahal-court-divorce-proceedings-tshirt-controversy-2773694-2025-08-19",
      "headline": "Dhanashree Verma on divorce with Yuzvendra Chahal: I started howling in courtChoreographer Dhanashree Verma shared that she had an emotional breakdown during her divorce proceedings with cricketer Yuzvendra Chahal. She also reacted to her ex-husband's controversial T-shirt that said 'Be Your Sugar Daddy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-rubbishes-us-claim-on-truce-with-pakistan-successful-strikes-not-trump-2773854-2025-08-20",
      "headline": "Successful strikes, not Trump: Shashi Tharoor rubbishes US claim on truce with PakSpeaking at the launch of the book Whither India-Pakistan Relations Today? Can They Ever Be Good Neighbours?, Tharoor said it was Pakistan's Director General of Military Operations (DGMO) who reached out to his Indian counterpart after India's Operation Sindoor - not Trump's alleged intervention - that led to the cessation of hostilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/h-1b-ban-next-india-us-ties-frosty-due-to-trump-comments-maga-talks-of-ban-on-h-1b-visa-2773614-2025-08-19",
      "headline": "India-US ties frosty due to Trump comments, MAGA talks of ban on H-1B VisaEven as US President Donald Trump has ratcheted up his tariff talk against India, his MAGA base is drumming up for one more step to hit India — modify or ban H-1B Visa so that fewer Indians can get jobs in the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-woman-kills-husband-with-lover-help-inspired-cid-arrested-rajasthan-police-2773841-2025-08-20",
      "headline": "Inspired by crime show CID, Jaipur woman kills husband with lover's helpJaipur Police cracked the case using CCTV and surveillance, arresting the victim's wife, her lover and his friend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/why-indians-are-taking-their-long-weekends-abroad-2773627-2025-08-20",
      "headline": "Why Indians are taking their long weekends abroadThis Independence Day long weekend, Indians skipped the usual road trips to the hills and staycations nearby. Instead, the new-age traveller packed their bags for international getaways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-vivek-agnihotris-the-bengal-files-has-sparked-political-fire-over-states-past-2773507-2025-08-19",
      "headline": "Why Vivek Agnihotri's 'The Bengal Files' has sparked political fire'The Bengal Files', starring Mithun Chakraborty, Anupam Kher and Pallavi Joshi, courts the same double-edged attention as 'The Kashmir Files': controversy as publicity"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-reorganisation-bill-restoring-statehood-lok-sabha-parliament-2773751-2025-08-19",
      "headline": "Omar Abdullah's cryptic Harry Potter meme amid J&K statehood bill buzzJammu and Kashmir Chief Minister Omar Abdullah appeared to have reacted cryptically to speculation about a bill to restore the region's statehood, sharing a Professor Snape dialogue: 'I can't take any more of this'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-offers-host-zelenskyy-russia-for-one-on-one-meeting-glbs-2773809-2025-08-20",
      "headline": "Putin offers to host Zelenskyy in Russia for one-on-one meeting: ReportDonald Trump has been suggesting a trilateral summit with Vladimir Putin and Volodymyr Zelenskyy as a path to end the war in Ukraine. At the White House meeting, he said arrangements are underway for a meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/should-sholay-be-remade-jai-veeru-sherlock-holmes-investigates-ranbir-ranveer-allu-arjun-prabhas-vicky-kaushal-2773433-2025-08-19",
      "headline": "If Sholay was remade, who'd be Jai-Veeru: Sherlock Holmes investigatesA cult classic collides with a timeless sleuth. As Sholay marks half a century, Holmes and Watson debate who could possibly fill the boots of Jai and Veeru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-official-tiktok-account-launches-trump-administration-2773824-2025-08-20",
      "headline": "I am your voice: White House joins TikTok with Trump's 2016 campaign audioThe account, which went live Tuesday evening, will serve as a channel for communicating the Trump administration's policy agenda and administration updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/71-killed-as-bus-carrying-migrants-crashes-catches-fire-in-afghanistan-2773835-2025-08-20",
      "headline": "71 killed as bus carrying migrants crashes, catches fire in AfghanistanA bus carrying Afghan migrants deported from Iran crashed in Herat province, killing 71 people, including 17 children, after colliding with a truck and motorcycle, Afghan provincial officials confirmed.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-criticises-ai-film-chiranjeevi-hanuman-vijay-subramaniam-2773857-2025-08-20",
      "headline": "Anurag Kashyap blasts AI-film Chiranjeevi Hanuman producer: Future for spinelessAnurag Kashyap criticised the backing of an AI-generated film 'Chiranjeevi Hanuman' by Vijay Subramaniam, prompting discussions on AI's role in filmmaking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-subpoena-dispute-isabela-ferrer-blake-lively-legal-case-it-ends-with-us-2773842-2025-08-20",
      "headline": "Inappropriate attack: Justin Baldoni slams Isabela Ferrer's harassment claimsThe subpoena dispute between Justin Baldoni and Isabela Ferrer escalated with allegations of misconduct and legal manoeuvring, as Ferrer's counsel challenged Baldoni's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-release-date-out-new-teaser-flawed-president-2773734-2025-08-19",
      "headline": "The Diplomat Season 3 release date out: New teaser introduces a flawed PresidentThe new teaser of 'The Diplomat Season 3' has been released along with the date announcement. Global diplomacy and foreign negotiations get tougher this time, led by a flawed President in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-boman-irani-mourn-achyut-potdar-death-3-idiots-actor-2773706-2025-08-19",
      "headline": "Achyut Potdar dies: Aamir Khan, Boman Irani pay last respects to 3 Idiots co-starActors Aamir Khan and Boman Irani mourned the death of veteran actor Achyut Potdar. They paid their last respects to their '3 Idiots' co-star."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alexander-isak-vs-newcastle-united-premier-league-transfer-standoff-explained-2773856-2025-08-20",
      "headline": "Alexander Isak vs Newcastle United: Premier League transfer stand-off explainedAlexander Isak's standoff with Newcastle United escalated dramatically on Tuesday night, as the Sweden striker publicly accused the club of breaking promises and betraying his trust. Newcastle said in a statement that no commitment was made by a club official that Isak could leave this summer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-buchi-babu-fresh-intent-no-sympathy-maharashrtra-century-2773804-2025-08-20",
      "headline": "Don't want anyone's sympathy: Prithvi Shaw on fresh start in Buchi BabuPrithvi Shaw has dismissed any need for sympathy as he looks to restart his cricketing journey. Shaw has backed himself to return stronger with consistent domestic performances and a renewed sense of determination after his Buchi Babu century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-ommision-ajit-agarkar-2773802-2025-08-20",
      "headline": "Asia Cup 2025: Shreyas Iyer knocks hard, but T20I doors stay shutShreyas Iyer continues to find himself out of T20I contention despite knocking hard on the selectors' doors with his unprecedented IPL and domestic numbers. As chief selector Ajit Agarkar says that there's no place for Iyer in the T20I team for now, the question remains: what more does he have to do to get back into the reckoning?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-squad-selection-fantastic-sunil-gavaskar-exclusive-2773788-2025-08-19",
      "headline": "India have picked a fantastic squad for the Asia Cup: Sunil GavaskarSunil Gavaskar praised India's Asia Cup 2025 squad, lauding its depth in batting and bowling versatility. He also backed Shubman Gill's vice-captaincy, calling it a sign of India grooming their next leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-government-decision-ind-vs-pak-sunil-gavaskar-2773771-2025-08-19",
      "headline": "Sunil Gavaskar on India vs Pakistan at Asia Cup: Players will go by government decisionSunil Gavaskar believes that the players should not be criticised for their participation at the Asia Cup and highlights that they are only following the directives of the BCCI which are given the green light by the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-on-axar-patels-removal-from-vice-captaincy-2773757-2025-08-19",
      "headline": "Axar Patel deserves an explanation for removal from vice-captaincy: Mohammad KaifFormer India cricketer-turned commentator Mohammad Kaif has said that Axar Patel deserves an explanation from the team management for his removal from the vice captaincy of the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-vice-captain-inclusion-good-decision-sunil-gavaskar-exclusive-2773752-2025-08-19",
      "headline": "Can't exclude player in that form: Gavaskar backs Gill as Asia Cup vice-captainSunil Gavaskar has backed Shubman Gill's appointment as India's Asia Cup vice-captain, calling it a step towards his future captaincy. Gavaskar praised Gill's form, leadership skills, and temperament, stressing his inevitable rise as an all-format leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-withdraws-us-open-mixed-doubles-illness-2773742-2025-08-19",
      "headline": "Jannik Sinner pulls out of inaugural US Open mixed doubles competitionWorld No 1 Jannik Sinner has withdrawn from the US Open mixed doubles event due to illness. The Italian star had retired from his final against Carlos Alcaraz in Cincinnati Masters on Monday, August 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasm-akram-oline-gambling-probed-complained-reports-illegal-promotion-2773717-2025-08-19",
      "headline": "Wasim Akram accused of promoting online gambling app: ReportsFormer Pakistan captain Wasim Akram faces a legal complaint in Lahore for allegedly endorsing a foreign online betting app, with authorities confirming an investigation under the Electronic Crimes Act 2016 after social media evidence surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-all-format-captain-inclusion-vice-captain-aakash-chopra-2773709-2025-08-19",
      "headline": "Shubman Gill India's next all-format captain? Chopra on Asia Cup inclusionShubman Gill's return as India's vice-captain sparks debates ahead of the Asia Cup, with Aakash Chopra seeing him as a future all-format leader, but his spot in the playing XI remains a tricky puzzle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-shreyas-iyers-asia-cup-2025-snub-2773697-2025-08-19",
      "headline": "R Ashwin shocked by Shreyas Iyer's Asia Cup snub: What wrong has he done?Former India all-rounder Ravichandran Ashwin has questioned the selectors for not picking Shreyas Iyer in the squad for the Asia Cup 2025. Iyer wasn't selected despite a strong show in the IPL and the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-vice-captain-inclusion-good-decision-sunil-gavaskar-exclusive-2773752-2025-08-19",
      "headline": "Can't exclude player in that form: Gavaskar backs Gill as Asia Cup vice-captainSunil Gavaskar has backed Shubman Gill's appointment as India's Asia Cup vice-captain, calling it a step towards his future captaincy. Gavaskar praised Gill's form, leadership skills, and temperament, stressing his inevitable rise as an all-format leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-withdraws-us-open-mixed-doubles-illness-2773742-2025-08-19",
      "headline": "Jannik Sinner pulls out of inaugural US Open mixed doubles competitionWorld No 1 Jannik Sinner has withdrawn from the US Open mixed doubles event due to illness. The Italian star had retired from his final against Carlos Alcaraz in Cincinnati Masters on Monday, August 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasm-akram-oline-gambling-probed-complained-reports-illegal-promotion-2773717-2025-08-19",
      "headline": "Wasim Akram accused of promoting online gambling app: ReportsFormer Pakistan captain Wasim Akram faces a legal complaint in Lahore for allegedly endorsing a foreign online betting app, with authorities confirming an investigation under the Electronic Crimes Act 2016 after social media evidence surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-all-format-captain-inclusion-vice-captain-aakash-chopra-2773709-2025-08-19",
      "headline": "Shubman Gill India's next all-format captain? Chopra on Asia Cup inclusionShubman Gill's return as India's vice-captain sparks debates ahead of the Asia Cup, with Aakash Chopra seeing him as a future all-format leader, but his spot in the playing XI remains a tricky puzzle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-shreyas-iyers-asia-cup-2025-snub-2773697-2025-08-19",
      "headline": "R Ashwin shocked by Shreyas Iyer's Asia Cup snub: What wrong has he done?Former India all-rounder Ravichandran Ashwin has questioned the selectors for not picking Shreyas Iyer in the squad for the Asia Cup 2025. Iyer wasn't selected despite a strong show in the IPL and the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jitesh-sharma-comeback-suryakumar-yadav-2773698-2025-08-19",
      "headline": "Comeback man Jitesh Sharma gets big vote of confidence from team managementAsia Cup 2025: Captain Suryakumar Yadav and chief selector Ajit Agarkar backed Jitesh Sharma's inclusion, saying the wicketkeeper-batter deserved to return to the T20I fold after a b breakthrough IPL season with Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-1st-odi-keshav-maharaj-cairns-2773677-2025-08-19",
      "headline": "Keshav Maharaj spins South Africa to emphatic win in ODI series openerAUS vs SA: Keshav Maharaj's brilliant spell of 5 for 33 powered South Africa to a commanding 98-run win over Australia in the first ODI at Cairns. Aiden Markram, Temba Bavuma and Matthew Breetzke shone with the bat before Maharaj ripped through Australia's middle order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-squad-shafali-verma-renuka-singh-talking-points-2773632-2025-08-19",
      "headline": "Shafali snubbed, Renuka returns: Talking points from India Women's World Cup squadIndia named their 15-member squad for the Women's ODI World Cup 2025, with Harmanpreet Kaur as captain and Smriti Mandhana as vice-captain. The tournament begins on September 30, and with home advantage, India will chase their first-ever title after twice finishing runners-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-should-be-in-t20i-team-gautam-gambhirs-old-video-2773634-2025-08-19",
      "headline": "Jaiswal should be in T20I team for next World Cup: Gambhir's old video goes viralAn old video of India head coach Gautam Gambhir has been going viral on social media, where he's asking for Yashasvi Jaiswal's selection in the T20I squad. The clip is gaining traction in the aftermath of Jaiswal's Asia Cup 2025 snub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-played-t20is-shubman-gill-yashasvi-jaiswal-unavailable-ajit-agarkar-2773628-2025-08-19",
      "headline": "Sanju Samson played as Gill, Jaiswal were unavailable in T20Is: Ajit AgarkarThe BCCI chairman of selectors, Ajit Agarkar, made a startling revelation that Sanju Samson was only playing T20 internationals as the likes of Yashasvi Jaiswal and Shubman Gill were unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-squad-announcement-key-pointers-shubman-gill-jasprit-bumrah-2773613-2025-08-19",
      "headline": "India's Asia Cup squad explained: Who's in and who missed out?India's Asia Cup 2025 squad blends experience, in-form talent, and strategic selections. Shubman Gill returns as vice-captain, Jasprit Bumrah leads the pace attack, while Yashasvi Jaiswal and Shreyas Iyer miss out, highlighting team balance priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-squad-selection-press-conference-ajit-agarkar-suryakumar-yadav-2773599-2025-08-19",
      "headline": "Asia Cup: Ajit Agarkar explains Shubman Gill's return, Shreyas Iyer's exclusionSpeaking after announcing India's Asia Cup 2025 squad, selection committee chairman Ajit Agarkar and captain Suryakumar Yadav explained the selection calls. Shubman Gill returned to the 15-man squad as vice-captain while Shreyas Iyer and Yashasvi Jaiswal were dropped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-hardik-pandya-personality-aura-leadership-abhishek-nayar-2773574-2025-08-19",
      "headline": "Hardik Pandya's aura and leadership are invaluable: Abhishek NayarFormer India coach Abhishek Nayar believes that Hardik Pandya remains an invaluable asset to Team India as they gear up for the Asia Cup 2025. He suggested that, alongside his all-round contributions to the field, he brings the added element of leadership as well to the mix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-played-t20is-shubman-gill-yashasvi-jaiswal-unavailable-ajit-agarkar-2773628-2025-08-19",
      "headline": "Sanju Samson played as Gill, Jaiswal were unavailable in T20Is: Ajit AgarkarThe BCCI chairman of selectors, Ajit Agarkar, made a startling revelation that Sanju Samson was only playing T20 internationals as the likes of Yashasvi Jaiswal and Shubman Gill were unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-squad-announcement-key-pointers-shubman-gill-jasprit-bumrah-2773613-2025-08-19",
      "headline": "India's Asia Cup squad explained: Who's in and who missed out?India's Asia Cup 2025 squad blends experience, in-form talent, and strategic selections. Shubman Gill returns as vice-captain, Jasprit Bumrah leads the pace attack, while Yashasvi Jaiswal and Shreyas Iyer miss out, highlighting team balance priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-squad-selection-press-conference-ajit-agarkar-suryakumar-yadav-2773599-2025-08-19",
      "headline": "Asia Cup: Ajit Agarkar explains Shubman Gill's return, Shreyas Iyer's exclusionSpeaking after announcing India's Asia Cup 2025 squad, selection committee chairman Ajit Agarkar and captain Suryakumar Yadav explained the selection calls. Shubman Gill returned to the 15-man squad as vice-captain while Shreyas Iyer and Yashasvi Jaiswal were dropped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-hardik-pandya-personality-aura-leadership-abhishek-nayar-2773574-2025-08-19",
      "headline": "Hardik Pandya's aura and leadership are invaluable: Abhishek NayarFormer India coach Abhishek Nayar believes that Hardik Pandya remains an invaluable asset to Team India as they gear up for the Asia Cup 2025. He suggested that, alongside his all-round contributions to the field, he brings the added element of leadership as well to the mix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-selector-neetu-david-on-shafali-verma-after-world-cup-2025-snub-2773570-2025-08-19",
      "headline": "Shafali Verma still on our radar, says India women's selector after World Cup snubIndia women's cricket team chief selector Neetu David has said that Shafali Verma is still on their radar despite snubbing her from the ICC Women's World Cup 2025 squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-squad-announcement-shubman-gill-playing-xi-easy-inclusion-or-not-2773549-2025-08-19",
      "headline": "Will vice-captain Shubman Gill start for India in Asia Cup? Agarkar explainsShubman Gill's appointment as India's T20I vice-captain for the Asia Cup 2025 sparks debate over his place in the starting XI, as Ajit Agarkar and the selectors weigh form, hierarchy, and a settled top order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-womens-odi-world-cup-2025-australia-odis-2773530-2025-08-19",
      "headline": "Renuka Singh returns in India squad for Women's World Cup, Australia ODIsIndia have included Renuka Singh Thakur as India named their squads for the Women's ODI World Cup and the three-match ODI series against Australia. Shafali Verma, however, didn't find a place in the team for both the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-asia-cup-2025-selection-ajit-agarkar-2773523-2025-08-19",
      "headline": "India want Bumrah for big tournaments, no fixed workload plans: AgarkarAjit Agarkar clarified that Jasprit Bumrah's workload management is not a fixed ordeal. He suggested that India sees him as a key player who they want to take part, especially when it comes to the big games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ajit-agarkar-yashasvi-jaiswal-shreyas-iyer-2773518-2025-08-19",
      "headline": "Not their fault, not ours: Agarkar explains Yashasvi and Shreyas Asia Cup snubAsia Cup 2025: Ajit Agarkar clarified the reasons behind Yashasvi Jaiswal and Shreyas Iyer missing out on India's squad. India's campaign in the tournament starts on September 10 in Dubai. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-question-ajit-agarkar-bcci-mumbai-2773515-2025-08-19",
      "headline": "BCCI stops reporter from asking Pakistan-related questionIndian cricket team chief selector Ajit Agarkar was stopped from responding to questions about Pakistan during the Asia Cup 2025 squad announcement. The BCCI representative at the meeting shut the question down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-squad-asia-cup-t20-shubman-gill-jasprit-bumrah-2773502-2025-08-19",
      "headline": "Shubman Gill vice-captain, Jasprit Bumrah in as India announce Asia Cup squadShubman Gill has been named vice-captain to Suryakumar Yadav as India announced their 15-member squad for the upcoming Asia Cup in the UAE. The eight-team tournament will be held from September 9 to 28, with India placed in Group A alongside Oman, Pakistan, and the UAE."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-bronze-10m-air-pistol-asian-shooting-championship-2773482-2025-08-19",
      "headline": "Manu Bhaker continues consistent run, wins 10m bronze in Asian ChampionshipsManu Bhaker secured a bronze medal in the women's 10m air rifle event at the Asian Shooting Championship. Her consistent performance highlights India's growing strength in continental shooting competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-aus-vs-sa-1st-odi-travis-head-2773462-2025-08-19",
      "headline": "Dewald Brevis' promising ODI debut ends in two balls against Travis HeadAUS vs SA: Dewald Brevis lit up his ODI debut with a first-ball six against Australia in Cairns, but his fireworks ended just two deliveries later as Alex Carey caught him at long-on. The cameo echoed Johann Louw's unique 2008 feat of starting his ODI batting career with a six."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-century-maharashtra-debut-buchi-babu-invitational-2773449-2025-08-19",
      "headline": "After quitting Mumbai, Prithvi Shaw smashes century in maiden knock for MaharashtraBuchi Babu Invitational 2025: Prithvi Shaw made a strong impact with a century in his first competitive match for Maharashtra. The 25-year-old hit a composed hundred on a challenging pitch against Chattisgarh in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-2027-odi-world-cup-ambati-rayudu-2773415-2025-08-19",
      "headline": "Rohit Sharma should continue as India's ODI captain till 2027 World Cup: RayuduAmbati Rayudu supports Rohit Sharma continuing as India's ODI captain ahead of the 2027 World Cup. He emphasises Rohit's leadership and fitness as key to India's success and stresses Virat Kohli's vital role at number three."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-contracts-babar-rizwan-shaheen-2773375-2025-08-19",
      "headline": "Pakistan annual contracts: Babar, Rizwan demoted, no players in Category AThe Pakistan Cricket Board has reshuffled its central contracts for 2025-26. They have taken the big decision of demoting star players Babar Azam and Mohammad Rizwan."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}