{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-from-april-23-tariffs-and-customs-negotiations-on-agenda-2711580-2025-04-19",
      "headline": "India-US trade talks from April 23, tariffs, customs negotiations on agenda: ReportThe Indian official team is visiting the US to give further impetus to the negotiations in the 90-day tariff pause window and discuss these terms of reference to iron out differences on certain issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-thanks-fans-for-jaat-enjoys-nature-walk-before-border-2-shoot-2711732-2025-04-20",
      "headline": "Sunny Deol enjoys nature walk before Border 2 shoot, thanks fans for JaatAmid the massive success of his film 'Jaat', Sunny Deol is unwinding in the valleys. Sharing a serene video on Sunday, the actor thanked fans for their overwhelming love and promised that the sequel would be even more entertaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bombai-ka-babu-incest-identity-inner-conflict-in-dev-anand-suchitras-bold-film-2711699-2025-04-20",
      "headline": "Bombai Ka Babu: Incest, identity, inner conflict in Dev Anand-Suchitra's bold filmIn 'Retro Review' this weekend, we explore 'Bombai Ka Babu', a film starring Dev Anand and Suchitra Sen. It is a hauntingly beautiful setup with the themes of incest and identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-joins-chris-martin-in-surprise-jig-his-1st-after-military-discharge-watch-viral-videos-2711692-2025-04-20",
      "headline": "BTS Jin joins Chris Martin in surprise jig, his 1st after military discharge. VideosBTS Jin surprised his fans when he joined Coldlay's Chris Martin at a concert in Seoul on Saturday. The two performed 'The Astronaut' and 'My Universe' for the crowd, and their videos are now going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-2-detailed-report-akshay-kumar-film-poised-for-a-fantastic-rs-30-crore-weekend-2711669-2025-04-20",
      "headline": "Kesari 2 box office Day 2: Akshay's film poised for a fantastic Rs 30 crore weekendAkshay Kumar's 'Kesari Chapter 2' saw fabulous growth in its collection on the second day, which raised the expectations for its overall run. The film has largely received positive reviews on social media, which will help boost its collection further. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-says-films-cant-be-blamed-for-drug-abuse-amid-shine-tom-chacko-row-2711548-2025-04-19",
      "headline": "Unni Mukundan says films can't be blamed for drug abuse amid Shine Tom Chacko rowAmid the arrest of Malayalam actor Shine Tom Chacko in a drugs case, fellow actor Unni Mukundan has come forward to defend the film industry. He argued that cinema alone should not be blamed for such incidents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/resident-playbook-review-a-spin-off-that-honours-the-legacy-of-hospital-playlist-2711544-2025-04-19",
      "headline": "Resident Playbook review: A spin-off that honours the legacy of Hospital PlaylistReleased-Sat Apr 12, 2025'Resident Playbook' offers a gritty take on the medical drama genre, focusing on the challenges faced by young residents. With emotional depth and realistic portrayals, it stands as a compelling addition to the 'Hospital Playlist' universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-x-twitter-account-gets-hacked-alerts-fans-about-suspicious-activity-2711515-2025-04-19",
      "headline": "Khushboo Sundar alerts fans about suspicious activity after X account gets hackedActor and politician Khushboo Sundar's X account has been hacked. She shared an Instagram post to alert fans about any suspicious activity on her account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-nicola-coughlan-slams-jk-rowling-for-celebratory-post-over-trans-ruling-harry-potter-series-2711510-2025-04-19",
      "headline": "Bridgerton's Nicola Coughlan slams JK Rowling for celebratory post over trans rulingActor Nicola Coughlan on Friday shared a note in her Instagram stories, asking 'Harry Potter' writer JK Rowling to keep her 'Harry Potter lads', after the latter made a celebratory post following the Supreme Court's trans-woman ruling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-visits-tirupati-temple-with-director-raj-nidimoru-2711481-2025-04-19",
      "headline": "Samantha visits Tirupati temple with director Raj NidimoruSamantha visited the Tirupati Balaji Temple along with filmmaker Raj Nidimoru on Saturday. Videos from their divine visit have surfaced on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-mahesh-babu-latest-update-from-ss-rajamouli-ssmb29-has-boat-connection-2711477-2025-04-19",
      "headline": "Priyanka Chopra-Mahesh Babu's latest update from SSMB29 has 'boat' connectionPriyanka Chopra Jonas, Mahesh Babu and Prithviraj Sukumaran are all set to begin the next shoot schedule for SS Rajamouli's next mythology-based film. Here's the latest update from their shoot schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-recalls-being-judged-for-marrying-twice-as-brahmin-devotee-of-lord-ram-2711460-2025-04-19",
      "headline": "Kamal Haasan recalls being judged for marrying twice as Brahmin devotee of Lord RamDuring the promotions of Mani Ratnam's film 'Thug Life', actors Kamal Haasan, Trisha Krishnan, and Simbu shared their personal views on marriage. Kamal Haasan reflected on his past relationships and his stance on the institution of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/phule-director-defends-film-amid-row-caste-discrimination-plagues-our-society-2711470-2025-04-19",
      "headline": "Caste discrimination plagues our society: Phule director defends film amid rowDirector Ananth Mahadevan spoke about objections raised against the portrayal of caste-discrimination in his film, 'Phule'. The filmmaker said India's fight against discrimination is far from over. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-arrested-in-drugs-case-2711468-2025-04-19",
      "headline": "Malayalam actor Shine Tom Chacko, arrested in drugs case, gets bailMalayalam actor Shine Tom Chacko has been arrested by Kerala police. He was charged under Sections 27 and 29 of the Narcotics Drugs and Psychotropic Substances (NDPS) Act. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-director-gopichand-malineni-says-film-was-tweaked-before-backlash-no-filmmaker-wants-to-hurt-2711431-2025-04-19",
      "headline": "Jaat director says film was tweaked before backlash: No filmmaker wants to hurtJaat director Gopichand Malineni finally addressed the controversial church scene in the recently released film. An FIR was filed for allegedly hurting religious sentiments, leading to the scene's removal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonakshi-sinha-as-nikita-roy-in-brother-kussh-sinha-directorial-debut-2711429-2025-04-19",
      "headline": "Sonakshi Sinha as Nikita Roy in brother Kussh's directorial debutSonakshi Sinha is gearing up for her next film, 'Nikita' Roy, which also marks the directorial debut of her brother, Kussh Sinha.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-says-she-was-worshipped-as-damdami-mai-reacts-to-temple-remark-2711415-2025-04-19",
      "headline": "Urvashi Rautela says she was worshipped as 'Damdami Mai', reacts to temple remarkUrvashi Rautela's team released an official statement demanding legal action against those who took her remark on the 'Urvashi Temple' out of context. The actor's team further agreed with her claim about being worshipped as 'Damdami Mai' at Delhi University. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-remembers-irrfan-announces-pikus-re-release-in-theatres-2711413-2025-04-19",
      "headline": "Deepika Padukone remembers Irrfan, announces Piku's re-release in theatresDeepika Padukone, Irrfan and Amitabh Bachchan's 'Piku' will re-release in theatres. The announcement was made by Deepika on April 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ginny-and-georgia-3-teaser-brianne-howey-antonia-gentry-more-drama-and-twists-2711385-2025-04-19",
      "headline": "Ginny & Georgia 3 teaser: The mother-daughter duo return with more drama and twistsThe much-anticipated third season of 'Ginny and Georgia' is set to release soon on Netflix. The new teaser, released on Friday, promises more drama and excitement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lyrics-titles-bollywood-plays-on-nostalgia-and-numerology-dharma-productions-subhash-ghai-swanand-kirkire-2711154-2025-04-19",
      "headline": "From lyrics to titles: How Bollywood plays on nostalgia and numerologyEver wondered why so many film titles sound like your favourite old songs? From catchy hooks to cosmic calculations, Bollywood filmmakers are increasingly turning to iconic lyrics as their film titles. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-reject-nishikant-dubey-dinesh-sharma-remarks-supreme-court-chief-justice-2711670-2025-04-20",
      "headline": "BJP 'completely rejects' MPs' remarks on judiciary, issues warningThe BJP distanced itself from controversial remarks made by MPs Nishikant Dubey and Dinesh Sharma against the Supreme Court, calling them personal opinions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-reacts-as-raj-and-uddhav-thackeray-hint-at-reunion-2711711-2025-04-20",
      "headline": "Devendra Fadnavis reacts as Raj and Uddhav Thackeray hint at reunionThe thaw in relations comes against the backdrop of growing discontent over the BJP-led state government's decision to make Hindi a compulsory third language in schools under the National Education Policy (NEP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tiktok-craze-dubai-chocolate-sparked-worldwide-pistachio-shortage-2711722-2025-04-20",
      "headline": "How a TikTok craze for Dubai chocolate sparked a global pistachio crunchTwo years after the chocolate bars hit the market, a TikTok video amassing more than 120 million views created a worldwide craze for the chocolate, turning it into an overnight global sensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sundar-pichai-google-ceo-vaibhav-suryavanshi-debut-rr-vs-lsg-2711730-2025-04-20",
      "headline": "Woke up to watch 8th grader: Google CEO Pichai praises Vaibhav SuryavanshiSundar Pichai revealed that he woke up early just to watch Vaibhav Suryavanshi's IPL debut live. The Google CEO heaped the 14-year-old's performance in his debut during Rajasthan Royals' clash against Lucknow Super Ginats with a special post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/paneer-iodine-test-viral-social-media-food-scientists-2711674-2025-04-20",
      "headline": "The problem with 'iodine' paneer policingIodine paneer tests are going viral on social media, but they may not be revealing the real truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-omar-abdullah-blasts-delhi-airport-after-srinagar-indigo-flight-diverted-jaipur-2711649-2025-04-20",
      "headline": "'In no mood to be polite': Omar Abdullah livid after Delhi flight divertedJammu and Kashmir Chief Minister Omar Abdullah on Sunday blasted the Delhi airport after his flight to the national capital was reportedly diverted to Jaipur on Saturday night, prompting him to take to his social media platform X to vent his frustration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wife-lover-arrested-trying-run-over-husband-car-madhya-pradesh-gwalior-2711708-2025-04-20",
      "headline": "Video: Wife, lover try to run over man on busy Gwalior road; arrestedA woman and her boyfriend have been arrested in Gwalior for attempting to murder her husband by running him over with a car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-flash-floods-3-dead-dozens-rescued-as-flash-floods-ravage-ramban-2711725-2025-04-20",
      "headline": "3 dead, dozens rescued as flash floods ravage J&K's RambanTen houses were completely destroyed, while 25 to 30 others suffered partial damage. Despite the destruction, a swift response by the Dharamkund police and district administration ensured the safe evacuation of nearly 90 to 100 people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bombai-ka-babu-incest-identity-inner-conflict-in-dev-anand-suchitras-bold-film-2711699-2025-04-20",
      "headline": "Bombai Ka Babu: Incest, identity, inner conflict in Dev Anand-Suchitra's bold filmIn 'Retro Review' this weekend, we explore 'Bombai Ka Babu', a film starring Dev Anand and Suchitra Sen. It is a hauntingly beautiful setup with the themes of incest and identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/home-minister-amit-shah-reveals-weight-loss-journey-urges-youth-exercise-on-world-liver-day-2711472-2025-04-19",
      "headline": "2 hours exercise, 6 hours sleep: Amit Shah on how he beat diabetes in 4 yearsRecollecting his journey towards fitness, Home Minister Amit Shah said that all it took was for him to change his diet, increase the hours of sleep and daily exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kulbhushan-jadhav-right-to-appeal-denied-pakistan-cites-loophole-in-un-icj-court-order-2711682-2025-04-20",
      "headline": "Kulbhushan Jadhav's right to appeal denied, Pak cites loophole in UN court orderPakistan Defence Ministry counsel provided the clarification when he was asked if the same facility of the right to appeal was provided to Kulbhushan Jadhav, and why it was not extended to Pakistani citizens convicted in military courts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-wonder-boy-sanjay-manjrekar-2711716-2025-04-20",
      "headline": "Vaibhav Suryavanshi is the new wonder boy: Sanjay Manjrekar on RR debutantSanjay Manjrekar said Vaibhav Suryavanshi's fearless debut was a proud moment not just for Rajasthan Royals but also for Indian cricket. He praised the youngster's maturity and labelled him a potential \"wonderboy\" of the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elon-musk-to-visit-india-after-call-with-narendra-modi-what-it-means-for-tesla-starlink-spacex-x-and-twitter-2711687-2025-04-20",
      "headline": "Tesla, Starlink, SpaceX and X: Why Elon Musk's India visit mattersElon Musk's upcoming visit to India signals a major step towards expanding Tesla, Starlink, and possibly SpaceX into one of the world's fastest-growing tech markets. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/akshardham-visit-dinner-with-pm-modi-us-vice-president-jd-vance-4-day-india-visit-delhi-jaipur-2711688-2025-04-20",
      "headline": "Akshardham visit, dinner with PM: What's on cards as JD Vance visits India?The US vice president, his wife, Usha, and their three children are scheduled to land at the Palam airbase here at 10 am on Monday on a four-day India visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-property-dealer-killed-maharashtra-2711712-2025-04-20",
      "headline": "Caught on CCTV: Property dealer ambushed, stabbed to death on Nagpur roadNagpur-based property dealer Ankush Kadu was stabbed to death in broad daylight by a group of men at a busy market. The entire incident was captured on CCTV.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-woman-stabbed-to-death-for-resisting-rape-in-a-moving-car-arrested-2711641-2025-04-20",
      "headline": "Lucknow beautician stabbed to death for resisting rape in moving carA woman was stabbed to death when she resisted a rape attempt on her in a moving car. Two accused have been arrested, while one is still absconding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-joins-chris-martin-in-surprise-jig-his-1st-after-military-discharge-watch-viral-videos-2711692-2025-04-20",
      "headline": "BTS Jin joins Chris Martin in surprise jig, his 1st after military discharge. VideosBTS Jin surprised his fans when he joined Coldlay's Chris Martin at a concert in Seoul on Saturday. The two performed 'The Astronaut' and 'My Universe' for the crowd, and their videos are now going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-474-18-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-interpol-red-notice-sheikh-hasina-government-topple-conspiracy-2711659-2025-04-20",
      "headline": "Bangladesh seeks Interpol red corner notice against ex-PM Sheikh HasinaThe Bangladesh Police has requested an Interpol red notice against ex-PM Sheikh Hasina and 11 others over alleged conspiracy to topple the interim government. Hasina fled to India after her regime was overthrown in a student-led uprising.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/meerut/story/meerut-man-alleges-wife-with-four-lovers-planning-his-murder-2711648-2025-04-20",
      "headline": "Wife plotted murder with 4 lovers, alleges Meerut man in police complaintGaurav Sharma, a manager at a publishing company in Meerut, has filed a complaint accusing his wife, Ritanshi Sharma alias Reetu, of immoral behaviour, physical abuse, and conspiring to kill him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-2-detailed-report-akshay-kumar-film-poised-for-a-fantastic-rs-30-crore-weekend-2711669-2025-04-20",
      "headline": "Kesari 2 box office Day 2: Akshay's film poised for a fantastic Rs 30 crore weekendAkshay Kumar's 'Kesari Chapter 2' saw fabulous growth in its collection on the second day, which raised the expectations for its overall run. The film has largely received positive reviews on social media, which will help boost its collection further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suvendu-adhikari-exclusive-bjp-leader-demands-arms-for-locals-amid-bengal-violence-2711537-2025-04-19",
      "headline": "Exclusive: Suvendu Adhikari demands arms for locals amid Bengal violenceAt least three people were killed and thousands of Hindus have had to flee their homes during violence in Murshidabad and North 24 Parganas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/meerut/story/man-tricked-into-marrying-brides-45-year-old-mother-ups-meerut-2711637-2025-04-20",
      "headline": "Man tricked into marrying bride's 45-year-old mother in UP's MeerutThe man claimed that upon lifting the veil, he discovered that he had been married to the woman who was supposed to be his mother-in-law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-follow-vintage-virat-kohli-form-turnaround-2711660-2025-04-20",
      "headline": "Why Pant needs to follow vintage Kohli to turn around IPL 2025 formRishabh Pant has been going through one of his worst phases in the IPL. With his form needs a quick change, should the LSG skipper take a leaf out of vintage Virat Kohli's playbook?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sundar-pichai-google-ceo-vaibhav-suryavanshi-debut-rr-vs-lsg-2711730-2025-04-20",
      "headline": "Woke up to watch 8th grader: Google CEO Pichai praises Vaibhav debutSundar Pichai revealed that he woke up early just to watch Vaibhav Suryavanshi's IPL debut live. The Google CEO heaped the 14-year-old's performance in his debut during Rajasthan Royals' clash against Lucknow Super Ginats with a special post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-wonder-boy-sanjay-manjrekar-2711716-2025-04-20",
      "headline": "Vaibhav Suryavanshi is the new wonder boy: Sanjay Manjrekar on RR debutantSanjay Manjrekar said Vaibhav Suryavanshi's fearless debut was a proud moment not just for Rajasthan Royals but also for Indian cricket. He praised the youngster's maturity and labelled him a potential \"wonderboy\" of the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-dc-gujarat-titans-batter-rahul-tewatia-press-conference-2711703-2025-04-20",
      "headline": "Buttler told me not to think about his hundred, just win the game vs DC: TewatiaGT's Rahul Tewatia said Jos Buttler had encouraged him to go for his shots in the final over and not think about his hundred. Tewatia finished the match with a six and four off Mitchell Starc in the final over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-dc-delhi-capitals-pacer-mukesh-kumar-press-conference-2711696-2025-04-20",
      "headline": "DC would have won if we had fielded better: Mukesh Kumar on loss to GTDelhi Capitals pacer Mukesh Kumar said their loss to Gujarat Titans might have been avoided with sharper fielding and tighter bowling in a few key overs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-lsg-lucknow-super-giants-press-conference-avesh-khan-2711690-2025-04-20",
      "headline": "Vaibhav could be a great prospect in future: Avesh Khan praises RR debutantLSG pacer Avesh Khan praised Vaibhav Suryavanshi's impressive debut, saying it felt great to watch him bat with such freedom. Vaibhav began his IPL journey with a huge six off Shardul Thakur and scored an impactful 34 off 20 balls, including two fours and three sixes. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-focus-on-executing-yorkers-final-over-2711689-2025-04-20",
      "headline": "Focus on executing yorkers: LSG's Avesh Khan explains death over success vs RRIPL 2025: Avesh Khan said he trusted his ability to deliver yorkers under pressure when bowling the last over for LSG in their clash against RR. Even after the dropped catch of Shubham Dubey, Avesh stayed focused on execution, believing that sticking to his strength would bring Lucknow the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-lsg-rajasthan-royals-spin-bowling-coach-sairaj-bahutule-press-conference-2711683-2025-04-20",
      "headline": "Rajasthan are playing good cricket, but results haven't gone our way: RR coachRajasthan Royals' spin bowling coach Sairaj Bahutule said the team has been playing good cricket, but the results haven't gone their way, reflecting on their close defeat to Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-debut-important-opportunity-sairaj-bahutule-2711675-2025-04-20",
      "headline": "Vaibhav Suryavanshi getting his chance was important: RR's Sairaj BahutuleRR assistant Sairaj Bahutule said Vaibhav Suryavanshi's debut wasn't rushed and was based on consistent signs of potential in training. The team believed he was ready, and his confident performance validated that belief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-captain-shubman-gill-penalised-for-his-teams-slow-over-rate-vs-dc-2711673-2025-04-20",
      "headline": "GT captain Shubman Gill penalised for his team's slow over-rate vs DCGujarat Titans captain Shubman Gill was fined Rs 12 lakh for his side's slow over-rate during their seven-wicket win over Delhi Capitals in the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-noor-ahmad-threat-mitchell-santner-press-conference-2711532-2025-04-20",
      "headline": "MI vs CSK: Mitchell Santner talks up Noor Ahmad threat for Mumbai for El ClasicoMitchell Santner talked about the threat posed by Noor Ahmad ahead of the IPL El Clasico between MI and CSK. Noor has been CSK's best bowler so far this season and remains in the hunt for the Purple cap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-lsg-rajasthan-royals-spin-bowling-coach-sairaj-bahutule-press-conference-2711683-2025-04-20",
      "headline": "Rajasthan are playing good cricket, but results haven't gone our way: RR coachRajasthan Royals' spin bowling coach Sairaj Bahutule said the team has been playing good cricket, but the results haven't gone their way, reflecting on their close defeat to Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-debut-important-opportunity-sairaj-bahutule-2711675-2025-04-20",
      "headline": "Vaibhav Suryavanshi getting his chance was important: RR's Sairaj BahutuleRR assistant Sairaj Bahutule said Vaibhav Suryavanshi's debut wasn't rushed and was based on consistent signs of potential in training. The team believed he was ready, and his confident performance validated that belief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-captain-shubman-gill-penalised-for-his-teams-slow-over-rate-vs-dc-2711673-2025-04-20",
      "headline": "GT captain Shubman Gill penalised for his team's slow over-rate vs DCGujarat Titans captain Shubman Gill was fined Rs 12 lakh for his side's slow over-rate during their seven-wicket win over Delhi Capitals in the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-noor-ahmad-threat-mitchell-santner-press-conference-2711532-2025-04-20",
      "headline": "MI vs CSK: Mitchell Santner talks up Noor Ahmad threat for Mumbai for El ClasicoMitchell Santner talked about the threat posed by Noor Ahmad ahead of the IPL El Clasico between MI and CSK. Noor has been CSK's best bowler so far this season and remains in the hunt for the Purple cap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-rahul-tewatia-mitchell-starc-2711631-2025-04-20",
      "headline": "How Rahul Tewatia countered Mitchell Starc in tense last-over chaseIPL 2025, GT vs DC: With Gujarat Titans needing 10 runs to win off the last over, Rahul Tewatia took the attack to Mitchell Starc and helped his team beat Delhi Capitals at the Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-follow-vintage-virat-kohli-form-turnaround-2711660-2025-04-20",
      "headline": "Why Pant needs to follow vintage Kohli to turn around IPL 2025 formRishabh Pant has been going through one of his worst phases in the IPL. With his form needs a quick change, should the LSG skipper take a leaf out of vintage Virat Kohli's playbook?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mi-vs-csk-ipl-2025-chennai-head-coach-stephen-fleming-press-conference-2711593-2025-04-20",
      "headline": "Jadeja, seniors need to step up: Stephen Fleming ahead of MI vs CSKChennai Super Kings head coach Stephen Fleming has urged the senior players in the team to step up. CSK have only 2 out of their first 7 games in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-match-preview-predicted-xi-pitch-report-weather-prediction-2711656-2025-04-20",
      "headline": "Away specialist Bengaluru hope for change of fortunes vs PBKS in reverse fixtureRoyal Challengers Bengaluru and Punjab Kings meet once again just two days after playing the first leg of the fixture in Bengaluru. Will Bengaluru's strong away form this season help them produce a different result?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-chuffed-aiden-markram-2711650-2025-04-20",
      "headline": "Aiden Markram 'chuffed' for Avesh Khan after final over heroicsIPL 2025, RR vs LSG: Aiden Markram praised Avesh Khan for putting in his best efforts during the match against Rajasthan Royals on April 19 at the Sawai Mansingh Stadium in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-csl-ipl-2025-ravi-ashwin-stephen-fleming-2711590-2025-04-20",
      "headline": "Dropped in Lucknow, what's CSK's plan for R Ashwin in IPL 2025?Spinner Ravichandran Ashwin has not been at his best in the IPL 2025. Ahead of their match Chennai Super Kings head coach Stephen Fleming explained why the spinner did not play in Lucknow and what lies ahead of him in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/churchill-brothers-i-league-champions-inter-kashi-cas-2711630-2025-04-20",
      "headline": "Churchill Brothers declared I-League champions, Inter Kashi vow to take CAS routeChurchill Brothers have been declared as the I-League champions and earn promotion to the Indian Super League after the AIFF Appeals Committee ruled against second-placed Inter Kashi. The runners-up of the I-League have now vowed to take the case to the Court of Arbitration for Sport inorder to challenge the decision. in order"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-mitchell-starc-jaipur-2711627-2025-04-20",
      "headline": "Don't want to be Mitchell Starc, just be a good Avesh Khan: LSG bowler on RR heroicsAvesh Khan said that he wasn't trying to do what Mitchell Starc in the final over against RR after guiding LSG to a miraculous win on Saturday, April 19. Avesh defended 9 runs in the final over to guide Lucknow to the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-chuffed-aiden-markram-2711650-2025-04-20",
      "headline": "Aiden Markram 'chuffed' for Avesh Khan after final over heroicsIPL 2025, RR vs LSG: Aiden Markram praised Avesh Khan for putting in his best efforts during the match against Rajasthan Royals on April 19 at the Sawai Mansingh Stadium in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-csl-ipl-2025-ravi-ashwin-stephen-fleming-2711590-2025-04-20",
      "headline": "Dropped in Lucknow, what's CSK's plan for R Ashwin in IPL 2025?Spinner Ravichandran Ashwin has not been at his best in the IPL 2025. Ahead of their match Chennai Super Kings head coach Stephen Fleming explained why the spinner did not play in Lucknow and what lies ahead of him in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/churchill-brothers-i-league-champions-inter-kashi-cas-2711630-2025-04-20",
      "headline": "Churchill Brothers declared I-League champions, Inter Kashi vow to take CAS routeChurchill Brothers have been declared as the I-League champions and earn promotion to the Indian Super League after the AIFF Appeals Committee ruled against second-placed Inter Kashi. The runners-up of the I-League have now vowed to take the case to the Court of Arbitration for Sport inorder to challenge the decision. in order"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-mitchell-starc-jaipur-2711627-2025-04-20",
      "headline": "Don't want to be Mitchell Starc, just be a good Avesh Khan: LSG bowler on RR heroicsAvesh Khan said that he wasn't trying to do what Mitchell Starc in the final over against RR after guiding LSG to a miraculous win on Saturday, April 19. Avesh defended 9 runs in the final over to guide Lucknow to the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-rr-vs-lsg-jaipur-2711624-2025-04-19",
      "headline": "Should have finished the game: Parag blames himself after RR lose to LSGIPL 2025: Riyan Parag scored 39 runs off 26 balls, but Rajasthan Royals (RR) lost by two runs against the Lucknow Super Giants (LSG). With nine runs needed off the last over, RR failed to hold their nerves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-rr-match-report-ipl-2025-avesh-khan-vaibhav-suryavanshi-jaiswal-2711614-2025-04-19",
      "headline": "Rajasthan fumble straightforward chase, lose thriller vs LSGAvesh Khan stunned Rajasthan Royals in Saturday's match in Jaipur, handing them a an unlikely win by 2 runs in what turned out to be an absolute thriller. Avesh's final two overs in the match turned out to be the point of difference between the two sides.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-playoffs-bucks-vs-pacers-lillard-nears-return-from-calf-injury-glbs-2711605-2025-04-19",
      "headline": "NBA Playoffs: Bucks vs Pacers, Lillard nears return from calf injuryThe Milwaukee Bucks are expected to receive a massive boost in their ongoing playoff series against the Indiana Pacers. Star guard Damian Lillard is nearing a return to the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-fans-reactions-debut-2711601-2025-04-19",
      "headline": "Future of India: Vaibhav Suryavanshi stuns IPL teams, fans with fearless 34IPL 2025, RR vs LSG: 14-year-old Vaibhav Suryavanshi earned praise from fans and the cricketing fraternity after scoring 34 runs off 20 balls against the Lucknow Super Giants at the Sawai Mansingh Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-csk-mitchell-santner-press-conference-mumbai-chennai-2711596-2025-04-19",
      "headline": "MI vs CSK: Lot of similarities between Mumbai and Chennai, says Mitchell SantnerMitchell Santner has said that there are a lot of similarities between Mumbai Indians and Chennai Super Kings ahead of the IPL El Clasico clash on Sunday, April 20. Santner has played for CSK and MI in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-shardul-thakur-2711577-2025-04-19",
      "headline": "Watch: 14-year-old Vaibhav hits first-ball six to announce himself on IPL debutIPL 2025, RR vs LSG: 14-year-old Vaibhav Suryavanshi smashed Shardul Thakur for a six over the covers to announce himself after becoming the youngest debutant in the history of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-rishabh-pant-failure-trolled-jaipur-2711576-2025-04-19",
      "headline": "106 off 108: Fans troll Rishabh Pant after another failure in RR vs LSGRishabh Pant was trolled once again after the LSG skipper suffered another failure with the bat in the clash against RR. Pant was dismissed for 3 runs off 9 balls against the Royals as his poor run of form continued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-pakistan-travel-india-hybrid-model-pcb-2711567-2025-04-19",
      "headline": "Pakistan won't travel to India for Women's World Cup 2025: PCB chiefPakistan Cricket Board chief Mohsin Naqvi said the Pakistan women's team will not travel to India for the 50-over World Cup, scheduled to be held from September 29 to October 26, 2025. Pakistan won all five matches in the qualifiers held in Lahore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-womens-odi-world-cup-qualifiers-qualification-net-run-rate-2711565-2025-04-19",
      "headline": "West Indies miss World Cup berth after falling 0.001 behind in Net Run RateWest Indies beat Thailand by six wickets on Saturday, but failed to qualify for the Women's ODI World Cup to be held in India later this year. Bangladesh and Pakistan are the two teams to have gone through to the mega event from the Qualifiers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-jos-buttler-8th-hundred-virat-kohli-2711563-2025-04-19",
      "headline": "GT vs DC: How Jos Buttler sacrificed record IPL hundred for Gujarat winJos Buttler revealed how he decided to sacrifice his 8th IPL hundred to get the win for GT against DC on Saturday, April 19. Buttler scored 97 off 53 balls as Rahul Tewatia hit the winning runs for his side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-ms-dhoni-jasprit-bumrah-interaction-mumbai-2711553-2025-04-19",
      "headline": "Watch: Dhoni, Bumrah keep MI-CSK rivalry aside, share fun conversationMS Dhoni and Jasprit Bumrah put aside the Mumbai Indians-Chennai Super Kings rivalry and engaged in a fun conversation ahead of the IPL El Clasico on Sunday, April 20. Bumrah shares a great bond with Dhoni. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-score-jos-buttler-ahmedabad-points-table-2711549-2025-04-19",
      "headline": "Jos Buttler battles cramps, Delhi bowlers as Gujarat reclaim top spotIPL 2025, GT vs DC: Jos Buttler's unbeaten 98 helped Gujarat Titans successfully chase 204 against Delhi Capitals on a hot Saturday afternoon in Ahmedabad. Gujarat returned to the top of the points table with a hat-trick of wins at home. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}