{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-business-loan-differs-from-a-personal-loan-interest-emis-guideline-2670901-2025-01-27",
      "headline": "How business loan differs from a personal loan?Personal loans can be taken for almost anything, be it meeting medical expenses, buying a car or house, for marriage of a son or daughter, etc."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-oil-turns-to-sweet-crude-as-russian-oil-supplies-tighten-report-2670897-2025-01-27",
      "headline": "Indian Oil turns to sweet crude as Russian oil supplies tighten: ReportThe United States recently imposed sweeping sanctions on Russia, targeting its oil producers and shipping networks. This has made it difficult for many countries, including India, to continue sourcing Russian crude oil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-ceos-4-month-salary-beats-sunder-pichai-and-tim-cook-annual-pay-who-is-he-2670836-2025-01-27",
      "headline": "This CEO's 4-month salary beats Sunder Pichai and Tim Cook's annual pay. Who is he?Niccol, who was earlier the CEO of Chipotle, joined Starbucks in September 2024. He was granted a $5 million sign-on bonus within the first month of stepping into his new role as revealed in company filings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-founder-sridhar-vembu-to-take-new-role-steps-down-as-ceo-social-media-post-shailesh-kumar-davey-2670853-2025-01-27",
      "headline": "Zoho founder Sridhar Vembu to take new role, steps down as CEOSridhar Vembu resigns as Zoho CEO: As part of the leadership transition, Sridhar Vembu has handed over the role of group CEO to Shailesh Kumar Davey, a co-founder of the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-dalal-street-bleeds-sensex-tanks-824-points-nifty-below-23000-2670815-2025-01-27",
      "headline": "Dalal Street bleeds: Sensex tanks 824 points, Nifty below 23,000The S&P BSE Sensex was down 824.29 points to close at 75,366.17, while the NSE Nifty50 lost 263.05 points to end at 22,829.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-government-may-prioritise-infrastructure-and-introduce-supply-chain-reforms-2670760-2025-01-27",
      "headline": "Budget 2025: Will government prioritise infrastructure and supply-chain reforms? Budget 2025 Expectations: Experts hope that Budget 2025 might announce key reforms to strengthen the infrastructure sector, which is the backbone of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shark-tank-india-judge-startups-losing-money-harsh-goenka-shares-post-x-2670790-2025-01-27",
      "headline": "Are Shark Tank India judges losing money? Harsh Goenka shares insightsHarsh Goenka, Chairman of RPG Group, recently shared insights about financial data that revealed losses in companies owned or co-founded by some of the Shark Tank India judges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-check-expected-salary-hike-fitment-factor-and-key-faqs-2670704-2025-01-27",
      "headline": "8th Pay Commission: Check expected salary hike, and key FAQs8th Pay Commission: The government will soon appoint a chairman and two members to the panel to recommend changes in the pay structure of central government employees."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-investors-lose-rs-10-lakh-crore-whats-ahead-for-dalal-street-sensex-nifty-2670712-2025-01-27",
      "headline": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street? Investors on Dalal Street faced losses as stock markets continued to decline, bringing the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) down. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-central-government-scheme-check-eligibility-benefits-and-other-details-2670640-2025-01-27",
      "headline": "Unified Pension Scheme: Check eligibility, benefits and other details hereUnified Pension Scheme: The UPS was approved by the Union Cabinet on August 24, 2024 for nearly 23 lakh central government employees and aims to provide an assured pension benefit for the employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-invites-applications-open-for-new-sebi-chief-who-will-succeed-madhabi-puri-buch-2670636-2025-01-27",
      "headline": "Who will succeed Madhabi Puri Buch? Applications open for new Sebi chiefNew Sebi Chief: The Ministry of Finance has invited applications for the post, with the last date for submission being February 17."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-over-800-points-3-reasons-why-stock-market-is-falling-today-2670616-2025-01-27",
      "headline": "Sensex tanks over 800 points. 3 reasons why stock market is falling todayShare market crash: The S&P BSE Sensex fell 818.36 points to 75,372.10, while the NSE Nifty50 dropped by 257.35 points to 22,834.85 as of 10:35 AM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-sensex-nifty-extend-losses-it-and-metal-stocks-drag-markets-down-2670593-2025-01-27",
      "headline": "Sensex, Nifty extend losses; IT and metal stocks drag markets downStock Market Today: The S&P BSE Sensex tanked 378.29 points to 75,812.17, while the NSE Nifty50 was down by 92.40 points to 22,999.80 as of 9:45 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-to-expect-from-senex-nifty-will-bears-dominate-stock-market-5-things-investors-should-know-2670388-2025-01-26",
      "headline": "Will bears dominate stock market next week? 5 things investors should knowCorporate earnings and key economic data from around the world will likely shape the direction of the stock market, keeping investors on their toes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/70-hour-workweek-are-indians-working-more-or-less-than-the-world-report-work-life-balance-debate-2670331-2025-01-26",
      "headline": "70-hour workweek: Are Indians working more or less than the world?70-hour workweek: It started with Infosys founder Naryana Murthy's statement that young Indians should work 70-hour workweeks for India to develop, which was met with a lot of flak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-middle-class-expectations-5-top-expectations-for-tax-relief-savings-growth-2670054-2025-01-25",
      "headline": "Budget 2025: 5 top middle-class expectations for tax relief and savings growthExperts suggest scrapping the old tax regime and rationalising the income tax slabs under the new regime, would go a long way in making income tax simpler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-fitment-factor-186-percent-hike-in-monthly-pensions-find-out-how-2669984-2025-01-25",
      "headline": "8th Pay Commission may give a 186% boost to pensions. Find out how The fitment factor plays an important role in calculating the updated pay and benefits and is likely to be in the range between 2.28 and 2.86 for the 8th Pay Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stuck-in-middle-income-trap-fareed-zakaria-explain-reason-behind-china-economic-crisis-davos-wef-2669724-2025-01-24",
      "headline": "Stuck in middle-income trap: Fareed Zakaria decodes China's economic crisisFareed Zakaria said that China's economy is not going to grow any time at the six, seven, eight percent that it was growing at previously. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-credit-score-for-getting-personal-loan-check-details-here-2669673-2025-01-24",
      "headline": "How to achieve minimum credit score for getting personal loan? Details hereThe higher the credit score, the greater are the chances for the approval of your loan requests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/interglobe-aviation-indigo-q3-results-net-profit-falls-by-18-pecent-to-rs-2449-ceo-pieter-elbers-2669660-2025-01-24",
      "headline": "InterGlobe Aviation Q3 results: IndiGo operator's net profit falls by 18%Indigo Q3 results: The net profit for the aviation company dropped by 18% to Rs 2,449 crore when compared to Rs 2,998 crore in the same quarter a year ago. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sharda-sinha-son-calls-her-long-awaited-padma-vibhushan-honour-matter-of-pride-2670945-2025-01-27",
      "headline": "Sharda Sinha's son calls her 'long awaited' Padma Vibhushan honour 'matter of pride'Sharda Sinha, the legendary folk singer known for her Chhath songs, was posthumously awarded the Padma Vibhushan. Her son called it a proud moment for Bihar and a message to future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-and-actor-dakota-johnson-at-maha-kumbh-2670923-2025-01-27",
      "headline": "Watch: Coldplay's Chris Martin and actor Dakota Johnson at Maha KumbhColdplay's lead singer Chris Martin and his partner and actor Dakota Johnson were seen arriving at the Maha Kumbh Mela 2025. The band recently concluded the final leg of its Indian concert in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-actor-wi-ha-jun-wants-to-do-a-bollywood-action-film-2670878-2025-01-27",
      "headline": "Squid Game actor Wi Ha-jun wants to do a Bollywood action filmSouth Korean star Wi Ha-jun wants to do a Bollywood action film. In a conversation with India Today Digital, he also opened up about BTS singer V's rumoured cameo appearance in Squid Game Season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-trailer-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-premiere-on-february-7-2670852-2025-01-27",
      "headline": "Mrs trailer: Sanya Malhotra leads film about a woman's quest for her identityThe trailer of Mrs released on January 27. Featuring Sanya Malhotra in the main role, the film will release on Zee 5 on February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wont-perform-infrastructure-remark-social-media-criticism-reactions-coldplay-ahmedabad-concert-2670783-2025-01-27",
      "headline": "X users turn on Diljit Dosanjh after Coldplay's Ahmedabad triumph: Stop complainingAfter Coldplay's massive final concert in Ahmedabad, singer Diljit Dosanjh came under fire from X users for his remarks that he would not perform in India again due to inadequate infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-lee-byung-hun-on-squid-game-2-frontman-chemistry-with-gi-hun-hollywood-and-indian-cinema-2670759-2025-01-27",
      "headline": "Exclusive: Lee Byung-hun on Lee Jung-jae, Squid Game 2, working in BollywoodLee Byung-hun recently sat down with India Today Digital where he discussed Squid Game, his chemistry with Lee Jung-jae, and if he would work in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-video-singer-guru-randhawa-celebrates-republic-day-soldiers-in-baramulla-kashmir-2670727-2025-01-27",
      "headline": "Watch: Singer Guru Randhawa celebrates Republic Day with soldiers in KashmirGuru Randhawa marked Republic Day in Baramulla, Kashmir, with soldiers. He paid tribute to their service and was honoured by the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-makes-history-with-ahmedabad-concert-but-it-is-not-a-world-record-2670745-2025-01-27",
      "headline": "Coldplay makes history with Ahmedabad concert, but it's not a world recordColdplay on Sunday created history by delivering its biggest-ever concert in Ahmedabad, Gujarat. However, the band couldn't surpass the world record of having the largest number of attendees at a concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-trailer-pratik-gandhi-and-yami-gautam-promise-a-fun-valentines-film-2670729-2025-01-27",
      "headline": "Dhoom Dhaam trailer: Pratik Gandhi and Yami Gautam promise a fun Valentine's filmThe first trailer of the upcoming Netflix release, Dhoom Dhaam, is here. The film promises an exciting blend of romance and adventure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-dakota-johnson-stroll-in-ahmedabad-post-coldplays-biggest-concert-january-26-2670659-2025-01-27",
      "headline": "Chris Martin, Dakota Johnson stroll in Ahmedabad post Coldplay's biggest concertChris Martin and Dakota Johnson were seen strolling in Ahmedabad post Coldplay's grand concert. The couple was spotted on Judges Road, surrounded by fans and bodyguards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-upset-alka-yagnik-shreya-ghoshal-kishore-kumar-padma-awards-2025-2670672-2025-01-27",
      "headline": "Sonu Nigam upset over Alka Yagnik, Shreya Ghoshal not receiving Padma awardsPadma Awards 2025: Singer Sonu Nigam expressed his thoughts on Alka Yagnik, Shreya Ghoshal and other prominent Indian singers not receiving Padma awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-becomes-first-international-artiste-to-perform-in-bhutan-2670655-2025-01-27",
      "headline": "Video: Ed Sheeran becomes first international artiste to perform in BhutanBritish singer Ed Sheeran has become the first international artiste to perform in Bhutan. Ed reflected on the experience on social media and said that he was happy and honoured to have held a concert in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-11-hanumantha-lamani-wins-trophy-kichcha-sudeep-bids-adieu-to-reality-show-2670577-2025-01-27",
      "headline": "Bigg Boss Kannada 11: Hanumantha Lamani wins trophy, Sudeep bids adieu to showHanumantha Lamani, who was a wild card entrant on the show, won Bigg Boss Kannada Season 11. Host Kichcha Sudeep bid adieu to the reality show after 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-wraps-india-tour-we-will-never-forget-two-weeks-chris-martin-2670548-2025-01-27",
      "headline": "Coldplay signs off after whirlwind India tour: We'll never forget these two weeksColdplay held its biggest-ever concert in Ahmedabad, India, on January 26. Sharing a photo of the packed stadium, the British rock band said that they will never forget the two weeks they spent in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-pauses-my-universe-to-ensure-fan-safety-at-ahmedabad-show-2670513-2025-01-26",
      "headline": "Chris Martin pauses My Universe to ensure fan safety at Ahmedabad showDuring Sunday's concert in Ahmedabad, Coldplay's lead singer Chris Martin paused mid-performance to ensure the safety of a fan. The moment was captured during the show's live-streaming on Disney+ Hotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-indian-band-telangana-ahmedabad-concert-2670511-2025-01-26",
      "headline": "Chris Martin jokes he is from Telangana, calls Coldplay an Indian bandDuring their recent performance in India, Coldplay's lead singer, Chris Martin, joked about being born here. The British rock band concluded their India tour with a final concert in Ahmedabad on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-sings-everglow-with-fan-couple-at-ahmedabad-concert-2670485-2025-01-26",
      "headline": "Chris Martin sings Everglow with fan couple at Ahmedabad concertDuring the Ahmedabad concert, Chris Martin performed Coldplay's popular song Everglow with a fan couple. The heartfelt moment was streamed live on Disney+ Hotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/india-new-frontier-of-live-entertainment-anand-mahindra-after-a-coldplay-record-2670480-2025-01-26",
      "headline": "India new frontier of live entertainment: Anand Mahindra after a Coldplay 'record'Anand Mahindra shared a stunning aerial video of Coldplay's concert in Ahmedabad, emphasising India's growing stature in global live entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplays-chris-martin-speaks-in-hindi-in-ahmedabad-show-2670475-2025-01-26",
      "headline": "Most Hindi I've ever learned: Chris Martin's thank you at massive Ahmedabad showColdplay's Chris Martin thrilled fans by speaking in Hindi during the Ahmedabad concert on January 26. He greeted the audience in Hindi and extended Republic Day wishes, leaving fans delighted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-11-grand-finale-when-and-where-to-watch-kichcha-sudeep-show-2670454-2025-01-26",
      "headline": "Bigg Boss Kannada 11 grand finale: When and where to watch Kichcha Sudeep showThe highly-anticipated grand finale of Bigg Boss Kannada 11 will be held on Sunday, January 26. It is hosted by Kichcha Sudeep. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-speaks-to-us-president-donald-trump-on-phone-2670944-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi speaks to 'dear friend' Trump: 'We are committed to a trusted partnership'Prime Minister Narendra Modi spoke with US President Donald Trump discussed bilateral relations during their telephonic conversation. This was PM Modi's first conversation with Trump since the US President began his second term in office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-kailash-mansarovar-yatra-resume-direct-flights-2670962-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, China agree to resume Kailash Mansarovar Yatra, direct flightsIndia and China agreed to resume the Kailash Mansarovar Yatra and direct flights between the two nations in 2025, which marks the 75th anniversary of the establishment of diplomatic relations between New Delhi and Beijing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/man-in-hubballi-karnataka-dies-by-suicide-alleges-wifes-harassment-in-death-note-2670933-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man dies by suicide, claims harassment by wife in note: 'She wants my death'A man in Hubballi, Karnataka, died by suicide leaving a note blaming his wife for harassment. Authorities are investigating the allegations and frequent domestic conflicts reported prior to his death.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-prayagraj-mahakumbh-flight-tickets-expensive-travelling-maldives-2670942-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A return ticket from Maha Kumbh can be more expensive than travelling to MaldivesHigh airfares during the key snan days of the Maha Kumbh could negatively impact Indian tourism, especially in comparison to leading international destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indias-travel-trends-for-2025-2670904-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How will Indians travel in 2025?Indians are venturing beyond traditional hotspots, seeking authenticity, cultural immersion, and sustainable adventures this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-immigrant-targets-of-maga-tirade-america-h-1b-visa-jobs-us-doge-vivek-ramaswamy-trump-executive-order-2670749-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indians in US: From model immigrants to targets of MAGA tiradeIndians, one of the finest examples of model immigrants in the US, have become the latest punching bags for the Make America Great Again (MAGA) army on social media. From the H-1B issue of \"they are taking our jobs\" to claims of \"casteist attitudes\", Indians are facing online attacks, and fear real-life harassment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/what-is-deepseek-r1-ai-and-why-is-everyone-talking-about-it-story-in-5-points-2670808-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is DeepSeek R1 AI and why is everyone talking about it: Story in 5 pointsIf you are keeping an eye on AI stuff, you must have come across DeepSeek. This is a new AI model, but unlike the ones that we have seen so far, this one comes from China, and it has set the world of AI abuzz. But what is DeepSeek, and why is everyone talking about it? We explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mallikarjun-kharge-says-bjp-leaders-competing-to-take-dips-in-ganga-bjp-reacts-2670866-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Does taking a dip remove poverty? Row over Mallikarjun Kharge's Maha Kumbh remarkCongress President Mallikarjun Kharge questioned the significance of taking a holy dip in the Ganga, asking whether such rituals could address critical issues like poverty and unemployment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-controversy-explained-what-was-the-objection-to-vicky-kaushal-film-2670830-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava controversy explained: What was the objection to Vicky Kaushal's filmObjections were raised against a song in Chhaava, a film based on Maratha king Chhatrapti Sambhaji Maharaj. Several ministers and Maratha outfits raised concerns about the song featuring Vicky Kaushal and Rashmika Mandanna performing the Lezim dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/tale-of-a-jacket-in-delhi-polls-whos-richer-kejriwal-rahul-or-modi-2670773-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tale of a jacket in Delhi polls: Who's richer—Kejriwal, Rahul or Modi?The election campaign has spotlighted the Big Three's lifestyles and financial disclosures. They showcase contrasting trajectories of governance, image and public perception\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-training-ranji-trophy-return-sanjay-bangar-2670954-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inside Virat Kohli's Alibaug training camp: Cement slabs, focus on backfoot playSenior India batter Virat Kohli trained ahead of his rumoured return to Ranji Trophy. Kohli was seen practising under the watchful eyes of Sanjay Bangar, the former batting coach of the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/23-harvard-mbas-jobless-stanford-wharton-ivy-league-similar-trend-unemployment-problems-2670884-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "23% Harvard MBAs are jobless, Stanford and Wharton see similar trend. But why?A recent report noted that 23% of MBA graduates from Harvard Business School remained unemployed in 2024 even after three months of graduation. Similar numbers were noted at other Ivy League colleges like Stanford Graduate School and Wharton School. What is the reason behind these unemployment struggles?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/r-vaishali-handshake-nodirbek-yakubboev-explains-snub-lengthy-post-social-media-2670791-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uzbek player explains handshake snub with Vaishali, apologises in lengthy postGrandmaster Yakubboev Nordirbek said he refused to shake hands with R Vaishali earlier in January at a Tata Steel Chess tournament due to religious reasons. The 23-year-old created a stir with his gesture as video clip went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vayu-sena-medal-to-wing-commander-akshay-saxena-for-daring-arabian-sea-operation-2670831-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vayu Sena medal to Wing Commander Akshay Saxena for daring Arabian Sea operationWing Commander Akshay Saxena was in 2024 tasked with a mission in support of operation Sankalp aimed at coercing 35 pirates onboard a merchant ship to surrender and ensure the safe evacuation of 17 crew members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-calls-iitians-arrogant-insufferable-elitist-viral-post-sparks-debate-2670960-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman calls IITians 'arrogant, insufferable, elitist.' Viral post sparks debate In a post that has now gone viral with over 2 lakh views, the woman criticised IITians - particularly those from top-tier IITs and high-ranking branches - and claimed that they display \"arrogance\" and \"elitism\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/aap-haryana-to-delhi-water-supply-increased-ammonia-election-commission-seeks-report-2670861-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Poll body seeks Haryana's reply after AAP claims high ammonia in Delhi water: SourcesThe Election Commission of India (ECI) has sought a response from the Haryana government by Tuesday noon (January 28) regarding allegations of increased ammonia levels in the water supplied from Haryana to Delhi, which has purportedly disrupted water availability in the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-claims-zepto-prices-differ-on-android-vs-iphone-shares-screenshots-2670898-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru woman claims Zepto prices differ on android vs iPhone, shares screenshotsVinita Singh, founder of a company named Horse Power, shared two screenshots in her post and claimed that the price of capsicum on Zepto's app on both android and iPhone was different. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-becomes-6th-indian-to-win-icc-test-cricketer-of-the-year-2670797-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bumrah becomes 6th Indian to win ICC Test Cricketer of the YearIndian pacer Jasprit Bumrah has been crowned the ICC Men's Test Cricketer of the Year 2024. Jasprit Bumrah picked up 71 wickets from 13 Test matches in 2024, topping the charts. He was clear of second-placed Gus Atkinson, who took 52 wickets from 11 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/middle-children-canadian-study-more-agreeable-co-operative-honest-2670980-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Middle children are more agreeable, co-operative and honest, finds studyA new study led by psychology professors at two Canadian universities found that middle children are more cooperative, agreeable and honest than their siblings, and that these personality traits become more pronounced in larger families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/wholl-lead-faction-ridden-congress-in-kerala-2670801-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who'll lead faction-ridden Congress in Kerala?Party begins exercise to pick the next state president, but infighting and aspirants' personal ambitions threaten to weaken the assembly election charge against the LDF\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wont-perform-infrastructure-remark-social-media-criticism-reactions-coldplay-ahmedabad-concert-2670783-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "X users turn on Diljit Dosanjh after Coldplay's Ahmedabad triumph: Stop complainingAfter Coldplay's massive final concert in Ahmedabad, singer Diljit Dosanjh came under fire from X users for his remarks that he would not perform in India again due to inadequate infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-and-actor-dakota-johnson-at-maha-kumbh-2670923-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Coldplay's Chris Martin and actor Dakota Johnson at Maha KumbhColdplay's lead singer Chris Martin and his partner and actor Dakota Johnson were seen arriving at the Maha Kumbh Mela 2025. The band recently concluded the final leg of its Indian concert in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/sanctions-solutions-stalemate-trump-options-on-iran-nuke-deal-opinion-2670822-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sanctions, solutions, stalemate: Trump's options on Iran's nuke dealTrump's second term presents an opportunity to redefine the US-Iran relationship, especially as tensions over the latter's advancing nuclear capabilities escalate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-ceos-4-month-salary-beats-sunder-pichai-and-tim-cook-annual-pay-who-is-he-2670836-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "This CEO's 4-month salary beats Sunder Pichai and Tim Cook's annual pay. Who is he?Niccol, who was earlier the CEO of Chipotle, joined Starbucks in September 2024. He was granted a $5 million sign-on bonus within the first month of stepping into his new role as revealed in company filings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-most-dangerous-stunt-of-career-and-mahesh-bhatt-reaction-2670988-2025-01-27",
      "headline": "Akshay Kumar reveals most dangerous stunt of career and Mahesh Bhatt's reactionActor Akshay Kumar recalls the dangerous stunt he performed for the 1998 film Angaaray, revealing that director Mahesh Bhatt fled, fearing for his life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pics-dakota-johnson-interacts-with-coldplay-crew-fans-shower-love-2670974-2025-01-27",
      "headline": "Pics: Dakota Johnson interacts with Coldplay crew, fans shower loveDakota Johnson was recently seen with Coldplay's crew, interacting with them. She and Chris Martin attended the Maha Kumbh Mela 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-reloaded-ott-release-date-time-allu-arjun-film-on-netflix-but-not-in-hindi-2670939-2025-01-27",
      "headline": "Pushpa 2 The Rule Reloaded to release on Netflix, but not in HindiAfter a phenomenal box office run, Allu Arjun's Pushpa 2: The Rule Reloaded will stream on Netflix with 24 minutes of additional footage. Here's all about its OTT release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-says-he-was-set-to-direct-rajinikanth-l2-empuraan-2670905-2025-01-27",
      "headline": "Prithviraj Sukumaran says he was set to direct RajinikanthMalayalam actor-director Prithviraj Sukumaran revealed his close brush with directing Tamil superstar Rajinikanth. He revealed how he couldn't meet the script deadline but also hopes for future collaboration."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-arshdeep-singh-haris-rauf-t20i-record-india-vs-england-2670969-2025-01-27",
      "headline": "Unstoppable Arshdeep Singh eyes Haris Rauf's all-time T20I record IND vs ENG: Indian youngster Arshdeep Singh is nearing the record for becoming the fastest pacer to the landmark of 100 wickets in Men's T20Is. Pakistan's Haris Rauf currently holds the record in 71 T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shami-fitness-sitanshu-kotak-reaction-2670950-2025-01-27",
      "headline": "Shami fit but Suryakumar-Gambhir will decide if he plays in Rajkot: Sitanshu KotakIndia's new batting coach, Sitanshu Kotak, dismissed any fitness concerns surrounding Mohammed Shami but added that Suryakumar Yadav and Gautam Gambhir will decide the pacer's participation in the series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-training-ranji-trophy-return-sanjay-bangar-2670954-2025-01-27",
      "headline": "Inside Virat Kohli's Alibaug training camp: Cement slabs, focus on backfoot playSenior India batter Virat Kohli trained ahead of his rumoured return to Ranji Trophy. Kohli was seen practising under the watchful eyes of Sanjay Bangar, the former batting coach of the Indian team.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-grateful-nca-injury-recovery-2670949-2025-01-27",
      "headline": "Recovery takes a team: Kuldeep grateful to NCA after returning from injuryKuldeep Yadav thanked the staff at the National Cricket Academy (NCA) for helping him recover from injury. The Indian spinner hasn't played any form of cricket since the Bengaluru Test against New Zealand back in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-novak-djokovic-statue-melbourne-park-2670921-2025-01-27",
      "headline": "Statue of Djokovic at Melbourne Park? Australian Open director opens upAustralian Open: Tournament director Craig Tiley said that players like Novak Djokovic, Roger Federer, and Serena Williams should be honoured with statues for their contributions to tennis over the years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-2025-tickets-how-to-buy-pakistan-2670888-2025-01-27",
      "headline": "How to buy Champions Trophy tickets for matches in Pakistan?Champions Trophy 2025: The PCB and the ICC jointly released the ticketing details of the matches in Karachi, Lahore and Rawalpindi. Tickets will go live for sale on Tuesday, January 28. Details of India's matches in Dubai are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bbl-final-mitchell-owen-fastest-hundred-australia-youngster-ipl-auction-2670868-2025-01-27",
      "headline": "Who is Mitchell Owen? 23-year-old smashes fastest hundred in BBL final Big Bash League 14 final: Mitchell Owen made heads turn with a match-winning hundred which came in only 39 balls in the final for Hobart Hurricanes. The 23-year-old had registerred for the IPL auction, but did not make it to the shortlist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bbl-2024-25-mitchell-owen-hobart-hurricanes-sydney-thunder-maiden-title-2670864-2025-01-27",
      "headline": "Mitchell Owen's record century powers Hurricanes to maiden BBL title  BBL 2024-25: Mitchell Owen smashed 108 runs off 42 balls as Hobart Hurricanes lifted the title for the first time after beating Sydney Thunder by seven wickets at the Bellerive Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mark-wood-ind-vs-eng-rajkot-t20i-2670860-2025-01-27",
      "headline": "Mark Wood on Bazball's impact: England bowlers not concerned about leaking runsAfter Jofra Archer leaked 60 runs in 4 overs while defending 165, Mark Wood came to his defence ahead of the 3rd T20I in Rajkot. Wood said that under McCullum, the focus was on picking up wickets and not on defensive bowling to keep a check on runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-captain-shan-masood-disrespectful-reporter-presser-2670854-2025-01-27",
      "headline": "Watch: Pakistan captain snaps at 'disrespectful' reporter in heated presserPakistan Test captain Shan Masood was involved in a fiery exchange with a local reporter after his side's 120-run loss to the West Indies in the second Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/naomi-girma-becomes-first-million-dollar-player-in-women-football-2670826-2025-01-27",
      "headline": "Chelsea's Naomi Girma becomes first million-dollar player in women's footballChelsea has signed Naomi Girma, the first female million-dollar footballer, for a world-record transfer price of around 900,000 pounds ($1.12 million)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bbl-final-mitchell-owen-fastest-hundred-australia-youngster-ipl-auction-2670868-2025-01-27",
      "headline": "Who is Mitchell Owen? 23-year-old smashes fastest hundred in BBL final Big Bash League 14 final: Mitchell Owen made heads turn with a match-winning hundred which came in only 39 balls in the final for Hobart Hurricanes. The 23-year-old had registerred for the IPL auction, but did not make it to the shortlist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bbl-2024-25-mitchell-owen-hobart-hurricanes-sydney-thunder-maiden-title-2670864-2025-01-27",
      "headline": "Mitchell Owen's record century powers Hurricanes to maiden BBL title  BBL 2024-25: Mitchell Owen smashed 108 runs off 42 balls as Hobart Hurricanes lifted the title for the first time after beating Sydney Thunder by seven wickets at the Bellerive Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mark-wood-ind-vs-eng-rajkot-t20i-2670860-2025-01-27",
      "headline": "Mark Wood on Bazball's impact: England bowlers not concerned about leaking runsAfter Jofra Archer leaked 60 runs in 4 overs while defending 165, Mark Wood came to his defence ahead of the 3rd T20I in Rajkot. Wood said that under McCullum, the focus was on picking up wickets and not on defensive bowling to keep a check on runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-captain-shan-masood-disrespectful-reporter-presser-2670854-2025-01-27",
      "headline": "Watch: Pakistan captain snaps at 'disrespectful' reporter in heated presserPakistan Test captain Shan Masood was involved in a fiery exchange with a local reporter after his side's 120-run loss to the West Indies in the second Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/naomi-girma-becomes-first-million-dollar-player-in-women-football-2670826-2025-01-27",
      "headline": "Chelsea's Naomi Girma becomes first million-dollar player in women's footballChelsea has signed Naomi Girma, the first female million-dollar footballer, for a world-record transfer price of around 900,000 pounds ($1.12 million)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-match-highlights-jomel-warrican-celebration-sajid-khan-2670825-2025-01-27",
      "headline": "Watch: Jomel Warrican taunts Sajid Khan with 'thigh-five' celebrationPakistan vs West Indies: Spinner Jomel Warrican gave a hilarious send-off to Pakistan's Sajid Khan after the visitors won the 2nd Test match in Multan. Warrican taunted Sajid with 'you can't see me' celebration after he helped Windies bowl out Pakistan in the final innings of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-ind-vs-eng-england-keep-faith-in-struggling-batting-line-up-for-3rd-t20i-vs-india-in-rajkot-2670819-2025-01-27",
      "headline": "England keep faith in struggling batting line up for 3rd T20I vs India in RajkotThe England team management continued to show faith in their struggling batting line up as they announced their playing XI for the third T20I against India in Rajkot. The Jos Buttler-led side is trailing by 0-2 in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-becomes-6th-indian-to-win-icc-test-cricketer-of-the-year-2670797-2025-01-27",
      "headline": "Bumrah becomes 6th Indian to win ICC Test Cricketer of the YearIndian pacer Jasprit Bumrah has been crowned the ICC Men's Test Cricketer of the Year 2024. Jasprit Bumrah picked up 71 wickets from 13 Test matches in 2024, topping the charts. He was clear of second-placed Gus Atkinson, who took 52 wickets from 11 Tests. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/r-vaishali-handshake-nodirbek-yakubboev-explains-snub-lengthy-post-social-media-2670791-2025-01-27",
      "headline": "Uzbek player explains handshake snub with Vaishali, apologises in lengthy postGrandmaster Yakubboev Nordirbek said he refused to shake hands with R Vaishali earlier in January at a Tata Steel Chess tournament due to religious reasons. The 23-year-old created a stir with his gesture as video clip went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-suresh-raina-praises-rohit-sharma-for-selecting-yashasvi-jaiswal-for-champions-trophy-2670778-2025-01-27",
      "headline": "Hats off to Rohit for selecting Jaiswal without playing any ODI: Suresh RainaICC Champions Trophy: Former India cricketer Suresh Raina has heaped praise on India captain Rohit Sharma and the selectors for including Yashasvi Jaiswal in the squad for the ICC Champions Trophy 2025 without him playing an ODI game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-babar-azam-test-form-fans-reaction-multan-2670777-2025-01-27",
      "headline": "Drop Babar Azam: Fans furious after Pakistan suffer humbling home loss in MultanPakistan vs West Indies: Former captain Babar Azam managed just 45 runs in four innings in the Test series. Pakistan lost a Test at home to the West Indies for the first time in 34 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-smriti-mandhana-odi-cricketer-of-the-year-2024-2670757-2025-01-27",
      "headline": "Smriti Mandhana wins ICC Women's ODI Cricketer of the Year award, scripts historyICC Awards: Smriti Mandhana became the first Indian to win the ICC Women's ODI Cricketer of the Year award for the second time. Smriti was a cut above the rest in the 50-over format last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-ab-de-villiers-played-for-the-wrong-franchise-in-ipl-says-sanjay-manjrekar-2670753-2025-01-27",
      "headline": "AB de Villiers played for the wrong franchise in IPL: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has made a big statement saying that the legendary South Africa batter AB de Villiers played for the wrong franchise in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-suresh-raina-praises-rohit-sharma-for-selecting-yashasvi-jaiswal-for-champions-trophy-2670778-2025-01-27",
      "headline": "Hats off to Rohit for selecting Jaiswal without playing any ODI: Suresh RainaICC Champions Trophy: Former India cricketer Suresh Raina has heaped praise on India captain Rohit Sharma and the selectors for including Yashasvi Jaiswal in the squad for the ICC Champions Trophy 2025 without him playing an ODI game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-babar-azam-test-form-fans-reaction-multan-2670777-2025-01-27",
      "headline": "Drop Babar Azam: Fans furious after Pakistan suffer humbling home loss in MultanPakistan vs West Indies: Former captain Babar Azam managed just 45 runs in four innings in the Test series. Pakistan lost a Test at home to the West Indies for the first time in 34 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-smriti-mandhana-odi-cricketer-of-the-year-2024-2670757-2025-01-27",
      "headline": "Smriti Mandhana wins ICC Women's ODI Cricketer of the Year award, scripts historyICC Awards: Smriti Mandhana became the first Indian to win the ICC Women's ODI Cricketer of the Year award for the second time. Smriti was a cut above the rest in the 50-over format last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-news-ab-de-villiers-played-for-the-wrong-franchise-in-ipl-says-sanjay-manjrekar-2670753-2025-01-27",
      "headline": "AB de Villiers played for the wrong franchise in IPL: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has made a big statement saying that the legendary South Africa batter AB de Villiers played for the wrong franchise in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awards-azmatullah-omarzai-mens-odi-cricketer-award-2670742-2025-01-27",
      "headline": "Azmatullah Omarzai becomes 1st Afghanistan player to win ICC ODI Player of Year awardICC Awards: All-rounder Azmatullah Omarzai became the first Afghanistan cricketer to win the ICC men's ODI Cricketer of the Year award. The 24-year-old all-rounder was honoured for his consistent showing in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-2024-25-hobart-hurricanes-vs-sydney-thunder-david-warner-live-updates-2670734-2025-01-27",
      "headline": "BBL 2024-25 Highlights, Hurricanes vs Thunder LIVE: Mitchell Owen century gives Hobart maiden title BBL 2024-25 Final Live Updates: Hobart Hurricanes won the title after beating Sydney Thunder by seven wickets in the final at the Bellerive Oval. Mitchell Owen smacked 108 runs off 42 balls as the Hurricanes chased down 185 in 14.1 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghanistan-womens-cricket-australia-exhibition-t20-match-2670725-2025-01-27",
      "headline": "Australia look at T20 match for rise of Afghanistan women's cricketBefore the T20 exhibition match between Afghanistan Women's XI and a Cricket Without Borders XI, Cricket Australia chief executive Nick Hockley lauded the Afghan women for their passion and love towards the game of cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pak-vs-wi-pakistan-vs-west-indies-2nd-test-jomel-warrican-self-belief-multan-test-victory-2670718-2025-01-27",
      "headline": "How West Indies' enormous 'self-belief' fuelled their historic win vs PakistanWest Indies managed to beat Pakistan by 120 runs in the second Test of the two-match series in Multan. The visitors made a sensational comeback after being reduced to 52/8 on Day 1."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}