{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-indian-tech-founders-can-register-a-global-company-online-in-4-hours-and-enjoy-0-tax-on-reinvested-profits-2765929-2025-08-04",
      "headline": "Why Estonia is the new favourite for Indian startupsAccording to an investment banker, top business leaders have already adopted Estonia's unique e-residency, allowing them to do business across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-probes-banks-in-rs-17000-crore-loan-fraud-linked-to-anil-ambani-2765906-2025-08-04",
      "headline": "ED probes banks in Rs 17,000 crore loan fraud linked to Anil AmbaniThe Enforcement Directorate (ED) is investigating why 39 banks failed to report a loan fraud of ₹17,000 crore linked to companies of businessman Anil Ambani. The agency suspects that the banks' silence may have been bought. The central question being investigated is, \"Was there a certain bribe that was paid to the banks to buy their silence?\" The ED has asked the banks to explain their inaction, especially when the loans turned into non-performing assets (NPAs). As the money laundering investigation mounts, Anil Ambani has been summoned to appear on the 5th of August. The ED has also summoned his top executives and close aides, including Amitabh Jhunjhunwala and Satish Seth, believing they hold key information on how the alleged frauds and payment of bribes occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI exclusive: How much are public sector banks spending on recovery agents?India Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-whats-better-for-you-in-fy-2024-25-2765913-2025-08-04",
      "headline": "Old vs new tax regime: What's better for you in FY 2024–25?With the ITR filing deadline extended to September 15, 2025, you've got more time to pick the right tax regime. Should you stick to the old one with its deductions, or go for the new one with lower rates?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-probe-summons-anil-ambani-top-executives-questions-39-bank-rs-17000-crore-loan-fraud-2765902-2025-08-04",
      "headline": "ED summons Anil Ambani's top aides; probes banks over Rs 17,000 crore loan fraudDays after summoning Anil Ambani, the Enforcement Directorate (ED) has now issued summons to several of his top executives for questioning under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mango-millionaire-radhika-gupta-niranjan-avasthi-sips-investing-financial-freedom-2765882-2025-08-04",
      "headline": "'Mango Millionaire' authors Radhika Gupta, Niranjan Avasthi on SIPs, investing and moreIn this exclusive Q&A interaction, Gupta and Avasthi reflect on the core ideas in their book, the pitfalls of social media-driven investing, why SIPs still matter, and what India needs to change in the way it talks about money and long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-dubai-property-with-credit-cards-why-many-indians-are-now-in-trouble-2765838-2025-08-04",
      "headline": "Buying Dubai property with credit cards? Why many Indians are now in troubleSeveral homebuyers either clicked on payment links shared by Dubai-based builders or swiped their credit cards during their visits to the UAE. It felt hassle-free, no paperwork, no visits to the bank. But there's a catch. Read here to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijaykumar-earned-rs-95-crore-who-are-india-top-highest-paid-it-bosses-tcs-infosys-wipro-2765847-2025-08-04",
      "headline": "HCLTech CEO earned Rs 95 crore: Here are India's highest-paid IT bossesHCLTech also reported a 17.6% increase in the median pay for its employees during the financial year. HCLTech currently has 1,67,316 permanent employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dehlivery-shares-rally-up-to-5-percent-after-q1-results-should-you-buy-2765822-2025-08-04",
      "headline": "Dehlivery shares rally up to 5% after Q1 results. Should you buy?Delhivery shares jumped 5% in early trade after the company posted its Q1FY26 results. Should you buy into the rally or wait and watch how the integration and margins play out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sri-lotus-developers-ipo-allotment-today-august-4-check-status-gmp-listing-date-expected-profit-2765804-2025-08-04",
      "headline": "Sri Lotus Developers IPO allotment today: Check your status, GMP, listing dateThe IPO of Sri Lotus Developers received a strong response during its three-day bidding window, with total subscriptions reaching 74.10 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Explained: How Trump's tariffs are hurting the US economyWith inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-160-points-higher-nifty-above-24600-bel-up-1-2765783-2025-08-04",
      "headline": "Sensex opens 160 points higher, Nifty above 24,600; BEL up 1%The S&P BSE Sensex added 229.73 points to 80,829.64, while the NSE Nifty50 rose 81.55 points to 24,646.90 as of 9:24 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-jyothika-visit-tirupati-with-kids-after-agaram-15-year-celebrations-video-2765909-2025-08-04",
      "headline": "Suriya, Jyothika visit Tirupati with kids after Agaram event. Viral videoTamil cinema's star couple, Suriya and Jyothika, recently visited the Tirupati temple in Andhra Pradesh, with their family. This comes after a grand celebration marking 15 years of Suriya's charitable foundation, Agaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-shatters-box-office-becomes-indias-highest-grossing-animated-film-2765966-2025-08-04",
      "headline": "Mahavatar Narsimha shatters box office, becomes India's highest-grossing animated filmAshwin Kumar's 'Mahavatar Narsimha' has taken the Indian box office by storm, becoming the highest-grossing animated film in the country with Rs 91.25 crore in just 10 days. The multi-language mythological drama's success signals a promising future for Indian animation and its rich storytelling traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-launches-fenty-beauty-to-india-check-launch-date-tira-sephora-india-2765946-2025-08-04",
      "headline": "Rihanna brings Fenty Beauty to India. Check launch dateMuch to the excitement of beauty enthusiasts, pop icon Rihanna's Fenty Beauty is all set to enter India. The singing sensation announced the launch date with a fun video on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pati-patni-aur-panga-forced-fun-flat-reality-checks-dull-munawar-faruqui-sonali-bendre-2765912-2025-08-04",
      "headline": "Pati Patni Aur Panga: Forced fun and flat reality checks dull the excitement'Pati Patni Aur Panga -Jodiyon Ka Reality Check' premiered on August 2 on Colors TV. Starring seven celebrity couples and hosted by Munawar Faruqui and Sonali Bendre, the show that promises a glimpse of REAL-ationship fails to deliver the freshness and emotional depth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-questions-transparency-national-film-awards-selection-process-2765947-2025-08-04",
      "headline": "Urvashi on National Awards selection process: Can't accept it silently like pensionVeteran actor Urvashi questioned the criteria used for National Film Awards and called for transparency from the Centre and State in award decisions. She won the Best Supporting Actor for Malayalam film, Ullozhukku'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-expresses-gratitude-to-canada-police-after-incident-at-kaps-cafe-2765856-2025-08-04",
      "headline": "Kapil Sharma thanks Canada police after shooting incident at Kap's cafeComedian Kapil Sharma thanked officials for their support in the firing incident at Kap's Cafe. He shared a video of the local police visiting his cafe on his Instagram account. The cafe resumed operations on July 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashamah-shailesh-lodha-approached-for-salman-khan-bigg-boss-19-2765944-2025-08-04",
      "headline": "Taarak Mehta actor Shailesh Lodha approached for Bigg Boss 19: SourceSalman Khan hosted 'Bigg Boss', is set to return with another season. While the new season promises some unique twists, India Today has exclusively learnt that actor Shailesh Lodha has been approached for the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-shares-photos-jungkook-rm-jimin-gym-2765916-2025-08-04",
      "headline": "BTS V shares messy gym update with Jungkook, RM, and JiminBTS member V, also known as Kim Taehyung, delighted ARMYs with an unexpected post featuring a collection of photos and videos from his recent outings with Jungkook, RM, Jimin, and other bandmates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tamannaah-bhatia-joins-shahid-kapoor-vishal-bhardwaj-romeo-action-thriller-2025-2765911-2025-08-04",
      "headline": "Tamannaah joins Shahid Kapoor in Vishal Bhardwaj's RomeoTamannaah Bhatia has been cast alongside Shahid Kapoor in Vishal Bhardwaj's upcoming thriller 'Romeo'. The film promises a gritty crime drama with complex characters and a big year-end release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-rana-daggubati-dance-to-ek-niranjan-in-baahubali-bts-video-2765854-2025-08-04",
      "headline": "Prabhas, Rana Daggubati dance to Ek Niranjan in Baahubali BTS video. WatchA fun video from the sets of 'Baahubali' shows Prabhas dancing to 'Ek Niranjan' in his royal costume. Shared on Friendship Day, the clip also features Rana Daggubati and Anushka Shetty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-wife-sshura-flaunts-baby-bump-for-first-time-at-his-birthday-bash-2765827-2025-08-04",
      "headline": "Arbaaz Khan's wife Sshura flaunts baby bump for first time at his birthday bashActor-filmmaker Arbaaz Khan's wife Sshura flaunted her baby bump at an event on Sunday. The couple made a stylish entry at Khan's birthday bash in Mumbai. The celebration was attended by several Bollywood celebrities, including actor Salman Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-on-working-with-pakistani-artistes-india-will-come-first-tenhran-2765867-2025-08-04",
      "headline": "John Abraham on working with Pakistani artistes: India comes first | ExclusiveActor John Abraham shared his strong views on putting India first before any cross-border artistic collaborations. He stressed national interests over personal or professional ties while promoting his film 'Tehran'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-expresses-pride-as-indian-dance-group-wows-americas-got-talent-judges-2765869-2025-08-04",
      "headline": "Allu Arjun expresses pride as Indian dance group wows America's Got Talent judgesIndian dance group B Unique Crew delivered a sensational performance on the America's Got Talent stage, leaving both the judges and audience stunned. Actor Allu Arjun took a moment to express his pride in the group's achievement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/juhi-chawla-cheers-for-shah-rukh-khan-national-award-shares-throwback-pic-and-sweet-note-2765818-2025-08-04",
      "headline": "Juhi Chawla cheers for SRK's National Award, shares throwback pic and sweet noteShah Rukh Khan won his first-ever National Award for Best Actor for his performance in 'Jawan', sharing the honour with Vikrant Massey. Industry friends like Juhi Chawla, Suriya, and Mohanlal celebrated his win with heartfelt messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-wild-journey-from-flop-auditions-to-bollywood-singing-god-2765769-2025-08-04",
      "headline": "Kishore Kumar's wild journey: From flop auditions to Bollywood's singing GodKishore Kumar ruled the stage like a rock star, but his career began with rejection of his signature style that defied norms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-music-unreleased-michael-jackson-track-tribute-anthem-2765816-2025-08-04",
      "headline": "BTS reportedly records unreleased Michael Jackson track for upcoming tribute albumBTS have recorded a previously unreleased Michael Jackson track at Grouse Lodge studio in Ireland for a global tribute album. The project, supported by Jackson's Estate, will also feature a documentary on his time in Ireland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-box-office-day-4-vijay-deverakonda-actioner-crawls-earns-rs-40-crore-2765815-2025-08-04",
      "headline": "Kingdom box office Day 4: Vijay Deverakonda's actioner crawls, earns Rs 40 croreDirector Gowtam Tinnanuri's espionage thriller 'Kingdom', starring Vijay Deverakonda, opened to a strong start but is now facing challenges in maintaining its box office momentum. The film's gripping plot and cliffhanger ending have generated curiosity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reaches-hyderabad-with-daughter-malti-for-ssmb-29-shoot-amid-strike-2765782-2025-08-04",
      "headline": "Priyanka Chopra reaches Hyderabad with daughter Malti for SSMB 29 shoot amid strikePriyanka Chopra has returned to Hyderabad with her daughter to join the shoot of SS Rajamouli's upcoming film 'SSMB 29' starring Mahesh Babu. Meanwhile, the Telugu Film Industry Employees' Federation has called for a strike from August 4, halting film shoots over wage hike demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chief-of-war-review-emotionally-enriching-raw-storytelling-on-war-jason-mamoa-show-2765721-2025-08-04",
      "headline": "Chief of War review: Emotionally enriching and raw storytelling on war, destructionRelease Date:Fri Aug 01, 2025Chief of War review: 'Chief of War', available for streaming on Apple TV + is backed by actor Jason Mamoa. Is the epic-drama series worth your time? Here is our review."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-slams-rahul-gandhi-china-land-grab-case-congress-defamation-case-2765863-2025-08-04",
      "headline": "True Indian wouldn't...: Top court raps Rahul Gandhi over China claim, halts caseThe Supreme Court slammed Rahul Gandhi for his claim that China had annexed 2,000 km of Indian territory, but stayed defamation proceedings against him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-pigeon-feeding-ban-kabutarkhanas-protests-heath-hazards-high-court-2765952-2025-08-04",
      "headline": "Maximum city, maximum kabutars? Mumbai bans pigeon feeding, protests take flightA Bombay High Court order directing the closure of kabutarkhanas has given flight to controversy, protests, as well as the first FIR for feeding pigeons. Here is why the issue has sparked protests across Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cockroaches-air-india-san-francisco-mumbai-flight-airline-sorry-probe-incident-2765898-2025-08-04",
      "headline": "Cockroaches on a plane, Air India says sorryAn Air India spokesperson said that cabin crew relocated two passengers who were bothered by the presence of cockroaches. The airline also issued an apology and said it is probing the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/tcs-layoffs-show-indian-it-giants-have-missed-the-bus-job-loss-and-pain-ahead-2765897-2025-08-04",
      "headline": "TCS layoffs show Indian IT giants have missed the bus, job loss and pain aheadNo one is willing to say it loudly, but it is clear that the nature of IT work is changing due to artificial intelligence. And it is changing in a way that may not turn out to be favourable for our IT giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorists-operation-mahadev-pakistan-link-voter-cards-chocolates-satellite-phone-2765829-2025-08-04",
      "headline": "Voter IDs, Candyland chocolates, GPS: Trail of Pahalgam terrorists leads to PakFindings drawn from the post-encounter evidence released by security agencies establish beyond doubt that the Pahalgam terrorists were from Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI reveals how much PSU banks spend on recovery agentsIndia Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mp-r-sudha-injured-chain-snatching-poland-embassy-delhi-2765874-2025-08-04",
      "headline": "I'm highly traumatised: Congress MP's chain snatched in Delhi's diplomatic enclaveCongress MP R Sudha was injured in a chain-snatching incident near the Poland Embassy in Chanakyapuri. She described the incident as \"highly shocking\" given it occurred in the high-security diplomatic enclave of the capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-u-turn-shashi-tharoor-bcci-gautam-gambhir-2765941-2025-08-04",
      "headline": "Shashi Tharoor wants Virat Kohli to unretire. BCCI, Gambhir should coax him backShashi Tharoor's call for Virat Kohli's return to Test cricket comes at a time when India's batting order looks unsettled and leadership gaps are showing in England. As fans debate the timing and merit of Kohli's retirement, the question remains: can the BCCI and Gambhir convince him to reconsider?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/param-bir-singh-malegaon-blast-case-king-of-controversies-mumbai-police-hindu-terror-ajmal-kasab-antilia-bomb-2765279-2025-08-04",
      "headline": "Param Bir Singh: Malegaon blast cop who's the king of controversiesParam Bir Singh probed the Malegaon blast case as an assistant commissioner of Maharashtra ATS. The case was projected by the establishment as a case of \"Hindu terror\", and all the accused have been let off. Not just Malegaon, from the Antilia bomb scare case to the Rs 100-crore extortion racket in Mumbai, the now-retired IPS officer has remained the king of controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shibu-soren-dies-at-81-after-prolonged-illness-former-jharkhand-chief-minister-and-jmm-founder-2765813-2025-08-04",
      "headline": "Shibu Soren, Jharkhand ex-Chief Minister and JMM founder, dies at 81Shibu Soren, former Jharkhand Chief Minister and JMM patriarch, died at 81 in a Delhi hospital on Monday after a prolonged illness, weeks after being admitted with a kidney-related ailment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-wild-journey-from-flop-auditions-to-bollywood-singing-god-2765769-2025-08-04",
      "headline": "Kishore Kumar's wild journey: From flop auditions to Bollywood's singing GodKishore Kumar ruled the stage like a rock star, but his career began with rejection of his signature style that defied norms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Explained: How Trump's tariffs are hurting the US economyWith inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-congress-rahul-gandhi-gaurav-gogoi-president-bjp-himanta-biswa-sarma-vidhan-sabha-election-2026-2765595-2025-08-04",
      "headline": "Can Rahul's Babbar Sher Gaurav Gogoi win Assam from Himanta?By bringing in Gaurav Gogoi as its Assam unit president, the Congress is planning to put up a big fight against the BJP in the 2026 Assembly polls. Will the plan, with a definite Rahul Gandhi imprint, help the Congress win Assam from Himanta Biswa Sarma and BJP, or will it be just fireworks with little gain?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/prayagraj-floods-india-baby-temples-buildings-inundated-water-rise-monsoon-2765836-2025-08-04",
      "headline": "Video: Parents carry infant overhead through waist-deep floodwater in UPA viral video from UP's Prayagraj showed a couple carrying their baby above waist-deep floodwater as relentless rain flooded homes, temples, and streets in the holy city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-women-more-prone-to-headaches-and-why-are-their-symptoms-often-dismissed-2765896-2025-08-04",
      "headline": "Are women more prone to headaches, and why are their symptoms often dismissed?Women suffer severe migraines linked to hormonal changes but often face dismissal in clinics. Neurologists call for personalised, gender-sensitive headache care to bridge this critical gap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/not-acceptable-top-trump-aide-accuses-india-of-financing-russias-war-in-ukraine-glbs-2765714-2025-08-04",
      "headline": "Not acceptable: Top Trump aide accuses India of financing Russia's war in UkraineStephen Miller, one of Trump's most influential advisors, said that Trump clearly believes India should stop buying oil from Russia. He stated that it is not acceptable for India to continue financing the war by purchasing Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-shashi-tharoor-national-award-win-witty-reply-2765741-2025-08-04",
      "headline": "SRK does a Shashi Tharoor while thanking politician for his National Award winShah Rukh Khan's National Award win for 'Jawan' prompted a witty exchange with Shashi Tharoor. This was SRK's first-ever National Award in 33 years of acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/if-government-schools-are-free-why-dont-we-send-our-kids-there-2765866-2025-08-04",
      "headline": "If government schools are free, why don't we send our kids there?Despite free tuition and mid-day meals, government schools in India struggle to earn parents' trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/is-it-spying-on-us-nasa-could-turn-juno-towards-interstellar-object-3iatlas-near-jupiter-2765933-2025-08-04",
      "headline": "Is the interstellar traveller a spy? Nasa could reroute Juno to investigateDiscovered in July 2025, 3I/ATLAS is the third confirmed interstellar visitor traversing our solar system, following 'Oumuamua and Comet Borisov. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-mamata-banerjee-delhi-police-called-bengali-bangladeshi-language-bjp-retorts-2765695-2025-08-03",
      "headline": "Trinamool claims Delhi Police called Bengali a Bangladeshi language, BJP retortsWest Bengal Chief Minister Mamata Banerjee shared a letter written by the Lodhi Colony Police Station and was addressed to the Banga Bhawan in Delhi with the subject line reading, \"Translation of documents containing text written in Bangladeshi language\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-entrepreneur-passport-stolen-barcelona-cafe-theft-consulate-emergency-certificate-2765796-2025-08-04",
      "headline": "Worst 48 hours of my life: Indian entrepreneur's passport, cash stolen in SpainIndian entrepreneur Ayush Panchmiya's bag, containing his travel documents, credit cards and cash, was stolen in a daylight robbery at a Barcelona cafe. The swift action of the Indian consulate ensured his quick return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/up-cop-chandradeep-nishad-dives-ganga-maiyya-lap-flooded-prayagraj-home-viral-video-2765864-2025-08-04",
      "headline": "New day, new stunt: 'Ganga Maiyya' still at doorstep, UP cop goes for a diveChandradeep Nishad, a former national-level swimmer, shared the video on Instagram with the caption: \"Today in the lap of Mother Ganga, Jai Ganga Maiyya.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-jyothika-visit-tirupati-with-kids-after-agaram-15-year-celebrations-video-2765909-2025-08-04",
      "headline": "Suriya, Jyothika visit Tirupati with kids after Agaram event. Viral videoTamil cinema's star couple, Suriya and Jyothika, recently visited the Tirupati temple in Andhra Pradesh, with their family. This comes after a grand celebration marking 15 years of Suriya's charitable foundation, Agaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-shatters-box-office-becomes-indias-highest-grossing-animated-film-2765966-2025-08-04",
      "headline": "Mahavatar Narsimha shatters box office, becomes India's highest-grossing animated filmAshwin Kumar's 'Mahavatar Narsimha' has taken the Indian box office by storm, becoming the highest-grossing animated film in the country with Rs 91.25 crore in just 10 days. The multi-language mythological drama's success signals a promising future for Indian animation and its rich storytelling traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-launches-fenty-beauty-to-india-check-launch-date-tira-sephora-india-2765946-2025-08-04",
      "headline": "Rihanna brings Fenty Beauty to India. Check launch dateMuch to the excitement of beauty enthusiasts, pop icon Rihanna's Fenty Beauty is all set to enter India. The singing sensation announced the launch date with a fun video on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-questions-transparency-national-film-awards-selection-process-2765947-2025-08-04",
      "headline": "Urvashi on National Awards selection process: Can't accept it silently like pensionVeteran actor Urvashi questioned the criteria used for National Film Awards and called for transparency from the Centre and State in award decisions. She won the Best Supporting Actor for Malayalam film, Ullozhukku'.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-harry-brook-ben-stokes-successor-ollie-pope-england-test-captaincy-2765959-2025-08-04",
      "headline": "Not Ollie Pope, but Harry Brook should be Ben Stokes' successor: VaughanFormer England captain Michael Vaughan believes that Harry Brook is the ideal fit to take over the reins of Test captaincy from current skipper Ben Stokes, instead of the current stand-in skipper Ollie Pope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-u-turn-shashi-tharoor-bcci-gautam-gambhir-2765941-2025-08-04",
      "headline": "Shashi Tharoor wants Virat Kohli to unretire. BCCI, Gambhir should coax him backShashi Tharoor's call for Virat Kohli's return to Test cricket comes at a time when India's batting order looks unsettled and leadership gaps are showing in England. As fans debate the timing and merit of Kohli's retirement, the question remains: can the BCCI and Gambhir convince him to reconsider?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-3rd-t20i-sahibzada-farhan-saim-ayub-lauderhill-2765940-2025-08-04",
      "headline": "Farhan, Ayub star as Pakistan take series-clinching win by 13 runsPakistan's opening pair, Sahibzada Farhan and Saim Ayub, laid the foundation for securing the win over the West Indies in the third T20I, which also helped them win the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-akash-deep-mohammed-siraj-performance-day-4-oval-test-2765883-2025-08-04",
      "headline": "Dinesh Karthik slams Akash Deep, Siraj after India's poor show on Day 4 at OvalDinesh Karthik wasn't pleased with India's bowling and fielding on Day 4 at The Oval. Karthik criticised Akash Deep's bowling performance and Mohammed Siraj's work in the outfield, especially with the drop catch of Harry Brook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-injection-stump-mic-akash-deep-2765878-2025-08-04",
      "headline": "Watch: Gill's stump-mic injection chat with Akash Deep leaves fans in splitsShubman Gill, during a tense Day 4 at The Oval, was caught on stump mic asking injured pacer Akash Deep about a painkiller injection as India desperately searched for a breakthrough against England's batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-morne-morkel-unfazed-day-4-early-end-rain-2765865-2025-08-04",
      "headline": "India bowling coach Morkel unfazed by early Day 4 end: Rain beyond controlENG vs IND: India bowling coach Morne Morkel explained how the side is not thinking much about the early end of what promised to be an exciting or potentially decisive Day 4 of the Oval Test against England, and that the team would rather focus on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-prediction-joe-root-press-conference-2765855-2025-08-04",
      "headline": "Joe Root backs England to win Oval Test: We have got what we need to cross lineEngland star Joe Root is backing the hosts to get over the finish line in the Oval Test and seal the series against India 3-1. Root scored his 39th Test century to put England on course for the win before a late twist got India back in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-prediction-varun-aaron-2765839-2025-08-04",
      "headline": "India are in a position to win Oval Test: Varun Aaron's big claim before Day 5Former pacer Varun Aaron believes India can clinch victory in the Oval Test on Day 5. The match is evenly poised as England needed 35 runs and India is aiming to get four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-5-live-score-updates-weather-mohammed-siraj-shubman-gill-2765824-2025-08-04",
      "headline": "Day 5 Live weather updates: India eye early breakthroughs in Oval finaleENG vs IND, 5th Test Day 5 Live weather updates: All four results remain on the table as the Oval Test heads into Day 5. With England 33 runs away and India needing 4 wickets, looming rain might just end up being the final decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3-pacers-no-kuldeep-yadav-morne-morkel-explains-oval-test-2765821-2025-08-04",
      "headline": "3-pacer policy, no Kuldeep Yadav: Morne Morkel explains India's Oval callENG vs IND: India's persistent three-pacer strategy came under scrutiny after Day 4 at The Oval, as bowling coach Morne Morkel addressed the absence of Kuldeep Yadav and hinted at a post-tour reassessment of selection tactics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-prediction-joe-root-press-conference-2765855-2025-08-04",
      "headline": "Joe Root backs England to win Oval Test: We have got what we need to cross lineEngland star Joe Root is backing the hosts to get over the finish line in the Oval Test and seal the series against India 3-1. Root scored his 39th Test century to put England on course for the win before a late twist got India back in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-prediction-varun-aaron-2765839-2025-08-04",
      "headline": "India are in a position to win Oval Test: Varun Aaron's big claim before Day 5Former pacer Varun Aaron believes India can clinch victory in the Oval Test on Day 5. The match is evenly poised as England needed 35 runs and India is aiming to get four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-5-live-score-updates-weather-mohammed-siraj-shubman-gill-2765824-2025-08-04",
      "headline": "Day 5 Live weather updates: India eye early breakthroughs in Oval finaleENG vs IND, 5th Test Day 5 Live weather updates: All four results remain on the table as the Oval Test heads into Day 5. With England 33 runs away and India needing 4 wickets, looming rain might just end up being the final decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3-pacers-no-kuldeep-yadav-morne-morkel-explains-oval-test-2765821-2025-08-04",
      "headline": "3-pacer policy, no Kuldeep Yadav: Morne Morkel explains India's Oval callENG vs IND: India's persistent three-pacer strategy came under scrutiny after Day 4 at The Oval, as bowling coach Morne Morkel addressed the absence of Kuldeep Yadav and hinted at a post-tour reassessment of selection tactics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}