{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-gmp-rises-marginally-should-you-subscribe-latest-subscription-2617665-2024-10-16",
      "headline": "Hyundai IPO: GMP rises marginally, should you subscribe? Hyundai Motors India IPO: The share price has been set between Rs 1,865 and Rs 1,960 per share. With this IPO, Hyundai aims to raise a massive Rs 27,856 crore, making it the largest public offering in India's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/7th-pay-commission-how-much-da-hike-central-government-employees-before-diwali-2024-2617663-2024-10-16",
      "headline": "How much DA hike will central government employees get? Details hereDearness Allowance, a key component of compensation for over one crore central government employees and pensioners, is designed to shield them from inflationary pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-16-2024-precious-metals-record-hike-on-mcx-2617660-2024-10-16",
      "headline": "Gold, silver price today, October 16, 2024: Precious metals record hike on MCXGold Price Today October 16, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pvr-inox-share-price-falls-analysts-bullish-bhool-bhulaiyaa-3-pushpa-2-movie-releases-2617652-2024-10-16",
      "headline": "Explained: Why analysts are bullish on PVR Inox despite falling share pricePVR Inox shares: Although PVR Inox shares have fallen over 5% this year, several brokerages are optimistic about the company"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-share-price-ofs-begins-key-details-for-investors-2617636-2024-10-16",
      "headline": "Cochin Shipyard shares down 4% today as 2-day OFS begins. Check detailsCochin Shipyard share price: The OFS, which started on October 16, is open only to non-retail investors today. The floor price for the sale is set at Rs 1,540 per share, a 7.89% discount to Tuesday's closing price of Rs 1,672."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-market-opening-update-stocks-to-watch-fii-outflows-2617626-2024-10-16",
      "headline": "Sensex, Nifty witness volatile trade as FII outflow dents sentimentsThe S&P BSE Sensex was up 50.20 points to 81,870.32 at 9:51 am, while the NSE Nifty50 rose 15.35 points to trade at 25,072.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-favours-administrative-allocation-spectrum-amid-elon-musk-ambani-showdown-2617515-2024-10-16",
      "headline": "No spectrum auction: Government after Elon Musk objects to Mukesh Ambani's pitchTelecom Minister Jyotiraditya Scindia has announced that India will follow the global trend of administrative spectrum allocation. The decision came after Starlink CEO Elon Musk objected to Ambani's Reliance Jio lobbying for the auction route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-53-percent-update-central-government-employees-can-expect-big-diwali-gift-2617350-2024-10-15",
      "headline": "DA hike update: Central government employees can expect big Diwali giftThe expected hike in DA would mean that over 1 crore central government employees and pensioners will receive their October salaries with the new DA rate, along with three months' worth of arrears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-mutual-fund-reduces-daily-minimum-sip-limit-to-rs-100-investment-tips-2617301-2024-10-15",
      "headline": "LIC Mutual Fund reduces daily minimum SIP limit to Rs 100Investors can now begin a SIP with just Rs 100 and in multiples of Re 1 thereafter for select schemes of LIC Mutual Fund (LIC MF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-review-should-you-buy-shares-after-its-listing-analyst-views-2617282-2024-10-15",
      "headline": "Hyundai IPO: Should you buy shares after its listing?While the buzz surrounding the IPO is palpable, many brokerages are urging investors to take a cautious approach. They advise looking at Hyundai's long-term growth potential rather than getting caught up in the excitement of quick listing gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-lower-amid-volatility-reliance-industries-ril-shares-down-2-percent-2617209-2024-10-15",
      "headline": "Sensex, Nifty end in red as metal and auto stocks pull markets downThe S&P BSE Sensex was down 152.93 points to close at 81,820.12, while the NSE Nifty50 lost 61.85 points to end at 25,066.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-review-investors-subscription-long-term-growth-not-listing-gains-experts-2617144-2024-10-15",
      "headline": "Hyundai IPO: Why investors should focus on long-term growth, not listing gainsHyundai Motor IPO: While Hyundai's IPO is undoubtedly generating excitement, experts are saying this is more of a marathon than a sprint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-day-1-check-latest-subscription-gmp-key-details-2617105-2024-10-15",
      "headline": "Hyundai IPO: Check latest subscription and GMP on Day 1Hyundai Motor India IPO: India's biggest public offering opened for subscription on Monday, looking to raise Rs 27,870.16 crore with an offer for sale of 14.22 crore shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-share-price-drops-q2-results-net-profit-investor-trading-strategy-brokerage-views-2617086-2024-10-15",
      "headline": "RIL shares dip 1% after Q2 results. What should investors do? Reliance Industries share price: The dip, driven by weaker-than-expected performance in its oil-to-chemicals (O2C) segment, has left investors and analysts contemplating their next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-subscription-latest-gmp-price-band-issue-size-subscribe-or-not-2617010-2024-10-15",
      "headline": "Hyundai IPO opens for subscription: Check GMP, price band, other key detailsHyundai Motor India IPO: The price band for the IPO has been set between Rs 1,865 and Rs 1,960 per share. Through this public offering, Hyundai aims to raise Rs 27,856 crore"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-scraps-zero-notice-policy-amid-talent-war-in-quick-commerce-zomato-swiggy-report-2617005-2024-10-15",
      "headline": "Blinkit scraps 'zero notice' policy amid talent war in quick commerce: ReportThe change in policy comes in response to growing competition in the quick commerce industry as Blinkit faces stiff competition from other players like Zepto, Flipkart, and Swiggy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-view-book-profit-or-hold-for-long-term-2617002-2024-10-15",
      "headline": "Garuda Construction and Engineering listing: Book profit or hold?Garuda Construction and Engineering listing: Despite a sluggish outlook in the grey market, which had indicated a flat or negative listing, the company surprised many with its strong opening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-gain-premium-rs-105-2616990-2024-10-15",
      "headline": "Garuda Construction and Engineering shares list at 10.5% premium at Rs 105Garuda Construction and Engineering IPO listing: The company's market debut has exceeded expectations, particularly given the flat to negative outlook in the grey market before the listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-close-to-surpassing-apple-worlds-most-valuable-company-market-value-stock-surge-2616986-2024-10-15",
      "headline": "Nvidia inches closer to overtaking Apple as world's most valuable companyNvidia share price: The latest stock jump pushed Nvidia's market value to $3.39 trillion, just shy of Apple's $3.52 trillion, but ahead of Microsoft's $3.12 trillion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-reliance-industries-hcltech-q2-results-cpi-retail-inflation-2616983-2024-10-15",
      "headline": "Sensex, Nifty gain in early trade, RIL shares drop after Q2 resultsThe S&P BSE Sensex was up 194.75 points at 82,167.80 at around 9:39 am, while the NSE Nifty50 was up 38.30 points to 25,166.25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-swears-in-as-chief-minister-of-jammu-and-kashmir-2617674-2024-10-16",
      "headline": "Omar Abdullah takes oath as J&K Chief Minister, Surinder Choudhary his deputyNational Conference leader Omar Abdullah on Wednesday was sworn-in as the Jammu and Kashmir Chief Minister as the Union Territory got its first government after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-air-pollution-stubble-burning-supreme-court-blasts-pulls-up-punjab-haryana-2617661-2024-10-16",
      "headline": "Complete defiance: Supreme Court blasts Punjab, Haryana over Delhi air pollutionThe Supreme Court directed the Commission of Air Quality Management to take penal action against state government officers and directed the Haryana Chief Secretary to be present in court next Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/s-jaishankar-sco-summit-pakistan-islamabad-morning-walk-planting-sapling-shehbaz-sharif-2617625-2024-10-16",
      "headline": "How S Jaishankar started his day in Islamabad ahead of SCO SummitExternal Affairs Minister S Jaishankar, who is in Pakistan for the SCO Summit, began his day with a morning walk with Indian diplomats and planting a sapling at the Indian High Commission in Islamabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/jagmeet-singh-ex-trudeau-ally-indian-diplomats-sanction-india-canada-diplomatic-row-khalistani-extremism-hardeep-nijjar-killing-2617592-2024-10-16",
      "headline": "Canadian Sikh MP wants sanctions on Indian diplomats, gets mocked by journalistsAmid the escalating India-Canada diplomatic row, Canadian Sikh leader Jagmeet Singh was mocked by journalists at a press conference when he demanded \"severe sanctions\" on Indian diplomats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-imran-khan-former-wife-jemima-goldsmith-social-media-post-solitary-confinement-dark-jail-cell-2617597-2024-10-16",
      "headline": "Imran Khan isolated in dark cell, no calls to sons, jail cook on leave: Ex-wifeJemima Goldsmith's allegations against the Pakistan government come amid the ongoing two-day SCO Summit in Islamabad, which has drawn top leaders from member states and turned the capital city into a fortress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-chosen-not-cooperate-with-canada-us-probe-into-killing-sikh-separatist-killer-hardeep-singh-nijjar-2617605-2024-10-16",
      "headline": "Canada's charges serious: Five Eyes allies US, New Zealand on its row with IndiaUS State Department spokesperson Matthew Miller said Canada's allegations against India in the killing of Hardeep Singh Nijjar \"need to be taken seriously\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/singapore-deploys-fighter-jets-escort-air-india-express-plane-after-bomb-threat-2617581-2024-10-16",
      "headline": "Singapore scrambled fighter jets after bomb threat on Air India Express flightSingapore Defence Minister Ng Eng Hen said that the two RSAF F-15SG jets escorted the Air India Express flight away from populated areas before it landed at the Changi Airport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-row-sanctions-melanie-joly-justin-trudeau-universities-students-2617538-2024-10-15",
      "headline": "What actions can India take if Canada imposes sanctions? Shiv Aroor explainsCanada's Foreign Minister Mélanie Joly has suggested that \"everything is on the table\" when asked if Ottawa would consider imposing sanctions on India. If Canada imposes sanctions on India, New Delhi has these possible options to hurt Ottawa back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-18-per-cent-tax-on-health-term-life-insurance-premium-in-india-high-gst-council-nitin-gadkari-nirmala-sitharaman-2614139-2024-10-16",
      "headline": "Why 18% GST on life and health insurance is high and must be slashedIndians are paying an 18% GST on term and health insurance premiums, which is higher than what people pay in the US, the UK and South Africa -- a Brics country. This is why experts suggest that the GST Council should bring down tax on insurance premiums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nayab-saini-chief-minister-oath-ceremony-haryana-newspapers-ad-amit-shah-meeting-2617628-2024-10-16",
      "headline": "Nayab Saini's photo with oath event ad out in newspapers before key BJP meetTraditionally, the BJP legislature party meeting finalises the leader's name after deliberation and consensus. However, with Nayab Saini's image and swearing-in details already made public, the announcement seems to be a mere formality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bella-hadid-ashley-graham-take-victorias-secret-fashion-show-watch-2617624-2024-10-16",
      "headline": "Gigi and Bella Hadid, Ashley Graham take Victoria's Secret Fashion Show by stormThe 2024 Victoria's Secret Fashion Show returned on October 15, featuring diverse models like Gigi Hadid and Ashley Graham. Highlights included performances by Cher and a focus on inclusivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadas-justin-trudeau-india-relations-media-coverage-nijjar-killing-allegationn-indian-officials-2617573-2024-10-16",
      "headline": "Canadian media slams Trudeau over row with India: Still in 'trust me bro' phaseCanadian media and experts criticised Prime Minister Justin Trudeau for making unsubstantiated allegations against India and allowing Sikh extremism to influence Canada's foreign policy, all without providing credible evidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-shares-video-of-hezbollah-tunnel-in-lebanon-with-ak-47-iron-doors-gaza-hamas-hassan-nasrallah-2617612-2024-10-16",
      "headline": "Watch: Israel shares video of Hezbollah tunnel in Lebanon with AK-47, iron doorsThe Israel Defence Forces' video showed several parts of the Hezbollah tunnel with iron doors, \"functioning\" rooms, AK-47 rifles, a bedroom, a bathroom, a storage room for generators, water tanks and vehicles, among other things."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-in-tamil-nadu-andhra-pradesh-depression-in-bay-of-bengal-chennai-bengaluru-2617584-2024-10-16",
      "headline": "Heavy rain alert in Tamil Nadu, Andhra as depression formed over Bay of Bengal Live UpdatesA well-marked low-pressure area over the southwest and adjoining southeast Bay of Bengal has intensified into a depression and is expected to make landfall between Puducherry and Nellore on October 17, bringing heavy rain in southern states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-philadelphia-rally-election-campaign-ymca-song-dance-party-presidential-election-2617578-2024-10-16",
      "headline": "Trump turns town hall into 'music fest', makes bizarre remarks on 2 who faintedOn Monday, Trump attended a Town Hall on Monday in Pennsylvania's Oaks suburb moderated by Republican South Dakota Governor Kristi Noem, who faced widespread criticism earlier this year for an incident she mentioned in her book about killing her pet dog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-day-2-sco-summit-s-jaishankar-shehbaz-sharif-shanghai-cooperation-organisation-2617577-2024-10-16",
      "headline": "Day 2 of SCO summit in Pak: S Jaishankar to attend talks on trade, economy Live UpdatesAccording to Pakistan's Foreign Ministry, discussions will focus on economic cooperation, trade, environmental issues, and socio-cultural ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-bomb-threat-chicago-divert-canada-statement-2617629-2024-10-16",
      "headline": "Air India flight, diverted to Canada due to bomb threat, leaves for ChicagoSeven Indian flights got bomb threats on Tuesday, including the Chicago-bound Air India AI127. At least two flights made emergency landings as a result."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-favours-administrative-allocation-spectrum-amid-elon-musk-ambani-showdown-2617515-2024-10-16",
      "headline": "No spectrum auction: Government after Elon Musk objects to Mukesh Ambani's pitchTelecom Minister Jyotiraditya Scindia has announced that India will follow the global trend of administrative spectrum allocation. The decision came after Starlink CEO Elon Musk objected to Ambani's Reliance Jio lobbying for the auction route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/nick-jonas-runs-off-stage-at-prague-concert-after-man-aims-laser-at-him-2617590-2024-10-16",
      "headline": "Watch: Nick Jonas runs off stage at Prague concert after man aims laser at himNick Jonas ran off stage during a Prague concert after a laser was aimed at his head. Fans expressed concern, and the show resumed after the individual was removed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/iit-roorkee-alumnus-is-a-principal-engineer-at-elon-musks-spacex-his-linkedin-profile-is-viral-2617637-2024-10-16",
      "headline": "This IIT Roorkee alumnus now has a key role in Elon Musk's SpaceX. True storyThe LinkedIn profile of an IIT Roorkee alumnus who is now a Principal Engineer at Elon Musk's SpaceX went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-kashmir-elections-part-of-alliance-no-mla-to-take-oath-congress-leader-bharat-singh-solanki-2617633-2024-10-16",
      "headline": "Omar Abdullah dismisses rift with Congress, says party not out of his cabinetOmar Abdullah said he won't be filling all nine vacancies in his cabinet as talks with Congress are currently ongoing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/7th-pay-commission-how-much-da-hike-central-government-employees-before-diwali-2024-2617663-2024-10-16",
      "headline": "How much DA hike will central government employees get? Details hereDearness Allowance, a key component of compensation for over one crore central government employees and pensioners, is designed to shield them from inflationary pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-day-8-update-rajat-dalal-vivian-dsena-2617673-2024-10-16",
      "headline": "BB 18 Day 8: Rajat Dalal threatens Vivian Dsena, says 'will break your hand'On Day 8 of Bigg Boss Season 18, a fight broke out between contestants Rajat Dalal and Vivian Dsena. The former expressed his frustration and threatened to break the actor's hand. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kangana-ranaut-emergency-likely-to-release-after-punjab-elections-exclusive-2617656-2024-10-16",
      "headline": "Kangana Ranaut's Emergency likely to release after Punjab elections: ExclusiveKangana Ranaut's Emergency, which was set to release in September, is yet to hit theatres. India Today exclusively learnt that the film is likely to release after Punjab elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/priyanka-chopra-samantha-varun-dhawan-citadel-honey-bunny-trailer-2617631-2024-10-16",
      "headline": "Priyanka Chopra reacts to Samantha, Varun's Citadel Honey Bunny trailer The trailer of Samantha and Varun Dhawan's Citadel Honey Bunny was released. Priyanka Chopra, Alia Bhatt and Karan Johar, among others reacted to it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bella-hadid-ashley-graham-take-victorias-secret-fashion-show-watch-2617624-2024-10-16",
      "headline": "Gigi and Bella Hadid, Ashley Graham take Victoria's Secret Fashion Show by stormThe 2024 Victoria's Secret Fashion Show returned on October 15, featuring diverse models like Gigi Hadid and Ashley Graham. Highlights included performances by Cher and a focus on inclusivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/instagram-introduces-customisable-profile-card-feature-what-is-it-and-how-to-use-2617657-2024-10-16",
      "headline": " Instagram introduces customisable Profile Card feature: What is it and how to useInstagram has announced a new Profile Card feature that provides a quick snapshot of your profile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/nothing-confirms-launching-phone-2a-community-edition-in-india-check-out-launch-date-price-and-more-2617630-2024-10-16",
      "headline": "Nothing confirms launching Phone 2a Community Edition in India: Check out launch date, price and more Nothing is set to launch the Nothing Phone 2a Community Edition in India, featuring a unique design influenced by its fan community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/qualcomm-may-still-buy-intel-but-not-right-now-2617623-2024-10-16",
      "headline": "Qualcomm may still buy Intel but not right nowQualcomm is eyeing to buy Intel, but has decided to wait until the US elections in November. The company is taking its sweet time, and it might stretch to next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/youtube-rolling-out-miniplayer-and-bunch-of-other-features-2617619-2024-10-16",
      "headline": "YouTube rolling out Miniplayer and bunch of other features YouTube's latest updates aim to enhance user experience with over two dozen improvements, including better browsing controls and personalized tools for a more interactive platform."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-focus-on-winning-games-for-india-not-numbers-mike-hesson-warns-australia-2617658-2024-10-16",
      "headline": "Virat Kohli's focus on winning games not numbers: Mike Hesson warns AustraliaMike Hesson defended Virat Kohli amid the recent scrutiny over his dipping Test numbers and said that the batter is at that stage of his career where he wants to win games for the team rather than focussing on numbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-one-rohit-sharma-captaincy-anil-kumble-2617649-2024-10-16",
      "headline": "Rohit Sharma has inspired India to go out and do the job for him: Anil KumbleAnil Kumble has heaped praise on Rohit Sharma's captaincy and claimed that the star batter inspires his players to rally around him and get the job done on the field. Rohit's captaincy has seen India sit at the top of the World Test Championship standings at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-shouldnt-change-his-approach-in-test-series-vs-australia-anil-kumble-2617634-2024-10-16",
      "headline": "Yashasvi shouldn't change his approach in Test series vs Australia: Anil Kumble Anil Kumble felt that Yashasvi Jaiswal shouldn't change his approach for the 5-match Test series against Australia. He also said that Jaiswal would feel comfortable going to Australia because of India's prolific wins in last two outings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/south-american-world-cup-qualifiers-argentina-vs-bolivia-lionel-messi-hat-trick-cristiano-ronaldo-2617627-2024-10-16",
      "headline": "Messi hits Ronaldo record levelling hat-trick as Argentina hammer BoliviaLionel Messi scored his 10th international hat-trick and went level with Cristiano Ronaldo as Argentina hammered Bolivia in the South American World Cup qualifiers on October 15, Tuesday. Argentina won the match 6-0 thanks to Messi's brilliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-announce-ashes-2025-26-dates-gabba-to-host-day-night-test-2617615-2024-10-16",
      "headline": "Cricket Australia announce Ashes 2025-26 dates, Gabba to host Day-Night TestThe dates for the 2025-26 Ashes has been revealed with Gabba set to host a day-night Test in the series. The series has made a deviation from the traditional Ashes schedule for 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-kamran-ghulam-puts-his-name-on-honours-board-after-multan-hundred-vs-eng-2617614-2024-10-16",
      "headline": "Watch: Kamran Ghulam puts his name on honours board after Multan hundred vs ENGKamran Ghulam put his name on the honours board list after his hundred on debut for Pakistan against England. The social media handle of Pakistan Cricket shared a video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-representatives-label-rape-probe-reports-as-false-and-slanderous-2617610-2024-10-16",
      "headline": "Kylian Mbappe representatives label rape probe reports as 'false and slanderous'Kylian Mbappe's representatives have slammed the allegations of rape against the France captain and labelled it as 'false' and as a 'slanderous rumour.' Media reports had claimed that Mbappe was under investigation for "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-describes-test-cricket-in-one-word-before-ind-vs-nz-respect-2617595-2024-10-16",
      "headline": "Mohammed Siraj describes Test cricket in one word before IND vs NZ: 'Respect'Indian bowlers described their love for the 'red cherry' in a video posted by the BCCI on X. India face New Zealand for a three-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-one-bengaluru-weather-live-updates-chinnaswamy-stadium-2617585-2024-10-16",
      "headline": "IND vs NZ, 1st Test Day 1 Weather Updates: 1st session washed out due to rain IND vs NZ, 1st Test Day 1 Weather Updates: Persistent rain in Bengaluru and the 1st session has been washed out completely without even a toss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-most-sixes-virat-kohli-9000-runs-ravichandran-ashwin-530-wickets-2617542-2024-10-16",
      "headline": "IND vs NZ: Rohit, Kohli, Ashwin on the brink of major milestones ahead of 1st TestIndia players Rohit Sharma, Virat Kohli and Ravichandran Ashwin are on the brink of shattering major milestones in the first Test against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-kamran-ghulam-puts-his-name-on-honours-board-after-multan-hundred-vs-eng-2617614-2024-10-16",
      "headline": "Watch: Kamran Ghulam puts his name on honours board after Multan hundred vs ENGKamran Ghulam put his name on the honours board list after his hundred on debut for Pakistan against England. The social media handle of Pakistan Cricket shared a video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-representatives-label-rape-probe-reports-as-false-and-slanderous-2617610-2024-10-16",
      "headline": "Kylian Mbappe representatives label rape probe reports as 'false and slanderous'Kylian Mbappe's representatives have slammed the allegations of rape against the France captain and labelled it as 'false' and as a 'slanderous rumour.' Media reports had claimed that Mbappe was under investigation for "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-describes-test-cricket-in-one-word-before-ind-vs-nz-respect-2617595-2024-10-16",
      "headline": "Mohammed Siraj describes Test cricket in one word before IND vs NZ: 'Respect'Indian bowlers described their love for the 'red cherry' in a video posted by the BCCI on X. India face New Zealand for a three-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-one-bengaluru-weather-live-updates-chinnaswamy-stadium-2617585-2024-10-16",
      "headline": "IND vs NZ, 1st Test Day 1 Weather Updates: 1st session washed out due to rain IND vs NZ, 1st Test Day 1 Weather Updates: Persistent rain in Bengaluru and the 1st session has been washed out completely without even a toss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-most-sixes-virat-kohli-9000-runs-ravichandran-ashwin-530-wickets-2617542-2024-10-16",
      "headline": "IND vs NZ: Rohit, Kohli, Ashwin on the brink of major milestones ahead of 1st TestIndia players Rohit Sharma, Virat Kohli and Ravichandran Ashwin are on the brink of shattering major milestones in the first Test against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-results-spain-reach-quarters-portugal-scotland-draw-2617580-2024-10-16",
      "headline": "Nations League: Spain thrash Serbia to reach quarters, Portugal held by ScotlandSpain has reached the quarterfinals of the UEFA Nations League with a commanding 3-0 win over Serbia on October 15, Tuesday. Portugal also edge closer to the knockout stages, despite being held to a 0-0 draw by Scotland. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-top-gear-australia-tour-preperation-batting-form-2617546-2024-10-16",
      "headline": "Can Virat Kohli hit top Test gear against New Zealand before flight to Australia?As India prepares to face New Zealand in the Bengaluru Test, all eyes are on Virat Kohli to finally click into his usual run-scoring form. After a lean run so far in 2024, the series offers a key opportunity for him to regain form ahead of the high-profile Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-tom-latham-bengaluru-test-rohit-sharma-virat-kohli-2617548-2024-10-16",
      "headline": "Tom Latham 'excited' to be full-time captain, says past experience to come in handyNew Zealand captain Tom Latham expressed excitement on being full time skipper for New Zealand ahead of India Test series set to begin from October 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-tuchel-agrees-deal-with-english-fa-to-be-england-manager-2617544-2024-10-15",
      "headline": "Thomas Tuchel signs contract to become new England manager: ReportsFormer Chelsea head coach Thomas Tuchel has signed a contract to become the new England manager, Sky Sports News reported on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-udita-highest-bid-day-1-womens-player-auction-2617527-2024-10-15",
      "headline": "India defender Udita attracts highest bid on Day 1 of women's player auctionIndian defender Udita Duhan emerged as the costliest buy at the Hockey India League women's auction after she was acquired by Shrachi Rarh Bengal Tigers for Rs 32 lakh on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-four-semi-finalists-aus-vs-sa-wi-vs-nz-2617514-2024-10-15",
      "headline": "Women's T20 World Cup: Four semi finalists confirmed after enthralling group stageThe four semi-finalists of the Women's T20 World Cup were confirmed after the end of the group stages of the tournament. Australia, New Zealand, West Indies and South Africa were the teams to qualify for the last four."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-form-test-cricket-2617512-2024-10-15",
      "headline": "India vs New Zealand: Can Tim Southee rediscover his mojo in Tests?Tim Southee is looking to rediscover form and his experience and past success in Indian conditions may prove crucial for New Zealand in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-west-indies-semifinals-england-knocked-out-hayley-matthews-qiana-joseph-2617503-2024-10-15",
      "headline": "West Indies knock England out of with a thumping win in DubaiWest Indies stormed into the T20 World Cup semi-finals with a dominant 6-wicket win over England, thanks to a blazing 102-run partnership between Qiana Joseph and Hayley Matthews that knocked England out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-udita-highest-bid-day-1-womens-player-auction-2617527-2024-10-15",
      "headline": "India defender Udita attracts highest bid on Day 1 of women's player auctionIndian defender Udita Duhan emerged as the costliest buy at the Hockey India League women's auction after she was acquired by Shrachi Rarh Bengal Tigers for Rs 32 lakh on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-four-semi-finalists-aus-vs-sa-wi-vs-nz-2617514-2024-10-15",
      "headline": "Women's T20 World Cup: Four semi finalists confirmed after enthralling group stageThe four semi-finalists of the Women's T20 World Cup were confirmed after the end of the group stages of the tournament. Australia, New Zealand, West Indies and South Africa were the teams to qualify for the last four."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-form-test-cricket-2617512-2024-10-15",
      "headline": "India vs New Zealand: Can Tim Southee rediscover his mojo in Tests?Tim Southee is looking to rediscover form and his experience and past success in Indian conditions may prove crucial for New Zealand in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-west-indies-semifinals-england-knocked-out-hayley-matthews-qiana-joseph-2617503-2024-10-15",
      "headline": "West Indies knock England out of with a thumping win in DubaiWest Indies stormed into the T20 World Cup semi-finals with a dominant 6-wicket win over England, thanks to a blazing 102-run partnership between Qiana Joseph and Hayley Matthews that knocked England out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-t20i-sri-lanka-beat-west-indies-report-wellalage-spin-2617497-2024-10-15",
      "headline": "Wellalage spins a web as Sri Lanka hammer West Indies to level seriesSri Lanka hammered West Indies by 73 runs to level the T20I series 1-1, thanks to a stellar performance from their spinners on a turning pitch in Dambulla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-wi-2nd-t20i-pathum-nissanka-shamar-joseph-five-boundaries-2617493-2024-10-15",
      "headline": "Watch: Pathum Nissanka smacks Shamar Joseph for 5 consecutive fours in 2nd T20ISri Lanka batter Pathum Nissanka smashed Shamar Joseph for five consecutive boundaries during the second T20I against West Indies on Tuesday, October 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-wants-to-play-test-cricket-for-india-2617474-2024-10-15",
      "headline": "Sanju Samson wants to play Test cricket for IndiaIndia wicketkeeper Sanju Samson, after scoring a century in the third T20I against Bangladesh, has expressed his strong desire to play Test cricket for India, aiming to establish himself as an all-format player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-highlights-jasprit-bumrahs-threat-ahead-of-india-test-series-2617469-2024-10-15",
      "headline": "Pat Cummins highlights Jasprit Bumrah's threat ahead of India Test seriesAustralia captain Pat Cummins highlighted India fast bowler Jasprit Bumrah's threat ahead of the upcoming five-match Test series beginning from November 22."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}