{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cng-price-hiked-by-rs-2-in-mumbai-other-cities-election-bound-delhi-spared-2639723-2024-11-25",
      "headline": "CNG prices hiked by Rs 2 in Mumbai, other cities; election bound-Delhi sparedPrices were hiked in Noida, Greater Noida, Ghaziabad, Gurugram and other cities but Delhi, which goes to polls in a few weeks from now, was spared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-listing-date-share-price-strong-market-debut-or-muted-listing-expert-view-2639668-2024-11-25",
      "headline": "NTPC Green Energy IPO share price: Strong debut on D-Street or muted listing? NTPC Green Energy IPO listing: Shares of NTPC Green Energy Limited are expected to make its debut on the stock exchanges on Wednesday after having been subscribed over 200%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-rise-energy-solutions-enterprises-port-sez-gautam-adani-bribery-market-rally-2639576-2024-11-25",
      "headline": "Adani Group shares rise for 2nd straight session: 2 reasons behind bull runAdani group stocks: Adani stocks continued their upward movement, with Adani Energy Solutions being among the top performers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-jump-why-explained-bse-inclusion-replaces-jsw-steel-2639543-2024-11-25",
      "headline": "Zomato shares jump 7%, inclusion on BSE replacing JSW Steel soonZomato share price: Zomato stocks surged in early trade on Monday, mirroring the stock market rally following a major announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-explained-3-reasons-why-dalal-street-saw-bull-run-today-adani-bjp-mahayuti-win-maharashtra-2639522-2024-11-25",
      "headline": "Sensex surges 1200 points: 3 factors behind stock market rallyStock market rally: Sensex shot past the 80,000 mark, while the broader NSE Nifty climbed above 24,300, increasing investors' wealth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-1000-points-early-trade-nifty-over-24000-stock-markets-adani-2639510-2024-11-25",
      "headline": "Sensex jumps over 1,000 points in early trade, Nifty over 24,000Stock market rally: The S&P BSE Sensex was up 1192.49 points to 80,309.60, while the NSE Nifty50 was up 411.85 points to 24,319.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-day-2-latest-gmp-subscription-subscribe-skip-review-details-price-band-2639507-2024-11-25",
      "headline": "Enviro Infra Engineers IPO Day 2: Shoud you subscribe based on latest GMP?Enviro Infra Engineers IPO: Enviro Infra Engineers Limited is looking to raise Rs 650.43 crore through a book-building process and will close for bidding on November 26, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-tez-quick-commerce-service-code-name-challenge-blinkit-zepto-swiggy-flipkart-minutes-2639500-2024-11-25",
      "headline": "Amazon's quick commerce service code named Tez to challenge Blinkit, ZeptoThe move will mark Amazon's entry into the fast-growing quick commerce space in India, where competitors like Blinkit, Zepto, and Swiggy Instamart currently dominate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-allotment-date-step-by-step-online-guide-check-status-latest-gmp-listing-2639485-2024-11-25",
      "headline": "NTPC Green Energy IPO allotment: Step-by-step guide to check statusNTPC Green Energy IPO allotment: The allotment for NTPC Green Energy IPO is expected to be finalised on Monday and investors and check their status on the online portals of BSE and Kfin Technologies Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-rvnl-zee-hdfc-hcl-cochin-shipyard-stock-market-stocks-to-watch-today-2639467-2024-11-25",
      "headline": "Zomato, RVNL, Zee, HDFC, HCL, Cochin Shipyard: Stocks to watch today Experts suggest the election outcome will boost investor confidence, especially in sectors like infrastructure, manufacturing, and urban development, which align with BJP's pro-business policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-energy-solutions-downplays-kenya-scrapping-736-million-power-deal-no-material-impact-2639242-2024-11-24",
      "headline": "Adani firm downplays Kenya scrapping $736 million power deal: No material impactAdani Energy Solutions said there was \"no material impact\" on the company's operations after Kenya cancelled a $736 million transmission line project over Gautam Adani's indictment in a bribery case in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reaction-bjp-led-mahayuti-win-maharashtra-will-it-lead-to-maha-rally-on-dalal-street-expert-view-2639133-2024-11-24",
      "headline": "BJP-led Mahayuti win Maharashtra: Will it lead to 'maha' rally on Dalal Street?The results of the Maharashtra assembly election, announced on Saturday, are expected to have a notable impact on the stock markets when trading resumes on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-gets-richer-wealth-hits-all-time-high-tesla-shares-surge-spacex-xai-usd-70-billion-addition-2638737-2024-11-23",
      "headline": "Elon Musk gets even richer after wealth hits all-time high post Trump winThe jump in Elon Musk's fortune came after Tesla shares rose 3.8% on Friday, reaching a 3.5-year closing high of $352.56 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-jeff-bezos-tesla-stock-space-x-us-electiosn-donald-trump-2638708-2024-11-23",
      "headline": "Jeff Bezos denies Musk's claim on Tesla stock advice: '100% not true'Elon Musk said on social media platform X that Bezos had advised people to sell their Tesla and SpaceX shares, predicting Donald Trump's electoral defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-founder-told-us-ally-to-flee-the-us-to-avoid-testifying-report-2637906-2024-11-22",
      "headline": "Byju's founder told US ally to flee the US to avoid testifying: ReportThe businessman, William R. Hailer, testified before US Bankruptcy Judge John T. Dorsey, alleging that Byju Raveendran offered him a lucrative job and sent him a $10,700 plane ticket to Dubai just two days before he was scheduled to testify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-today-sensex-2000-points-nifty-above-23900-2637809-2024-11-22",
      "headline": "Sensex ends nearly 2,000 points higher, Nifty above 23,900A broad-based recovery in information technology (IT), financial, banking and energy stocks spearheaded the recovery. A sharp rebound in Adani Group stocks also added to the positive momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-2000-points-key-factors-adani-shares-2637775-2024-11-22",
      "headline": "Sensex surges 2,000 points, Rs 7 lakh crore added: 4 key factors behind rallyThe Sensex was up 2039.44 points to 79,195.23 at 2:57 pm, while the NSE Nifty50 gained 587.90  to 23,938.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-high-within-touching-distance-of-100000-dollar-milestone-2637714-2024-11-22",
      "headline": "Bitcoin hits record high, within touching distance of $100,000 milestoneThe world's leading cryptocurrency topped $99,300, coming within striking distance of the psychological milestone that many experts had anticipated after the US election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-1200-points-nifty-3-things-to-know-stock-market-bull-run-2637706-2024-11-22",
      "headline": "Sensex jumps 1,200 points: 3 things to know about today's stock market bull runThe BSE Sensex climbed 1,193.90 points to cross 78,340.07, while the NSE Nifty advanced 371.50 points to reach 23,721.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-rises-1000-points-nifty-rebounds-adani-stocks-in-green-2637683-2024-11-22",
      "headline": "Sensex jumps over 1,000 points as most Adani Group stocks rebound sharplyStock market today: The S&P BSE Sensex climbed 1,034.76 points to 78,190.55 by 12:42 pm, while the NSE Nifty50 gained 329.15 points to reach 23,679.05. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-up-masjid-mosque-clash-violence-death-uttar-pradesh-survey-temple-2639456-2024-11-25",
      "headline": "Sambhal: Case against Samajwadi MP, Akhilesh Yadav says riot by Yogi governmentSambhal violence: Opposition parties blamed the BJP for inciting violence through a mosque survey, while the BJP accused the INDIA alliance of fomenting unrest since the Lok Sabha poll failure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-riot-up-court-plea-shahi-jama-masjid-kalki-temple-history-explained-asi-report-2639611-2024-11-25",
      "headline": "Was centuries-old Sambhal temple razed? What 1875 ASI report, historians sayThe town of Sambhal in Uttar Pradesh saw violent rioting over a court-mandated survey at the Shahi Jama Masjid. The violence has roots in a dispute over the Shahi Jama Masjid, which Hindus claim was built after Babur demolished a centuries-old Kalki temple. This is what an ASI report of 1879 and historians say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-air-pollution-aqi-grap-4-curbs-serious-lapses-supreme-court-delhi-police-no-checkpoints-borders-trucks-2639709-2024-11-25",
      "headline": "Serious lapses: Supreme Court pulls up Delhi cops over no checkpoints at city bordersThe court said that they would consider prosecution of the Delhi Police Commissioner for deploying police personnel at only 23 check points, instead of all, on November 18 when Stage 4 of the Graded Response Action Plan (GRAP) kicked in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-live-updates-day-2-sold-unsold-full-squads-csk-rcb-dc-mi-rr-gt-kkr-pbks-srh-lsg-jeddah-2639584-2024-11-25",
      "headline": "Day 2 Live: Prithvi Shaw goes unsold, Punjab buy Jansen for Rs 7 croreIPL 2025 Mega Auction Day 2 Live: Prithvi Shaw and Kane Williamson are some of the big names who have gone unsold. Faf du Plessis, Washington Sundar, and Sam Curran were bought at steal prices. There was a bidding war for South Africa all-rounder Marco Jansen. The second day of the auction is heating up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/is-maharashtra-on-way-to-becoming-congress-mukt-just-like-gujarat-opinion-2639617-2024-11-25",
      "headline": "Is Maharashtra on way to becoming Congress-mukt just like Gujarat?The BJP's remarkable performance in the assembly elections allows it to finally dictate terms to one and all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-chief-minister-face-ajit-pawar-backs-devendra-fadnavis-bjp-ncp-eknath-shinde-2639567-2024-11-25",
      "headline": "Ajit Pawar's power play, backs Devendra Fadnavis for Chief Minister: SourcesAjit Pawar convened a meeting with his newly-elected legislators at his residence on Sunday, where he discussed the next Chief Minister of Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-beat-australia-perth-test-report-bumrah-kohli-siraj-jaiswal-historic-win-2639621-2024-11-25",
      "headline": "1st Test: Jasprit Bumrah's India breach Perth fortress, outclass hapless Australia Border-Gavaskar Trophy: India became the first team to beat Australia at Perth's Optus Stadium as the Jasprit Bumrah-led side secured a historic 295-run win in the first Test of the five-match series. This is India's largest-ever Test win in Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-clash-shahi-masjid-history-mosque-survey-harihar-mandir-babur-2639634-2024-11-25",
      "headline": "A mandir-masjid dispute and a survey: What led to deadly Sambhal violenceSambhal Violence: The Hindu side cites historical texts and an ASI report to support their temple claim, while the Muslim side dismisses it, invoking the 1991 Supreme Court ruling preserving the status of religious sites as they were in 1947."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-masjid-mosque-survey-temple-notice-samajwadi-party-akhilesh-yadav-sp-2639707-2024-11-25",
      "headline": "What happened in Sambhal? Deadly clashes light political fireThe violent clashes in Uttar Pradesh's Sambhal have sparked a political blame game, with the BJP accusing Samajwadi Party leaders of incitement, SP chief Akhilesh Yadav alleging government orchestration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/sanjay-raut-blames-ex-chief-justice-chandrachud-for-maharashtra-assembly-poll-loss-2639581-2024-11-25",
      "headline": "Sanjay Raut blames ex-Chief Justice Chandrachud for Maharashtra poll drubbingSanjay Raut's explosive remark comes after his earlier statement wherein he accused the Mahayuti alliance of \"stealing\" seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-woman-harshita-brella-found-dead-family-alleges-dowry-husband-2639604-2024-11-25",
      "headline": "Husband kept asking for dowry, says sister of Harshita Brella found dead in UKA 24-year-old Indian woman, Harshita Brella, was found dead in the boot of a car in east London on November 14. Her family alleges that she faced dowry harassment from her husband, Pankaj Lamba, who continued to demand more dowry despite receiving a substantial amount."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/earths-axis-has-tilted-by-315-inches-indias-rising-water-demand-is-the-reason-2639648-2024-11-25",
      "headline": "Earth's axis has tilted and India has a big role behind itThe study estimates that humans have pumped out around 2,150 gigatons of groundwater during the study period. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-bombay-placement-report-no-rs-6-lakh-minimum-salary-baseless-2639712-2024-11-25",
      "headline": "'Baseless': IIT Bombay denies reports of setting Rs 6 lakh salary minimumIIT Bombay has refuted reports of setting a Rs 6 lakh minimum salary for placements, citing no such mandate, as discussions heat up ahead of the upcoming placement season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-polls-ncp-ajit-pawar-nephew-rohit-from-opposition-alliance-touches-his-feet-had-i-campaigned-karjat-jamkhed-seat-2639599-2024-11-25",
      "headline": "Nephew touches Ajit Pawar's feet after poll win, he quips: You got savedMaharashtra Election: Maharashtra Deputy Chief Minister Ajit Pawar jokingly told nephew Rohit Pawar he \"barely survived\" winning his seat, crediting his own absence for Rohit's narrow victory. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/vitamins-taken-during-pregnancy-may-contain-high-levels-of-lead-arsenic-study-2639642-2024-11-25",
      "headline": "Vitamins taken during pregnancy may contain high levels of lead, arsenicA recent study highlights concerns over the nutritional content and safety of prenatal vitamins, revealing many lack essential nutrients and contain unsafe levels of toxic metals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-irony-man-look-iron-man-suit-triggers-a-meme-fest-on-x-2639555-2024-11-25",
      "headline": "Elon Musk's 'Irony Man' look in Iron Man suit triggers meme festIn a post on X, Elon Musk shared an image of him flying in an Iron Man suit and described it as \"Irony Man\", which has now triggered a meme fest online.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rejected-by-voters-some-resort-to-hooliganism-to-hijack-parliament-pm-modi-ahead-of-winter-session-2639536-2024-11-25",
      "headline": "PM's 'hooliganism' jab at Opposition ahead of Parliament's Winter Session PM Modi, ahead of the Parliament Winter Session, criticised the Opposition alleging that they disrespect democratic values after electoral defeats. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-men-google-maps-car-incomplete-bridge-bareilly-river-fall-dead-police-investigation-2639395-2024-11-24",
      "headline": "3 killed after Google Maps leads their car to unfinished flyover in UPUP Bridge Accident: Relying on Google Maps to reach a wedding venue proved fatal for three men after the GPS wrongly led their car to an unfinished bridge, where it fell into a river in Uttar Pradesh's Bareilly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-madhuri-dixit-dance-pehla-pehla-pyar-living-his-dream-2639662-2024-11-25",
      "headline": "Kartik Aaryan lives his 'dream' as he dances with Madhuri Dixit to Pehla Pehla PyarKartik Aaryan shared a video of him dancing with Madhuri Dixit to Hum Aapke Hain Koun song Pehla Pehla Pyar. The actor called it living his 'dream'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-blueprint-is-ready-will-maharashtra-haryana-losses-spur-congresss-radical-revamp-2024-election-results-2639348-2024-11-24",
      "headline": "Will Maharashtra, Haryana losses spur Congress's radical revamp?The defeats have again bared the Congress's organisational frailty. Will these setbacks now push the party to unveil its long-promised blueprint for restructuring and revival?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vinay-kumar-hits-out-sanjay-manjrekar-120kmph-bowlers-remark-2639480-2024-11-25",
      "headline": "Vinay Kumar hits out at Sanjay Manjrekar's 120kmph bowlers remark Ind vs Aus: Former India pacer Vinay Kumar strongly responded to Sanjay Manjrekar's 120kmph bowler's remark during his commentary on Day 3 of the first Test between India and Australia in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/britain-king-charles-iii-queen-camilla-india-official-visit-pm-modi-uk-2639511-2024-11-25",
      "headline": "King Charles plans India visit after PM Modi expresses desire to host: ReportThe British Foreign Office has authorised officials to initiate discussions with potential host nations, including India, for the King's tour. PM Modi has expressed his enthusiasm to welcome the royals after their previous visit was cancelled, reports said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-is-in-deep-shit-prashant-kishor-tells-bihari-community-in-us-via-virtual-interaction-following-bypoll-loss-2639506-2024-11-25",
      "headline": "Bihar is in deep s***, Prashant Kishor tells Bihari community in USKishor made the remarks during a virtual interaction with the Bihari community in the United States after launching the US chapter of his party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-kids-uyir-and-ulag-sing-thangamey-song-from-naanum-rowdy-dhaan-2639714-2024-11-25",
      "headline": "Watch: Nayanthara, Vignesh Shivan's kids sing Thangamey song from duo's filmNayanthara and Vignesh Shivan's kids, Uyir and Ulag, were seen singing Thangamey song from Naanum Rowdy Dhaan in a new video. The iconic song is from the film which brought them together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/taylor-swift-wraps-eras-tour-in-toronto-after-receiving-standing-ovation-2639703-2024-11-25",
      "headline": "Taylor Swift wraps Eras Tour in Toronto after receiving standing ovationAmerican singer Taylor Swift recently wrapped the Eras Tour in Toronto, Canada. Swift got emotional as she bid everyone goodbye on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/inside-kartik-aaryan-birthday-party-goa-2639716-2024-11-25",
      "headline": "Friends, sunsets, Rooh Baba cake: Inside Kartik Aaryan's 34th birthday celebrationKartik Aaryan celebrated his 34th birthday with a serene getaway to Goa. The actor enjoyed beach sunsets, poolside fun, and time with friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sookshmadarshini-review-nazriya-nazim-basil-joseph-lead-a-thrilling-ride-2639654-2024-11-25",
      "headline": "Sookshmadarshini review: Nazriya Nazim, Basil Joseph lead a thrilling rideReleased-Fri Nov 22, 2024The Malayalam thriller Sookshmadarshini, starring Basil Joseph and Nazriya Nazim, offers a refreshing take on the genre. With its compelling story and strong performances, the film provides a satisfying experience, despite some logical inconsistencies that slightly hinder its impact."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/prithvi-shaw-unsold-in-1st-round-of-ipl-auction-after-being-released-by-dc-2639726-2024-11-25",
      "headline": "IPL 2025 mega auction: Prithvi Shaw unsold in 1st round after losing DC contractIndia batter Prithvi Shaw went unsold in the first round of the IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-mohammed-kaif-reveals-how-salts-inclusion-in-rcb-prove-beneficial-for-virat-kohli-2639721-2024-11-25",
      "headline": "Kaif reveals how Salt's inclusion in RCB prove beneficial for Virat KohliMohammed Kaif felt that Phil Salt's inclusion in the RCB lineup would prove to be beneficial. With Salt's explosive batting at the top of the order, Virat Kohli will get to play his anchor role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/can-i-bring-my-girlfriend-shastri-recalls-virats-flying-kiss-deja-vu-from-2014-2639715-2024-11-25",
      "headline": "Can I bring my girlfriend? Shastri recalls Virat's flying kiss deja vu from 2014Ravi Shastri recalled an interesting anecdote from 2014 when Virat Kohli requested him to let Anushka Sharma come to the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-jasprit-bumrah-rohit-sharma-press-conference-2639698-2024-11-25",
      "headline": "Selfess Bumrah happy to step aside after 'captain' Rohit Sharma returnsAUS vs IND: Jasprit Bumrah welcomed back 'captain' Rohit Sharma to the Indian setup after India's massive win by 295 runs at the Perth Stadium. Rohit had his first training session on Monday before the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-perth-test-jasprit-bumrah-press-conference-funny-questionjs-2639699-2024-11-25",
      "headline": "Australia afraid of Jasprit Bumrah? Pacer laughs off question after Perth victoryBorder-Gavaskar Trophy 2024: Jasprit Bumrah continued to haunt Australia, taking eight wickets in India's 295-run win in the Perth Test. The stand-in captain had a field day, answering some interesting questions from the press on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-we-need-virat-kohli-jasprit-bumrah-perth-test-century-confidence-2639694-2024-11-25",
      "headline": "Kohli doesn't need us, we need him: Bumrah after Perth Test centuryIndia stand-in captain Jasprit Bumrah heaped praise on Virat Kohli, hailing his resilient century in the Perth Test as a crucial innings that helped India secure a commanding 295-run win and take a 1-0 lead in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/starc-refutes-batters-vs-bowlers-rift-in-australian-dressing-room-perth-loss-2639689-2024-11-25",
      "headline": "Starc refutes batters vs bowlers rift in Australian dressing room after Perth lossAustralia pacer Mitchell Starc refuted reports of a batters vs bowlers rift in the Australian dressing room after the Perth loss to India in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-india-vs-australia-perth-test-jasprit-bumrah-2639683-2024-11-25",
      "headline": "Excuse me, Cummins: AUS captain forgets presentation during chat with BumrahAUS vs IND: Australia captain Pat Cummins hilariously forgot about the presentation ceremony after the conclusion of the Perth Test match. Cummins needed multiple reminders from presenter Adam Gilchrist before he came up on the dias."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-win-stat-pack-2639670-2024-11-25",
      "headline": "Bumrah's historic feat, India's biggest win in Australia: Stat PackAUS vs IND: Jasprit Bumrah's India took a 1-0 lead in the five-match series after beating Pat Cummins' Australia by 295 runs at the Optus Stadium. Bumrah became the Player of the Match for taking eight wickets, including a five-wicket haul in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/perth-pitch-was-not-that-spicy-jasprit-bumrah-bullish-after-record-win-vs-aus-2639665-2024-11-25",
      "headline": "Perth Pitch was not that spicy: Jasprit Bumrah bullish after record win vs AUSAUS vs IND 1st Test: Jasprit Bumrah said that the current pitch was a bit less spicy than the one on which the Indian team played in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-beat-australia-perth-test-report-bumrah-kohli-siraj-jaiswal-historic-win-2639621-2024-11-25",
      "headline": "1st Test: Jasprit Bumrah's India breach Perth fortress, outclass hapless Australia Border-Gavaskar Trophy: India became the first team to beat Australia at Perth's Optus Stadium as the Jasprit Bumrah-led side secured a historic 295-run win in the first Test of the five-match series. This is India's largest-ever Test win in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/starc-refutes-batters-vs-bowlers-rift-in-australian-dressing-room-perth-loss-2639689-2024-11-25",
      "headline": "Starc refutes batters vs bowlers rift in Australian dressing room after Perth lossAustralia pacer Mitchell Starc refuted reports of a batters vs bowlers rift in the Australian dressing room after the Perth loss to India in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-india-vs-australia-perth-test-jasprit-bumrah-2639683-2024-11-25",
      "headline": "Excuse me, Cummins: AUS captain forgets presentation during chat with BumrahAUS vs IND: Australia captain Pat Cummins hilariously forgot about the presentation ceremony after the conclusion of the Perth Test match. Cummins needed multiple reminders from presenter Adam Gilchrist before he came up on the dias."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-win-stat-pack-2639670-2024-11-25",
      "headline": "Bumrah's historic feat, India's biggest win in Australia: Stat PackAUS vs IND: Jasprit Bumrah's India took a 1-0 lead in the five-match series after beating Pat Cummins' Australia by 295 runs at the Optus Stadium. Bumrah became the Player of the Match for taking eight wickets, including a five-wicket haul in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/perth-pitch-was-not-that-spicy-jasprit-bumrah-bullish-after-record-win-vs-aus-2639665-2024-11-25",
      "headline": "Perth Pitch was not that spicy: Jasprit Bumrah bullish after record win vs AUSAUS vs IND 1st Test: Jasprit Bumrah said that the current pitch was a bit less spicy than the one on which the Indian team played in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-beat-australia-perth-test-report-bumrah-kohli-siraj-jaiswal-historic-win-2639621-2024-11-25",
      "headline": "1st Test: Jasprit Bumrah's India breach Perth fortress, outclass hapless Australia Border-Gavaskar Trophy: India became the first team to beat Australia at Perth's Optus Stadium as the Jasprit Bumrah-led side secured a historic 295-run win in the first Test of the five-match series. This is India's largest-ever Test win in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-travis-heads-wicket-was-one-of-best-ball-of-bumrahs-career-sanjay-manjrekar-2639626-2024-11-25",
      "headline": "Travis Head's wicket was one of greatest balls of Bumrah's career: Manjrekar AUS vs IND 1st Test: Sanjay Manjrekar hailed Jasprit Bumrah's delivery to Travis Head as one of the greatest balls of his career. Bumrah managed to get the edge of Head as the Australian batter departed for 89 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ipl-2025-mega-auction-highlights-in-jeddah-ytvd-2639470-2024-11-25",
      "headline": "Major highlights from the IPL 2025 mega auction in JeddahHighlights from the IPL 2025 Mega Auction in Jeddah, featuring record-breaking bids and star players."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-live-updates-day-2-sold-unsold-full-squads-csk-rcb-dc-mi-rr-gt-kkr-pbks-srh-lsg-jeddah-2639584-2024-11-25",
      "headline": "Day 2 Live: Prithvi Shaw goes unsold, Delhi buy Faf du Plessis IPL 2025 Mega Auction Day 2 Live: It's time for Day 2 of the mega auction. Most of the 10 teams zeroed in on their core, splashing huge money on Sunday. They will be more cautious on Monday. However, some big names, including Prithvi Shaw, Bhuvneswar Kumar, Washington Sundar, and Faf du Plessis, are up for grabs today. Who will assemble the best squad? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nostalgia-max-ganguly-and-rahul-dravids-heartwarming-reunion-at-ipl-auction-2639578-2024-11-25",
      "headline": "Nostalgia max: Ganguly and Rahul Dravid's heartwarming reunion at IPL auctionRahul Dravid and Sourav Ganguly were engaged in a fun chat during Day 1 of the IPL 2025 mega auction. Delhi Capitals shared a video of the same, heart-warming enough to send fans into nostalgia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-virat-kohli-jasprit-bumrah-roar-travis-head-wicke-perth-2639566-2024-11-25",
      "headline": "Kohli, Bumrah roar after dismissing 'aggressive' Travis Head in PerthJasprit Bumrah and Virat Kohli let out a roar after dismissing Travis Head on Day 4 in Perth. Head was frustrating India with his aggressive knock in Australia's final innings of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-phil-salt-is-someone-rcb-would-love-to-have-dinesh-karthik-2639561-2024-11-25",
      "headline": "Phil Salt is someone RCB would love to have: Dinesh Karthik in IPL auctionIPL 2025 mega auction: Dinesh Karthik hailed Phil Salt's acquisition and said that he was the kind of player RCB wanted in their team. RCB spent Rs 11.50 crore on the star England wicketkeeper-batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-rohit-sharma-hit-the-nets-reach-perth-2639558-2024-11-25",
      "headline": "No time to waste, Rohit Sharma hit the nets straightaway after reaching PerthIndia captain Rohit Sharma hit the nets after arriving in Perth, while the team, led by his deputy Jasprit Bumrah, slowly but steadily edged closer to a decisive victory over Australia in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-final-d-gukesh-aims-to-become-youngest-champion-vs-ding-liren-2639553-2024-11-25",
      "headline": "World Chess Championship Final: D Gukesh aims to become youngest championIndia's D Gukesh is set to face China's Ding Liren in the final of the World Chess Championship Final. If in-form Gukesh beats Ding Liren, the 18-year-old will become the youngest to win the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-virat-kohli-jasprit-bumrah-roar-travis-head-wicke-perth-2639566-2024-11-25",
      "headline": "Kohli, Bumrah roar after dismissing 'aggressive' Travis Head in PerthJasprit Bumrah and Virat Kohli let out a roar after dismissing Travis Head on Day 4 in Perth. Head was frustrating India with his aggressive knock in Australia's final innings of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-phil-salt-is-someone-rcb-would-love-to-have-dinesh-karthik-2639561-2024-11-25",
      "headline": "Phil Salt is someone RCB would love to have: Dinesh Karthik in IPL auctionIPL 2025 mega auction: Dinesh Karthik hailed Phil Salt's acquisition and said that he was the kind of player RCB wanted in their team. RCB spent Rs 11.50 crore on the star England wicketkeeper-batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-rohit-sharma-hit-the-nets-reach-perth-2639558-2024-11-25",
      "headline": "No time to waste, Rohit Sharma hit the nets straightaway after reaching PerthIndia captain Rohit Sharma hit the nets after arriving in Perth, while the team, led by his deputy Jasprit Bumrah, slowly but steadily edged closer to a decisive victory over Australia in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-final-d-gukesh-aims-to-become-youngest-champion-vs-ding-liren-2639553-2024-11-25",
      "headline": "World Chess Championship Final: D Gukesh aims to become youngest championIndia's D Gukesh is set to face China's Ding Liren in the final of the World Chess Championship Final. If in-form Gukesh beats Ding Liren, the 18-year-old will become the youngest to win the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-perth-test-rift-in-australia-adam-gilchrist-hazlewood-perth-test-comments-2639534-2024-11-25",
      "headline": "Rift in Australian team? Gilchrist highlights Hazlewood's Perth Test commentsConcerns have been raised about a potential divide in the Australian cricket team after Josh Hazlewood's comments appeared to shift focus to the batting unit following a challenging day in the Perth Test against India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-venkatesh-iyer-kkr-tom-moody-2639533-2024-11-25",
      "headline": "Venkatesh Iyer is going to struggle: Tom Moody on KKR's 23.75 crore buyIPL 2025 Auction: Kolkata Knight Riders shelled out a massive price for Venkatesh Iyer, who fetched INR 23.75 crore. Iyer has played 51 matches for KKR since his debut back in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-rohit-sharma-joins-gautam-gambhir-in-team-india-dressing-room-watches-perth-test-2639515-2024-11-25",
      "headline": "Rohit Sharma joins Gambhir in Team India dressing room, watches Perth TestIndia captain Rohit Sharma was spotted in the India dressing room watching the Perth Test match. Rohit was sitting beside head coach Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-kl-rahul-reacts-rohit-sharma-return-adelaide-test-2639508-2024-11-25",
      "headline": "Rahul reacts to Rohit Sharma's return for 2nd Test: Hopefully I get a chanceKL Rahul hopes to retain his spot in the XI as skipper Rohit Sharma returns for the Adelaide Test. With Jasprit Bumrah leading in Rohit's absence and Rahul opening alongside Yashasvi Jaiswal, the team must now decide whether to slot Rahul in the middle order or drop him.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}