{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-silent-debt-crisis-easy-loans-bnpl-apps-emi-burden-expert-panel-report-2849529-2026-01-10",
      "headline": "Drowning in debt: How easy loans are turning into an EMI nightmare for IndiansMonth after month, salaries go to EMIs, essentials shrink, and families realise that what once felt temporary has become the new normal. Read on to understand how this silent debt crisis is unfolding within Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sip-investments-hit-record-high-in-december-2025-amfi-2849472-2026-01-09",
      "headline": "SIP investments hit record high in December 2025: AMFIThe latest data from the Association of Mutual Funds in India (AMFI) for December 2025 shows steady participation from retail investors, record SIP contributions and sustained interest in equity and hybrid schemes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-it-possible-for-the-us-to-put-a-price-tag-on-greenland-2849404-2026-01-09",
      "headline": "Is it possible for the US to put a price tag on Greenland?In 1946, the US offered to buy the vast, mineral-rich Arctic island from Denmark for $100 million, an offer that was rejected back then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pf-keep-earning-interest-after-you-have-left-job-2849324-2026-01-09",
      "headline": "Will your PF keep earning interest after you have left job?Changing jobs is common today, but doubts around Provident Fund savings still linger. Many employees worry that their PF stops growing once they leave a job. The truth, however, is very different and often misunderstood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-income-tax-relief-expectations-middle-class-2849334-2026-01-09",
      "headline": "Tax relief on the cards? What to expect from Budget 2026Changes to tax slabs, a higher exemption limit and a continued push towards the new tax regime helped reduce the tax burden for many families and eased pressure on households in budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-600-points-lower-nifty-below-25700-ntpc-down-2-percent-2849312-2026-01-09",
      "headline": "Sensex closes 605 points lower, Nifty below 25,700; NTPC down 2%The S&P BSE Sensex tanked 604.72 points to close at 83,576.24, while the NSE Nifty50 lost 193.55 points to end at 25,683.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-rates-today-india-global-turmoil-investors-safe-haven-demand-mcx-2849288-2026-01-09",
      "headline": "Gold, silver rates today: What should investors know amid global turmoilGold prices in India moved higher across all major purity levels on January 9. The price of 24K gold stood at Rs 13,871 per gram, up by Rs 71 from the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/govt-ducks-imfs-c-grade-criticism-in-stunning-rti-stonewall-no-answers-no-fixes-2849264-2026-01-09",
      "headline": "Govt ducks IMF's 'C' grade criticism in stunning RTI stonewall: No answers, no fixesOn the estimation of GDP and Gross Value Added (GVA) for the unorganised sector, MoSPI said it follows methodologies outlined in official documents released in 2012 and 2015, both available in the public domain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-hoping-for-a-tax-makeover-why-you-might-be-disappointed-this-year-2849244-2026-01-09",
      "headline": "Budget 2026: Hoping for a tax makeover? Why you might be disappointed this yearHoping Budget 2026 will finally bring sweeping tax changes? Experts suggest this may not be the year for big announcements or dramatic relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-bccl-ipo-fully-subscribed-day-1-gmp-latest-2849238-2026-01-09",
      "headline": "Bharat Coking Coal IPO fully booked on Day 1. Should you subscribe?BCCL IPO: The allotment is expected to be finalised on January 14, 2026. Shares are proposed to list on the BSE and NSE on January 16, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-sector-rotation-what-truly-shapes-returns-in-indian-equity-markets-2849221-2026-01-09",
      "headline": "Is sector rotation the real driver of returns in Indian equity markets?Sector rotation in its simplest form is the reaction of the market to shifts in the economic environment. The various sectors are enjoyed at various stages of the cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-bloodbath-on-dalal-street-sensex-down-700-points-explained-2849218-2026-01-09",
      "headline": "Sensex falls over 600 points: What's behind the bloodbath on Dalal Street?Around 12:46 pm, the BSE Sensex was down 634.91 points to 83,546.05, while the NSE Nifty50 fell 188.80 points to 25,688.05. Most of the broader market indices also tumbled, reflecting the volatility on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-not-received-your-income-tax-refund-in-2026-here-is-why-it-is-taking-time-2849156-2026-01-09",
      "headline": "Still not received your income tax refund in 2026? Here's why it's taking timeWaiting endlessly for your tax refund can be stressful. If your FY 2024–25 income tax refund has not arrived yet in 2026, there are several common reasons behind the delay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumble-what-next-for-dalal-street-investors-2849163-2026-01-09",
      "headline": "Trump's 500% tariff threat rattles Dalal Street. What should investors do now?Around 11:55 am, the Sensex was down nearly 450 points, while the NSE Nifty 50 had tumbled over 130 points, pushing the benchmark indices deeper into the red after a bruising week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-insurance-sector-needs-more-than-an-fdi-reset-2849098-2026-01-09",
      "headline": "Budget 2026: Why insurance sector needs more than an FDI boostWith FDI reforms in place, Budget 2026 must prioritise affordability, trust and protection-led incentives to close India's insurance gap and turn reform momentum into real coverage for citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mutual-fund-inflows-december-2025-equity-mf-drop-amfi-data-2849130-2026-01-09",
      "headline": "Mutual fund inflows cool off in December, down 6% to Rs 28,054 croreData released by the Association of Mutual Funds in India, or AMFI, showed that inflows into equity mutual funds fell 6% in December to Rs 28,054 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bhel-share-price-rises-over-4-percent-why-bhel-stock-is-gaining-today-new-order-bcgcl-2849092-2026-01-09",
      "headline": "BHEL share price jumps over 4%. Why is the stock rising today?BHEL shares were trading at Rs 282.40, up Rs 10.10 or 3.71% as of 10:10 AM. The stock had closed at Rs 272.30 in the last session. It opened higher at Rs 279.10 and moved up further during the day.. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-gains-over-200-points-nifty-above-25900-bel-it-metal-up-2849062-2026-01-09",
      "headline": "Sensex gains over 200 points, Nifty above 25,900; BEL up 2%The S&P BSE Sensex was down by 35.21 points to 84,145.75, while the NSE Nifty50 lost 19.80 points to 25,857.50 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-will-stock-market-fall-again-us-tariff-concerns-trading-setup-nse-bse-2849049-2026-01-09",
      "headline": "Sensex, Nifty trade setup: Will stock market fall again today?Both Sensex and Nifty have seen steady losses over the past four sessions. Nifty has fallen 1.7% during this period, while Sensex is down 1.8%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-bccl-ipo-opens-review-good-bad-gmp-falls-should-you-subscribe-price-band-details-2849045-2026-01-09",
      "headline": "Bharat Coking Coal IPO opens for bidding, but GMP falls. Should you apply?BCCL IPO: The allotment is expected to be finalised on January 14, 2026. Shares are proposed to be listed on the BSE and NSE, with a tentative listing date of January 16, 2026."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vivek-oberoi-cheers-as-kantara-chapter-1-enters-oscar-race-roar-of-ancestors-2849938-2026-01-10",
      "headline": "Vivek Oberoi cheers as Kantara Chapter 1 enters Oscar race: Roar of ancestors Vivek Oberoi cheered for 'Kantara Chapter 1' as the film has been listed by The Academy among the 201 film titles eligible for the Best Picture category. Vivek praised Rishab Shetty and expressed his admiration for the Bhuta Kola tradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshans-52nd-birthday-saba-azad-wishes-days-of-fulfilling-creation-2849922-2026-01-10",
      "headline": "Hrithik Roshan's 52nd birthday: Saba Azad wishes days of fulfilling creation Saba Azad shared an emotional message for her partner Hrithik Roshan on his 52nd birthday. She shared a series of pictures from their holidays and lunch outings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthi-is-victory-garland-for-dmk-history-kamal-haasan-to-udhayanidhi-stalin-2849901-2026-01-10",
      "headline": "Parasakthi is victory garland for DMK history: Kamal Haasan to Udhayanidhi Stalin Kamal Haasan wrote a letter to Deputy CM Udhayanidhi Stalin, praising Sivakarthikeyan's 'Parasakthi' as a 'war-drum' for the upcoming elections. He blessed the film, calling it as a \"victory garland\" for DMK history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-colonel-hoshiar-singh-dahiya-wife-blesses-varun-dhawan-praises-actor-2849886-2026-01-10",
      "headline": "Border 2: Colonel Hoshiar Singh Dahiya's wife blesses Varun Dhawan, praises actor PVC (Parm Vir Chakra) Colonel Hoshiar Singh Dahiya's wife showered praise on Varun Dhawan for sincerely portraying her husband's legacy in Border 2. The film is set for a theatrical release on January 23, 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rani-mukerji-mardaani-3-release-moved-ahead-cop-drama-to-arrive-on-january-30-2849865-2026-01-10",
      "headline": "Rani Mukerji's Mardaani 3 release moved ahead: Cop drama to arrive on January 30 Rani Mukerji is back as the fearless cop Shivani Shivaji Roy in Mardaani 3. The film's new poster reveals its release date has been moved ahead to January 30, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-theri-to-re-release-for-pongal-after-jana-nayagan-censor-row-2849873-2026-01-10",
      "headline": "Vijay's Theri to re-release for Pongal after Jana Nayagan's censor row Celebrating its tenth anniversary, the action thriller 'Theri' hits theatres worldwide on January 15, 2026. Vijay portrays a dual role in the 2016 action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/masterchef-india-9-contestant-inspires-ranveer-vikas-with-parkinsons-battle-2849806-2026-01-10",
      "headline": "Masterchef India 9 contestant inspires Ranveer, Vikas with Parkinson's battle 'Masterchef India Season 9' contestant Mini impressed Chefs Vikas Khanna and Ranveer Brar with her resilience, viewing cooking as a vital form of therapy and a way to inspire others through her \"magic.\" Judges gave her a standing ovation for her dedication and passion for cooking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-birthday-tributes-from-family-highlight-bollywood-stars-inspiring-journey-2849796-2026-01-10",
      "headline": "Hrithik turns 52: Rakesh Roshan sends love, sister Sunaina posts childhood pics On Hrithik Roshan's 52nd birthday, his sister Sunaina Roshan and father Rakesh Roshan shared emotional messages and rare family photographs, offering fans a glimpse into the actor's early life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-celebrates-father-allu-aravinds-77th-birthday-heartfelt-tribute-allu-cinemas-opening-2849787-2026-01-10",
      "headline": "Closest thing to God in my life: Allu Arjun's birthday wish for father Allu Aravind Actor Allu Arjun extended his heartfelt wishes to producer and father Allu Aravind on his 77th birthday. The 'Pushpa' actor wrote a personal message and photo in front of the newly launched Allu Cinemas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-on-censorship-amid-jana-nayagan-row-freedom-of-expression-at-stake-2849784-2026-01-10",
      "headline": "Kamal Haasan on censorship amid Jana Nayagan row: Freedom of expression at stake Kamal Haasan, while citing the constitution and emphasising freedom of expression, called for a \"principled relook\" at film certification after 'Jana Nayagan' faced a Pongal release block. He stressed that a lack of transparency stifles creativity and harms the industry's ecosystem.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/people-we-meet-on-vacation-review-emily-henry-book-meets-limits-on-screen-2849753-2026-01-10",
      "headline": "People We Meet on Vacation Review: Emily Henry's book meets its limits on screenRelease Date:Fri Jan 09, 2026 A review of Netflix's People We Meet on Vacation, unpacking why the Emily Henry adaptation works better as a translation than a copy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/parasakthi-film-review-hindi-imposition-youth-protest-tamil-nadu-politics-2849774-2026-01-10",
      "headline": "Parasakthi review: Sivakarthikeyan's period drama reignites Hindi imposition debateRelease Date:Sat Jan 10, 2026 Parasakthi movie review: Director Sudha Kongara Prasad's Parasakthi, starring Sivakarthikeyan, Ravi Mohan, Atharvaa and Sreeleela, the film is about student revolution against Hindi imposition. With solid emotional beats, the film has all the potential to become a Pongal winner despite some shortcomings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-producer-venkat-k-narayana-addresses-censor-board-dispute-film-release-delays-2849727-2026-01-10",
      "headline": "Jana Nayagan producer addresses censor row: Vijay deserves the farewell he's earned Amid the Jana Nayagan censor row, the makers have spoken out for the first time, detailing the challenges the Thalapathy Vijay starrer faced during its certification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-4-confirmed-new-episodes-expected-to-release-in-late-2026-2849740-2026-01-10",
      "headline": "The Diplomat Season 4 confirmed, new episodes expected to release in late 2026 'The Diplomat' season four was confirmed in Netflix's 2026 slate. The series is expected to release in late 2026, with production set to begin in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/oromeo-first-glimpse-shahid-kapoor-steps-into-a-brutal-vengeance-driven-tale-2849716-2026-01-10",
      "headline": "O'Romeo teaser: Shahid Kapoor steps into a brutal, vengeance-driven tale Shahid Kapoor surprised fans with the first glimpse of his upcoming film 'O'Romeo'. The film directed by Vishal Bharadwaj, will release in theatres on February 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-candid-moments-fan-engagement-upcoming-projects-2849686-2026-01-10",
      "headline": "Priyanka Chopra's sweet video of Nick Jonas proves what healthy flirting is. Watch Priyanka Chopra's latest video featuring Nick Jonas at a swimming pool has drawn attention from fans, highlighting the couple's love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stebin-ben-nupur-sanon-wedding-celebrations-udaipur-haldi-sangeet-2849672-2026-01-10",
      "headline": "Kriti Sanon joins friends for a fun dance at Nupur-Stebin's sangeet. Watch The wedding celebrations of actor Nupur Sanon and singer Stebin Ben in Udaipur featured vibrant haldi and sangeet ceremonies. Several videos from the pre-wedding festivities have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-most-hindi-films-struggle-to-crack-south-market-despite-ongoing-pan-india-boom-2848199-2026-01-10",
      "headline": "Why most Hindi films struggle to crack South market despite ongoing pan-India boom Even as most South films rake it in at the pan-India box office regularly, Bollywood continues to struggle in southern markets that remain deeply rooted and self-sufficient with regional language content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matt-damon-ben-affleck-go-candid-on-money-stunts-and-life-beyond-acting-watch-2849666-2026-01-10",
      "headline": "Matt Damon, Ben Affleck go candid on money, stunts and life beyond acting. Watch Actors Matt Damon and Ben Affleck recently sat down for a conversation where they got candid about their lives beyond acting, stunts and more. The two will be seen sharing screen space in 'The Rip.'"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-offers-prayers-at-gujarats-somanath-temple-takes-part-in-swabhiman-parv-celebrations-2849919-2026-01-10",
      "headline": "PM Modi offers prayers at Somnath temple, attends Swabhiman Parv celebrationsPrime Minister Modi took part in the 'Somnath Swabhiman Parv' celebrations to mark 1,000 years since the first attack on the ancient temple in Gujarat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-approaches-supreme-court-after-calcutta-high-court-defers-hearing-in-i-pac-case-against-mamata-banerjee-2849788-2026-01-10",
      "headline": "ED moves Supreme Court after Calcutta High Court defers hearing in I-PAC caseThe ED has detailed a sequence of events in its petition, describing what it termed a \"showdown\" during search operations conducted at premises linked to political consultancy firm I-PAC."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ayodhya-ram-mandir-kashmiri-youth-detained-namaz-attempt-uttar-pradesh-2849781-2026-01-10",
      "headline": "Kashmiri man attempts to offer namaz inside Ayodhya's Ram Mandir, raises slogansA Kashmir resident, Ahmed Sheikh, was detained after allegedly attempting to offer namaz inside the Ram Mandir complex in Ayodhya. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cold-wave-to-continue-temperature-to-dip-on-sunday-morning-in-north-india-2849903-2026-01-10",
      "headline": "North India to witness freezing morning on Sunday, cold wave to continueCold wave and cold day conditions are likely to prevail in pockets of Punjab, Rajasthan, and Uttar Pradesh, particularly during the early morning hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-dogs-are-watching-us-333-10-01-2026",
      "headline": "The dogs are watching usIn three consecutive days of hearing as to whether streets must be cleared of stray dogs and if they must be sent away to shelters, Supreme Court observed much and lawyers argued a lot. The result: a slew of quotable quotes for both dog-loving and dog-baiting humans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zoho-founder-sridhar-vembu-divorce-case-who-is-wife-pramila-srinivasan-2849862-2026-01-10",
      "headline": "Who is Pramila Srinivasan, Zoho founder's wife at centre of bitter divorceZoho founder Sridhar Vembu is involved in a high-stakes divorce battle with his estranged wife, Pramila Srinivasan.  It has brought into focus the personal life of the Zoho founder and his US-based wife, who has alleged that Vembu abandoned her and their autistic child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/devendra-fadnavis-eknath-shinde-former-maharashtra-dgp-sanjay-pande-plotted-to-frame-2016-ulc-scam-case-report-rashmi-shukla-report-2849684-2026-01-10",
      "headline": "Ex-Maharashtra DGP plotted to frame Fadnavis, Shinde in ULC scam, claims reportA special investigation report submitted by outgoing Maharashtra DGP Rashmi Shukla to the state Home Department revealed that former DGP Sanjay Pande plotted to frame Devendra Fadnavis and Eknath Shinde in the 2016 ULC scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-vs-delhi-capitals-live-score-jemimah-rodrigues-harmanpreet-kaur-navi-mumbai-2849885-2026-01-10",
      "headline": "MI vs DC Live: Mumbai thrash Delhi by 50 runs, recovers from RCB defeatMumbai Indians vs Delhi Capitals, WPL 2026 Highlights: Mumbai Indians hammered Delhi Capitals by 50 runs to open their campaign in the tournament. Chinelle Henry scored 56, but Nicola Carey and Amelia Kerr took three-wicket hauls to take the two-time champions past the finish line. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/drunk-driver-jumps-divider-rams-car-into-bengaluru-restaurant-incident-caught-on-cctv-camera-2849915-2026-01-10",
      "headline": "Caught on CCTV: Drunk driver jumps divider, rams car into Bengaluru restaurantAccording to police, the car, driven by a 42-year-old man, was travelling from 18th Main Road towards 100 Feet Road at high speed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mary-kom-opens-up-on-her-divorce-onkholer-boxing-india-2849937-2026-01-10",
      "headline": "Mary Kom breaks silence on her divorce: He was not the man I believed him to beMary Kom has spoken out on her divorce, financial distress and public slander, saying her silence was being misread. The boxing legend says she felt forced to speak during her darkest phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-theri-to-re-release-for-pongal-after-jana-nayagan-censor-row-2849873-2026-01-10",
      "headline": "Vijay's Theri to re-release for Pongal after Jana Nayagan's censor rowCelebrating its tenth anniversary, the action thriller 'Theri' hits theatres worldwide on January 15, 2026. Vijay portrays a dual role in the 2016 action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/6-killed-in-series-of-shooting-in-uss-mississippi-suspect-in-custody-2849939-2026-01-10",
      "headline": "6 killed in series of shootings in Mississippi, suspect in custodyThe shootings occurred at three separate locations in Mississipp, leaving at least six people dead; a suspect has been arrested and authorities say there is no longer any threat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rani-mukerji-mardaani-3-release-moved-ahead-cop-drama-to-arrive-on-january-30-2849865-2026-01-10",
      "headline": "Rani Mukerji's Mardaani 3 release moved ahead: Cop drama to arrive on January 30Rani Mukerji is back as the fearless cop Shivani Shivaji Roy in Mardaani 3. The film's new poster reveals its release date has been moved ahead to January 30, 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-navy-base-haldia-bay-of-bengal-china-bangladesh-pakistan-activities-2849770-2026-01-10",
      "headline": "With eye on China and Bangladesh, India to set up naval base in BengalThe new base of the Indian Navy in the Bay of Bengal is being established amid rising Chinese naval activity and evolving regional security dynamics involving Bangladesh and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-rourkela-indiaone-air-nine-seater-plane-crash-2849772-2026-01-10",
      "headline": "6 injured as small plane crashes in Odisha during emergency landing, probe orderedOfficials said the pilots executed a controlled forced landing, which helped prevent any loss of life. The district administration reached the site after receiving information and shifted all injured persons to medical facilities in Rourkela.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protests-women-light-cigarettes-burn-khamenei-photos-viral-2849736-2026-01-10",
      "headline": "Why Iran women are lighting cigarettes from burning Khamenei photosIranian women seem to have ignited a new protest trend, lighting cigarettes from burning photos of Supreme Leader Ayatollah Ali Khamenei amid the bloody unrest that has gripped the Middle Eastern nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/skies-in-birmingham-mysteriously-turned-pink-its-not-auroras-2849906-2026-01-10",
      "headline": "Skies in Birmingham mysteriously turned pink. It's not aurorasResidents from the city center to nearby Hednesford in Staffordshire captured the dazzling display on social media, initially mistaking it for auroras or an otherworldly event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-559-09-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-pakistan-dhaka-karachi-direct-flight-india-overflight-permission-1978-agreement-biman-bangladesh-2849536-2026-01-10",
      "headline": "Why India decides the fate of Dhaka-Karachi direct flightsFollowing growing bonhomie between Pakistan and Bangladesh, direct flights between Dhaka and Karachi are set to resume from January 29, after over a decade. Since India and Pakistan have banned each other's aircraft from their respective airspaces, would New Delhi allow the Dhaka-Karachi air service to operate over its territory, amid strained India-Bangladesh ties?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-gifts-jemimah-rodrigues-bat-shaped-guitar-womens-premier-league-2849618-2026-01-10",
      "headline": "Sunil Gavaskar gifts Jemimah bat-shaped guitar, joins her for promised duetSunil Gavaskar surprised Jemimah Rodrigues with a customised bat-shaped guitar in Mumbai. The cricket great fulfilled a promise he made during India's Women's World Cup campaign by sitting down with her for a jamming session on the eve of the Women's Premier League opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-most-hindi-films-struggle-to-crack-south-market-despite-ongoing-pan-india-boom-2848199-2026-01-10",
      "headline": "Why most Hindi films struggle to crack South market despite ongoing pan-India boomEven as most South films rake it in at the pan-India box office regularly, Bollywood continues to struggle in southern markets that remain deeply rooted and self-sufficient with regional language content."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-greenland-threat-denmark-shoot-first-military-strength-us-comparison-2849691-2026-01-10",
      "headline": "Denmark says we'll shoot first if US invades Greenland. But with what?Denmark has warned that its troops were under standing orders to 'shoot first and ask questions later' if Greenland is attacked by the US. But can the Danish army take on the might of the US in case of a military invasion or a Venezuela-like operation?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/hanging-coffin-and-cliff-burials-origins-beliefs-and-living-descendants-2849743-2026-01-10",
      "headline": "Hanging coffins and cliff burials: The ancient culture that still lives onHanging coffins and cliff burials were once widespread across parts of East and Southeast Asia, shaped by beliefs around honour, ancestry and spiritual elevation. New DNA research has now confirmed that the Bo tribe, one of the earliest practitioners of this ritual, still has living descendants, revealing rare cultural continuity from the Neolithic era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/bmc-polls-marathi-asmita-language-poll-plank-falls-flat-for-gen-z-of-mumbai-civic-body-elections-mns-shiv-sena-ubt-mahayuti-2848647-2026-01-10",
      "headline": "BMC polls: Marathi language poll plank falls flat for Gen Z-ers of MumbaiThe longstanding issue of Marathi Asmita is hot again ahead of the BMC polls, but Mumbai's Gen Z is tuning it out. For the city's youngest voters, potholes, waste management, and breathable air are bigger than language politics. With youth forming nearly a quarter of the BMC electorate, civic issues might decide who governs India's richest municipal body."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wesley-so-leads-open-blitz-arjun-erigaisi-nihal-sarin-follow-2849952-2026-01-10",
      "headline": "Tata Chess Blitz: Arjun Erigaisi in second, Nihal Sarin stuns Viswanathan Anand Arjun Erigaisi is hot on the heels of Wesley So, who took the sole lead in the Open Blitz after nine rounds, while Carissa Yip edged ahead in the Women's Blitz. Nihal Sarin pulled off a big upset over Viswanathan Anand with a stunning performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-awaits-icc-response-security-concerns-t20-world-cup-india-2849950-2026-01-10",
      "headline": "Bangladesh yet to receive response from ICC on T20 World Cup: BCB president BCB president Aminul Islam Bulbul said Bangladesh are still awaiting a response from the ICC on security concerns over playing T20 World Cup matches on Indian soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/macclesfield-stuns-crystal-palace-fa-cup-upset-reach-fourth-round-2849943-2026-01-10",
      "headline": "FA Cup holders Crystal Palace crash out after 1-2 defeat to sixth-tier Macclesfield Sixth-tier Macclesfield knocked out title holders Crystal Palace in a dramatic 2-1 victory, defying the odds and sending shockwaves through the FA Cup. The gulf between the teams was evident, but Macclesfield's belief and composure overcame Premier League opposition in front of jubilant home fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mary-kom-opens-up-on-her-divorce-onkholer-boxing-india-2849937-2026-01-10",
      "headline": "Mary Kom breaks silence on her divorce: He was not the man I believed him to be Mary Kom has spoken out on her divorce, financial distress and public slander, saying her silence was being misread. The boxing legend says she felt forced to speak during her darkest phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sneh-rana-bizarre-no-ball-delhi-capitals-mumbai-indians-wpl-2026-2849931-2026-01-10",
      "headline": "What just happened? Sneh Rana's bizarre no-ball steals spotlight against MI Sneh Rana stole the spotlight in WPL 2026 with a bizarre no-ball that left players and fans stunned during the match between Delhi Capitals and Mumbai Indians on Saturday in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lauren-bell-rcb-wpl-debut-four-wickets-one-million-instagram-followers-2849920-2026-01-10",
      "headline": "RCB sensation Lauren Bell achieves another major landmark after dream WPL debut England pacer Lauren Bell enjoyed a dream Women's Premier League debut for Royal Challengers Bengaluru against Mumbai Indians, capping a match-winning spell with the milestone of one million Instagram followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-delhi-capitals-lizelle-lee-stunner-catch-wpl-debut-mumbai-indians-2849909-2026-01-10",
      "headline": "Lizelle Lee goes full Supergirl with stunner on WPL debut for Delhi Capitals: Watch WPL 2026, MI-W vs DC-W: Lizelle Lee's WPL debut for Delhi Capitals blended chaos and brilliance as the retired South African pulled off two stunning catches, stamped her authority in the field and turned the game on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-injury-update-wpl-comeback-up-warriorz-gujarat-giants-2849908-2026-01-10",
      "headline": "Pratika Rawal turns cheerleader for UP Warriorz despite being sidelined by injury Despite being sidelined by ankle and knee injuries, Pratika Rawal showed her unwavering support for UP Warriorz by cheering from the stands during their WPL opener against Gujarat Giants in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anushka-sharma-shines-44-runs-wpl-debut-gujarat-giants-2849904-2026-01-10",
      "headline": "Who is Anushka Sharma? Virat Kohli fan steals spotlight on WPL debut Anushka Sharma marked her Women's Premier League debut for Gujarat Giants with a brisk 44 off 30 deliveries, forming a key partnership with Ashleigh Gardner against UP Warriorz. A Virat Kohli fan, Anushka, was able to grab the attention of everyone with her brilliant knock with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/birmingham-turns-pink-fa-cup-stadium-lights-snow-2849896-2026-01-10",
      "headline": "Birmingham turns pink as FA Cup stadium lights reflect off snow The city of Birmingham had pink skies on a dreamy winter's night. Social media users put up photos and videos of the pink sky, calling it wondrous. What caused the phenomenon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-vs-delhi-capitals-live-score-jemimah-rodrigues-harmanpreet-kaur-navi-mumbai-2849885-2026-01-10",
      "headline": "MI vs DC Live: DC (133/8 in 17.1 ov), Henry departs as Mumbai edge closer to win Mumbai Indians vs Delhi Capitals, WPL 2026 Live Score, DC (133/8 in 17.1 overs): Chinelle Henry has departed as Mumbai Indians are close to opening their account in the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/up-warriorz-lose-to-gujarat-giants-runs-in-wpl-opener-meg-lanning-2849878-2026-01-10",
      "headline": "Meg Lanning's UP Warriorz journey begins with defeat as Gujarat Giants win thrillerWPL 2026, GG vs UPW: Meg Lanning made a tough start to her journey with the UP Warriorz after Gujarat Giants edged them in the thriller on Saturday in Navi Mumbai. Georgia Wareham won the Player of the Match effort for her all-round effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-captain-roadmap-test-comeback-2849864-2026-01-10",
      "headline": "Shubman Gill lays out roadmap to for India's Test comebackIndia's packed calendar has hurt Test preparation. Shubman Gill has urged the BCCI to rethink scheduling, stressing the need for breathing space when switching from white-ball cricket to Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-new-zealand-odi-series-2024-key-squads-match-schedule-t20-world-cup-2849808-2026-01-10",
      "headline": "IND vs NZ ODIs: Squads, livestreaming details and all you need to knowIndia will host New Zealand in a three-match ODI series beginning 11 January at Kotambi Stadium, with both sides aiming to fine-tune their squads ahead of the T20 World Cup. The series offers both teams valuable preparation and will be broadcast live on Star Sports and JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-scores-96-against-scotland-warm-up-under-19-world-cup-2026-2849807-2026-01-10",
      "headline": "Vaibhav Suryavanshi goes ballistic again, slams 50-ball 96 against Scotland U-19India's teen batting star Vaibhav Suryavanshi scored a dazzling 96 against Scotland Under-19 in the warm-up fixture ahead of the ICC Under-19 World Cup. The 14-year-old whacked nine fours and seven sixes during his fiery knock."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/axar-patel-ind-vs-nz-ms-dhoni-t20-world-cup-2849798-2026-01-10",
      "headline": "How MS Dhoni's simple tweak saved Axar Patel's career in 2021IND vs NZ: India all-rounder Axar Patel has revealed how legendary MS Dhoni saved his international career in 2021. Axar said that Dhoni had a big part in turning him into a proper batter in all formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-pacer-zaman-khan-bowling-action-chucking-big-bash-league-david-warner-cheeky-dig-2849802-2026-01-10",
      "headline": "BBL: Pakistan pacer's bowling action under fire, David Warner takes cheeky dig at himZaman Khan came under scrutiny in the BBL after David Warner questioned the Pakistan pacer's slingshot action on the field, reviving memories of past controversies involving bowlers' actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-steve-smith-v-grip-celebration-bbl-fifty-2849791-2026-01-10",
      "headline": "Usman Khawaja imitates Steve Smith on BBL return, hits fifty in Brisbane Heat's winUsman Khawaja returned to the Big Bash League with a bang, scoring a brilliant 78 to help the Brisbane Heat defeat Sydney Thunder on Saturday, January 10. Khawaja decided to pull off the V-grip celebration, like Steve Smith, to celebrate reaching his half-century. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-denies-dressing-room-rift-test-calendar-india-vs-new-zealand-odi-series-2849786-2026-01-10",
      "headline": "Gill dismisses dressing room rift, blames tight calendar for Test debacleIndia captain Shubman Gill has denied any dressing room rift ahead of the ODI series against New Zealand. India are set to take on Kiwis in three ODIs beginning on January 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-gujarat-titans-vs-up-warriorz-live-score-meg-lanning-deepti-sharma-navi-mumbai-2849775-2026-01-10",
      "headline": "GG vs UPW, Highlights: Ashleigh Gardner stars in Gujarat Giants' 10-run winGujarat Giants vs UP Warriorz Highlights: Gujarat Giants take the win in their season opener with the skipper, Ashleigh Gardner putting up an all-round show to beat UP Warriorz by 10 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-influence-shubman-gill-india-vs-new-zealand-pre-match-press-conference-2849771-2026-01-10",
      "headline": "Rohit Sharma, Virat Kohli make captain's job easier: Shubman Gill on duo's ODI impactIND vs NZ: Shubman Gill believes Rohit Sharma and Virat Kohli make an ODI captain's job easier. Their experience in pressure situations, Gill says, is invaluable as India prepare for the New Zealand series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-parts-ways-with-jan-zelezny-months-after-world-championship-flop-show-2849751-2026-01-10",
      "headline": "Neeraj Chopra parts ways with coach Jan ZeleznyNeeraj Chopra has parted ways with his coach, the legendary Jan Zelezny. The move comes just months after his World Championship flop show. Under Zelezny, Chopra had a difficult year despite breaking the 90-m mark in his first competition of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-t20-world-cup-snub-reaction-india-vs-new-zealand-odi-series-2849749-2026-01-10",
      "headline": "Shubman Gill breaks silence on T20 World Cup snubIndia vs New Zealand: India ODI captain Shubman Gill has reacted to his T20 World Cup 2026 snub. Gill, who was the vice-captain of the T20I side, was not named in India's 15-member squad for the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-silent-on-bangladesh-t20-world-cup-security-issues-devajit-saikia-2849741-2026-01-10",
      "headline": "BCCI remains silent on Bangladesh World Cup controversy: Not our domain to talk aboutBCCI remains tight-lipped amid Bangladesh's refusal to play T20 World Cup matches in India. The two cricketing boards are at loggerheads as Bangladesh has called for venue changes ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/najmul-hossain-shanto-slams-najmul-islam-tamim-iqbal-india-agent-comment-bcci-vs-bcb-2849719-2026-01-10",
      "headline": "BCCI and Bangladesh cricket stand-off affecting us mentally: Najmul Hossain ShantoBangladesh Test captain Najmul Hossain Shanto has criticised the BCB director M Najmul Islam for calling Tamim Iqbal 'India's agent'. Shanto also revealed that the ongoing dispute over security concerns for the T20 World Cup in India is affecting players' morale ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-yuvraj-singh-nets-training-batting-tips-viral-video-t20-world-cup-2849721-2026-01-10",
      "headline": "Yuvraj Singh's new student? Sanju Samson takes batting tips from India legendA viral nets video has reignited buzz around Sanju Samson's T20 World Cup role. With Yuvraj Singh seen offering guidance, the India batter's push to cement his place at the top order has gained fresh momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-vs-delhi-capitals-preview-jemimah-rodrigues-harmanpreet-kaur-2849690-2026-01-10",
      "headline": "WPL 2026: Delhi Capitals begin Jemimah era against battered Mumbai IndiansDelhi Capitals start their Women's Premier League 2026 (WPL 2026) campaign against defending champions Mumbai Indians. DC will be led by a new captain this season in Jemimah Rodrigues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-stamp-authority-ind-vs-nz-odi-series-2026-tough-start-india-captain-2849473-2026-01-10",
      "headline": "Shubman Gill out to stamp his authority in 2026 after tough start as India captainShubman Gill enters 2026 under scrutiny after a demanding first year as India captain. A T20 World Cup snub and leadership lessons now shape a phase where form, clarity and authority matter more than promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-real-madrid-vs-fc-barcelona-el-clasico-spanish-super-cup-lands-saudi-arabia-2849677-2026-01-10",
      "headline": "Kylian Mbappe lands in Saudi Arabia ahead of El Clasico Super Cup final vs BarcelonaKylian Mbappe's arrival in Saudi Arabia has lifted excitement ahead of El Clásico. With Real Madrid reaching the Super Cup final, all eyes are now on the French star's fitness and possible return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-hil-final-sg-pipers-vs-bengal-tigers-preview-2849568-2026-01-10",
      "headline": "Women's Hockey India League final: SG Pipers hope to end Bengal Tigers jinxA new champion is all set to be crowned in the Women's Hockey India League as SG Pipers square off against the Shrachi Bengal Tigers in Ranchi on Saturday, January 10. The top teams delivered tight contests earlier on in the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-pv-sindhu-semi-final-loss-vs-wang-zhi-yi-world-number-2-heartbreak-2849664-2026-01-10",
      "headline": "PV Sindhu's Malaysia Open run ends in semi-final loss to world No. 2 Wang Zhi YiPV Sindhu's encouraging return ended in disappointment at the Malaysia Open. Despite strong leads in both games, the Indian star faltered at key moments, falling to world No. 2 Wang Zhi Yi in the semis.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}