{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/4-banks-revise-credit-card-fees-and-rewards-yes-bank-axis-bank-sbi-bank-au-small-finance-bank-2644079-2024-12-03",
      "headline": "Credit card changes in December: 4 banks revise fees and rewardsBanks like SBI, Axis, Yes Bank, and AU Small Finance Bank are updating credit card fees, rewards, and policies in December 2024, impacting transactions, redemptions, and reward categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-benefits-investments-withdrawal-rules-key-highlights-2644177-2024-12-03",
      "headline": "NPS Vatsalya: Key benefits, investments, and withdrawal rules explained NPS Vatsalya, launched in September, enables guardians to secure a child's financial future with regulated investments, early savings benefits, and partial withdrawal options until age 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-q2-results-net-loss-narrows-to-rs-625-crore-in-1st-earnings-after-ipo-2644217-2024-12-03",
      "headline": "Swiggy Q2 results: Net loss narrows to Rs 625.5 crore in 1st earnings after IPOSwiggy's revenue from operations rose by 30% year-on-year (YoY) to Rs 3,601 crore, up from Rs 2,763 crore in Q2FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-banking-stocks-rally-sbi-gains-2-percent-2644190-2024-12-03",
      "headline": "Sensex, Nifty end higher as banking stocks rally; SBI gains 2%The S&P BSE Sensex was up 597.67 points to close at 80,845.75, while the NSE Nifty50 gained 181.10 points to end at 24,457.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-salary-usd-56-billion-tesla-pay-rejected-by-us-court-delaware-again-appeal-2644165-2024-12-03",
      "headline": "Elon Musk's $56 billion Tesla pay rejected by US court againThe court upheld its earlier ruling from January, which called the compensation plan excessive and rescinded it, despite Tesla shareholders voting in June to reinstate it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-was-as-explicit-as-i-could-be-before-binances-cz-changpeng-zhao-responds-to-wazirx-hack-2643537-2024-12-03",
      "headline": "I was as explicit as I could be: Binance CEO on WazirX hackBinance CEO Changpeng Zhao addressed the WazirX hack on X, emphasising Binance's non-involvement, as users seek answers to their frozen funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-share-price-2-percent-gains-today-block-deal-2644109-2024-12-03",
      "headline": "Explained: Why HDFC Bank share price gained 2% today HDFC Bank shares rose 2% in early trade to touch a day high of Rs 1,837. At 1:34 pm, the stock was trading 1.25% higher at Rs 1,827.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-cost-delhi-mumbai-pune-bengaluru-11-percent-rise-housing-trends-report-2644104-2024-12-03",
      "headline": "Housing prices rise 11% across top Indian cities. Is your city on the list?The average housing price across eight major cities now stands at Rs 11,000 per square foot, according to a report. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-rises-500-points-nifty-gains-three-factors-2644096-2024-12-03",
      "headline": "Sensex soars over 500 points: 3 factors behind stock market rallyThe S&P BSE Sensex rose 562.95 points to reach 80,811.03 at 12:55 pm, while the NSE Nifty50 climbed 152.15 points to 24,425.85. Broader market indices also traded in the green, reflecting widespread optimism across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-strong-jump-up-28-percent-in-five-days-should-you-buy-or-avoid-2644075-2024-12-03",
      "headline": "Why Ola Electric share price jumped today? 3 factors behind strong rally Ola Electric Stock Price: Over the past five trading sessions, Ola Electric shares have gained nearly 28%, recovering sharply from their 52-week low of Rs 66.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-share-price-today-sharp-jump-early-trade-q2-results-today-2644011-2024-12-03",
      "headline": "Explained: Why Swiggy share price gained in early trade todaySwiggy's share price jumped over 9% to reach a day high of Rs 542.10, marking a 39% gain over its issue price of Rs 390. At 11:07 am, the stock was trading 3.36% higher at Rs 512 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uidai-extends-free-aadhaar-updates-until-december-14-here-is-how-to-do-2643671-2024-12-03",
      "headline": "UIDAI extends free Aadhaar updates until December 14: All you need to knowUIDAI has extended the free Aadhaar update deadline to December 14, 2024, allowing users to update key details online for free. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-godfrey-phillips-share-price-decline-early-trade-gst-increase-sin-goods-2643993-2024-12-03",
      "headline": "Explained: Why ITC, Godfrey Phillips shares fell in early trade today ITC, Godfrey Phillips stocks fell in early trade after a proposed change from the Group of Ministers (GoM) on GST rate rationalisation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kpit-technologies-share-price-jump-today-brokerage-upbeat-jp-morgan-2643985-2024-12-03",
      "headline": "Explained: Why KPIT Technologies share price jumped 6% todayAt 10:28 am, the stock was trading 5.90% higher at Rs 1,420.65 on the Bombay Stock Exchange, regaining some momentum after a period of underperformance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-december-3-2024-precious-metals-record-hike-on-mcx-2643970-2024-12-03",
      "headline": "Gold, silver price today, December 3, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-down-50-percent-why-reason-bonus-share-issue-adjustment-2643959-2024-12-03",
      "headline": "Wipro shares down 50%? Here's why some apps are showing the wrong priceWipro share price: Wipro stocks appeared down by 50%. However, the decline shown in certain brokerage platforms is not due to a genuine fall in the stock's value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-itc-share-price-down-3-percent-2643945-2024-12-03",
      "headline": "Sensex, Nifty open flat; ITC share price down 3% The S&P BSE Sensex was up 39.47 points to 80,287.55, while the NSE Nifty50 added 21.05 points to 24,297.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-price-itc-godfrey-phillips-cigarette-stocks-to-be-in-focus-today-why-35-percent-gst-tobacco-products-2643942-2024-12-03",
      "headline": "Share price of ITC, Godfrey Phillips to be in focus today. Here's why Shares of ITC and Godfrey Phillips, which derive a huge portion of their revenue from the tobacco and cigarette business, are likely to see movement based on investor reactions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-power-itc-wipro-swiggy-tata-power-cipla-2643937-2024-12-03",
      "headline": "Stocks to watch today: Adani Power, Wipro, Swiggy, Tata Power, CiplaDespite mixed signals, several stocks such as Adani Power, Wipro, Swiggy, Tata Power, Cipla are expected to be in focus today due to key news and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-ceo-pat-gelsinger-forced-out-quit-tech-giant-david-zinsner-michelle-johnston-holthaus-interim-co-ceos-2643927-2024-12-03",
      "headline": "Intel CEO Pat Gelsinger's 'Bittersweet' response after being forced out Intel's Chief Financial Officer, David Zinsner, and Executive Vice President, Michelle Johnston Holthaus, have taken over as interim co-CEOs while the board searches for a permanent replacement. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-summons-indian-envoy-over-breach-mission-tripura-agartala-2644315-2024-12-03",
      "headline": "Bangladesh summons Indian envoy over breach of its mission in AgartalaBangladesh had lodged a strong protest against the alleged vandalism of its mission in Tripura's Agartala by a group of demonstrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-maharashtra-mahayuti-deadlock-ajit-pawar-unwell-fever-hospital-meeting-december-5-oath-ceremony-2644108-2024-12-03",
      "headline": "Eknath Shinde relents, to be part of Mahayuti's '1+2' oath on Thursday: SourcesAfter extensive negotiations within the Mahayuti alliance, Eknath Shinde is likely to take oath as one of two deputy chief ministers at the swearing-in ceremony on December 5, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindus-safety-sheikh-hasina-regime-muhammad-yunus-press-secretary-2644198-2024-12-03",
      "headline": "Hindus well protected in Bangladesh, better than in Hasina's time: Yunus's aideShafiqul Alam, the press secretary of the Muhammad Yunus government, said an 'industrial scale misinformation campaign' was being run by Indian media to peddle false narratives of minorities being targeted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/indigo-sues-mahindra-for-using-6e-in-its-new-electric-car-delhi-high-court-to-hear-matter-2644199-2024-12-03",
      "headline": "IndiGo sues Mahindra & Mahindra for using '6E' in its upcoming electric carIndiGo has filed a trademark infringement suit against Mahindra Electric over the use of '6E' in its BE 6E electric car, claiming it conflicts with the airline's established branding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/asteroid-on-collision-course-with-earth-set-to-crash-tonight-2644182-2024-12-03",
      "headline": "Asteroid on collision course with Earth, set to crash tonightThe impact is anticipated around 9:45 pm IST, with a potential variation of five minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/muda-scam-karnataka-ed-probe-land-illegal-allotment-luxury-cars-cash-2644274-2024-12-03",
      "headline": "ED's big claim in MUDA 'scam': Land worth Rs 700 crore allotted in lieu of carsMUDA 'scam': The ED has alleged that most of the land allotments by MUDA, under the controversial 50:50 scheme, were made in the names of dummy or benami individuals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/blusmart-driver-robs-woman-at-gunpoint-in-gurugram-haryana-app-promises-safety-protocols-strengthening-2644256-2024-12-03",
      "headline": "Gurugram woman robbed at gunpoint by BluSmart cab driver, company apologisesThe BluSmart cab driver forced the woman to transfer Rs 55,000 from her mobile phone at gunpoint in Gurugram. He also snatched the woman's bag and mobile phone before fleeing from the spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-session-function-congress-rahul-gandhi-adani-debate-samajwadi-party-trinamool-2644168-2024-12-03",
      "headline": "What forced Congress to blink on Adani debate?Parliament started functioning on Tuesday, the seventh day, after six days of washout due to Congress protests on the Adani issue. It was massive pressure both within the party and from alliance partners that made the party recalibrate its strategy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/uk-chef-urges-thieves-who-stole-his-van-with-2500-pies-to-donate-the-loot-video-2644226-2024-12-03",
      "headline": "Video: UK chef urges thieves who stole his van with 2,500 pies to donate the lootA British chef, Tommy Banks, urged the thieves who stole his van loaded with 2,500 pies worth £25,000 (approximately Rs 27 lakh) to donate the loot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/upsc-coach-avadh-ojha-now-in-aap-once-bashed-kejriwal-never-hid-political-itch-2644181-2024-12-03",
      "headline": "UPSC coach Avadh Ojha, now in AAP, once bashed Arvind KejriwalUPSC teacher Avadh Ojha has joined the Aam Admi Party. Ojha, who teaches history by blending it with mythology and current affairs, had tried to get tickets from the BJP, Congress and BSP earlier. Clips of Ojha attacking AAP chief Arvind Kejriwal are being shared now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-world-test-championship-points-deduction-christchurch-2644247-2024-12-03",
      "headline": "NZ vs ENG: New Zealand, England hit with World Test Championship points deductionNew Zealand and England face penalties for slow over-rates in the World Test Championship 2023-25, impacting their standings. New Zealand's qualification hopes now hinge on winning remaining matches and favorable outcomes elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-on-taking-break-from-films-not-retiring-just-focusing-on-myself-2644183-2024-12-03",
      "headline": "Vikrant Massey says not retiring, post misinterpretedActor Vikrant Massey clarified that his recent announcement was not a retirement statement but a break to focus on family and health. He assured fans of his return when the time feels right."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-push-mamata-banerjee-india-bloc-chief-congress-manickam-tagore-rejects-opposition-alliance-parliament-2644201-2024-12-03",
      "headline": "That's a good joke: Congress MP on push for Mamata Banerjee to lead INDIA blocCongress MP Manickam Tagore dismissed the Trinamool Congress's recent push to appoint West Bengal Chief Minister Mamata Banerjee as the leader of the INDIA bloc. He called the suggestion a \"good joke\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-parliament-india-china-ties-improvement-border-truce-2644129-2024-12-03",
      "headline": "India-China ties on course of some improvement: S Jaishankar after border truceParliament Winter Session: While briefing the Lok Sabha on India-China ties and the recent border truce, S Jaishankar reiterated that New Delhi remained committed to engaging with Beijing to \"arrive at a fair, mutually acceptable framework for boundary settlement\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hindu-monk-chinmoy-krishna-das-fails-to-get-bail-bangladesh-iskcon-flags-threat-to-life-bangladesh-jail-2644200-2024-12-03",
      "headline": "Iskcon India asks devotees to not wear tilak in Bangladesh: Hide your identityIskcon Kolkata spokesperson expressed concern over the safety of arrested Hindu monk in Bangladesh. He also alleged attacks on minorities and urged devotees to not wear tilaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/arya-pushpa-2-director-sukumar-flawed-relatable-heroes-2644090-2024-12-03",
      "headline": "Arya to Pushpa 2: Director Sukumar and his flawed yet relatable heroesTelugu director Sukumar defies conventional storytelling with flawed heroes, deep conflicts, and symbolism. From Arya to Pushpa 2, his films stand out for their flawed morals, emotional depth and innovation.  \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/tradition-or-safety-how-kerala-govt-is-in-a-spot-over-curbs-on-elephant-parades-2643601-2024-12-02",
      "headline": "Tradition or safety? How Kerala government is in a spot over curbs on elephant paradesA political slugfest looms as major temple festivals, of which elephant parades are a major attraction, stare at losing some of their charm"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/planning-to-buy-a-new-electric-car-evs-might-become-more-affordable-with-govts-this-move-2644050-2024-12-03",
      "headline": "Planning to buy an electric car? This government move may make EVs cheaperThe electric car segment is still at a nascent stage in India, with a share of less than 3% in the overall car sales in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bgt-australia-vs-india-virat-kohli-possible-knee-injury-adelaide-day-night-test-2644126-2024-12-03",
      "headline": "Watch: Virat Kohli injured? Batter seen bandaged in Adelaide trainingVirat Kohli's knee niggle ahead of the Adelaide Test sparked concerns, as fans worried about the star batter's fitness. Despite the scare, his recent match-winning century in Perth highlighted his critical role in India's Border-Gavaskar campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/who-is-venkata-datta-sai-find-out-more-about-pv-sindhus-to-be-husband-2643949-2024-12-03",
      "headline": "Who is Venkata Datta Sai, PV Sindhu's husband-to-be who has managed an IPL teamPV Sindhu is all set to marry Venkata Datta Sai, an executive director at Posidex Technologies. Find out more about the star shuttler's to-be husband. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/punjab/story/akali-dal-sukhbir-singh-badal-wheelchair-serves-punishment-amritsar-golden-temple-2644010-2024-12-03",
      "headline": "Akali Dal's Sukhbir Badal, on wheelchair, begins penance at Golden TempleOn August 30, Akal Takht Jathedar, Giani Raghbir Singh, along with four other high priests, had declared Sukhbir Badal a 'tankhaiya' (guilty of religious misconduct)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/india-packaged-drinking-water-and-mineral-water-is-high-risk-food-categories-what-it-means-2644095-2024-12-03",
      "headline": "India's packaged drinking water is 'high-risk food': What it meansIndia's food regulatory body, FSSAI, has reclassified packaged drinking water and mineral water as 'high-risk food.' This means that manufacturers are subject to annual inspections and audits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/junaid-ahmed-bhat-terrorist-behind-killing-of-civilians-terror-attacks-2644206-2024-12-03",
      "headline": "Lashkar terrorist behind civilian killings shot dead in encounter in J&KThe terrorist, identified as Junaid Ahmed Bhat, was involved in civilian killings in Gagangir, Ganderbal and several other terror attacks, the Kashmir Police said in a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/gaurav-khanna-exit-anupamaa-anuj-controversies-exclusive-2644289-2024-12-03",
      "headline": "Exclusive: Gaurav Khanna talks about his exit from AnupamaaGaurav Khanna discussed his exit from Anupamaa, addressing fan reactions and dismissing controversies with his co-stars and producers. Speaking to India Today Digital, the actor reflected on his journey as Anuj and the overwhelming love from fans across ages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/story/uorfi-javed-dissolves-chin-fillers-after-8-9-years-posts-then-and-now-pics-2644280-2024-12-03",
      "headline": "Uorfi Javed 'dissolves' chin fillers after 8-9 years, posts then-and-now picsActor and Internet Uorfi Javed shared that she has dissolved her chin fillers. Embracing her natural look, Uorfi shared before and after pictures of herself on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zero-se-restart-trailer-vikrant-massey-vidhu-vinod-chopra-loses-cool-at-crew-in-12th-fail-bts-2644269-2024-12-03",
      "headline": "Zero Se Restart trailer: Vidhu Vinod Chopra loses cool at crew in 12th Fail BTSZero Se Restart is a documentary chronicling the making of the 2023 hit, 12th Fail. The documentary will release in cinemas on December 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-to-wear-pancha-sobhita-dhulipala-silk-saree-wedding-2644239-2024-12-03",
      "headline": "Naga Chaitanya to wear 'pancha', Sobhita chooses silk saree for weddingActors Naga Chaitanya and Sobhita Dhulipala are set to marry in Hyderabad, embracing their cultural traditions with Chaitanya wearing a pancha and Sobhita, a silk saree."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ashish-nehra-jasprit-bumrah-border-gavaskar-trophy-australia-vs-india-ipl-2025-2644321-2024-12-03",
      "headline": "Even a purse of 520 crore would not be enough for Jasprit Bumrah: Ashish NehraFormer India seamer Ashish Nehra has said that even an auction purse of Rs 520 crore won't be enough to buy star India fast bowler Jasprit Bumrah in IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-ruud-van-nistelrooy-leaving-manchester-united-leicester-city-2644306-2024-12-03",
      "headline": "Hurt that I had to leave Manchester United: Leicester boss Ruud van Nistelrooy Ruud van Nistelrooy shares his feelings about leaving Manchester United after a successful interim spell and his new journey with Leicester City. The Dutchman opens up about his conversation with Ruben Amorim and his ambitions to help Leicester avoid relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-sachin-tendulkar-australia-vs-india-border-gavaskar-trophy-2024-25-2644275-2024-12-03",
      "headline": "Yashasvi Jaiswal on the verge of breaking Sachin Tendulkar's major recordYoung India opening batter Yashasvi Jaiswal is closing in on breaking Sachin Tendulkar's record of most runs in a calendar year by an India batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-gopal-hattrick-karnataka-vs-baroda-new-csk-spinner-indore-2644262-2024-12-03",
      "headline": "New CSK man Shreyas Gopal dismisses Hardik for 0 during SMAT hattrickShreyas Gopal's hat-trick against Baroda, including dismissing both Pandya brothers for golden ducks, showcased his brilliance and sparked excitement amongst Chennai Super Kings fans ahead of IPL 2025, where he is set to play at Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-liverpool-arne-slot-mohamed-salah-future-manchester-city-2644260-2024-12-03",
      "headline": "Maybe he knows more about City's 115 charges: Slot jokes about Salah's commentLiverpool manager Arne Slot made light of Mohamed Salah's comments regarding his future after the win over Manchester City. Slot also joked about City's 115 legal charges, emphasizing it was just a jest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-world-test-championship-points-deduction-christchurch-2644247-2024-12-03",
      "headline": "NZ vs ENG: New Zealand, England hit with World Test Championship points deductionNew Zealand and England face penalties for slow over-rates in the World Test Championship 2023-25, impacting their standings. New Zealand's qualification hopes now hinge on winning remaining matches and favorable outcomes elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/squash-indian-squash-legend-raj-manchanda-dies-at-79-in-new-delhi-2644242-2024-12-03",
      "headline": "Indian squash legend Raj Manchanda dies at 79 in New DelhiLegendary India squash player Raj Manchanda, the Arjuna Award recipient and winner of six national titles died at the age of 79 in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sir-don-bradman-baggy-green-from-1947-48-auctioned-in-sydney-for-390000-2644220-2024-12-03",
      "headline": "Sir Don Bradman's 'baggy green' cap gets auctioned for Rs 2.63 crore in SydneyLegendary Australia batter Sir Don Bradman's Baggy Green cap from 1947-48 was auctioned for Rs 2.63 crore in Sydney. The cap was worn by Bradman during his last series in Australia played against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-who-is-aryaman-birla-worlds-richest-cricketer-wealthier-sachin-kohli-dhoni-2644211-2024-12-03",
      "headline": "Who is Aryaman Birla? Ranji centurion who never played after 2019Aryaman Birla, son of industrialist Kumar Mangalam Birla is in the news once again. The 27-year-old is being dubbed as the richest cricketer who retired at 22 years of age. Here's a look at the story of the Madhya Pradesh cricketer who took an indefinite break from the game in 2019 and took over a part of his father's business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-yashasvi-jaiswal-classy-mitchell-starc-sledging-coming-too-slow-alastair-cook-2644195-2024-12-03",
      "headline": "Cook amazed by 'classy' Yashasvi Jaiswal sledging Starc in Perth TestYashasvi Jaiswal earned high praise from Alastair Cook for his remarkable 161-run knock in Perth, showcasing grit and audacity at just 22, even sledging Mitchell Starc during India's commanding Border-Gavaskar Trophy opener against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-marnus-labuschagne-form-adam-gilchrist-adelaide-2644194-2024-12-03",
      "headline": "Marnus Labuschagne needs to be reminded he is a class act: Adam GilchristAdam Gilchrist has expressed confidence in Marnus Labuschagne's ability to bounce back from his current batting slump. The Australian batter has struggled for runs in recent Tests, but Gilchrist believes he remains a class act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/squash-indian-squash-legend-raj-manchanda-dies-at-79-in-new-delhi-2644242-2024-12-03",
      "headline": "Indian squash legend Raj Manchanda dies at 79 in New DelhiLegendary India squash player Raj Manchanda, the Arjuna Award recipient and winner of six national titles died at the age of 79 in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sir-don-bradman-baggy-green-from-1947-48-auctioned-in-sydney-for-390000-2644220-2024-12-03",
      "headline": "Sir Don Bradman's 'baggy green' cap gets auctioned for Rs 2.63 crore in SydneyLegendary Australia batter Sir Don Bradman's Baggy Green cap from 1947-48 was auctioned for Rs 2.63 crore in Sydney. The cap was worn by Bradman during his last series in Australia played against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-who-is-aryaman-birla-worlds-richest-cricketer-wealthier-sachin-kohli-dhoni-2644211-2024-12-03",
      "headline": "Who is Aryaman Birla? Ranji centurion who never played after 2019Aryaman Birla, son of industrialist Kumar Mangalam Birla is in the news once again. The 27-year-old is being dubbed as the richest cricketer who retired at 22 years of age. Here's a look at the story of the Madhya Pradesh cricketer who took an indefinite break from the game in 2019 and took over a part of his father's business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-yashasvi-jaiswal-classy-mitchell-starc-sledging-coming-too-slow-alastair-cook-2644195-2024-12-03",
      "headline": "Cook amazed by 'classy' Yashasvi Jaiswal sledging Starc in Perth TestYashasvi Jaiswal earned high praise from Alastair Cook for his remarkable 161-run knock in Perth, showcasing grit and audacity at just 22, even sledging Mitchell Starc during India's commanding Border-Gavaskar Trophy opener against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-marnus-labuschagne-form-adam-gilchrist-adelaide-2644194-2024-12-03",
      "headline": "Marnus Labuschagne needs to be reminded he is a class act: Adam GilchristAdam Gilchrist has expressed confidence in Marnus Labuschagne's ability to bounce back from his current batting slump. The Australian batter has struggled for runs in recent Tests, but Gilchrist believes he remains a class act."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-rohit-sharma-training-adelaide-2644169-2024-12-03",
      "headline": "Watch: Rohit Sharma trains under watchful eyes of Abhishek NayarIndia captain Rohit Sharma trained under the watchful eyes of Abhishek Nayar in Adelaide. Sharma continued his struggle against balls pitched just outside off stump.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shardul-thakur-four-wicket-haul-mumbai-vs-services-syed-mushtaq-ali-trophy-ipl-unsold-2644164-2024-12-03",
      "headline": "Shardul Thakur returns form with 4 wickets after most expensive T20 spellShardul Thakur roared back to form with a stunning four-wicket haul for Mumbai against Services, silencing critics after a tough week that saw him go unsold in the IPL auction and deliver a record-expensive spell in the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bgt-australia-vs-india-virat-kohli-possible-knee-injury-adelaide-day-night-test-2644126-2024-12-03",
      "headline": "Watch: Virat Kohli injured? Batter seen bandaged in Adelaide trainingVirat Kohli's knee niggle ahead of the Adelaide Test sparked concerns, as fans worried about the star batter's fitness. Despite the scare, his recent match-winning century in Perth highlighted his critical role in India's Border-Gavaskar campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mis-suryakumar-yadav-csks-shivam-dube-light-up-smat-with-blistering-sixes-2644130-2024-12-03",
      "headline": "MI's Suryakumar Yadav, CSK's Shivam Dube light up SMAT with blistering sixesSuryakumar Yadav and Shivam Dube shared a 130-run stand during Mumbai vs Services at the Sayed Mushtaq Ali Trophy. Their solid stand helped Mumbai post a challenging total of 192 runs on board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-will-rohit-sharma-sacrifice-his-spot-for-kl-rahul-sledging-room-s2-ep-66-2644127-2024-12-03",
      "headline": "Will Rohit Sharma bat in middle order? | Sledging Room, S2 Ep 66It's time for the pink-ball Test in the Border-Gavaskar Trophy with the Indian team surprisingly going in as the favourites. Kingshuk Kusari, Rishabh Beniwal and Alan Jose John talk about the Adelaide Test and also a little about the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-gautam-gambhir-attends-training-right-after-returning-from-india-2644110-2024-12-03",
      "headline": "Gautam Gambhir attends training right after returning from IndiaIndia head coach Gautam Gambhir went straight to the training session after dropping down in Adelaide on Tuesday, 3 December. Gambhir, had earlier returned home after the Perth Test to attend a family emergency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-pahaadi-garhwali-dance-wife-sakshi-viral-video-rishikesh-trip-watch-2644082-2024-12-03",
      "headline": "Watch: MS Dhoni and wife Sakshi dance to 'Pahadi' song, video goes viralMS Dhoni's vibrant Pahadi Garhwali dance with wife Sakshi during their Rishikesh trip charmed fans and showcased his grounded personality. The video of the former India captain's joyful moment quickly went viral, earning widespread praise online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/siddharthh-kaul-state-bank-of-india-new-job-post-retirement-cricket-sunrisers-hyderabad-2644061-2024-12-03",
      "headline": "Pacer Siddharthh Kaul joins State Bank of India days after retirementSiddarth Kaul transitioned from cricket to banking, joining the State Bank of India days after retiring, marking a new chapter in his life. The former India pacer shared the news with fans through a heartfelt Twitter post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-will-rohit-sharma-sacrifice-his-spot-for-kl-rahul-sledging-room-s2-ep-66-2644127-2024-12-03",
      "headline": "Will Rohit Sharma bat in middle order? | Sledging Room, S2 Ep 66It's time for the pink-ball Test in the Border-Gavaskar Trophy with the Indian team surprisingly going in as the favourites. Kingshuk Kusari, Rishabh Beniwal and Alan Jose John talk about the Adelaide Test and also a little about the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/aus-vs-ind-gautam-gambhir-attends-training-right-after-returning-from-india-2644110-2024-12-03",
      "headline": "Gautam Gambhir attends training right after returning from IndiaIndia head coach Gautam Gambhir went straight to the training session after dropping down in Adelaide on Tuesday, 3 December. Gambhir, had earlier returned home after the Perth Test to attend a family emergency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-pahaadi-garhwali-dance-wife-sakshi-viral-video-rishikesh-trip-watch-2644082-2024-12-03",
      "headline": "Watch: MS Dhoni and wife Sakshi dance to 'Pahadi' song, video goes viralMS Dhoni's vibrant Pahadi Garhwali dance with wife Sakshi during their Rishikesh trip charmed fans and showcased his grounded personality. The video of the former India captain's joyful moment quickly went viral, earning widespread praise online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/siddharthh-kaul-state-bank-of-india-new-job-post-retirement-cricket-sunrisers-hyderabad-2644061-2024-12-03",
      "headline": "Pacer Siddharthh Kaul joins State Bank of India days after retirementSiddarth Kaul transitioned from cricket to banking, joining the State Bank of India days after retiring, marking a new chapter in his life. The former India pacer shared the news with fans through a heartfelt Twitter post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/urvil-patel-follows-up-fatest-t20-hundred-with-36-ball-century-in-smat-2644062-2024-12-03",
      "headline": "Urvil Patel follows up fastest T20 hundred with 36-ball century in SMATUrvil Patel followed up his fastest T20 hundred by an Indian with a 36-ball century in the ongoing Sayed Mushtaq Ali Trophy. The Gujarat batter has hit two of the four-fastest T20 hundreds by an Indian within a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/australia-still-confident-to-win-series-vs-india-alex-carey-ahead-of-pink-ball-test-2644051-2024-12-03",
      "headline": "Australia still confident to win series vs India: Carey ahead of pink ball TestWicketkeeper-batter Alex Carey revealed in the press-conference that the Australian team is still confident of winning the Test series vs India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/watch-steve-smith-cops-blow-on-finger-walks-off-injured-from-adelaide-nets-2644049-2024-12-03",
      "headline": "Steve Smith cops blow on finger, walks off injured from Adelaide netsBorder-Gavaskar Trophy: Australia batter Steve Smith left the Adelaide nets after getting hit on his fingers. Smith copped a clow from Marnus Labuschagne during throwdowns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-arne-slot-transformed-jurgen-klopp-powerhouse-champions-league-caoimhin-kelleher-2644038-2024-12-03",
      "headline": "How has Slot transformed Klopp's Liverpool into a powerhouse this seasonArne Slot's transformative start at Liverpool saw the Reds dominate the Premier League, boasting an 11-point lead. Slot's tactical brilliance and player rejuvenation have silenced doubts, making Liverpool fans dream of another era of glory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}