{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/muhurat-trading-ends-in-green-cipla-bajaj-finserv-among-top-gainers-2806126-2025-10-21",
      "headline": "Muhurat Trading ends in green; Cipla, Bajaj Finserv among top gainersThe BSE Sensex and NSE Nifty50 both closed in the green, led by gains in Cipla and Bajaj Finserv, even as mid-session profit booking trimmed early advances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/business-today/video/samvat-2082-experts-see-new-highs-bet-on-domestic-sectors-2806115-2025-10-21",
      "headline": "Samvat 2082: Experts see new highs, bet on domestic sectorsFor investors, Bandyopadhyay recommends focusing on domestic growth stories. \"Cement, infrastructure, construction, and capital goods will lead the charge,\" he noted, highlighting Ultratech Cement, L&T, and Bharti Airtel as top picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-250-points-nifty-above-25900-infosys-gains-over-1-2806070-2025-10-21",
      "headline": "Muhurat Trading 2025: Sensex, Nifty dip after strong opening; Infosys up 1%The BSE Sensex rose 180.76 points, or 0.21%, to 84,544.13, while the NSE Nifty50 climbed 62.60 points, or 0.24%, to 25,905.75 at 1:50 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-bonus-investment-tips-maximise-profit-growth-mistakes-to-avoid-2806011-2025-10-21",
      "headline": "How to make the most of your Diwali bonus and build long-term wealthTurn your Diwali bonus into a stepping stone for long-term financial security with these expert-backed tips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-rebound-buy-or-wait-dip-muhurat-trading-diwali-2805982-2025-10-21",
      "headline": "Gold hits Rs 1.30 lakh again, silver at Rs 1.58 lakh: Buy now or wait for a dip?Gold and silver are regaining momentum amid festive demand and global uncertainty. Investors should buy with discipline, stagger purchases, and treat bullion as a long-term hedge rather than chasing short-term spikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/diwali-muhurat-trading-2025-how-to-make-the-most-of-todays-one-hour-special-session-2805947-2025-10-21",
      "headline": "Muhurat Trading today: Your quick guide to today's one-hour special sessionAs Muhurat Trading 2025 begins this afternoon, optimism runs high on Dalal Street. With Nifty near record highs and liquidity improving, experts suggest discipline, stock selection, and long-term focus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-on-diwali-as-reliance-bank-stocks-shine-2805815-2025-10-20",
      "headline": "Sensex, Nifty end higher on Diwali as Reliance, bank stocks shineThe BSE Sensex rose 0.5% to 84,363.37, while the NSE Nifty50 gained 0.49% to 25,851—both hitting fresh one-year highs. Over the past four sessions, the indices have climbed 2.8%, leaving them less than 2% away from their all-time highs scaled in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesThe Chinese Commerce Ministry has alleged that the measures by India violate several WTO obligations, including the principle of national treatment, and constitute import substitution subsidies, which are explicitly prohibited under the multi-lateral trade rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-on-october-21-everything-investors-need-to-know-special-market-session-2805749-2025-10-20",
      "headline": "Muhurat Trading on October 21: Check timing, trade strategy and moreMuhurat Trading will take place on October 21 this year. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm, and a closing session until 3:05 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-shares-jump-q2-results-diwali-portfolio-buy-sell-explained-2805722-2025-10-20",
      "headline": "Reliance shares jump 3% after Q2 results. Should it be in your Diwali portfolio?Around 10:20 am, shares of Reliance Industries rose 3.22% to Rs 1,462.60 on the Bombay Stock Exchange (BSE). The stock's sharp upmove added to the broader market rally on Dalal Street as sentiment turned upbeat following a string of solid earnings reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-rare-earth-export-curbs-impact-eu-industries-auto-defence-response-glbs-2805666-2025-10-20",
      "headline": "EU to hold urgent talks on European industries hit by China's rare earth curbsChina, the world's leading producer of the minerals used to make magnets crucial to the auto, electronics and defence industries, this month announced new controls on the export of rare-earth technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zoho-sridhar-vembu-gold-price-warning-systemic-risk-global-economy-2805062-2025-10-18",
      "headline": "Gold flashing a big warning signal: Zoho's Sridhar Vembu says amid rising pricesAs gold prices soar globally, Zoho's Sridhar Vembu raises a red flag. Does the surge signal investor anxiety and eroding trust in the system or reveal a deeper economic fault line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vignesh-shivan-on-life-family-love-insurance-kompany-missing-diwali-release-2806347-2025-10-21",
      "headline": "Vignesh Shivan on life, family; Love Insurance Kompany missing Diwali release Director Vignesh Shivan shared emotional reflections on love and family during Diwali. He highlighted simple happiness with loved ones amid the unexpected delay of his film 'Love Insurance Company', which was supposed to release on Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bill-gates-to-discuss-women-health-issues-in-upcoming-kyunki-episode-report-2806339-2025-10-21",
      "headline": "Bill Gates to discuss women's health issues in upcoming Kyunki... episode: Report Bill Gates will make a special virtual appearance on 'Kyunki Saas Bhi Kabhi Bahu Thi' to promote maternal health. The show highlights progressive social issues including body image and ageing challenges faced by women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daughter-dua-poses-with-parents-deepika-and-ranveer-for-post-with-diwali-wishes-2806308-2025-10-21",
      "headline": "Daughter Dua poses with parents Deepika and Ranveer for post with Diwali wishes Deepika Padukone and Ranveer Singh unveiled their daughter Dua Padukone Singh's face on social media. The trio was seen dressed in traditional attire amid Diwali festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/never-have-i-ever-fame-richa-moorjani-announces-pregnancy-shares-gratitude-post-extra-special-diwali-2806276-2025-10-21",
      "headline": "Never Have I Ever actor Richa Moorjani announces pregnancy, shares gratitude post Richa Moorjani, known for her role in Never Have I Ever, announced her pregnancy on Diwali. Her heartfelt post with husband Bharat Rishi Moorjani has delighted fans and sparked warm wishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-priyadarshan-recalls-how-asrani-shot-for-bhoot-bangla-haiwaan-amid-pain-2806278-2025-10-21",
      "headline": "Exclusive: Priyadarshan recalls how Asrani shot for Bhoot Bangla, Haiwaan amid pain Legendary actor Goverdhan Asrani died after a brief hospital stay, leaving a void in Indian cinema. Filmmaker Priyadarshan recalls his unmatched dedication and humility, highlighting his lasting impact on Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diwali-dump-kareena-saif-ananya-suhana-navya-glam-up-social-media-with-photos-2806250-2025-10-21",
      "headline": "Diwali Dump! Kareena-Saif, Ananya, Suhana, Navya glam up social media with photos Actors Kareena Kapoor, Ananya Panday and Suhana Khan, among others, shared glimpses of their Diwali celebration on social media. A mix of family moments, traditional attire and festival wishes marked their celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-shares-diwali-picture-with-daughter-lara-deletes-it-later-2806234-2025-10-21",
      "headline": "Varun Dhawan reportedly shares Diwali picture with daughter Lara, deletes it later Actor Varun Dhawan reportedly shared a heartfelt Diwali photo with his daughter Lara on Instagram. The post was deleted soon after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/how-thamma-makes-way-for-shakti-shalini-is-maddock-bringing-a-modern-day-kali-2806225-2025-10-21",
      "headline": "How Thamma makes way for Shakti Shalini: Is Maddock bringing a modern-day Kali? 'Thamma' sets the stage for 'Shakti Shalini', Maddock Films' next horror-comedy that could mark the rise of a divine feminine force. With hints of Goddess Kali's mythology and a powerful new heroine at its core, 'Shakti Shalini' might just be the universe's most intriguing chapter yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-shares-concern-about-toxic-air-while-celebrating-diwali-in-delhi-2806239-2025-10-21",
      "headline": "Woke up to Delhi's AQI touching 447: Vaani Kapoor shares concern on toxic air As Delhi-NCR celebrates Diwali under Stage 2 of the Graded Response Action Plan, residents face severe air pollution, with the city's AQI reaching hazardous levels. Actor Vaani Kapoor, in Delhi for the festival with her family, highlighted the worsening air quality on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-ali-nehal-chudasama-couple-bigg-boss-19-farrhana-bhatt-abhishek-bajaj-gaurav-khanna-kunickaa-sadanand-2806204-2025-10-21",
      "headline": "Baseer, Nehal first couple of Bigg Boss 19? Farrhana thinks it's fake Baseer Ali and Nehal Chudasama's growing bond in 'Bigg Boss 19' has raised doubts among viewers and contestants alike. The latest promo shows Farrhana Bhatt questioning the genuineness of Baseer's feelings towards Nehal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ek-deewane-ki-deewaniyat-review-toxic-love-harshvardhan-rane-sonam-bajwa-2806202-2025-10-21",
      "headline": "Ek Deewane Ki Deewaniyat review: Another obsessive lover in another problematic filmRelease Date:Tue Oct 21, 2025 Ek Deewane Ki Deewaniyat movie review: This film, starring Harshvardhan Rane and Sona Bajwa, depicts an obsessive lover's troubling pursuit. The film raises concerns about glamorising toxic relationships amid rising crimes against women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/i-play-rocky-anthony-ippolitos-first-look-as-sylvester-stallone-unveiled-2806190-2025-10-21",
      "headline": "I Play Rocky: Anthony Ippolito's first look as Sylvester Stallone unveiled Amazon MGM released first look of Anthony Ippolito portraying young Sylvester Stallone in 'I Play Rocky'. The film explores Stallone's journey before global fame, highlighting his unshakeable belief in becoming Rocky Balboa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asrani-death-celebrity-tribute-condolences-ajay-devgn-madhur-bhandarkar-adnan-sami-boman-irani-sonu-sood-2806180-2025-10-21",
      "headline": "Ajay Devgn, Madhur Bhandarkar to Adnan Sami: Film industry mourns Asrani's death The death of veteran actor Asrani has come as a huge loss to his fans and the Indian film industry alike. Actor Ajay Devgn, director Madhur Bhandarkar, singer Adnan Sami, among others, remembered the Sholay actor and shared their condolences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/would-you-marry-me-review-jung-so-min-choi-woo-shik-make-predictability-look-good-2806191-2025-10-21",
      "headline": "Would You Marry Me review: Jung So-min, Choi Woo-shik make predictability look goodRelease Date:Fri Oct 10, 2025 'Would You Marry Me' is a light-hearted K-drama starring Jung So-min and Choi Woo-shik that combines revenge, romance, and comedy with charm and sincerity. Despite its familiar tropes of fake marriage and second chances, the show's sharp humour, performances, and self-aware writing make it engaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-indian-stars-diwali-celebrations-2023-family-moments-yash-allu-arjun-trisha-2806178-2025-10-21",
      "headline": "Yash, Allu Arjun to Trisha: Here's how South Indian stars celebrated Diwali 2025 As Diwali 2025 flares up across the country, South Indian stars like Yash, Allu Arjun, Trisha and Varun Tej shared glimpses from their celebrations with friends and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-asrani-wanted-to-keep-his-funeral-private-away-from-the-spotlight-2806153-2025-10-21",
      "headline": "Why Asrani wanted to keep his funeral private, away from the spotlight Veteran actor Govardhan Asrani passed away quietly at 84 after a brief hospitalisation. His family respected his wish for a private farewell, sparking reflection on his remarkable cinematic legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/asrani-heartfelt-role-in-abhiman-beyond-comedy-2806154-2025-10-21",
      "headline": "Beyond comedy: Asrani's soulful streak in Abhiman Asrani, known for his comic genius, gave a soulful performance in Abhiman. His role as Chandar Kripalani showcased his emotional depth beyond comedy and left a lasting impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dude-leads-diwali-box-office-collection-tamil-telugu-films-2025-2806144-2025-10-21",
      "headline": "South cinema's Diwali box office battle: Which star sparkles brightest this year? This Diwali saw six films from Tamil and Telugu cinema featuring next-gen stars hit theatres. 'Dude' emerged as the clear box office winner, nearing Rs 100 crore worldwide, signalling a promising trend for youthful cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-alia-bhatt-diwali-had-love-light-and-rahas-hand-painted-diyas-pics-2806149-2025-10-21",
      "headline": "Ranbir-Alia's Diwali had love, light and Raha's hand-painted diyas. Pics Alia Bhatt and Ranbir Kapoor celebrated a cozy, intimate Diwali with family and close friends. From daughter Raha painting diyas to Alia's elegant festive look, the celebration radiated warmth and togetherness. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ties-with-india-independent-paks-accusations-illogical-afghan-defense-minister-2806241-2025-10-21",
      "headline": "Ties with India independent: Afghanistan slams Pak's illogical proxy war claimsAfghanistan's Defense Minister Mawlawi Mohammad Yaqoob Mujahid dismissed Pakistan's claims blaming India for tensions in the region as \"unfounded, illogical, and unacceptable.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-abolishes-kafala-system-to-improve-migrant-worker-rights-glbs-2806350-2025-10-22",
      "headline": "Saudi Arabia ends 50-year Kafala system in landmark labour reform for migrantsSaudi Arabia has abolished its decades-old Kafala labour sponsorship system. This reform grants migrant workers greater freedoms and aligns labour laws with international standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zohran-mamdani-criticises-modi-pluralism-diwali-queens-indian-diaspora-debate-2806335-2025-10-21",
      "headline": "Grew up in a plural India: Zohran Mamdani takes aim at PM Modi on DiwaliZohran Mamdani, who visited several Hindu temples in Queens for the Festival of Lights, went on to say that PM Modi and his party, BJP, are rather leading India with a vision that the country \"only has room for certain kinds of Indians.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-clarifies-on-h1b-visa-fee-big-relief-for-students-techies-l1-f1-company-transferee-student-visa-holders-2806028-2025-10-21",
      "headline": "US clarifies on H-1B visa fee, big relief for students, techiesThe Donald Trump administration has clarified the exemptions to the controversial $100,000 H-1B visa fee introduced via a presidential proclamation in September. Employers can now proceed with change-of-status filings. The proclamation's scope is limited to new petitions for individuals outside the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daughter-dua-poses-with-parents-deepika-and-ranveer-for-post-with-diwali-wishes-2806308-2025-10-21",
      "headline": "Daughter Dua poses with parents Deepika and Ranveer for post with Diwali wishesDeepika Padukone and Ranveer Singh unveiled their daughter Dua Padukone Singh's face on social media. The trio was seen dressed in traditional attire amid Diwali festivities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/all-allegations-baseless-truth-will-come-out-soon-punjab-ex-dgp-after-being-named-in-fir-over-sons-death-2806249-2025-10-21",
      "headline": "Baseless, truth will emerge: Ex-Punjab DGP dismisses allegations in son's deathThe Panchkula police have registered a case against Akeel Akhtar's family following a complaint by a person whom the former IPS officer described as having \"dirty thoughts and petty political motives.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/openai-launches-atlas-browser-to-challenge-google-chrome-glbs-2806362-2025-10-22",
      "headline": "OpenAI launches Atlas browser to challenge Google's ChromeOpenAI has launched its new web browser, Atlas, directly challenging Google Chrome. The launch comes just months after an OpenAI executive told lawmakers the company might be interested in buying Chrome, if a federal court forced Google to sell it. That never happened."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-putin-summit-paused-ukraine-peace-talks-stall-territorial-demands-glbs-2806360-2025-10-22",
      "headline": "Trump-Putin Budapest meeting on Ukraine war put on hold days after proposalThe planned Trump-Putin meeting in Budapest has been halted amid deadlocked Ukraine peace talks. The White House cited \"no plans\" for a summit as Kyiv resisted territorial deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/how-thamma-makes-way-for-shakti-shalini-is-maddock-bringing-a-modern-day-kali-2806225-2025-10-21",
      "headline": "How Thamma makes way for Shakti Shalini: Is Maddock bringing a modern-day Kali?'Thamma' sets the stage for 'Shakti Shalini', Maddock Films' next horror-comedy that could mark the rise of a divine feminine force. With hints of Goddess Kali's mythology and a powerful new heroine at its core, 'Shakti Shalini' might just be the universe's most intriguing chapter yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-mohsin-naqvi-reaction-india-asia-cup-trophy-row-bcci-letter-2806261-2025-10-21",
      "headline": "Send a player to collect Asia Cup: Adamant Mohsin Naqvi responds to BCCI letterAsian Cricket Council (ACC) President Mohsin Naqvi has refused to hand over the Asia Cup trophy to India, despite a formal demand from the Board of Control for Cricket in India (BCCI). Instead, Naqvi, who also serves as chairman of the Pakistan Cricket Board (PCB), has directed the BCCI to organise a presentation ceremony in India and send a player to collect the trophy from him personally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/not-just-paneer-india-has-an-egg-problem-as-well-2806035-2025-10-21",
      "headline": "Not just fake paneer, India has an egg problem as wellIndia has an egg problem. It is also a problem that mirrors our problem of low-quality and adulterated food, particularly on quick commerce apps where prices are high and yet quality is missing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/rare-earth-minerals-deal-trump-rudd-public-clash-us-australia-cooperation-2806242-2025-10-21",
      "headline": "Will never like you: Trump hits out at Australian envoy for calling him destructiveDuring the signing of the US-Australia minerals deal, Donald Trump said that he doesn't \"like\" Australian Ambassador Kevin Rudd, who had previously called the US President \"destructive\" and a \"village idiot.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chinese-rocket-crashes-next-to-residential-area-after-deploying-satellite-in-space-2806262-2025-10-21",
      "headline": "Watch: Chinese rocket crashes dangerously close to residential areaThe first stage of the rocket fell back uncontrollably to Earth, creating alarm due to the impact and toxic fumes released upon crash.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/diwali-2025-india-diwali-fireworks-set-off-alarm-in-pakistan-delhi-aqi-lahore-pollution-smog-2806007-2025-10-21",
      "headline": "India's Diwali fireworks set off alarm in PakistanAs Diwali fireworks lit up skies across India, toxic air and pollutants drifted across the border into Pakistan. Lahore's air quality plunged to alarming levels, trailing only Delhi as the most-polluted city in the world. Pakistan's Punjab government has blamed cross-border pollution for worsening the existing smog crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-zealand-born-navjot-singh-loses-bid-for-residency-citizenship-faces-deportation-auckland-india-immigration-laws-2806141-2025-10-21",
      "headline": "Born in New Zealand, facing deportation to India: Punished for parents' past?An 18-year-old, born and raised in Auckland to Indian parents who were undocumented immigrants, is now facing deportation after his residency bid was denied. Having never attended school or left New Zealand, Navjot Singh fears for his survival in India, where he has no support. Community leaders and politicians have condemned the decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chandigarh-former-dgp-son-akeel-akhtar-murder-mohammad-mustafa-affair-daughter-in-law-punjab-police-2806037-2025-10-21",
      "headline": "Death of Punjab ex-DGP's son gets more intriguing as second video emergesPolice have registered a case against former Punjab DGP Mohammad Mustafa, his wife, and family members after their late son alleged abuse and a murder conspiracy in a pre-recorded video. In another video that has surfaced, the son gave a clean chit to his family, dismissing his earlier allegations as a figment of his imagination caused by schizophrenia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diwali-dump-kareena-saif-ananya-suhana-navya-glam-up-social-media-with-photos-2806250-2025-10-21",
      "headline": "Diwali Dump! Kareena-Saif, Ananya, Suhana, Navya glam up social media with photosActors Kareena Kapoor, Ananya Panday and Suhana Khan, among others, shared glimpses of their Diwali celebration on social media. A mix of family moments, traditional attire and festival wishes marked their celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-does-not-have-a-week-long-holiday-and-this-this-the-only-time-it-can-have-one-diwali-celebrations-2806143-2025-10-21",
      "headline": "Can India have a 5-day national holiday for Diwali?India celebrates together, yet it doesn't. Countries across the world pause for week-long holidays, but India's fragmented festival calendar does not allow a national breather. Diwali might be the one festival that could be our chance to pause, recharge, and celebrate together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-cbi-probes-karur-stampede-is-vijay-at-an-electoral-crossroads-2806235-2025-10-21",
      "headline": "As CBI probes Karur stampede, is Vijay at an electoral crossroads?The tragedy has shifted the narrative from Vijay's star power to his party TVK's organisational unpreparedness, the probe leaving him vulnerable to the BJP's ploys"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-alleges-bjp-forced-3-jan-suraaj-candidates-to-withdraw-from-polls-2806251-2025-10-21",
      "headline": "Prashant Kishor alleges BJP forced 3 Jan Suraaj candidates to withdraw from pollsPrashant Kishor alleged that three of his party's candidates in the upcoming Bihar Assembly elections were forced to withdraw their nominations under pressure from the BJP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/never-have-i-ever-fame-richa-moorjani-announces-pregnancy-shares-gratitude-post-extra-special-diwali-2806276-2025-10-21",
      "headline": "Never Have I Ever actor Richa Moorjani announces pregnancy, shares gratitude postRicha Moorjani, known for her role in Never Have I Ever, announced her pregnancy on Diwali. Her heartfelt post with husband Bharat Rishi Moorjani has delighted fans and sparked warm wishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/your-post-diwali-pollution-playbook-risks-remedies-2806192-2025-10-21",
      "headline": "Your post-Diwali pollution playbook: Risks, remediesNew studies strongly link air pollution to metabolic disorders, cancer and poor brain performance. Protection must go beyond N-95 masks"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-crash-out-dls-womens-world-cup-2806345-2025-10-21",
      "headline": "South Africa knock Pakistan out in rain-hit clash, storm to top of tableWomen's World Cup: South Africa extended their impressive ICC Women's World Cup run, defeating Pakistan via the Duckworth-Lewis-Stern (DLS) method to climb to the top of the points table. Pakistan, meanwhile, crashed out of the semi-final race as their winless streak in Colombo continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-brought-bulldozers-white-house-amid-government-shutdown-controversy-ballroom-project-demolition-2806237-2025-10-21",
      "headline": "Why Trump has brought bulldozers to the White HouseBulldozers have begun tearing down a part of the White House's East Wing to make way for US President Donald Trump's controversial $250-million ballroom project. Critics are accusing Trump of prioritising lavish personal projects over urgent government needs with a government shutdown in its third week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vignesh-shivan-on-life-family-love-insurance-kompany-missing-diwali-release-2806347-2025-10-21",
      "headline": "Vignesh Shivan on life, family; Love Insurance Kompany missing Diwali releaseDirector Vignesh Shivan shared emotional reflections on love and family during Diwali. He highlighted simple happiness with loved ones amid the unexpected delay of his film 'Love Insurance Company', which was supposed to release on Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bill-gates-to-discuss-women-health-issues-in-upcoming-kyunki-episode-report-2806339-2025-10-21",
      "headline": "Bill Gates to discuss women's health issues in upcoming Kyunki... episode: ReportBill Gates will make a special virtual appearance on 'Kyunki Saas Bhi Kabhi Bahu Thi' to promote maternal health. The show highlights progressive social issues including body image and ageing challenges faced by women."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-crash-out-dls-womens-world-cup-2806345-2025-10-21",
      "headline": "South Africa knock Pakistan out in rain-hit clash, storm to top of table Women's World Cup: South Africa extended their impressive ICC Women's World Cup run, defeating Pakistan via the Duckworth-Lewis-Stern (DLS) method to climb to the top of the points table. Pakistan, meanwhile, crashed out of the semi-final race as their winless streak in Colombo continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-rain-washes-out-indias-nets-session-ahead-of-crucial-new-zealand-clash-2806329-2025-10-21",
      "headline": "Heavy rain washes out India's nets session before crucial New Zealand clash Heavy rains in Navi Mumbai on Tuesday forced India to cancel their training session ahead of Thursday's crucial Women's World Cup clash against New Zealand. With the weather and net run rate potentially playing a decisive role, India face a tense battle to secure a spot in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-test-hopes-no-3-role-india-a-squads-exclude-2806309-2025-10-21",
      "headline": "Sarfaraz may have to bat at No. 3 for Mumbai to stay in India's scheme: Sources Though omitted from the India A squads, Sarfaraz Khan's chances of returning to the Test side may depend on batting at No. 3 for Mumbai, as selectors lean on multi-skilled players to fill the middle order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thibaut-courtois-criticises-laliga-miami-match-decision-2806312-2025-10-21",
      "headline": "Courtois slams LaLiga over Miami match, says it distorts fairness and competition Real Madrid goalkeeper Thibaut Courtois criticises LaLiga's decision to hold Barcelona's away match in Miami. The move has sparked protests and raised concerns about league fairness and consultation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-shai-hope-akeal-hosein-all-spin-attack-super-over-win-bangladesh-dhaka-odi-2806305-2025-10-21",
      "headline": "Bangladesh bottle it again, this time vs West Indies in rare Super Over encounter West Indies triumphed over Bangladesh in a thrilling Super Over after a historic all-spin bowling strategy. The dramatic finish highlighted spin's growing influence and raised questions on Bangladesh's batting resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/asia-cup-trophy-war-bcci-vs-acc-chief-warns-of-icc-escalation-ytvd-2806289-2025-10-21",
      "headline": "Asia Cup Trophy War: BCCI vs ACC Chief, Warns of ICC Escalation The focus of this special report is the escalating dispute between the BCCI and Asian Cricket Council (ACC) Chairman Mohsin Naqvi over the Asia Cup trophy. The Board of Control for Cricket in India (BCCI) is demanding the handover of the silverware after the Indian team refused to accept it from Naqvi, who is also Pakistan's Interior Minister, following their victory. BCCI secretary Devajit Saikia told India Today, 'We have written to ACC to give the trophy to the champion team. We are awaiting a response.' The board has made it clear that if the ACC does not comply, it will escalate the matter to the International Cricket Council (ICC). This unprecedented situation has garnered support for the BCCI from the cricket boards of Sri Lanka and Afghanistan, further intensifying pressure on the ACC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rishabh-pants-comeback-confirmed-to-captain-india-a-after-injury-layoff-ytvd-2806287-2025-10-21",
      "headline": "Rishabh Pant's Comeback Confirmed! To Captain India A After Injury Layoff This special report focuses on the much-awaited return of Indian wicketkeeper-batter Rishabh Pant to competitive cricket. 'It's been confirmed the wicketkeeper batter will be leading India A in two four-day matches against a visiting South Africa A side ahead of the much-anticipated test series between India and South Africa.' Sidelined since July this year due to a foot fracture sustained during the Anderson-Tendulkar trophy, Pant is set to captain the India A squad. The two four-day matches will be played in Bengaluru, with the first starting on October 30. This series is seen as a crucial warm-up for Pant ahead of the senior team's Test series against South Africa. He has been undergoing rehabilitation in Bengaluru and has been in contact with the medical team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-kl-rahul-batting-order-india-vs-australia-perth-odi-2806270-2025-10-21",
      "headline": "KL Rahul's nearly batted at all 11 positions: McGrath on India star's role Glenn McGrath said that he was surprised by the constant batting spot changes for KL Rahul. McGrath said that the constant shuffling can affect Rahul's confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-mohsin-naqvi-reaction-india-asia-cup-trophy-row-bcci-letter-2806261-2025-10-21",
      "headline": "Send a player to collect Asia Cup: Adamant Mohsin Naqvi responds to BCCI letter Asian Cricket Council (ACC) President Mohsin Naqvi has refused to hand over the Asia Cup trophy to India, despite a formal demand from the Board of Control for Cricket in India (BCCI). Instead, Naqvi, who also serves as chairman of the Pakistan Cricket Board (PCB), has directed the BCCI to organise a presentation ceremony in India and send a player to collect the trophy from him personally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-exits-french-open-super-750-first-round-loss-nhat-nguyen-2806245-2025-10-21",
      "headline": "Lakshya Sen crashes out of French Open after humbling loss in 1st round World No. 16 Lakshya Sen suffered a straight-games defeat to Ireland's Nhat Nguyen in the French Open Super 750 men's singles opening round in Paris, marking an early and unexpected exit for the Indian shuttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-keshav-maharaj-reaction-7-wicket-haul-babar-azam-rawalpindi-2806244-2025-10-21",
      "headline": "PAK vs SA: Rawalpindi hero Keshav Maharaj reveals how he outsmarted Babar Azam South Africa left-arm spinner Keshav Maharaj revealed how he outfoxed star Pakistan batter Babar Azam during his seven-wicket haul in the first innings of the Rawalpindi Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rishabh-pants-comeback-confirmed-to-captain-india-a-after-injury-layoff-ytvd-2806287-2025-10-21",
      "headline": "Rishabh Pant's Comeback Confirmed! To Captain India A After Injury Layoff This special report focuses on the much-awaited return of Indian wicketkeeper-batter Rishabh Pant to competitive cricket. 'It's been confirmed the wicketkeeper batter will be leading India A in two four-day matches against a visiting South Africa A side ahead of the much-anticipated test series between India and South Africa.' Sidelined since July this year due to a foot fracture sustained during the Anderson-Tendulkar trophy, Pant is set to captain the India A squad. The two four-day matches will be played in Bengaluru, with the first starting on October 30. This series is seen as a crucial warm-up for Pant ahead of the senior team's Test series against South Africa. He has been undergoing rehabilitation in Bengaluru and has been in contact with the medical team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-kl-rahul-batting-order-india-vs-australia-perth-odi-2806270-2025-10-21",
      "headline": "KL Rahul's nearly batted at all 11 positions: McGrath on India star's role Glenn McGrath said that he was surprised by the constant batting spot changes for KL Rahul. McGrath said that the constant shuffling can affect Rahul's confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-mohsin-naqvi-reaction-india-asia-cup-trophy-row-bcci-letter-2806261-2025-10-21",
      "headline": "Send a player to collect Asia Cup: Adamant Mohsin Naqvi responds to BCCI letter Asian Cricket Council (ACC) President Mohsin Naqvi has refused to hand over the Asia Cup trophy to India, despite a formal demand from the Board of Control for Cricket in India (BCCI). Instead, Naqvi, who also serves as chairman of the Pakistan Cricket Board (PCB), has directed the BCCI to organise a presentation ceremony in India and send a player to collect the trophy from him personally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-exits-french-open-super-750-first-round-loss-nhat-nguyen-2806245-2025-10-21",
      "headline": "Lakshya Sen crashes out of French Open after humbling loss in 1st round World No. 16 Lakshya Sen suffered a straight-games defeat to Ireland's Nhat Nguyen in the French Open Super 750 men's singles opening round in Paris, marking an early and unexpected exit for the Indian shuttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-keshav-maharaj-reaction-7-wicket-haul-babar-azam-rawalpindi-2806244-2025-10-21",
      "headline": "PAK vs SA: Rawalpindi hero Keshav Maharaj reveals how he outsmarted Babar Azam South Africa left-arm spinner Keshav Maharaj revealed how he outfoxed star Pakistan batter Babar Azam during his seven-wicket haul in the first innings of the Rawalpindi Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-prioritises-test-cricket-mental-freshness-ashes-opener-perth-2806243-2025-10-21",
      "headline": "Older and wiser, Steve Smith prioritises mental freshness for Ashes 2025Smith reflects on career adjustments and mental strategies as he prepares to captain Australia in the Ashes opener, emphasising the importance of prioritisation and mental well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-2nd-test-score-day-2-rawalpindi-tristan-stubbs-keshav-maharaj-2806232-2025-10-21",
      "headline": "Sturdy Stubbs keeps South Africa in game after Maharaj heroicsPakistan vs South Africa, 2nd Test Day 2: Tristan Stubbs came up with a resolute knock to help South Africa cut down on the lead in the first innings. Earlier, Keshav Maharaj took seven wickets to trigger a massive Pakistan collapse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2nd-odi-short-hazlewood-starc-test-virat-kohli-swing-adelaide-2806213-2025-10-21",
      "headline": "Short expects Hazlewood, Starc to exploit Kohli's off stump weakness in AdelaideAustralia batter Matthew Short admitted he did not attend the fast bowlers' meetings but expects the veteran pacers to once again look to exploit Virat Kohli's weakness outside off stump when India take on Australia in the second ODI at the Adelaide Oval on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-leads-womens-odi-batter-rankings-deepti-sharma-climbs-bowling-charts-2806212-2025-10-21",
      "headline": "Smriti Mandhana tops Women's ODI batters list, Deepti Sharma 3rd in bowlers chartsSmriti Mandhana has widened her margin atop the ICC Women's ODI Batter Rankings following a series of strong displays at the World Cup. Key changes also see Deepti Sharma, Alyssa Healy and several others achieve new career highs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vincent-kompany-extends-bayern-munich-contract-until-2029-2806183-2025-10-21",
      "headline": "Bayern Munich extend manager Vincent Kompany's contract till 2029Bayern Munich have extended head coach Vincent Kompany's contract by two years, keeping him at the club until 2029. The decision comes after Kompany led Bayern to the Bundesliga title in his debut season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-keshav-mahraj-record-7-wickets-rawalpindi-2806182-2025-10-21",
      "headline": "Keshav Maharaj scripts history with 7-wicket haul in Rawalpindi TestPakistan vs South Africa, 2nd Test: Keshav Maharaj became the first visiting spinner to take seven wickets in an innings in Rawalpindi. The left-arm spinner triggered Pakistan's dramatic collapse on Tuesday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-spin-bowl-full-50-overs-2nd-odi-bangladesh-dhaka-2806172-2025-10-21",
      "headline": "Spin storm in Dhaka: West Indies bowl full 50 overs of spin in historic featWest Indies made history by bowling only spin in their entire 50 overs in the 2nd ODI against Bangladesh in Dhaka. This bold strategy restricted Bangladesh to 213 for 7 and showcased the effectiveness of spin bowling on a slow, turning pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-amir-slams-pakistan-odi-captaincy-rizwan-shaheen-controversy-2806148-2025-10-21",
      "headline": "Rizwan was not a bad ODI captain: Amir slams Pakistan board over captaincy sagaFormer pacer Mohammad Amir has criticised the Pakistan Cricket Board's decision to sack Mohammad Rizwan as ODI captain and hand the reins to left-arm pacer Shaheen Shah Afridi, a move that has raised eyebrows across cricketing circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vincent-kompany-extends-bayern-munich-contract-until-2029-2806183-2025-10-21",
      "headline": "Bayern Munich extend manager Vincent Kompany's contract till 2029Bayern Munich have extended head coach Vincent Kompany's contract by two years, keeping him at the club until 2029. The decision comes after Kompany led Bayern to the Bundesliga title in his debut season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-keshav-mahraj-record-7-wickets-rawalpindi-2806182-2025-10-21",
      "headline": "Keshav Maharaj scripts history with 7-wicket haul in Rawalpindi TestPakistan vs South Africa, 2nd Test: Keshav Maharaj became the first visiting spinner to take seven wickets in an innings in Rawalpindi. The left-arm spinner triggered Pakistan's dramatic collapse on Tuesday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-spin-bowl-full-50-overs-2nd-odi-bangladesh-dhaka-2806172-2025-10-21",
      "headline": "Spin storm in Dhaka: West Indies bowl full 50 overs of spin in historic featWest Indies made history by bowling only spin in their entire 50 overs in the 2nd ODI against Bangladesh in Dhaka. This bold strategy restricted Bangladesh to 213 for 7 and showcased the effectiveness of spin bowling on a slow, turning pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-amir-slams-pakistan-odi-captaincy-rizwan-shaheen-controversy-2806148-2025-10-21",
      "headline": "Rizwan was not a bad ODI captain: Amir slams Pakistan board over captaincy sagaFormer pacer Mohammad Amir has criticised the Pakistan Cricket Board's decision to sack Mohammad Rizwan as ODI captain and hand the reins to left-arm pacer Shaheen Shah Afridi, a move that has raised eyebrows across cricketing circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/juergen-klopp-open-to-liverpool-return-backs-arne-slot-amid-challenging-phase-2806135-2025-10-21",
      "headline": "Klopp hints Liverpool return is possible but backs Slot to turn things aroundJurgen Klopp says a return to Liverpool is 'theoretically possible' but rules out managing any other English club. He voices full confidence in Arne Slot as Liverpool face a challenging spell, having lost four matches in a row for the first time since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/trophy-war-erupts-bcci-threatens-icc-action-as-pak-chief-refuses-to-return-asia-cup-ytvd-2806117-2025-10-21",
      "headline": "Trophy War Erupts: BCCI Threatens ICC Action as Pak Chief Refuses to Return Asia Cup!This special report focuses on the escalating dispute over the Asia Cup trophy between the BCCI and ACC chief Mohsin Naqvi. After winning the tournament, the Indian team refused to accept the trophy from Naqvi, who is also the PCB chairman, in protest of the Pahalgam terror attack. BCCI Secretary Devjit Saikia stated, 'we have written to the ACC to give us the trophy to the champion team and we are awaiting a response. If there will be no response or negative response, then we will write to the ICC.' The trophy is now reportedly locked in the ACC's Dubai office, with the BCCI formally demanding its return and preparing to escalate the matter to the International Cricket Council if the standoff continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-batting-nets-adelaide-2806101-2025-10-21",
      "headline": "Perth setback behind, Virat Kohli looks million dollars in Adelaide netsVirat Kohli trained hard in the Adelaide nets ahead of the team's second ODI against Australia. The batter looked a million bucks as the sound of the ball striking his bat reverberated in the arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-ruled-out-england-odi-tahlia-mcgrath-captains-australia-world-cup-2806071-2025-10-21",
      "headline": "Australia suffer captain Alyssa Healy blow before business endAustralia will be without their captain Alyssa Healy for their crucial top-of-the-table clash against England in Indore on Wednesday. Australia will be hoping to have their skipper back before the business end of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-india-vs-south-africa-tests-2806081-2025-10-21",
      "headline": "Where is Sarfaraz Khan? Batter's absence from India A squad baffles fansThe BCCI announced India A's squad against South Africa for the upcoming series in November. Mumbai batter Sarfaraz Khan did not make it to the squad, baffling fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mohsin-naqvi-official-mail-asia-cup-trophy-handover-2806079-2025-10-21",
      "headline": "BCCI warns Mohsin Naqvi of escalation to ICC if Asia Cup not handed to IndiaThe BCCI have written an official email to ACC chief Mohsin Naqvi to hand over the Asia Cup title to the champions India immediately. The Indian team refused to collect the trophy after the final win against Pakistan from Naqvi, prompting him to tell the ACC officials to take it away. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}