{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-flat-as-banking-sector-downturn-offsets-it-surge-2609389-2024-10-01",
      "headline": "Sensex, Nifty end flat as banking sector downturn offsets IT surgeThe S&P BSE Sensex lost 33.49 points to end at 84,266.29, while the NSE Nifty50 was down by 13.95 points to close at 25,796.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-share-price-19-percent-correction-record-high-good-time-to-buy-trade-strategy-experts-2609359-2024-10-01",
      "headline": "RVNL shares down 19% from record high. Good time to buy? RVNL shares have corrected nearly 19% from its record high of Rs 647. Is now a good time to invest in RVNL stock, or should investors wait for clearer signals? Read on to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-life-insurance-rules-from-today-what-it-means-for-you-guaranteed-surrender-value-2609333-2024-10-01",
      "headline": "New life insurance rules from today: What it means for you? As of October 1, policyholders will now be eligible for a guaranteed surrender value from the first year, even if they have only paid one annual premium. However, these new regulations are expected to lower returns for policyholders over time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-jumps-7-percent-dolat-capital-buy-updated-target-price-report-2609292-2024-10-01",
      "headline": "Explained: Why Paytm shares jumped over 7% todayAt 2:56 pm, shares of Paytm were trading over 7.02% higher at Rs 736.70 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smallcap-ev-stock-mercury-ev-tech-share-price-upper-circuit-38000-percent-gain-in-5-years-2609285-2024-10-01",
      "headline": "This smallcap EV stock is up 38,000% in 5 years. Have you invested? In just a month, the company's shares have gained over 83% and over 168% in a year. In the past five years, the stock has gained a whopping 38,900%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tony-vinciquerra-outgoing-new-ceo-ravi-ahuja-sony-pictures-entertainment-sep-2609262-2024-10-01",
      "headline": "Who is Tony Vinciquerra, outgoing CEO of Sony Pictures Entertainment?Tony Vinciquerra joined Sony Pictures Entertainment in June 2017 and saw five consecutive years of profit growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rates-change-october-1-transactions-stt-share-buybacks-rent-payments-2609252-2024-10-01",
      "headline": "New TDS rates from today: These transactions will be impactedRevised tax rates and TDS changes are now in effect. Here's what taxpayers need to know about the updates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-ravi-ahuja-sony-pictures-next-ceo-tony-vinciquerra-steps-down-2609222-2024-10-01",
      "headline": "Who is Ravi Ahuja, the incoming CEO of Sony Pictures?As he steps into the CEO role, Ravi Ahuja will succeed Tony Vinciquerra, who will remain with SPE as a non-executive chairman until December 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-latest-interest-rates-on-ppf-scss-ssy-small-savings-scheme-2609216-2024-10-01",
      "headline": "Check latest interest rates on PPF, SCSS, SSY and more The post office savings schemes included in this decision are the Public Provident Fund (PPF), Senior Citizen Savings Scheme (SCSS), Sukanya Samriddhi Yojana (SSY), and a few others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/no-fuel-price-relief-for-consumers-oil-marketing-companies-reap-huge-profits-drop-in-crude-rates-2609202-2024-10-01",
      "headline": "Consumers await fuel price relief as OMCs pocket huge gainsDespite falling crude prices and record profits, consumers are still waiting for meaningful reductions in fuel prices, even as oil marketing companies are reaping huge benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-pays-usd-27-billion-to-bring-back-ai-visionary-noam-shazeer-character-gemini-2609191-2024-10-01",
      "headline": "Google pays $2.7 billion to bring back AI visionary Noam ShazeerNoam Shazeer, 48, was one of Google's early hires, joining the company in 2000. A talented software engineer, Shazeer made his mark in AI, becoming a key figure in Google's early AI development."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-factory-growth-cools-to-eight-month-low-in-september-2609155-2024-10-01",
      "headline": "India's factory growth cools to eight-month low in SeptemberNew orders - a key gauge of demand - grew at the weakest pace since December, though were still robust, while output was at an eight-month low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-ipo-allotment-step-by-step-guide-to-check-application-status-latest-gmp-2609144-2024-10-01",
      "headline": "Diffusion Engineers IPO allotment: Step-by-step guide to check statusDiffusion Engineers IPO allotment status: Investors can check their allotment status through the online portals of the Bombay Stock Exchange (BSE) and Bigshare Services Pvt Ltd, the registrar for the IPO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-1-2024-precious-metals-record-hike-on-mcx-2609143-2024-10-01",
      "headline": "Gold, silver price today, October 1, 2024: Precious metals record hike on MCXGold Price Today October 1, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-it-auto-stocks-gain-2609135-2024-10-01",
      "headline": "Sensex, Nifty open higher as IT and auto stocks gainThe S&P BSE Sensex was up 147.39 points to 84,447.17 at 10:02 am, while the NSE Nifty50 gained 34.75 points to trade at 25,845.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-ppf-rules-october-1-minots-individuals-with-multiple-accounts-nris-2608769-2024-09-30",
      "headline": "New PPF rules effective today: All you need to know New PPF rules effective today streamline account management for minors, multiple account holders, and NRIs, impacting interest rates and regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-changes-from-october-1-what-investors-need-to-know-2608745-2024-09-30",
      "headline": "Stock market changes effective today: 3 things investors need to knowThree key updates effective today will impact transaction fees, Securities Transaction Tax, and share buyback taxation for stock market investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1200-points-nifty-tumbles-investors-lose-rs-4-lakh-crore-2608722-2024-09-30",
      "headline": "Bloodbath on D-Street: Sensex slips 1,200 points; investors lose Rs 4 lakh croreThe S&P BSE Sensex fell 1,272.07 points to 84,299.78 at the closing bell, while the NSE Nifty50 settled 361.65 points lower at 25,810.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-below-rs-100-buy-the-dip-avoid-experts-take-2608711-2024-09-30",
      "headline": "Ola Electric shares slip below Rs 100. Buy the dip or avoid? The stock was down 2.59% at Rs 99.55 on the Bombay Stock Exchange (BSE), marking a sharp decline from its record high of Rs 157.53 on August 20, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-oil-corporation-withdraws-rs-22000-crore-rights-issue-2608689-2024-09-30",
      "headline": "Indian Oil Corporation withdraws Rs 22,000 crore rights issueIOC decided to withdraw the rights issue following the Ministry of Petroleum & Natural Gas (MoP&NG) informing that no funds have been allocated for capital support to Oil Marketing Companies (OMCs) in the 2024-25 budget."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-pauses-sit-probe-into-animal-fat-in-tirupati-laddus-supreme-court-2609331-2024-10-01",
      "headline": "Tirupati laddu row: Andhra pauses SIT probe until Supreme Court hearingThe development comes a day after the Supreme Court raised a slew of questions to the Andhra Pradesh government over the Tirupati laddu controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-anant-ambani-wedding-haryana-election-narendra-modi-bjp-2609387-2024-10-01",
      "headline": "Ambani spent crores on wedding with your money: Rahul Gandhi in HaryanaAddressing a rally in Haryana's Bahadurgarh, Congress MP Rahul Gandhi said that PM Modi has developed a system where 25 people in India can spend thousands of crores of rupees on their marriage, while farmers and ordinary people have to take loans for getting their children married."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mahmoud-ahmadinejad-iran-spy-israel-mossad-espionage-double-agent-hassan-nasrallah-lebanon-hezbollah-tensions-2609250-2024-10-01",
      "headline": "Top Iranian secret service officer was Israeli spy: Iran ex-president's bombshellFormer Iranian President Mahmoud Ahmadinejad revealed in an interview that the head of a secret unit tasked with countering Israel's spy agency Mossad's operations in Iran was, in fact, an Israeli agent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-reaction-day-4-batting-records-2609375-2024-10-01",
      "headline": "Ready for 100-all out: Rohit Sharma explains India's Bazball show in Kanpur TestIndia vs Bangladesh: Captain Rohit Sharma said India were prepared to get bowled out for 100 in their first innings as the focus was on scoring quickly and racing against time to produce a favourable result. Despite losing two days to wet weather, India won the Test by seven wickets and a session to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/russian-jet-flies-dangerously-close-to-us-warplane-alaska-intercept-video-2609371-2024-10-01",
      "headline": "Watch: Russian jet flies within feet of US fighter plane off Alaska coastUS Senator Dan Sullivan said that the actions of the Russian fighter jet put the lives of US airmen at risk. The incident took place during the intercept of Russian jets near Alaska last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/haryana-assembly-elections-bjp-advantage-factors-non-jat-votes-congress-rift-2609315-2024-10-01",
      "headline": "Three factors shaping BJP's campaign in Haryana as it eyes record 3rd termAs the BJP attempts a third consecutive term in Haryana, here are the three key factors shaping the party's campaign in the Jat land."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/siddaramaiah-wife-surprise-move-victim-of-politics-of-hate-muda-land-scam-return-plots-2609281-2024-10-01",
      "headline": "Siddaramaiah 'surprised' at wife's move to return land: Victim of hate politicsMuda Scam: Siddaramaiah's remarks came after his wife announced that she would return the 14 compensatory land sites that she received from the Mysuru Urban Development Authority in the wake of the land 'scam' probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/what-is-36-biradari-haryana-politics-congress-bjp-vidhan-sabha-election-bjp-manifesto-congress-jjp-2608972-2024-10-01",
      "headline": "Will 36 biradari help in the battle of 90 in HaryanaPoliticians, be they from the BJP, Congress or JJP, are appealing to the '36 biradari' of Haryana to woo the voters ahead of the October 5 election. What is the '36 biradari' concept, how did it emerge, and will it play a role in the Haryana election?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/giant-naked-republican-presidential-candidate-donald-trump-statue-removed-display-las-vegas-crooked-and-obscene-2609293-2024-10-01",
      "headline": "Giant naked Donald Trump statue removed after weekend display near Las VegasA 43-foot-tall naked effigy of former President Donald Trump was taken down less than 48 hours after it appeared near Las Vegas. The statue, titled \"Crooked and Obscene\", drew a small crowd of curious onlookers but wasn't easily visible from the highway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-man-orders-rs-15-lakh-iphone-cash-on-delivery-kills-delivery-agent-2609104-2024-10-01",
      "headline": "Lucknow delivery agent killed by customer who had to pay cash for 2 smartphonesAfter receiving the smartphones, Gajanan and his accomplice allegedly strangled the delivery agent, then put his body in a sack and dumped it in the Indira Canal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rates-change-october-1-transactions-stt-share-buybacks-rent-payments-2609252-2024-10-01",
      "headline": "New TDS rates from today: These transactions will be impactedRevised tax rates and TDS changes are now in effect. Here's what taxpayers need to know about the updates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-bulldozer-action-demolition-guidelines-hearing-temple-dargah-2609221-2024-10-01",
      "headline": "Be it temple or dargah, it has to go: Supreme Court on encroachmentThe Supreme Court was hearing petitions challenging bulldozer action against people accused of crimes -- a move often referred to as 'bulldozer justice'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-police-reacts-to-viral-video-of-man-trying-to-break-into-woman-car-2609286-2024-10-01",
      "headline": "Bengaluru Police reacts to viral video of man trying to break into woman's carA Bengaluru woman had a narrow escape when a man tried to break into her car. The police reacted after a video of the incident went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-kanpur-test-2-0-series-win-wtc-points-2609270-2024-10-01",
      "headline": "Fearless India conquer Bangladesh, wet weather in Kanpur Test heist, 2-0 sweepIndia vs Bangladesh: Fearless India stormed to a 2-0 series sweep over Bangladesh, defying wet weather and time constraints in the Kanpur Test. After two rain-hit days, India unleashed a blistering batting display on Day 4 and then a bowling masterclass on Day 5 to secure a 7-wicket win on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-chief-general-upendra-dwivedi-warns-china-tactics-lac-situation-stable-not-normal-2609280-2024-10-01",
      "headline": "Situation stable, but not normal: Army chief warns against China's LAC tacticsWhile addressing the curtain raiser of the Chanakya Forum Dialogue, the Army chief provided key insights into India's defence posture, regional stability, and the importance of joint military planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-on-dadasaheb-phalke-award-journey-struggles-national-award-2609307-2024-10-01",
      "headline": "Mithun Chakraborty on Dadasaheb Phalke Award: I am still dazedVeteran actor Mithun Chakraborty, in an exclusive chat with India Today TV, shared his emotional journey upon receiving the Dadasaheb Phalke Award. He reflected on his challenging path in the film industry and how he balances his 'superstardom with parallel cinema'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/retired-ias-officer-rohit-kumar-singh-reveals-first-salary-tcs-mumbai-offered-him-40-years-ago-after-iit-graduation-2609208-2024-10-01",
      "headline": "Retired IAS officer reveals first salary TCS Mumbai offered him 40 years agoRetired IAS officer Rohit Kumar Singh shared a glimpse of his journey as he revealed his first salary that TCS Mumbai had offered him 40 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-chief-general-upendra-dwivedi-israel-hezbollah-pager-blasts-2609174-2024-10-01",
      "headline": "Masterstroke by Israel: Indian Army chief on Lebanon pager blast operationLast month, multiple explosions of pagers and walkie-talkies of Hezbollah members in Lebanon killed nearly 40 and left over 3,000 injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/maharashtra-government-mahant-ramgiri-maharaj-bombay-high-court-derogatory-remarks-islam-cyber-police-video-chief-minister-eknath-shinde-2609073-2024-10-01",
      "headline": "67 cases against seer over Prophet Mohammed remarks, Bombay High Court toldThe government told the court that the objectionable material containing Mahant Ramgiri Maharaj's alleged derogatory remarks, which was shared online, is being taken down by the cyber crime police."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/british-journalist-frank-gardner-crawls-on-lot-polish-airline-after-it-fails-to-provide-wheelchair-2609142-2024-10-01",
      "headline": "Disabled UK journalist crawls on flight after airline fails to give wheelchairRenowned British journalist Frank Gardner had to crawl across the cabin floor of a LOT Polish Airlines flight due to the airline's lack of onboard wheelchair facilities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-kalki-koechlin-interesting-breakup-tip-sleep-with-someone-and-tell-him-2609241-2024-10-01",
      "headline": "Actor Kalki Koechlin's unusual breakup strategy in past: Sleep with someone, tell himIn an interview recently, Kalki Koechlin talked about her past and her experiences of having polyamorous relationships. The actor also shared an unusual breakup tip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-chief-hassan-nasrallah-suffocated-toxic-fumes-inside-secret-bunker-israel-hezbollah-war-2609223-2024-10-01",
      "headline": "Nasrallah suffocated to death from toxic fumes inside bunker: ReportHassan Nasrallah, the elusive chief of Hezbollah who headed the Iran-backed Hezbollah for 32 years, was killed on September 27 in a massive Israeli airstrike that hit the militant group's headquarters in Beirut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thailand-school-bus-catches-fire-several-school-children-injured-uthai-thani-2609274-2024-10-01",
      "headline": "School bus catches fire in Bangkok, 25 on board feared deadA bus carrying 44 passengers from Thailand's central Uthai Thani province to Ayutthaya for a school trip caught fire near Bangkok with 25 of those on board feared dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-1st-statement-after-bullet-injury-thank-you-for-praying-i-feel-better-2609148-2024-10-01",
      "headline": "Govinda's 1st statement after bullet injury: Thank you for praying, I feel betterActor Govinda released an audio message after accidentally shooting himself in the leg with his licenced revolver on Tuesday, October 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/shark-tank-india-season-4-returns-with-old-sharks-watch-first-promo-2609424-2024-10-01",
      "headline": "Shark Tank India Season 4 returns with old sharks, watch first promoA new promo shared by SonyLiv India announced the return of Shark Tank India with season 4 on Tuesday, October 1. Five old sharks from the previous seasons are seen making their way back to the sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-on-not-doing-art-films-after-winning-national-award-for-mrigayaa-2609405-2024-10-01",
      "headline": "Mithun Chakraborty reveals why he stopped doing art films after MrigyaaMithun Chakraborty, in an interview with Rajdeep Sardesai, explains his decision to move away from art films after winning the National Award for Mrinal Sen's Mrigayaa. He shares insights into his acting journey and the balance between his stardom and parallel cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/grammy-winning-icons-zakir-hussain-rakesh-chaurasia-bela-fleck-edgar-meyer-announce-india-as-we-speak-tour-2609391-2024-10-01",
      "headline": "Zakir Hussain, Rakesh Chaurasia, Bela Fleck, Edgar Meyer announce India tourThe As We Speak India Tour, featuring Grammy-winning icons - Zakir Hussain, Rakesh Chaurasia, Bela Fleck, Edgar Meyer - promises to be a captivating fusion of Indian classical music and Western jazz. Scheduled for January 2025, the tour will visit Bengaluru, Hyderabad, Mumbai, and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-manoj-bajpayee-suraj-pe-mangal-bhari-re-release-18-october-2609412-2024-10-01",
      "headline": "Diljit Dosanjh-Manoj Bajpayee's Suraj Pe Mangal Bhari to re-release on OctoberZee Studios is re-releasing the comedy film, Suraj Pe Mangal Bhari, in cinemas on October 18. The film stars Manoj Bajpayee, Diljit Dosanjh and Fatima Sana Shaikh."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/upcoming-all-rounder-akash-deep-reveals-his-banter-with-virat-kohli-over-his-bat-2609407-2024-10-01",
      "headline": "'Upcoming all-rounder' Akash Deep reveals his banter with Virat Kohli over his batAkash Deep revealed his dun banter with Virat Kohli as the star player gifted his bat to the bowler. Abhishek Nayar also hailed Akash Deep as the upcoming all-rounder. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ind-vs-ban-kanpur-green-park-2609404-2024-10-01",
      "headline": "R Ashwin not targeting 600-wicket milestone, wants to take it '1 Test at a time'Star India off-spinner Ravichandran Ashwin has revealed that he isn't targeting the milestone of 600 Test wickets after another match winning performance against Bangladesh at Green Park, Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-virat-kohli-special-bat-shakib-al-hasan-retirement-last-test-kanpur-2609377-2024-10-01",
      "headline": "Watch: Kohli gifts special bat to Shakib al Hasan after Kanpur TestVirat Kohli honored Shakib Al Hasan by gifting him a signed bat after the Kanpur Test, marking what could be Shakib's final Test match. The gesture symbolized respect for Shakib's iconic all-round career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-reaction-day-4-batting-records-2609375-2024-10-01",
      "headline": "Ready for 100-all out: Rohit Sharma explains India's Bazball show in Kanpur TestIndia vs Bangladesh: Captain Rohit Sharma said India were prepared to get bowled out for 100 in their first innings as the focus was on scoring quickly and racing against time to produce a favourable result. Despite losing two days to wet weather, India won the Test by seven wickets and a session to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-wtc-points-table-2609367-2024-10-01",
      "headline": "World Test Championship validated as India hunt down Bangladesh in 2 daysIndia raced to a 7-wicket win against Bangladesh in the Kanpur Test match, despite no play possible for two straight days. One can argue that India's hunt for a win against BAN was a direct result of the exciting World Test Championship format.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-reveals-how-rohit-sharma-plotted-kanpur-test-heist-on-day-4-2609348-2024-10-01",
      "headline": "Ashwin reveals how Rohit Sharma plotted Kanpur Test heist on Day 4India vs Bangladesh: R Ashwin revealed how captain Rohit Sharma plotted Bangladesh's downfall in the Kanpur Test after two days were washed out due to rain and a wet outfield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-trophy-rohit-sharma-hands-over-akash-deep-kanpur-test-2609335-2024-10-01",
      "headline": "Watch: Rohit Sharma hands Bangladesh series win trophy to Akash DeepIndia captain Rohit Sharma handed the Bangladesh Test series trophy to debutant pacer Aakash Deep, honoring his crucial contributions in India's seven-wicket victory, which secured the series despite rain delays in the second Test at Kanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-akash-deep-wickets-2609332-2024-10-01",
      "headline": "'Mentor' Jasprit Bumrah happy to help Akash Deep: 'He has a lot of heart'Star India pacer Jasprit Bumrah praised Akash Deep for his spirit after the Kanpur Test match. Bumrah, the senior-most pacer in the team said that he is happy to mentor Akash Deep who is a great asset to India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-al-nassr-goal-father-birthday-dedicates-emotional-wish-he-was-alive-2609297-2024-10-01",
      "headline": " Ronaldo scores for Al Nassr on father's birthday: Wish he was alive Cristiano Ronaldo's screamer against Al Rayyan, his 904th career goal, was a tribute to his late father on his birthday, as he dedicated the emotional moment to honor his father's lasting impact on his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-kanpur-test-2-0-series-win-wtc-points-2609270-2024-10-01",
      "headline": "Fearless India conquer Bangladesh, wet weather in Kanpur Test heist, 2-0 sweepIndia vs Bangladesh: Fearless India stormed to a 2-0 series sweep over Bangladesh, defying wet weather and time constraints in the Kanpur Test. After two rain-hit days, India unleashed a blistering batting display on Day 4 and then a bowling masterclass on Day 5 to secure a 7-wicket win on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-score-mumbai-vs-rest-of-india-prithvi-shaw-devdutt-padikkal-catch-2609272-2024-10-01",
      "headline": "Irani Cup: Prithvi Shaw fails after Devdutt Padikkal's sensational catch at slipsIrani Cup 2024: Prithvi Shaw failed to trouble the scorers much on Tuesday in Lucknow as the Mumbai opener fell for 4. Devdutt Padikkal took a sensational catch at second slip to ensure Prithvi's stay in the middle did not last longer than seven deliveries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-trophy-rohit-sharma-hands-over-akash-deep-kanpur-test-2609335-2024-10-01",
      "headline": "Watch: Rohit Sharma hands Bangladesh series win trophy to Akash DeepIndia captain Rohit Sharma handed the Bangladesh Test series trophy to debutant pacer Aakash Deep, honoring his crucial contributions in India's seven-wicket victory, which secured the series despite rain delays in the second Test at Kanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-akash-deep-wickets-2609332-2024-10-01",
      "headline": "'Mentor' Jasprit Bumrah happy to help Akash Deep: 'He has a lot of heart'Star India pacer Jasprit Bumrah praised Akash Deep for his spirit after the Kanpur Test match. Bumrah, the senior-most pacer in the team said that he is happy to mentor Akash Deep who is a great asset to India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-al-nassr-goal-father-birthday-dedicates-emotional-wish-he-was-alive-2609297-2024-10-01",
      "headline": " Ronaldo scores for Al Nassr on father's birthday: Wish he was alive Cristiano Ronaldo's screamer against Al Rayyan, his 904th career goal, was a tribute to his late father on his birthday, as he dedicated the emotional moment to honor his father's lasting impact on his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-kanpur-test-2-0-series-win-wtc-points-2609270-2024-10-01",
      "headline": "Fearless India conquer Bangladesh, wet weather in Kanpur Test heist, 2-0 sweepIndia vs Bangladesh: Fearless India stormed to a 2-0 series sweep over Bangladesh, defying wet weather and time constraints in the Kanpur Test. After two rain-hit days, India unleashed a blistering batting display on Day 4 and then a bowling masterclass on Day 5 to secure a 7-wicket win on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-score-mumbai-vs-rest-of-india-prithvi-shaw-devdutt-padikkal-catch-2609272-2024-10-01",
      "headline": "Irani Cup: Prithvi Shaw fails after Devdutt Padikkal's sensational catch at slipsIrani Cup 2024: Prithvi Shaw failed to trouble the scorers much on Tuesday in Lucknow as the Mumbai opener fell for 4. Devdutt Padikkal took a sensational catch at second slip to ensure Prithvi's stay in the middle did not last longer than seven deliveries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-jasprit-bumrah-clean-dismissal-mushfiqur-rahim-kanpur-2609261-2024-10-01",
      "headline": "Watch: Bumrah's dismissal of Mushfiqur gives India upper hand in Kanpur TestJasprit Bumrah's crucial 3/17 spell, including Mushfiqur's dismissal, gave India the upper hand on Day 5, leaving them with just 95 runs to chase for a series win against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-one-over-enough-saba-karim-kanpur-test-2609259-2024-10-01",
      "headline": "One over is enough for Bumrah: Saba Karim praises pacer's Kanpur heroics Saba Karim praised Jasprit Bumrah's crucial 3/17 spell on Day 5, which put India in command. Bumrah's consistent impact and leadership in India's bowling attack played a vital role in setting up a potential series win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/county-cricket-delhi-capitals-gmr-group-buy-hampshire-majority-stake-2609211-2024-10-01",
      "headline": "Delhi Capitals co-owner GMR Group buys majority stake in Hampshire county teamThe co-owners of Delhi Capitals, the GMR Group, bought a majority stake in the Hampshire County cricket team. GMR group owns teams in various Twenty-20 leagues, including the IPL, Women's Premier League, and the SA20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/28-year-old-bengal-cricketer-asif-hossain-dies-after-falling-from-stairs-2609183-2024-10-01",
      "headline": "28-year-old Bengal cricketer Asif Hossain dies after falling from stairsBengal cricket was stunned by the untimely demise of 28-year-old cricketer Asif Hossain. Asif died after falling down from the stairs at his house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-fastest-u19-test-hundred-india-vs-australia-youth-chennai-2609169-2024-10-01",
      "headline": "IND vs AUS: 13-year-old Vaibhav Suryavanshi hits 58-ball hundred in youth Test India vs Australia, Under-19 Test: 13-year-old Vaibhav Suryavanshi of Bihari hit a hundred in 58 balls, impressing on his debut for the Under-19 team in the red-ball format. Vaibhav made his Ranji Trophy debut for Bihar at 12 earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-arsenal-ousmane-dembele-luis-enrique-fight-controversy-2609166-2024-10-01",
      "headline": "Ousmane Dembele controversy: PSG coach says he will drop player '100 more times'PSG manager Luis Enrique has said that he would drop star winger Ousmane Dembele 100 times over if it would help him make a better team. Dembele fell out with the manager just days ahead of the team's crucial Champions League clash against Arsenal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-gautam-gambhir-ind-vs-ban-2609141-2024-10-01",
      "headline": "Tamim Iqbal praises Rohit, Gambhir's 'champion mentality' in Kanpur TestFormer Bangladesh captain Tamim Iqbal praised Rohit Sharma and Gautam Gambhir's champion mentality in the Kanpur Test match. India came out with aggressive intent with the bat and tried to force a result despite more than 2 days being washed out by rain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-self-respect-questioned-pakistan-media-urged-to-show-respect-2609136-2024-10-01",
      "headline": "Watch: Shan Masood's self-respect questioned, Pakistan media urged to show respectPakistan Test captain Shan Masood faced an awkward moment during a recent media interaction when a journalist controversially asked if he had considered quitting after a series of defeats. A clip of the exchange has been circulating on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-fastest-u19-test-hundred-india-vs-australia-youth-chennai-2609169-2024-10-01",
      "headline": "IND vs AUS: 13-year-old Vaibhav Suryavanshi hits 58-ball hundred in youth Test India vs Australia, Under-19 Test: 13-year-old Vaibhav Suryavanshi of Bihari hit a hundred in 58 balls, impressing on his debut for the Under-19 team in the red-ball format. Vaibhav made his Ranji Trophy debut for Bihar at 12 earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-arsenal-ousmane-dembele-luis-enrique-fight-controversy-2609166-2024-10-01",
      "headline": "Ousmane Dembele controversy: PSG coach says he will drop player '100 more times'PSG manager Luis Enrique has said that he would drop star winger Ousmane Dembele 100 times over if it would help him make a better team. Dembele fell out with the manager just days ahead of the team's crucial Champions League clash against Arsenal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-gautam-gambhir-ind-vs-ban-2609141-2024-10-01",
      "headline": "Tamim Iqbal praises Rohit, Gambhir's 'champion mentality' in Kanpur TestFormer Bangladesh captain Tamim Iqbal praised Rohit Sharma and Gautam Gambhir's champion mentality in the Kanpur Test match. India came out with aggressive intent with the bat and tried to force a result despite more than 2 days being washed out by rain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-self-respect-questioned-pakistan-media-urged-to-show-respect-2609136-2024-10-01",
      "headline": "Watch: Shan Masood's self-respect questioned, Pakistan media urged to show respectPakistan Test captain Shan Masood faced an awkward moment during a recent media interaction when a journalist controversially asked if he had considered quitting after a series of defeats. A clip of the exchange has been circulating on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-captain-legacy-indian-team-ind-vs-ban-2609121-2024-10-01",
      "headline": "'Selfless approach and play to win': Manjrekar on Rohit Sharma's legacySanjay Manjrekar believes that Rohit Sharma has secured his legacy in Indian cricket for his selfless approach. Manjrekar said that Rohit only plays to win and should get the credit for India's new approach in Test cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kl-rahul-reveals-rohit-sharma-message-kanpur-test-2609115-2024-10-01",
      "headline": "Rahul reveals how Rohit's message breathed life in rain-marred 2nd TestIndia vs Bangladesh: India revived their hopes for victory in the rain-marred second Test against Bangladesh, driven by an aggressive strategy inspired by captain Rohit Sharma's clear instructions, according to KL Rahul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/phil-foden-back-to-his-best-soon-manchester-city-pep-guardiola-2609110-2024-10-01",
      "headline": "Phil Foden back to his best soon, predicts Manchester City boss Pep GuardiolaPhil Foden has yet to hit the heights of last season, but Manchester City manager Pep Guardiola is confident that the young forward is on the verge of a breakthrough. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-marc-bernal-contract-buyout-clause-2609109-2024-10-01",
      "headline": "Barcelona set 17-year-old Marc Bernal's buyout clause at 500 million eurosFC Barcelona handed their 17-year-old mid-field prodigy Marc Bernal a new senior team contract. Bernal, who is recovering from an ACL surgery has a new buyout clause of 500 million euros.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}