{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-overtakes-japan-become-worlds-4th-largest-economy-in-world-niti-aayog-2730164-2025-05-25",
      "headline": "India overtakes Japan to become fourth-largest economy: Niti AayogIndia has overtaken Japan to become the world's 4th largest economy, with a GDP of $4 trillion. NITI Aayog projects India will become the 3rd largest economy in the next 2-3 years, surpassing Germany. Factors contributing to this growth include infrastructure development, Make in India initiative, GST implementation, and fiscal discipline during the COVID-19 pandemic. The country has reduced extreme poverty to less than 5% and is poised for rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-fourth-largest-economy-ahead-of-japan-niti-aayog-ceo-2730153-2025-05-25",
      "headline": "India now fourth-largest economy, ahead of Japan: Niti Aayog CEOIndia's GDP has reached $4 trillion, placing it behind only the US, China, and Germany, according to IMF data cited by NITI Aayog CEO BVR Subrahmanyam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-allotment-how-to-check-status-listing-date-expectation-gmp-online-guide-2729182-2025-05-23",
      "headline": "Borana Weaves IPO allotment: Step-by-step guide to check statusBorana Weaves IPO opened for subscription on May 20 and closed on May 22. The IPO saw strong demand from all investor groups. It was subscribed 147.85 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-change-tax-slab-revamp-talks-begin-government-officials-report-2729163-2025-05-23",
      "headline": "GST rates may change soon as fresh revamp talks begin: ReportGST, which was launched in July 2017, brought together many indirect taxes into one system and created a single national market. The latest round of talks follows the government's introduction of a bill in February this year to simplify income tax laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-may-23-trading-setup-sensex-nifty-nse-bse-2729159-2025-05-23",
      "headline": "Sensex, Nifty opening: Stock market likely to open higher today. Here's whyStock market opening: The Nifty50 index may open slightly above its previous close. Gift Nifty futures were trading at 24,692.5 at 7:59 am, showing a possible rise from Thursday's close of 24,609.7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-23-trading-tips-nse-bse-itc-ola-honasa-sun-pharma-jsw-steel-2729154-2025-05-23",
      "headline": "Stocks to watch on May 23: ITC, Ola, Honasa, Sun Pharma, JSW SteelA number of companies will release their January-March quarter results today. These include JSW Steel, Ashok Leyland, Glenmark Pharmaceuticals, Afcons Infrastructure, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-645-points-lower-nifty-below-24700-indusind-bank-gains-2-percent-it-auto-stocks-2728770-2025-05-22",
      "headline": "Sensex closes 645 points lower, Nifty below 24,700; IndusInd Bank gains 2%The S&P BSE Sensex lost 644.64 points to end at 80,951.99, while the NSE Nifty50 was down by 203.75 points to close at 24,609.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-day-3-subscription-bidding-over-100-times-check-latest-gmp-listing-date-2728751-2025-05-22",
      "headline": "Borana Weaves IPO booked over 100 times: Check latest subscription, GMPAllotment for the Borana Weaves IPO is expected to be finalised on Friday, May 23, 2025. The company is likely to list its shares on the stock exchanges on Tuesday, May 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-to-start-solar-module-factory-this-year-report-2728719-2025-05-22",
      "headline": "Reliance to start solar module factory this year: ReportThis year, Reliance Industries will launch its solar module factory, aiming to meet India's clean energy goals by producing 20 GW annually. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/most-happiest-and-unhappiest-careers-of-the-world-revealed-is-your-job-among-them-2728702-2025-05-22",
      "headline": "World's happiest and unhappiest careers revealed. Is your job among them?Researchers at the University of Tartu in Estonia looked at 263 different jobs and asked over 59,000 people about their work and life satisfaction. They also used health data from the Estonian Biobank to get a better picture of what really makes people happy in their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-rising-covid-cases-pause-dalal-street-bull-run-sensex-nifty-outlook-investor-expert-insight-2728677-2025-05-22",
      "headline": "Covid cases surge in India: Will it trigger a stock market crash?Stock market today: The S&P BSE Sensex had dropped by over 900 points to 80,681.76, while the NSE Nifty50 was down 266 points at 24,547.45 as of 12:45 pm. The fall in the market comes after days of strong performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-to-cut-1500-jobs-in-restructuring-move-report-employee-layoff-2728662-2025-05-22",
      "headline": "Walmart to cut 1,500 jobs in restructuring move: ReportThe job cuts will affect several areas, including Walmart's global tech team, the e-commerce section in US stores, and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-adds-1458-lakh-members-in-march-women-and-youth-lead-the-way-2728646-2025-05-22",
      "headline": "EPFO adds 14.58 lakh members in March. Women and youth lead the wayMost of the new members who joined EPFO for the first time in March were youngsters. Around 4.45 lakh people in the 18–25 age group signed up in March, making up nearly 59% of all new subscribers. Many in this age group are first-time jobseekers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-teleservices-shares-jumps-11-percent-today-whats-driving-the-rally-2728642-2025-05-22",
      "headline": "Tata Teleservices shares jumps 11% today. What's driving the rally?The trigger behind the rally appears to be growing speculation around a potential capital infusion by Tata Sons Ltd into its struggling telecom subsidiary, Tata Teleservices Ltd (TTSL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/abfrl-demerger-brokerages-assign-fair-value-to-new-fashion-twins-details-here-2728621-2025-05-22",
      "headline": "ABFRL demerger: Brokerages assign fair value to new fashion twins. Details hereBrokerages have begun breaking down the newly split entities, laying out distinct growth paths and fair value estimates for both ABFRL and ABLBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/all-itr-forms-are-out-but-you-still-cannot-file-what-causing-the-delay-e-filing-utilities-portal-2728606-2025-05-22",
      "headline": "All ITR forms are out, but you still can't file. What's causing the delay?While all seven ITR forms (ITR-1 to ITR-7) and even the updated ITR-U form are ready, the filing process can't begin until the government activates the utility software. These utilities are essential tools that help taxpayers fill in, check, and submit their returns online or offline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aditya-birla-fashion-and-retail-ltd-abfrl-business-demerger-stock-drop-66-percent-2728594-2025-05-22",
      "headline": "ABFRL stock drops 66% post demerger. What investors should know The sharp decline from Wednesday's close of Rs 268.95 reflects the market's adjustment for the value of the demerged entity, not a deterioration in Aditya Birla Fashion and Retail Ltd's fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vaibhav-taneja-salary-tesla-cfo-more-pay-than-sunder-pichai-google-satya-nadella-microsoft-2728585-2025-05-22",
      "headline": "Who is Vaibhav Taneja? Tesla CFO who made more than Pichai and NadellaWhile Sundar Pichai took home $10.73 million and Satya Nadella received $79.1 million in 2024, Taneja's total earnings far exceeded both. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/itc-q4-results-today-check-dividend-revenue-profit-expectations-2728571-2025-05-22",
      "headline": "ITC set to report Q4 results today: Earnings, dividend payout in focusSo far this financial year, the diversified FMCG and cigarette giant has already handed out an interim dividend of Rs 6.50 per share. Given its track record, investors are now eyeing another generous payout."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/og-release-date-out-pawan-kalyan-film-to-hit-screens-in-september-2730364-2025-05-25",
      "headline": "OG release date out: Pawan Kalyan's film to hit screens in SeptemberPawan Kalyan's much-awaited Telugu action film 'OG' is set to release in September25, 2025. Directed by Sujeeth and featuring music by S Thaman, the film will be a gripping mafia drama alongside a star-studded cast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-companion-blamed-for-divorce-takes-legal-action-after-rape-threats-2730351-2025-05-25",
      "headline": "Actor Ravi's 'companion', blamed for divorce, takes legal action after rape threatsActor Ravi Mohan's 'companion' Keneeshaa Francis has taken legal action against online abuse, rape and death threats. Her move comes after Ravi called her his partner amid his divorce battle with Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-on-day-2-at-cannes-2025-courtesy-designer-gaurav-gupta-2730339-2025-05-25",
      "headline": "BTS with Aishwarya Rai on Day 2 at Cannes, courtesy designer Gaurav GuptaDesigner Gaurav Gupta shared behind-the-scenes glimpses of Aishwarya Rai and her daughter Aaradhya on day 2 of Cannes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/k3g-actor-malvika-raaj-and-husband-pranav-bagga-announce-pregnancy-2730315-2025-05-25",
      "headline": "K3G actor Malvika Raaj and husband Pranav Bagga announce pregnancy'Kabhie Khushi Kabhie Gham' actor Malvika Raaj and her husband Pranav Bagga are expecting their first child. She sharing the happy news with adorable photos on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crunchyroll-anime-awards-2025-full-winners-list-solo-leveling-bags-anime-of-the-year-2730314-2025-05-25",
      "headline": "Crunchyroll Anime Awards 2025 Full Winners List: Solo Leveling bags Anime of the yearThe 2025 Crunchyroll Anime Awards held in Tokyo celebrated the best in anime with Solo Leveling emerging as the biggest winner. The star-studded event also honoured Attack on Titan for its cultural impact and featured performances by popular artists, making it a grand celebration of anime's global influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-donates-rs-110-crore-to-help-army-widows-children-after-operation-sindoor-2730310-2025-05-25",
      "headline": "Preity Zinta donates Rs 1.10 crore to help Army widows, children after Op SindoorActor Preity Zinta donated Rs 1.10 crore to the Army Wives Welfare Association after India's Operation Sindoor. The actor made the generous donation at an event held in Jaipur on May 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-teaser-dhanush-nagarjuna-rashmika-mandanna-jim-sarbh-power-and-wealth-2730289-2025-05-25",
      "headline": "Kuberaa teaser: Dhanush, Nagarjuna's film explores power and wealthThe teaser of 'Kuberaa' starring Dhanush and Rashmika Mandanna is finally out. Sekhar Kammula's pan-Indian directorial will release in theatres on June 20.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhen-dharmendra-mala-sinha-sankari-sky-saved-india-2730296-2025-05-25",
      "headline": "Ankhen: The sanskari spy who shunned martinis and saved India'Ankhen' remains a landmark spy thriller of 1968 Bollywood, blending patriotism, action, and strong female roles. The film's unique gadgets and nostalgic style made it a classic Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-waves-at-fans-as-he-steps-out-for-weekend-outing-2730287-2025-05-25",
      "headline": "Allu Arjun waves at fans as he steps out for weekend outing. WatchActor Allu Arjun stepped out for a weekend outing on May 24. In a viral video, he is seen waving to fans as he exits a showroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-triptii-dimri-will-be-next-big-thing-in-bollywood-after-spirit-prabhas-sandeep-reddy-vanga-2730281-2025-05-25",
      "headline": "Ram Gopal Varma says Triptii Dimri will be next big thing in Bollywood after SpiritFilmmaker Ram Gopal Varma shared a post on X and praised Sandeep Reddy Vanga for casting Triptii Dimri in 'Spirit.' The actor will be seen opposite Prabhas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshals-tribute-to-armed-forces-with-maa-tujhe-salaam-rendition-at-mumbai-concert-2730255-2025-05-25",
      "headline": "Shreya Ghoshal's tribute to armed forces with 'Maa Tujhe Salaam' rendition. WatchShreya Ghoshal concluded her 'All Hearts Tour' in Mumbai with a tribute to the Indian armed forces, performing 'Maa Tujhe Salaam' as a mark of respect. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-alia-bhatt-stun-in-viral-cannes-selfie-2730257-2025-05-25",
      "headline": "Bold meets beauty: Urvashi Rautela, Alia Bhatt stun in viral Cannes selfieUrvashi Rautela shared a picture with Alia Bhatt from their Cannes appearance. Fans were thrilled to see two beautiful actors in one frame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-friends-wedding-with-y-cover-after-security-breach-at-home-2730231-2025-05-25",
      "headline": "Salman Khan attends friend's wedding with Y+ cover after security breach at homeSalman Khan attended his friend Ayaz Khan's wedding in Mumbai under Y+ cover following a recent security breach at his Galaxy Apartments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-bows-back-to-fan-at-pune-concert-in-heart-winning-gesture-2730219-2025-05-25",
      "headline": "Singer Papon bows back to fan at concert in heart-winning gesture. WatchSinger Papon impressed the Pune crowd with his beautiful singing and a sweet gesture to a fan during his concert.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-first-look-anurag-basu-film-introduces-modern-love-relationships-2730210-2025-05-25",
      "headline": "Metro In Dino 1st look: Anurag Basu's film introduces modern love, relationships'Metro In Dino' first look was unveiled by the makers on social media. The film introduces the entire star cast, including Anupam Kher, Sara Ali Khan, Aditya Roy Kapur and Pankaj Tripathi, among others. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-reacts-to-akshay-kumar-lawsuit-hera-pheri-3-2730194-2025-05-25",
      "headline": "Paresh Rawal reacts to Akshay's lawsuit: My lawyer has sent an appropriate responseParesh Rawal has responded to Akshay Kumar's legal notice over his sudden exit from 'Hera Pheri 3', stating that his lawyer has sent a proper reply. The actor has also returned the signing amount with interest, but the legal dispute may delay the film's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-visit-ayodhya-ram-mandir-and-hanuman-garhi-2730182-2025-05-25",
      "headline": "Anushka Sharma, Virat Kohli visit Ayodhya's Ram Mandir and Hanuman GarhiAnushka Sharma and Virat Kohli offered prayers at Ayodhya's Ram Mandir and Hanuman Garhi after RCB vs SRH match in Lucknow on May 23. Pictures and videos of the couple's visit have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/khushi-tdt-lashcurry-on-success-of-victory-anthem-politics-in-music-industry-exclusive-2729620-2025-05-25",
      "headline": "Khushi TDT-Lashcurry on success of Victory Anthem, politics in music industryVictory Anthem by Khushi TDT and Lashcurry is a powerful hip-hop track that has struck a chord with millions globally, inspiring listeners to overcome life's challenges. The hip-hop artists, in an exclusive interview, opens up about the process of making the song and its widespread success."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-expelled-lalu-yadav-rjd-bihar-assembly-elections-tejashwi-yadav-2730278-2025-05-25",
      "headline": "Lalu Yadav removes son Tej Pratap from party, family after row over viral postOn Saturday, Tej Pratap Yadav declared his long-standing relationship with Anushka Yadav, saying that they have been in love and in a relationship for the past 12 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-nda-leaders-meeting-chief-ministers-delhi-operation-sindoor-controversy-2730312-2025-05-25",
      "headline": "No loose talk: PM to NDA leaders at Delhi meet after recent controversiesPM Modi, in a Delhi meeting with NDA leaders, urged leaders to avoid unnecessary statements. He also clarified that the Operation Sindoor ceasefire was initiated at Pakistan's request without third-party involvement.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/akali-dal-councillor-harjinder-singh-bahman-shot-dead-bike-borne-men-in-amritsar-sad-2730358-2025-05-25",
      "headline": "Akali Dal councillor shot dead by unknown bike-borne men in AmritsarThe miscreants fired five-six rounds of bullets at the councillor while he was on his way to a hotel after attending a function at Chheharta Sahib Gurudwara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-future-csk-vs-gt-ahmedabad-2730357-2025-05-25",
      "headline": "Dhoni on IPL 2026 plans: Will enjoy a few bike rides in Ranchi and then decideMS Dhoni has said that he has time on his side and will make a decision on his IPL future in the coming few months. Dhoni said he will enjoy a 'few bike rides' in Ranchi and take the next couple of months to make the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-entered-quarantine-launch-international-space-station-2730378-2025-05-25",
      "headline": "Confident of success: Shubhanshu Shukla enters quarantine ahead of Ax-4 launchIndian astronaut Shubhanshu Shukla and the Ax-4 crew have entered quarantine ahead of their June 8, 2025 launch to the International Space Station, marking a key step in commercial spaceflight and India's space ambitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-german-man-arrested-for-planning-to-bomb-american-embassy-in-tel-aviv-glbs-2730433-2025-05-26",
      "headline": "US-German man arrested for planning to bomb American embassy in Tel AvivA dual US-German citizen, Joseph Neumayer, was arrested after attempting to firebomb the US Embassy branch in Tel Aviv. FBI Director Kash Patel confirmed the arrest, vowing justice as Neumayer faces charges including threats against President Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-in-guccis-first-ever-saree-iconic-look-in-cannes-2730107-2025-05-25",
      "headline": "Gucci touches down in tradition and Alia Bhatt is the museAlia's final look on the Cannes carpet was an amalgamation of heritage and haute couture. Styled by Rhea Kapoor, the look is allegedly Gucci's first-ever interpretation of the Indian saree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncp-sp-mp-supriya-sule-led-all-party-delegation-in-qatar-over-operation-sindoor-2730386-2025-05-25",
      "headline": "Supriya Sule meets Qatari MPs, conveys India's outrage over Pahalgam attackThe delegation met the Deputy Speaker of the Qatar Shura Council, Dr Hamda Al Sulaiti and other parliamentarians and reflected India's united stance on cross-border terrorism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhen-dharmendra-mala-sinha-sankari-sky-saved-india-2730296-2025-05-25",
      "headline": "Ankhen: The sanskari spy who shunned martinis and saved India'Ankhen' remains a landmark spy thriller of 1968 Bollywood, blending patriotism, action, and strong female roles. The film's unique gadgets and nostalgic style made it a classic Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-modernising-nuclear-arsenal-depends-china-economic-military-support-india-adversary-us-intel-report-2730262-2025-05-25",
      "headline": "Pak modernising nuclear arsenal, sees India as existential threat: US reportA recent US intelligence report reveals that Pakistan is actively modernising its nuclear arsenal, reflecting heightened strategic concerns in the region. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-rafael-nadal-federer-djokovic-emotional-tribute-roland-garros-2730399-2025-05-25",
      "headline": "Nadal emotional as Roger Federer and Novak Djokovic join French Open tributeFrench Open 2025: Rafael Nadal was honored at Roland Garros on Sunday in a powerful farewell ceremony that paid tribute to his unparalleled dominance on the Paris clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-waterlogging-aap-atishi-saurabh-bharadwaj-slams-pwd-minister-parvesh-verma-bjp-2730348-2025-05-25",
      "headline": "Why is he hiding? AAP slams BJP's Parvesh Verma for waterlogging in DelhiA political row has erupted in Delhi with AAP leaders criticising Public Works Department Minister Parvesh Singh Sahib Vema for his absence from ground-level response as Delhi fought severe waterlogging after heavy rainfall. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-csk-match-report-top-two-hopes-shubman-gill-ms-dhoni-2730352-2025-05-25",
      "headline": "GT's top-two hopes fade after twin setbacks, CSK wrap up season in styleChennai Super Kings may have exited IPL 2025 at the bottom, but their young stars lit up Ahmedabad and exposed glaring cracks in Gujarat Titans' setup, raising serious questions about GT's playoff readiness in both batting depth and bowling control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2024-25-points-table-liverpool-arsenal-city-newcastle-ucl-europa-2730416-2025-05-26",
      "headline": "Premier League final day: Who qualified for Champions, Europa and Conference leagueManchester City, Chelsea, and Newcastle United clinched their places in next season's Champions League. Meanwhile, Aston Villa's defeat at Manchester United consigned them to the Europa League, while Nottingham Forest's loss to Chelsea saw them slip into the Europa Conference League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yunus-selling-off-bangladesh-to-america-sheikh-hasinas-big-charge-amid-protests-2730183-2025-05-25",
      "headline": "'Militant leader' Yunus selling off Bangladesh to US: Sheikh Hasina's big chargeSheikh Hasina alleged that Yunus is running the government with the help of militants and slammed him for imposing a ban on her party, the Awami League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-486-23-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/translation-power-helps-world-discover-heart-lamp-banu-mushtaq-deepa-bhasthi-international-booker-prize-winner-geetanjali-shree-2728611-2025-05-25",
      "headline": "How power of translation helps world discover a Heart LampBanu Mushtaq's anthology in Kannada was unknown to Indians, let alone readers across the world. It was translator Deepa Bhasthi who shone the light on it as Heart Lamp. Both Mushtaq and Bhasthi have been awarded the International Booker Prize. Indian writing's global success is being penned in the language of translation, opening new chapters and challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/miss-england-quits-miss-world-pageant-harassment-kt-rama-rao-demands-probe-2730184-2025-05-25",
      "headline": "Miss England quits Miss World pageant over 'harassment', KTR demands probeTelangana minister KT Rama Rao has strongly condemned the alleged harassment faced by Miss England 2024, Milla Magee, during her visit to the state for the ongoing Miss World 2025 pageant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-new-test-captain-feature-2730132-2025-05-25",
      "headline": "Shubman Gill, India's first accidental Test captain of the 21st century Shubman Gill's appointment as captain reflects a leadership vacuum in Indian cricket, driven more by circumstance than readiness. His inconsistent form and unproven credentials raise concerns about the team's direction during this transitional phase."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/pakistani-nationals-arrested-visa-fraud-money-laundering-case-texas-2730242-2025-05-25",
      "headline": "2 Pakistani nationals arrested for visa fraud, money laundering in TexasFBI Director Kash Patel praised the arrests of the two Texas residents - Abdul Hadi Murshid, 39, and Muhammad Salman Nasir, 35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-on-virat-kohli-and-rohit-sharma-captaincy-2730276-2025-05-25",
      "headline": "Virat's aggression, Rohit's calm: Shubman Gill reveals Test captaincy mantraShubman Gill has revealed his learnings from Virat Kohli and Rohit Sharma following his appointment as India's new Test captain following the retirement of Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-chairs-nda-chief-ministers-meet-caste-census-operation-sindoor-agenda-2730218-2025-05-25",
      "headline": "NDA Chief Ministers back caste census and Op Sindoor, hail counter-Naxal strategyThe meeting saw participation from around 20 Chief Ministers and 18 Deputy Chief Ministers from NDA-ruled states. Two key resolutions were passed during the meeting, one on Operation Sindoor and another on the caste census."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-monaco-grand-prix-result-lando-norris-2730424-2025-05-26",
      "headline": "Lando Norris relishes dream Monaco win as driver's championship intensifiesLando Norris clinched a dream victory at the Monaco Grand Prix, boosting McLaren's title hopes. The win tightens the championship race and highlights Mercedes' ongoing struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jasmine-paolini-beat-yuan-yue-win-streak-clay-2730423-2025-05-26",
      "headline": "Jasmine Paolini battles past Yuan Yue to reach second roundFrench Open: Last year's runner-up, Jasmine Paolini, was made to work hard in her opening match at the French Open, eventually securing a 6-1, 4-6, 6-3 win over China's Yuan Yue in a tense first-round encounter on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2024-25-points-table-liverpool-arsenal-city-newcastle-ucl-europa-2730416-2025-05-26",
      "headline": "Premier League final day: Who qualified for Champions, Europa and Conference leagueManchester City, Chelsea, and Newcastle United clinched their places in next season's Champions League. Meanwhile, Aston Villa's defeat at Manchester United consigned them to the Europa League, while Nottingham Forest's loss to Chelsea saw them slip into the Europa Conference League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-report-heinrich-klaasen-harsh-dubey-delhi-2730405-2025-05-25",
      "headline": "Klaasen record 105, SRH's 278 too good for clueless KKR in season-ending clashHeinrich Klaasen's record hundred and a disciplined performance from the bowlers handed SRH a xx-run win over KKR in Delhi on Sunday, May 25. The win helped SRH finish above KKR, who are all set to finish in the bottom three. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-musetti-zheng-qinwen-win-second-round-roland-garros-2730402-2025-05-25",
      "headline": "Musetti and Zheng Qinwen book second round spots at Roland GarrosFrench Open 2025: Lorenzo Musetti and Zheng Qinwen secured straight-sets wins to reach the second round. Qinwen beat Anastasia Pavlyuchenkova 6-4, 6-3 while Frances Tiafoe also defeated Roman Safiullin 6-4, 7-5, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-rafael-nadal-federer-djokovic-emotional-tribute-roland-garros-2730399-2025-05-25",
      "headline": "Nadal emotional as Roger Federer and Novak Djokovic join French Open tributeFrench Open 2025: Rafael Nadal was honored at Roland Garros on Sunday in a powerful farewell ceremony that paid tribute to his unparalleled dominance on the Paris clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-highest-totals-srh-vs-kkr-heinrich-klaasen-2730390-2025-05-25",
      "headline": "278/3: SRH maul KKR to hit 3rd highest total in IPL historyIPL 2025: SunRisers Hyderabad scored 278 runs against Kolkata Knight Riders in their final IPL game. Klaasen's rapid century helped SRH record the 3rd highest total in the history of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-heinrich-klaasen-fastest-hundred-srh-batter-vs-kkr-2730389-2025-05-25",
      "headline": "SRH's Heinrich Klaasen hits joint-third-fastest IPL hundred to decimate KKRSunrisers Hyderabad batter Heinrich Klaasen hit the joint third-fastest hundred in the Indian Premier League against Kolkata Knight Riders at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/southampton-appoint-will-still-manager-premier-league-2730370-2025-05-25",
      "headline": "Southampton appoint Will Still as manager to lead Premier League returnSouthampton have appointed 32-year-old Will Still as their new manager on a three-year deal. He is tasked with guiding the club back to the Premier League after their earliest-ever relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-points-table-ms-dhoni-retiremement-news-2730367-2025-05-25",
      "headline": "CSK finish last place for first time in history of IPLChennai Super Kings ended IPL 2025 in last place for the first time despite a strong win in the final match. MS Dhoni said after the match that he was undecided about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-confirms-ruturaj-gaikwad-2026-captain-continue-gt-vs-csk-2730366-2025-05-25",
      "headline": "MS Dhoni confirms Ruturaj Gaikwad to continue as CSK captain in IPL 2026After leading CSK to a win over GT in their final match of the IPL 2025, MS Dhoni confirmed that Ruturaj Gaikwad will resume the captaincy role in the side from IPL 2026 after returning from his elbow injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-highest-totals-srh-vs-kkr-heinrich-klaasen-2730390-2025-05-25",
      "headline": "278/3: SRH maul KKR to hit 3rd highest total in IPL historyIPL 2025: SunRisers Hyderabad scored 278 runs against Kolkata Knight Riders in their final IPL game. Klaasen's rapid century helped SRH record the 3rd highest total in the history of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-heinrich-klaasen-fastest-hundred-srh-batter-vs-kkr-2730389-2025-05-25",
      "headline": "SRH's Heinrich Klaasen hits joint-third-fastest IPL hundred to decimate KKRSunrisers Hyderabad batter Heinrich Klaasen hit the joint third-fastest hundred in the Indian Premier League against Kolkata Knight Riders at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/southampton-appoint-will-still-manager-premier-league-2730370-2025-05-25",
      "headline": "Southampton appoint Will Still as manager to lead Premier League returnSouthampton have appointed 32-year-old Will Still as their new manager on a three-year deal. He is tasked with guiding the club back to the Premier League after their earliest-ever relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-points-table-ms-dhoni-retiremement-news-2730367-2025-05-25",
      "headline": "CSK finish last place for first time in history of IPLChennai Super Kings ended IPL 2025 in last place for the first time despite a strong win in the final match. MS Dhoni said after the match that he was undecided about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-confirms-ruturaj-gaikwad-2026-captain-continue-gt-vs-csk-2730366-2025-05-25",
      "headline": "MS Dhoni confirms Ruturaj Gaikwad to continue as CSK captain in IPL 2026After leading CSK to a win over GT in their final match of the IPL 2025, MS Dhoni confirmed that Ruturaj Gaikwad will resume the captaincy role in the side from IPL 2026 after returning from his elbow injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoff-race-gt-pbks-rcb-mi-top-2-race-2730362-2025-05-25",
      "headline": "IPL playoffs: Advantage MI and RCB in top two race after GT suffer heavy lossDespite all four playoff spots being confirmed in IPL 2025, none of the qualified teams - Gujarat Titans (GT), Royal Challengers Bengaluru (RCB), Punjab Kings (PBKS), and Mumbai Indians (MI) - have secured a top-two finish yet. With just a few matches remaining, the race for the top two spots, which offers a crucial second chance via Qualifier 1, remains wide open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-future-csk-vs-gt-ahmedabad-2730357-2025-05-25",
      "headline": "Dhoni on IPL 2026 plans: Will enjoy a few bike rides in Ranchi and then decideMS Dhoni has said that he has time on his side and will make a decision on his IPL future in the coming few months. Dhoni said he will enjoy a 'few bike rides' in Ranchi and take the next couple of months to make the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-csk-match-report-top-two-hopes-shubman-gill-ms-dhoni-2730352-2025-05-25",
      "headline": "GT's top-two hopes fade after twin setbacks, CSK wrap up season in styleChennai Super Kings may have exited IPL 2025 at the bottom, but their young stars lit up Ahmedabad and exposed glaring cracks in Gujarat Titans' setup, raising serious questions about GT's playoff readiness in both batting depth and bowling control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captain-harbhajan-singh-england-tour-2730347-2025-05-25",
      "headline": "Shubman Gill will have to lead from front on tough England tour: Harbhajan SinghFormer India spinner Harbhajan Singh welcomed the appointment of Shubman Gill as captain, praising the move as a step toward building a future-ready team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-runs-have-come-in-losing-cause-hes-also-dropped-4-catches-aakash-chopra-2730337-2025-05-25",
      "headline": "Dhoni's runs have come in losing cause, he's dropped 4 catches: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra has highlighted MS Dhoni's poor performances in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-first-round-aryna-sabalenka-elina-svitolina-results-roland-garros-2730336-2025-05-25",
      "headline": "French Open: Sabalenka, Svitolina cruise into 2nd round with easy winsAryna Sabalenka laid down the marker as she crushed Kamilla Rakhimova with a straight-sets win on Sunday, May 25. Elina Svitolina breezed past Zeynep Sonmez to make it to the second round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-test-captain-england-seires-challenge-opportunity-cheteshwar-pujara-2730331-2025-05-25",
      "headline": "Shubman Gill faces a big challenge and opportunity in England series: PujaraWith India heading into a new Test era, Cheteshwar Pujara sees Shubman Gill's England challenge as both a test and a chance for early impact. The young skipper will look to lead a youthful side back to winning ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-runs-have-come-in-losing-cause-hes-also-dropped-4-catches-aakash-chopra-2730337-2025-05-25",
      "headline": "Dhoni's runs have come in losing cause, he's dropped 4 catches: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra has highlighted MS Dhoni's poor performances in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-first-round-aryna-sabalenka-elina-svitolina-results-roland-garros-2730336-2025-05-25",
      "headline": "French Open: Sabalenka, Svitolina cruise into 2nd round with easy winsAryna Sabalenka laid down the marker as she crushed Kamilla Rakhimova with a straight-sets win on Sunday, May 25. Elina Svitolina breezed past Zeynep Sonmez to make it to the second round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-test-captain-england-seires-challenge-opportunity-cheteshwar-pujara-2730331-2025-05-25",
      "headline": "Shubman Gill faces a big challenge and opportunity in England series: PujaraWith India heading into a new Test era, Cheteshwar Pujara sees Shubman Gill's England challenge as both a test and a chance for early impact. The young skipper will look to lead a youthful side back to winning ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-on-sarfaraz-khans-snub-from-england-tour-squad-2730327-2025-05-25",
      "headline": "Cheteshwar Pujara reveals reason behind Sarfaraz Khan's absence from Test squadCheteshwar Pujara shared his views on Sarfaraz Khan's snub from the Indian Test team for the upcoming England tour. The 27-year-old didn't get a chance during the Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-fastest-fifty-csk-230-6-gujarat-titans-2730324-2025-05-25",
      "headline": "Dewald Brevis scores CSK's joint-second-fastest fifty vs Gujarat TitansDewald Brevis produced a blistering knock in Ahmedabad, scoring 57 off just 23 balls to register Chennai Super Kings' joint-second-fastest half-century in IPL history. Brevis's innings helped CSK post a formidable total of 230 for 6 against Gujarat Titans - their highest score of the season so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-pbks-faf-du-plessis-preity-zinta-viral-picture-2730307-2025-05-25",
      "headline": "Make it happen: Du Plessis' response to fan's suggestion on pic with ZintaDC's Faf du Plessis had a hilarious response to a fan who said he should be cast in a movie alongside Preity Zinta after the picture of the two went viral. DC beat PBKS in the match in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-comeback-favourite-test-format-2730301-2025-05-25",
      "headline": "KL Rahul aims for India's batting comeback in his favourite Tests vs EnglandKL Rahul and India's young Test side aim to bounce back in England, embracing the challenge ahead. With Shubman Gill as captain, the team seeks to overcome recent setbacks and begin a new era of success in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ayush-mhatre-rohit-sharma-arshad-khan-gt-vs-csk-2730293-2025-05-25",
      "headline": "Mini Rohit Sharma: Mhatre wows fans with 28-run over off Arshad KhanIPL 2025: Ayush Mhatre was severe on fast bowler Arshad Khan, scoring 28 runs off him in an over during CSK's match against GT on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-xabi-alonso-new-coach-carlo-ancelotti-florentino-perez-2730290-2025-05-25",
      "headline": "Real Madrid announce Xabi Alonso as new head coach after Ancelotti departureReal Madrid have confirmed the appointment of Xabi Alonso as the new head coach of the team after the departure of Carlo Ancelotti. Alonso returns to the club, having started his coaching career with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-john-mcenroe-french-open-2730286-2025-05-25",
      "headline": "Jack Draper is a big threat: John McEnroe backs British youngsterFrench Open 2025: John McEnroe reckoned that 23-year-old Jack Draper could be a big threat to the big players in the tournament. Draper recently entered the top five of the ATP rankings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-csk-ms-dhoni-future-fitness-ahmedabad-2730279-2025-05-25",
      "headline": "GT vs CSK: MS Dhoni says his body is 'surviving' amidst IPL future speculationMS Dhoni said that his body is 'surviving' the rigours of the IPL as speculation about his career in the tournament continues. Dhoni is yet to make a call about his future in the IPL as CSK will end their campaign against GT on Sunday, May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-vs-west-indies-3rd-odi-live-updates-dublin-2730238-2025-05-25",
      "headline": "3rd ODI Highlights: West Indies draw series by winning rain-affected gameIRE vs WI, 3rd ODI Highlights: West Indies beat Ireland by a big margin of 197 runs to clinch a rain-affected game. The win helped Windies draw the series 1-1 against the Irish team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-on-virat-kohli-and-rohit-sharma-captaincy-2730276-2025-05-25",
      "headline": "Virat's aggression, Rohit's calm: Shubman Gill reveals Test captaincy mantraShubman Gill has revealed his learnings from Virat Kohli and Rohit Sharma following his appointment as India's new Test captain following the retirement of Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-emma-raducanu-biggest-phobia-2730273-2025-05-25",
      "headline": "Emma Raducanu reveals biggest needle phobia in back injury recovery2021 US Open champion Emma Raducanu said that she has fought her biggest phobia in the form of needles in the road to recovering from her long-standing back injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kidambi-srikanth-malaysia-open-relishing-injury-return-silver-medal-2730270-2025-05-25",
      "headline": "Kidambi Srikanth relishing injury return despite Malaysia Open silver finishAfter battling injuries and slipping in world rankings, Kidambi Srikanth marked a spirited return to form with a runner-up finish at the Malaysia Open 2025, showing glimpses of his old self and relishing the rhythm of top-tier badminton again."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}