{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-high-retail-institutional-demand-allotment-2832326-2025-12-08",
      "headline": "Meesho IPO allotment status: Follow these steps to check on KFin Tech, BSE and NSEInvestors who applied for Meesho's IPO can begin checking their allotment status, with high demand making allocation competitive. Once the allotment is finalised, investors will be able to check their status through three official platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indigo-shares-fall-flight-disruptions-investor-confidence-2832316-2025-12-08",
      "headline": "IndiGo shares tumble 4% as airline faces pressure after flight crisisShares of IndiGo fell sharply following extensive flight cancellations and delays, prompting regulatory scrutiny and new operational measures by the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-allotment-status-check-online-bse-kfin-latest-gmp-listing-details-profit-loss-2832301-2025-12-08",
      "headline": "Aequs IPO allotment out: Check your status, expected profit, and listing detailsAequs IPO saw robust investor interest with over 100 times subscription. Investors are eager to know the allotment status, listing date, and potential profit gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-lower-us-trade-deal-uncertainty-rupee-fall-fii-outflow-weigh-in-2832303-2025-12-08",
      "headline": "Sensex, Nifty open lower as US trade deal uncertainty, FII outflow weigh inThe S&P BSE Sensex was down by 49.63 points to 85,662.74, while the NSE Nifty50 was down by 29.85 points to 26,156.60 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-how-to-check-allotment-shares-expected-listing-gains-bse-kfin-latest-gmp-2832271-2025-12-08",
      "headline": "Waiting for Meesho IPO shares? Check your allotment status, expected profit hereInvestors can check whether they have received Meesho shares through either the BSE website or the registrar, Kfin Technologies Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-says-that-it-has-not-issued-any-advisory-to-halt-funding-in-clean-energy-sector-2832212-2025-12-08",
      "headline": "No advisory issued to stop clean energy funding, says governmentThe Ministry has further noted that calibrated and well-informed financing across the solar manufacturing ecosystem will drive sustainable industry growth and has asked multiple financial institutions to take note of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/netflix-acquire-warner-bros-72-billion-deal-christmas-entertainment-2832085-2025-12-07",
      "headline": "GoT, Harry Potter and more: Netflix notifies users about big Warner Bros takeoverNetflix has begun informing subscribers via email that it is in the final stages of acquiring Warner Bros Discovery's film, TV, and streaming businesses, in a deal valued at $72 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-young-wealthy-gen-z-indians-are-skipping-the-west-for-dubai-2832010-2025-12-07",
      "headline": "Why young, wealthy Indians are skipping the West for DubaiWhy is Dubai now outperforming the West in attracting young Indian investors and professionals? Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-crisis-inflation-capacity-how-centre-fixed-rs-7500-18000-fare-caps-2831869-2025-12-06",
      "headline": "IndiGo crisis, inflation, capacity: How Centre fixed Rs 7,500–18,000 fare capsIndia's Ministry of Civil Aviation has imposed emergency caps on domestic airfares following IndiGo's massive flight cancellations, aiming to protect passengers from soaring ticket prices during the peak travel season. This intervention seeks to stabilise the market amid one of the worst aviation disruptions in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-liquidity-push-rate-cut-omo-sell-swap-rupee-rescue-explained-2831772-2025-12-06",
      "headline": "Can RBI's liquidity boost give the sinking rupee a lifeboat?Liquidity can calm markets, not rewrite global conditions. As the rupee battles external shocks, will the RBI's latest push prove enough to anchor sentiment or simply slow an inevitable slide?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-reliance-power-ed-chargesheet-fake-bank-guarantee-case-2831736-2025-12-06",
      "headline": "Noose tightens around Anil Ambani's Reliance Power as ED files chargesheetThe money laundering case is linked to the issuance of an alleged fake bank guarantee of Rs 68 crore for securing a Solar Energy Corporation of India tender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simone-tata-transforms-lakme-pioneers-westside-retail-india-passes-away-95-2831703-2025-12-06",
      "headline": "Simone Tata, the quiet force behind Lakmé and Westside, dies at 95Simone Tata, a figure behind some of India's most recognizable retail and cosmetics brands, passed away at 95, leaving a legacy marked by innovation and leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-lending-rates-ahead-from-icici-to-sbi-your-home-loan-rate-check-2831467-2025-12-05",
      "headline": "Lower lending rates ahead? From ICICI to SBI, your home loan rate checkIndia's central bank has reduced the repo rate by 25 basis points. This move is likely to influence home loan interest rates and stimulate activity across the housing and real estate sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/netflix-to-acquire-warner-bros-discoverys-studios-streaming-unit-in-72-billion-deal-2831434-2025-12-05",
      "headline": "Netflix to buy Warner Bros Discovery's studios, streaming unit in $72 billion dealNetflix has agreed to buy Warner Bros Discovery's TV, film and streaming businesses, bringing the iconic studio under its control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-forex-reserves-decline-for-second-week-to-usd-6862-billion-rbi-data-report-2831426-2025-12-05",
      "headline": "India's forex reserves decline for second week to $686.2 billion: ReportIndia's foreign exchange reserves fell for the second consecutive week, slipping by $1.877 billion to $686.227 billion in the week ended November 28, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-12-lakh-invested-only-rs-10000-earned-the-truth-behind-sip-maths-2831305-2025-12-05",
      "headline": "Rs 1.2 lakh invested, only Rs 10,000 earned? The truth behind SIP mathsInvestors often overlook the real timeline of their investments when assessing SIP returns. Understanding the compounding effect and the actual period money stays invested can make a significant difference in evaluating returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-as-rbi-cuts-lending-rate-offers-liquidity-support-2831296-2025-12-05",
      "headline": "Sensex, Nifty end higher as RBI cuts lending rate, offers liquidity supportThe Sensex ended at 85,712.37, up 447.05 points, while the Nifty50 settled at 26,186.45, gaining 152.70 points. Most of the broader market indices also ended the trading session on a positive note. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/avadhut-sathe-training-academy-denies-sebi-allegations-fraud-stock-market-victim-of-regulatory-vacuum-2831275-2025-12-05",
      "headline": "Victim of regulatory vacuum: Avadhut Sathe Training Academy denies allegationsSebi's interim order said the academy and its founder were running an unregistered investment advisory service under the guise of training programmes and had collected large sums of money from the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-flight-refund-cancellation-delay-crisis-pilot-delhi-chennai-fdtl-regulations-back-government-2831236-2025-12-05",
      "headline": "IndiGo flight cancellations: What passengers need to know about refundsIndiGo has informed the DGCA that full operational stabilisation is expected only by February 10, 2026, with continued cancellations anticipated until December 8.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-mumbai-flight-prices-surge-70000-indigo-crisis-2831225-2025-12-05",
      "headline": "IndiGo crisis sends Delhi–Mumbai flight prices soaring to over Rs 80,000The Delhi–Mumbai corridor, which connects the national capital with the country's financial centre, is one of the busiest air routes globally. Any disruption on this route immediately affects business travellers, tourists, and daily commuters."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-celebrates-bigg-boss-19-win-calls-trophy-home-in-emotional-note-2832325-2025-12-08",
      "headline": "Gaurav Khanna celebrates Bigg Boss 19 win, calls trophy home in emotional note Gaurav Khanna celebrated his Bigg Boss 19 win by sharing joyful post-finale photos with his wife Akanksha Chamola and close friends, proudly calling the trophy \"home.\" His team wrote an emotional note, calling the victory a collective win for everyone who supported him throughout the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/travel-anxiety-coping-rituals-shared-by-karan-johar-resonate-with-many-2832291-2025-12-08",
      "headline": "KJo's reflection about dealing with travel trauma is every anxious flyer ever Filmmaker Karan Johar has openly discussed his experiences with travel anxiety through a recent social media post, drawing attention to common travel concerns and sparking conversations among his followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-tyla-mumbai-debut-indian-sneakers-festival-2832288-2025-12-08",
      "headline": "Tyla's Mumbai debut: A 60-minute pop spectacle that left Mumbai craving for more Grammy-winner Tyla made a memorable debut in Mumbai at the Indian Sneakers Festival. Her vibrant performance blended cultural elements with high-energy music, promising bigger shows ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sunainaa-khalid-al-ameri-confirm-relationship-romantic-birthday-photos-2832278-2025-12-08",
      "headline": "Tamil actor Sunainaa and UAE influencer Khalid Al Ameri go Insta official. Pics out After months of speculation, Tamil actor Sunainaa and Khalid Al Ameri seemed to have confirmed their relationship by sharing photos together on Instagram, drawing attention from fans and followers across India and the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-90th-birth-anniversary-tribute-by-daughter-esha-deol-2832269-2025-12-08",
      "headline": "We are always together papa: Esha Deol honours Dharmendra on 90th birth anniversary Actor Esha Deol commemorates her father, veteran actor Dharmendra, on what would have been his 90th birthday, expressing her memories and intentions to share his legacy with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-collection-crosses-rs-100-crore-opening-weekend-ranveer-singh-2832246-2025-12-08",
      "headline": "Dhurandhar box office Day 3: Ranveer Singh film hits century in opening weekend Ranveer Singh's action film Dhurandhar recorded a strong box-office opening, grossing Rs 100 crore in India and Rs 140 crore globally, outperforming the competition and setting career milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dharmendra-tribute-salman-khan-bigg-boss-19-finale-bollywood-legend-legacy-2832242-2025-12-08",
      "headline": "Salman Khan gets teary-eyed as he honours Dharmendra's legacy on BB 19 finale Salman Khan paid tribute to Dharmendra during the Bigg Boss 19 grand finale, reflecting on the late actor's legacy and commending Sunny and Bobby Deol for the grace and dignity shown at his funeral and prayer meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-smriti-mandhana-call-off-wedding-health-issues-public-speculation-2832244-2025-12-08",
      "headline": "Palaash Mucchal deletes proposal video with Smriti Mandhana after calling off wedding Palaash Muchhal removed the proposal and World Cup celebration video featuring Smriti Mandhana after publicly announcing the cancellation of their wedding, originally scheduled for November 24. Both have requested privacy following days of speculation and online scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-meets-the-panoti-guy-video-goes-viral-amid-indigo-turbulence-2832252-2025-12-08",
      "headline": "Samay Raina bumps into panoti guy on IndiGo, fans blame him for crisis in fun reel Samay Raina's latest reel featuring the return of the viral \"panoti guy\" has taken over social media after the comedian spotted him on an IndiGo flight amid the airline's chaos. The clip arrives even as Raina continues to face scrutiny over his previous controversies linked to India's Got Latent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elvish-yadav-i-havent-done-as-big-a-project-as-im-going-to-do-in-2026-2832062-2025-12-08",
      "headline": "Elvish Yadav: I haven't done as big a project as I'm going to do in 2026 Elvish Yadav has made his acting debut with 'Aukaat Ke Bahar'. During an exclusive chat, he shared insights on fame, friendships, addressed negative assumptions about him and hinted at a major project in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-farrhana-bhatt-reacts-to-dating-rumours-with-bhaskar-bhatt-2832240-2025-12-08",
      "headline": "Bigg Boss 19's Farrhana reacts to dating rumours with Bhaskar Bhatt: Nonsensical Bigg Boss 19 runner-up Farrhana Bhatt dismissed rumours that she was \"pushed\" internally by rumoured boyfriend Bhaskar Bhatt, calling the speculation \"nonsensical\" and untrue. She also reacted to Gaurav Khanna's win, asserting that he \"did nothing\" all season and won solely because of his fanbase, while emphasising that she herself won \"people's love.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-winner-gaurav-khanna-on-called-fixed-winner-2832235-2025-12-08",
      "headline": "Bigg Boss 19: Gaurav Khanna reacts to 'fixed winner' allegations Bigg Boss 19 winner Gaurav Khanna shut down accusations of being a \"fake\" or \"fixed winner,\" insisting he won by staying real and playing the game on his own terms. In an exclusive interview, he dismissed online criticism as noise and said his authenticity not strategy helped him connect with viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-season-5-trailer-hints-at-explosive-homelander-vs-butcher-clash-2832233-2025-12-08",
      "headline": "The Boys Season 5 trailer hints at explosive Homelander vs Butcher clash The Boys has officially announced its fifth and final season, set to premiere on April 8, 2026, following a massive reveal and exclusive teaser drop at CCXP in Sao Paulo. The panel, led by Eric Kripke and the cast, offered fans a high-voltage first look at the escalating chaos and stakes of the show's endgame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/margot-robbie-on-backlash-over-wuthering-heights-this-generations-titanic-2832231-2025-12-08",
      "headline": "Margot Robbie on backlash over Wuthering Heights: This generation's Titanic Margot Robbie has strongly defended Emerald Fennell's Wuthering Heights adaptation amid criticism over Jacob Elordi's casting as Heathcliff, urging audiences to trust the director's vision. She called the film \"this generation's Titanic,\" praising both Fennell's interpretation and Elordi's performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-grand-finale-farrhana-bhatt-first-runner-up-gaurav-khanna-wins-2832180-2025-12-07",
      "headline": "Bigg Boss 19 Grand Finale: Farrhana Bhatt first runner-up, Gaurav Khanna wins After a season of high drama, Farrhana Bhatt was named the first runner-up of 'Bigg Boss 19', losing the title to actor Gaurav Khanna. Following the eliminations of Amaal Mallik and Tanya Mittal, the final two faced host Salman Khan's grand announcement, capping the grand finale.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-winner-gaurav-khanna-lifts-trophy-takes-rs-50-lakh-home-2832188-2025-12-07",
      "headline": "Bigg Boss 19 winner: Gaurav Khanna lifts trophy, takes Rs 50 lakh home Actor Gaurav Khanna claimed victory of Bigg Boss 19, taking home a cash prize of Rs 50 lakh. Farrhana Bhatt finished as first runner-up, with Pranit More in third place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-eviction-bigg-boss-19-grand-finale-top-contestant-drama-controversies-2832174-2025-12-07",
      "headline": "Bigg Boss 19 Grand Finale: After Amaal Mallik, Tanya Mittal eliminated Tanya Mittal, known for her lavish persona and bold presence, finished fourth on Bigg Boss 19. The top three are Gaurav Khanna, Farrhana Bhatt and Pranit More. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-grand-finale-amaal-mallik-becomes-1st-finalist-to-be-evicted-2832168-2025-12-07",
      "headline": "Bigg Boss 19 Grand Finale: Amaal Mallik becomes 1st finalist to be evicted Music composer Amaal Mallik finished fifth in Bigg Boss 19. He left the show as the first finalist to be evicted on the grand finale. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-accused-of-offensive-gesture-at-pub-actor-zaid-khan-defends-him-2832133-2025-12-07",
      "headline": "Actor Zaid Khan says Aryan Khan's gesture in Bangalore pub wasn't meant for crowd Aryan Khan faced legal action after an alleged offensive gesture incident at a Bengaluru pub on November 28, 2025. Actor Zaid Khan provided a statement that the gesture was directed at Aryan's manager and not the crowd."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-fire-tragedy-birch-romeo-lane-club-owners-look-out-notice-licence-arrested-controversy-2832317-2025-12-08",
      "headline": "Deeply shaken: Goa club owner breaks silence as crackdown tightens in deadly fireA devastating fire at Goa's Romeo Lane club that killed 25 people has prompted a strict government crackdown on the club's owners over alleged licence irregularities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-cancellation-delay-refunds-delhi-mumbai-bengaluru-airport-passenger-advisory-2832241-2025-12-08",
      "headline": "Over 450 IndiGo flights cancelled today; operations far from normal  Live UpdatesIndiGo continues to face significant flight disruptions on Monday, and the airline has processed ticket refunds worth Rs 610 crore amid the ongoing nationwide chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-open-lok-sabha-debate-on-vande-mataram-congress-lines-up-rahul-priyanka-for-key-interventions-2832245-2025-12-08",
      "headline": "PM Modi to lead Vande Mataram debate in Lok Sabha today  Live UpdatesThe government has set aside 10 hours for the Vande Mataram discussion, part of year-long commemorations. In the Rajya Sabha, Amit Shah and J P Nadda will open corresponding debates, with Mallikarjun Kharge speaking for the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-ncr-aqi-punjab-haryana-farmers-trick-satellites-hiding-farm-fires-isro-study-nasa-scientist-reveal-ministry-of-environment-2832170-2025-12-08",
      "headline": "How farmers are dodging satellites with 5 PM trick, fooling govt on farm firesEven as the government says farm fires in Punjab and Haryana have gone down, the smog in Delhi-NCR remains the same. A study by Isro researchers shows how farmers have learnt the time when satellites scan the region and delayed the time of peak fire activity. A Nasa researcher says an aerosol study indicates 2025 to be the third-worst in the last 15 years. There's a gap in India's tracking system and farmers are exploiting it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-uk-deal-sex-grooming-gang-uk-convicts-deportation-dissident-munir-adil-raja-deportation-extradition-2831889-2025-12-08",
      "headline": "Pak to take back sex grooming gang members from UK, wants political rebels tooIslamabad has reportedly floated a proposal to London to accept the return of convicted members of Pakistani grooming gangs from the UK in exchange for Britain extraditing two high-profile anti-Asim Munir political dissidents. The two are former PM Imran Khan's aide Shahzad Akbar, and a Pakistani army dissident, Adil Raja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-2017-actress-assault-abduction-case-dileep-verdict-today-2832327-2025-12-08",
      "headline": "Actor Dileep's sexual assault case verdict today, 8 years after high-profile scandalA Kerala court is set to deliver its verdict at 11 am today in the 2017 actor abduction and assault case. Malayalam actor Dileep is among the 10 accused facing judgment after nearly eight years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-immigration-remarks-row-mass-migration-glbs-2832230-2025-12-08",
      "headline": "JD Vance's immigration remark sparks row, triggers calls to send Usha back to IndiaUS Vice President JD Vance sparked backlash after calling mass migration theft of the American Dream, drawing criticism over his Indian-American wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-calls-emails-after-work-right-to-disconnect-bill-introduced-in-lok-sabha-2831729-2025-12-06",
      "headline": "No calls, emails after work: Right to Disconnect Bill introduced in Lok SabhaThe bill proposes granting every employee the right to disconnect from work-related calls and emails beyond official work hours and on holidays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/saina-nehwal-nails-akshaye-khanna-swagger-dhurandhar-entry-step-fa9la-dad-joins-for-fun-video-2832345-2025-12-08",
      "headline": "Saina Nehwal nails Akshaye Khanna's swagger Dhurandhar entry step, dad joins for funDuring a recent outing, Saina Nehwal attempted Akshaye Khanna's electrifying entry in Dhurandhar, but the surprise scene-stealer turned out to be her father. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-tvk-protest-illegal-liquor-bar-dharmapuri-cadre-attempts-bite-cop-2832336-2025-12-08",
      "headline": "Caught on camera: Vijay's party cadre tries to bite police officer during protestA TVK protest against an alleged illegal liquor bar at a recreation centre in Tamil Nadu's Dharmapuri turned tense after cadres entered the premises. Police stopped them. One protester was caught on camera attempting to bite a police officer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indigo-shares-fall-flight-disruptions-investor-confidence-2832316-2025-12-08",
      "headline": "IndiGo shares tumble 4% as airline faces pressure after flight crisisShares of IndiGo fell sharply following extensive flight cancellations and delays, prompting regulatory scrutiny and new operational measures by the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rs-500-crore-to-become-punjab-cm-navjot-kaur-sidhus-remark-sparks-row-2832172-2025-12-07",
      "headline": "Rs 500 crore to become Punjab CM? Navjot Kaur Sidhu's remark sparks rowCongress leader Navjot Kaur Sidhu has ignited controversy by alleging massive corruption in Punjab's CM selection process. The statement highlights internal Congress rifts and draws sharp BJP criticism ahead of upcoming elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/my-head-was-shaking-i-just-ran-dancer-recalls-chilling-escape-from-goa-club-fire-2832110-2025-12-07",
      "headline": "Goa club fire: Short circuit caught on camera, dancer recalls moments before escapeA young Kazakhstani dancer narrowly escaped a deadly fire at a popular nightclub in Goa, recounting her terrifying experience and expressing gratitude for her life. The tragedy claimed 25 lives and prompted swift government response and investigations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-celebrates-bigg-boss-19-win-calls-trophy-home-in-emotional-note-2832325-2025-12-08",
      "headline": "Gaurav Khanna celebrates Bigg Boss 19 win, calls trophy home in emotional noteGaurav Khanna celebrated his Bigg Boss 19 win by sharing joyful post-finale photos with his wife Akanksha Chamola and close friends, proudly calling the trophy \"home.\" His team wrote an emotional note, calling the victory a collective win for everyone who supported him throughout the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-zohran-mamdani-immigrant-rights-ice-raids-glbs-2832239-2025-12-08",
      "headline": "Know your rights: Zohran Mamdani tells New Yorkers how to resist immigration raidsIn the video, Zohran Mamdani said his administration will work to protect the city's large immigrant population. \"We can all stand up to ICE if you know your rights,\" he said, stressing that people in the United States can legally refuse to answer questions from immigration agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-collection-crosses-rs-100-crore-opening-weekend-ranveer-singh-2832246-2025-12-08",
      "headline": "Dhurandhar box office Day 3: Ranveer Singh film hits century in opening weekendRanveer Singh's action film Dhurandhar recorded a strong box-office opening, grossing Rs 100 crore in India and Rs 140 crore globally, outperforming the competition and setting career milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-90th-birth-anniversary-tribute-by-daughter-esha-deol-2832269-2025-12-08",
      "headline": "We are always together papa: Esha Deol honours Dharmendra on 90th birth anniversaryActor Esha Deol commemorates her father, veteran actor Dharmendra, on what would have been his 90th birthday, expressing her memories and intentions to share his legacy with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-vande-mataram-150th-anniversary-debate-lok-sabha-rajya-sabha-parliament-winter-session-live-updates-congress-bjp-2832236-2025-12-08",
      "headline": "Live: Shiv Sena UBT MP Priyanka Chaturvedi to raise Indigo fiasco in Rajya SabhaParliament Winter Session Live: Prime Minister Narendra Modi will initiate a 10-hour debate in the Lok Sabha on Monday to mark the 150th anniversary of the national song Vande Mataram, a discussion expected to highlight several significant and lesser-known facets of its history, followed by a one-day special debate in the Rajya Sabha on Tuesday led by the Home Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-club-fire-spread-due-to-wooden-furniture-many-people-couldnt-escape-as-club-had-2-gates-police-sources-2832139-2025-12-07",
      "headline": "Goa nightclub had only 2 gates, fire spread due to wooden furniture: SourcesA tragic fire at a Goa nightclub claimed 25 lives, primarily due to suffocation caused by combustible wooden interiors and limited exits. Authorities have arrested four individuals and launched investigations into safety violations and regulatory lapses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-pollution-levels-very-poor-aqi-today-noida-gurugram-ghaziabad-2832247-2025-12-08",
      "headline": "Delhi continues to choke as air quality remains very poor amid dip in temperaturePollution levels in Delhi-NCR remained in the very poor category on Monday, with the AQI rising slightly to 318. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-rohit-sharma-virat-kohli-gautam-gambhir-odi-world-cup-2027-2832263-2025-12-08",
      "headline": "Ro-Ko against the world: How Rohit, Kohli are pushing each other to World Cup 2027Rohit Sharma and Virat Kohli have started pushing each other on the field to keep themselves ready for their mission of making it to the 2027 World Cup. Along with lifting themselves up, the South Africa series underlined their importance to the Indian squad with their experience and vibes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-strict-action-rohingyas-identity-verification-inflitrators-up-2832243-2025-12-08",
      "headline": "Check IDs before hiring: Yogi Adityanath's strict action against RohingyasUttar Pradesh CM Yogi Adityanath has urged citizens to verify identities before hiring, as the state intensifies strict action against alleged Rohingya and Bangladeshi infiltrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/hyderabad-road-housing-us-consulate-general-set-to-be-called-donald-trump-avenue-in-honour-of-us-president-2832163-2025-12-07",
      "headline": "Hyderabad road housing US Consulate General to be named as 'Donald Trump Avenue'The state government will write to the Union Ministry of External Affairs and the US Embassy, informing them about the plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-smriti-mandhana-call-off-wedding-health-issues-public-speculation-2832244-2025-12-08",
      "headline": "Palaash Mucchal deletes proposal video with Smriti Mandhana after calling off weddingPalaash Muchhal removed the proposal and World Cup celebration video featuring Smriti Mandhana after publicly announcing the cancellation of their wedding, originally scheduled for November 24. Both have requested privacy following days of speculation and online scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/travel-anxiety-coping-rituals-shared-by-karan-johar-resonate-with-many-2832291-2025-12-08",
      "headline": "KJo's reflection about dealing with travel trauma is every anxious flyer everFilmmaker Karan Johar has openly discussed his experiences with travel anxiety through a recent social media post, drawing attention to common travel concerns and sparking conversations among his followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sunainaa-khalid-al-ameri-confirm-relationship-romantic-birthday-photos-2832278-2025-12-08",
      "headline": "Tamil actor Sunainaa and UAE influencer Khalid Al Ameri go Insta official. Pics outAfter months of speculation, Tamil actor Sunainaa and Khalid Al Ameri seemed to have confirmed their relationship by sharing photos together on Instagram, drawing attention from fans and followers across India and the UAE."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-final-bangladesh-cricket-series-political-icc-challenges-2832335-2025-12-08",
      "headline": "Shakib Al Hasan eyes swansong in Bangladesh as political, selection hurdles linger Former captain Shakib Al Hasan wants one last chance to play in Bangladesh colours. Now it is up to the selectors and authorities to decide if the country's biggest star gets a final goodbye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-germnany-junior-hockey-world-cup-semifinal-analysis-2832318-2025-12-08",
      "headline": "Potential vs process: India were outthought by Germany in Junior World Cup semis Hockey Junior World Cup 2025: Germany showed India the difference between talent and preparation. Now comes the real test—whether these lessons survive beyond heartbreak and become the steel that shapes tomorrow's champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-michael-neser-5-wicket-haul-nathan-lyon-ashes-2025-brisbane-test-2832309-2025-12-08",
      "headline": "Ashes: Nathan Lyon is pissed. But Steve Smith says Gabba axe right call Michael Neser took a crucial five-wicket haul to help Australia win the second Ashes Test. His performance justified the controversial decision to bench Nathan Lyon in the all-seam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-vs-south-africa-men-in-blue-arrive-in-bhubaneswar-for-t20-series-opener-ytvd-2832287-2025-12-08",
      "headline": "India vs South Africa: Men in Blue Arrive in Bhubaneswar for T20 Series Opener On this news bulletin, the focus is on the Indian cricket team's arrival in Bhubaneswar ahead of the highly anticipated five-match T20 series against South Africa. The series opener is scheduled for tomorrow, December 9, at the Barabati Stadium in Cuttack. Visuals capture a grand welcome for the 'Men in Blue' with enthusiastic fans cheering and traditional drumming resonating around the airport arrival area. The team, led by captain Suryakumar Yadav, looks to continue their winning momentum after successfully wrapping up the ODI series. The programme highlights the palpable excitement building up in Odisha as the cricketing action shifts to the shortest format. Security and arrangements are in place as the city gears up to host the international fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-rohit-sharma-virat-kohli-gautam-gambhir-odi-world-cup-2027-2832263-2025-12-08",
      "headline": "Ro-Ko against the world: How Rohit, Kohli are pushing each other to World Cup 2027 Rohit Sharma and Virat Kohli have started pushing each other on the field to keep themselves ready for their mission of making it to the 2027 World Cup. Along with lifting themselves up, the South Africa series underlined their importance to the Indian squad with their experience and vibes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-links-up-with-team-india-ahead-of-1st-t20i-in-cuttack-2832253-2025-12-08",
      "headline": "Shubman Gill links up with team India after recovering from neck injury India's T20I vice captain Shubman Gill has rejoined the team after completing rehabilitation for his neck injury. Gill was ruled out of the Test and ODI series against South Africa after injuring himself in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-v-eng-joe-root-sachin-tendulkar-best-test-batters-2832103-2025-12-08",
      "headline": "Has Joe Root done enough to take over from Sachin Tendulkar as Test GOAT? Star England batter Joe Root has finally got rid of the only blemish of his illustrious Test career after scoring his first century in Australia. However, has he done enough to earn the tag of Test 'GOAT' as he inches closer to overtake Sachin Tendulkar as the highest run scorer of the format."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-v-eng-michael-vaughan-series-prediction-2832210-2025-12-08",
      "headline": "It could be 5-0: Micheal Vaughan fears the worst for England in Ashes Ashes: Former England captain Michael Vaughan fears the worst for Ben Stokes' team. Vaughan feels that if England do not drastically improve, they might be whitewashed by Australia in the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-15-crore-reward-delhi-government-rekha-gupta-womens-world-cup-2832205-2025-12-08",
      "headline": "Pratika Rawal rewarded Rs 1.5 crore by Delhi government for Women's World Cup heroics From wheelchair-bound celebrations to a ₹1.5 crore reward, Pratika Rawal's World Cup journey became a powerful symbol of resilience as Delhi honoured one of its brightest new sporting stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-max-verstappen-praises-lando-norris-first-world-title-abu-dhabi-2025-2832201-2025-12-07",
      "headline": "Don't see it as a loss: Max Verstappen on conceding F1 World title to Norris Max Verstappen praised Lando Norris after the McLaren driver dethroned him to become the new Formula One World Champion. Norris edged past Verstappen by two points to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ksca-elections-2025-venkatesh-prasad-new-president-karnataka-cricket-association-2832185-2025-12-07",
      "headline": "Former pacer Venkatesh Prasad elected as new Karnataka cricket association president Former India pacer Venkatesh Prasad has been elected as the new president of the Karnataka State Cricket Association (KSCA) as the panel led by him secured a dominant win in the elections held on Sunday, December 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-admits-deliberate-illegal-bowling-action-surrey-2024-suspension-2832178-2025-12-07",
      "headline": "Shakib Al Hasan reveals why he bowled with an illegal action during Surrey stintBangladesh all-rounder Shakib Al Hasan has revealed he bowled with an illegal action during his time at Surrey, leading to a suspension, but was later cleared after remedial training and testing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/jr-mens-hockey-world-cup-2025-india-vs-germany-semifinal-result-2832173-2025-12-07",
      "headline": "India's Jr. World Cup wait continues as Germany thrash them in semi-finalIndia's wait to make it to the final of the Jr.men's Hockey World Cup continues as the defending champions Germany thrash them 1-5 on Sunday, December 7. Germany will face Spain in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-struggles-mccullum-overpreparation-impacted-performance-2832167-2025-12-07",
      "headline": "England overprepared, needed few days off: McCullum's bizarre take after Brisbane lossThe Ashes 2025-26, 2nd Test: Brendon McCullum admitted England may have overprepared after back-to-back Ashes defeats, with the tourists now needing to win all three remaining Tests to reclaim the urn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lando-norris-first-reaction-first-f1-world-title-mclaren-abu-dhabi-2832164-2025-12-07",
      "headline": "Lando Norris's reaction after winning maiden F1 title: Didn't think I'd cry but I didLando Norris sealed his first Formula 1 world title at the Abu Dhabi Grand Prix after a season-long battle with Max Verstappen and Oscar Piastri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/chinnaswamy-stadium-to-continue-hosting-ipl-matches-despite-stampede-concerns-speaker-ytvd-2832156-2025-12-07",
      "headline": "Chinnaswamy Stadium To Continue Hosting IPL Matches Despite Stampede Concerns: SpeakerIn this special report, an unidentified speaker addresses the uncertainty regarding hosting rights at Chinnaswamy Stadium following a reported stampede on June 4th. The incident reportedly occurred during celebrations of the Royal Challengers Bangalore's IPL 2025 victory. Speaking after casting a vote in the KSCA presidential elections, the speaker confirms that Chinnaswamy Stadium will continue to host future IPL games. Additionally, the speaker shares a vision for the state to 'build a new, larger stadium down the road'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/abu-dhabi-gp-2025-lando-norris-wins-f1-title-beats-max-verstappen-2832140-2025-12-07",
      "headline": "Abu Dhabi GP: Norris plays it safe, pips Verstappen to claim F1 2025 titleLando Norris pipped Max Verstappen to secure his maiden Formula One title as he finished third in the Abu Dhabi Grand Prix on Sunday, December 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-2025-26-2nd-test-geoffrey-boycott-england-backsides-brisbane-horror-show-2832136-2025-12-07",
      "headline": "England are up their own backsides, says Geoffrey Boycott after Brisbane horror showThe Ashes 2025-26, 2nd Test: Geoffrey Boycott tore into Ben Stokes and England after their Brisbane Ashes defeat, branding the team \"up their own backsides\" and slamming their batting, bowling and overall mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-ashes-bazball-does-not-work-2832112-2025-12-07",
      "headline": "Ashes: Australia isn't a place for weak men and Bazball does not workAshes: England were battered by Australia in the 2nd Test match of the series. The Gabba Test once again proved that Bazball really does not work against tough opponents in tough conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-who-are-best-finishers-in-odis-2832007-2025-12-07",
      "headline": "Unsung heroes at the death: The art and artists of finishing in ODIsIND vs SA: The difference between hope and heartbreak often lies with one batter. India needs a new closer who carries confidence into the storm and makes victory feel inevitable again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshad-khan-record-best-bowling-figures-6-9-syed-mushtaq-ali-trophy-2832114-2025-12-07",
      "headline": "SMAT 2025: Gujarat Titans' uncapped star creates history with record bowling figuresMadhya Pradesh left-arm seamer Arshad Khan delivered the best bowling figures in the history of the Syed Mushtaq Ali Trophy, taking 6/9 against Chandigarh at the Jadavpur University Ground, and helped his team to a comprehensive victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-liverpool-tension-transfer-rumours-limited-starts-2832108-2025-12-07",
      "headline": "Salah's explosive Liverpool rant: Former midfielder slams Egyptian starMohamed Salah's public comments after being benched for a third consecutive match have drawn criticism from former midfielder Danny Murphy after Liverpool's draw against Leeds United. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-dominates-england-ashes-test-gabba-neser-five-wicket-haul-smith-finishing-touch-2832089-2025-12-07",
      "headline": "Steve Smith 23 off 9: When Jofra Archer predicted his own Ashes downfall in 2013Australia cruised to an eight-wicket win over England in the second Ashes Test at Brisbane's Gabba, chasing 65 with minimal resistance. The hosts now hold a 2-0 lead in the five-Test series, while England's drought for a victory in Australia—stretching 14 years—remains unresolved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-abu-dhabi-gp-live-verstappen-norris-piastri-title-fight-2832090-2025-12-07",
      "headline": "F1 Abu Dhabi GP Highlights: Lando Norris crowned World Championship titleAbu Dhabi Grand Prix 2025 Highlights: Max Verstappen won the race but it wasn't enough as Lando Norris went on to finish 3rd to take the top spot in the Driver's Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-need-special-treatment-sanjay-bangar-ind-vs-sa-2832088-2025-12-07",
      "headline": "Should Rohit Sharma, Virat Kohli be treated differently from others? Bangar reactsFormer India batting coach Sanjay Bangar has said that both Rohit Sharma and Virat Kohli need to be treated differently as compared to the other players after their heroics in the South Africa ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rahul-rawat-smriti-mandhana-calls-off-wedding-with-palash-muchhal-cites-privacy-ytvd-2832082-2025-12-07",
      "headline": "Rahul Rawat: Smriti Mandhana Calls Off Wedding With Palash Muchhal, Cites PrivacyIn this India Today broadcast, Senior Sports Editor Rahul Rawat and Reporter Anjali Pandey report on the cancellation of cricketer Smriti Mandhana's wedding to music composer Palash Muchhal. Mandhana confirmed the split on Instagram, stating, 'I need to clarify that the wedding is called off.' She emphasized her desire for privacy and focus on representing India. Muchhal also released a statement, saying he is 'moving on' and 'stepping back from his personal relationship.' He further warned that his team will take 'strict legal action against those spreading false and defamatory content.' The segment discusses the timeline, including the initial postponement due to Mandhana's father's illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-v-eng-steve-smith-jofra-archer-2832079-2025-12-07",
      "headline": "Repeat on 2019: Jofra Archer, Steve Smith engage in heated battle at GabbaAshes: Australia captain Steve Smith engaged in a heated battle with England's Jofra Archer in the final moments of the 2nd Test match. Facing heat from Archer, a fired up Smith hooked him for a six and uttered some stern words to the bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-australia-beat-england-brisbane-ben-stokes-jofra-archer-2832078-2025-12-07",
      "headline": "Stokes' fight not enough as Australia crush England in pink-ball Test, go 2-0 upAustralia dominated the second Ashes Test at The Gabba in Brisbane to take a 2-0 lead in the series. The hosts were set a target of 65 runs in the fourth innings and chased it down with eight wickets to spare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-breaks-silence-wedding-palash-palash-muchhal-2832049-2025-12-07",
      "headline": "Smriti Mandhana says wedding with Palash Muchhal is offIndia cricketer Smriti Mandhana has broken her silence on her wedding to Palash Muchhal. In an Instagram story, Mandhana confirmed for the first time that the wedding was off and requested privacy for both families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-simachalam-temple-vizag-ind-vs-sa-2832045-2025-12-07",
      "headline": "Virat Kohli visits Simachalam temple after rediscovering form in ODI seriesIND vs SA: Virat Kohli offered prayers at the Simachalam temple after India's series win in Vizag. Kohli rediscovered his mojo in the series and played three stunning innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-matches-to-continue-in-bengaluru-with-enhanced-safety-measures-2832039-2025-12-07",
      "headline": "Chinnaswamy pride of Bengaluru, IPL will not shift from here: Karnataka Deputy CMKarnataka Deputy CM D.K. Shivakumar has said that IPL matches will not be moved from Bengaluru's M. Chinnaswamy Stadium. The decision follows plans to improve safety and develop an alternative stadium after last year's stampede incident."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}