{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dnpa-hosts-key-ai-and-journalism-dialogue-at-indiaai-impact-summit-2026-2869708-2026-02-17",
      "headline": "DNPA hosts key AI and journalism dialogue at IndiaAI Impact Summit 2026The session brought together senior leaders from India's most influential news organisations along with global publishing representation to examine how artificial intelligence is transforming journalism, and how India must shape that transformation responsibly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-income-tax-rules-2026-could-change-your-tax-forms-what-it-means-for-you-2869689-2026-02-17",
      "headline": "Draft income tax rules 2026 could change your tax forms: What it means for you?Under the draft new law, statutory forms such as Form 26AS, Form 16 and Form 13 will be issued with new numbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-close-higher-it-psu-bank-rally-infosys-anthropic-reliance-fall-2869668-2026-02-17",
      "headline": "Sensex, Nifty close higher as IT and PSU banking stocks rally; Infosys up 2%The IT sector played a key role in lifting the markets. The Nifty IT index, which is the second-heaviest sector on the benchmarks, climbed 1%. Shares of Infosys rose 1.9% after the company announced a partnership with US-based artificial intelligence firm Anthropic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/are-millennials-and-gen-z-behind-90-95-of-indias-home-purchases-2869594-2026-02-17",
      "headline": "Are millennials and Gen Z behind 90–95% of India's home purchases?For many borrowers under 40, applying for a home loan online is no longer optional, it is the preferred way. Around 72% of borrowers in this age group choose digital applications, and nearly half of borrowers above 60 are also getting comfortable with online processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-forge-bel-cochin-shipyard-defence-stocks-comeback-2869577-2026-02-17",
      "headline": "Cochin Shipyard, HAL, BEL: Are defence stocks set for a strong comeback?The defence theme is back on screens. Now it needs breadth, sustained volumes and follow-through to turn early strength into a lasting rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-announces-100-billion-to-build-ai-ready-green-data-centres-by-2035-2869553-2026-02-17",
      "headline": "Adani Group announces $100 billion to build AI-ready, green data centres by 2035The $100 billion direct investment is expected to catalyse an additional $150 billion across related sectors over the next decade. These include server manufacturing, advanced electrical infrastructure, sovereign cloud platforms, and semiconductor and compute ecosystems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/star-health-denies-lucknow-man-viral-allegation-mother-claim-rejection-pre-existing-condition-2869523-2026-02-17",
      "headline": "Star Health rejects Lucknow man's viral allegation over mother's claim rejectionIn a post, the man said he had been paying around Rs 50,000 every year as premium for his mother's health insurance policy. When she fell ill, he went to the Lucknow office of Star Health and Allied Insurance to seek claim support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-drops-over-rs-2500-silver-falls-rs-6000-are-bigger-price-cuts-on-the-way-2869510-2026-02-17",
      "headline": "Gold drops over Rs 2,500, silver falls Rs 6,000: Are bigger price cuts on the way?Gold and silver have taken a sharp hit, shaking confidence after weeks of strong gains. As volatility rises, investors are trying to understand whether this decline signals a larger trend shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/changed-your-salary-account-heres-what-happens-to-your-pf-withdrawals-now-2869486-2026-02-17",
      "headline": "Changed your salary account? Here's what happens to your PF withdrawals nowUpdating your account when there is no urgency is far easier than scrambling to fix it when you need funds quickly. Think of it as preventive maintenance for your finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tcs-hcltech-share-price-up-why-it-stocks-are-rising-today-anthropic-ai-deal-nifty-it-rebound-2869458-2026-02-17",
      "headline": "Infosys, TCS, HCLTech gain up to 3%: Why are IT stocks rising today?The main trigger for the rally was Infosys announcing a strategic partnership with artificial intelligence firm Anthropic. Investors reacted positively to the news, pushing Infosys shares nearly 3% higher to around Rs 1,407 during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-anthropic-artificial-intelligence-ai-technology-complex-industry-advance-partnership-india-ai-2869430-2026-02-17",
      "headline": "Infosys shares jump 3% today after announcing partnership with AnthropicThis new partnership will help companies in tough, rule-heavy sectors use AI better, and improve efficiency in providing essential services to the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-it-rally-shares-up-2869428-2026-02-17",
      "headline": "Sensex, Nifty open lower but IT stocks rallyThe S&P BSE added 42.49 points to 83,319.64, while the NSE Nifty50 lost 17.05 points to 25,665.70 as of 10:10 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/global-tech-giants-lose-billions-ai-spending-concerns-microsoft-amazon-nvidia-2026-2869408-2026-02-17",
      "headline": "Global tech giants see billions erased amid rising AI cost concernsInvestors who once rewarded bold AI plans are now asking tougher questions about spending, profits and competition. Several of the largest US technology firms have lost hundreds of billions of dollars in market value since the start of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-advances-with-focus-on-finalising-legal-agreement-2869135-2026-02-16",
      "headline": "India–US trade deal advances with focus on finalising legal agreementSpeaking on the development, Commerce Secretary Rajesh Agrawal said a joint statement outlining the contours of the agreement has already been signed. He said that these contours now need to be converted into a formal legal agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/record-msp-procurement-how-many-farmers-are-actually-benefiting-2869087-2026-02-16",
      "headline": "Record MSP procurement: How many farmers are actually benefiting?India's MSP system is clearly expanding, with higher spending, larger procurement and more beneficiaries than before. Yet the debate has shifted from scale to security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-jump-500-points-nifty-rally-banking-financial-shares-up-2869003-2026-02-16",
      "headline": "Sensex rallies over 600 points: Why stock market rose today?The S&P BSE Sensex rallied 650.39 points to close at 83,277.15, while the NSE Nifty50 added 211.65 points to end at 25,682.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-cash-levels-equity-returns-market-volatility-kotak-flexicap-2868990-2026-02-16",
      "headline": "How cash levels in mutual funds impact returns during volatile marketsIn the current market, volatility caused by global and external factors has led some mutual funds to increase their cash positions. The idea is to lower risk and protect portfolios from sudden corrections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-nps-help-you-save-tax-in-the-new-regime-what-salaried-employees-must-know-2868956-2026-02-16",
      "headline": "Can NPS help you save tax in the new regime? What salaried employees must knowFor salaried workers who have moved to the new tax regime, tax saving can feel limited. This has led many to question if there are still practical ways to ease their tax burden. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-your-employer-refuse-gratuity-if-you-get-pension-heres-what-employees-must-know-2868916-2026-02-16",
      "headline": "Can your employer refuse gratuity if you get pension? Here's what employees must knowMany employees assume that receiving a pension from their employer means they may have to give up gratuity. But the law draws a clear distinction between the two. A recent court ruling has clarified what workers should know about their rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/mumbai-luxury-housing-market-2025-ultra-luxury-home-sales-rs-100-crore-record-2868915-2026-02-16",
      "headline": "Why Mumbai remains India's top luxury housing hubThe global recognition Mumbai is receiving today is best understood as validation rather than arrival. International research now ranks the city among the world's fastest-growing luxury housing markets, reflecting sustained price appreciation at the very top end."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pravina-deshpande-dies-veteran-actor-hindi-marathi-cinema-legacy-2869955-2026-02-18",
      "headline": "Pravina Deshpande, Salman Khan's co-actor in Ready, dies at 60 Actor Pravina Deshpande, known for her work in Hindi and Marathi cinema and television, died on February 17, 2026. Her death was confirmed by her family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-on-marrying-husband-vivek-mehra-2869947-2026-02-17",
      "headline": "Did it out of compulsion: Neena Gupta on marrying Vivek Mehra Actor Neena Gupta shared in what way societal pressure shaped her decision to marry Vivek Mehra, and has a surprising take on love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-father-sunil-malhotra-passes-away-delhi-family-mourns-loss-2869885-2026-02-17",
      "headline": "Sidharth Malhotra's father dies in Delhi after prolonged illness, actor shares post Actor Sidharth Malhotra's father, Sunil Malhotra, died in Delhi on Saturday, February 14, following a prolonged illness. He was surrounded by family at the time of his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anubhav-sinha-on-raone-2-hopes-and-srks-availability-its-a-3-year-marriage-2869821-2026-02-17",
      "headline": "Anubhav Sinha on Ra.One 2 hopes and SRK's availability: It's a 3-year marriage Anubhav Sinha expressed his desire to develop a sequel to Ra.One, describing the ambitious project as a \"three-year marriage.\" He mentioned that the sequel's future depends on his own schedule and Shah Rukh Khan's availability for such a long-term commitment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heated-rivalry-series-adaptation-jacob-tierney-premiere-india-2026-2869817-2026-02-17",
      "headline": "Heated Rivalry director Jacob Tierney stays true to source material. Here's why Filmmaker Jacob Tierney says he refused to alter the Heated Rivalry novel while adapting it for television. Here's why his approach stands out.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/alia-bhatt-joins-cillian-murphy-and-kate-hudson-as-bafta-2026-presenters-2869803-2026-02-17",
      "headline": "Alia Bhatt joins Cillian Murphy and Kate Hudson as BAFTA 2026 presenter Actor Alia Bhatt has been named among a high-profile list of presenters for the 2026 BAFTA Awards. She will be joining Cillian Murphy, Kate Hudson, and Glenn Close for the ceremony on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chikungunya-update-bollywood-filmmaker-kiran-rao-recovery-safety-tips-2869753-2026-02-17",
      "headline": "Kiran Rao is down with chikungunya, meet her 'excellent paramedic' Filmmaker Kiran Rao recently shared her experience with chikungunya on social media. She emphasised the importance of taking health precautions and expressed gratitude for the support she received during her recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/farida-jalal-career-journey-adaptability-quality-work-2869757-2026-02-17",
      "headline": "Actor Farida Jalal says her comeback outshone her early career Veteran actor Farida Jalal discusses her approach to work, the significance of her comeback, and observations on the changing nature of fame and roles in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-grover-on-teen-accused-in-hit-and-run-case-politicians-in-papas-pockets-2869664-2026-02-17",
      "headline": "Varun Grover on teen accused in hit-and-run case: Politicians in Papa's pockets Varun Grover slammed the \"soft-oligarchy\" following the Dwarka hit-and-run, where a minor accused of killing Sahil Dhaneshra received interim bail. He criticised the culture of influential families escaping accountability, highlighting how systemic gaps allow reckless behavior to go unpunished in high-profile cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emmanuel-macron-meets-manoj-bajpayee-anil-kapoor-shabana-azmi-zoya-akhtar-richa-chadha-alongside-legends-of-indian-cinema-2869758-2026-02-17",
      "headline": "Alongside legends: Emmanuel Macron meets Manoj Bajpayee, Anil Kapoor and others French President Emmanuel Macron met Bollywood celebrities including Shabana Azmi, Anil Kapoor, Manoj Bajpayee, Zoya Akhtar and Richa Chadha in Mumbai during his India visit. \"Alongside legends of Indian cinema,\" Macron wrote in the caption along with pictures he posted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/farhan-akhtar-portrays-ravi-shankar-sam-mendes-beatles-biopic-2869722-2026-02-17",
      "headline": "Amul celebrates Farhan's Ravi Shankar act in The Beatles with quirky topical Amul India has celebrated Farhan Akhtar's Hollywood debut as Ravi Shankar with a witty topical. Here's why the casting is making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-father-salim-khan-shifted-icu-doctors-confirm-he-is-stable-2869740-2026-02-17",
      "headline": "Salim Khan shifted to ICU, doctors confirm he is stable Salman Khan's father, Salim Khan, has been shifted to the Intensive Care Unit (ICU) of Lilavati Hospital under the observation of experts. The doctor, in a press statement, said that Khan is currently stable.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-expresses-gratitude-to-high-court-following-interim-bail-from-tihar-2869732-2026-02-17",
      "headline": "Rajpal Yadav expresses gratitude to High Court following interim bail from Tihar Rajpal Yadav expressed gratitude to the High Court as well as the film industry and his fans after being granted interim bail. Addressing a cheque bounce case, the actor mentioned he remains ready to answer all allegations and thanked the judiciary for the relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-shares-early-stage-show-experience-parents-denied-entry-punjab-2869661-2026-02-17",
      "headline": "Why were Akshay Kumar's parents denied entry to his first show? Actor shares During an episode of Wheel of Fortune, Akshay Kumar recalled how his parents were unable to attend his first stage performance in Punjab. The actor also shared that the security staff thought that his father was intoxicated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shanaya-kapoor-recalls-aryan-khans-rollercoaster-prank-on-her-and-suhana-khan-2869687-2026-02-17",
      "headline": "Rollercoaster gone rogue: Shanaya recalls Aryan Khan's prank on her and Suhana Actor Shanaya Kapoor shared a childhood memory where she and Suhana Khan were pushed down the stairs by Aryan Khan. The confession came as she was promoting her latest film, Tu Yaa Main, alongside co-star Adarsh Gourav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/climate-responsibility-storytelling-dia-mirza-sustainable-growth-harvard-hpair-forum-2869670-2026-02-17",
      "headline": "Dia Mirza says storytelling can encourage climate action and change Bollywood actor Dia Mirza combined climate urgency with cultural wisdom in her Harvard keynote. What powerful message did she leave students with?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakondas-slow-burn-love-story-heads-to-the-altar-2869694-2026-02-17",
      "headline": "Rashmika Mandanna, Vijay Deverakonda's slow-burn love story heads to the altar Rashmika Mandanna and Vijay Deverakonda are set to marry on February 26 in an intimate ceremony. From their first film together in 2018 to years of speculation, their slow-burn romance has shaped away from the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/i-am-a-shiva-devotee-prakash-raj-reveals-his-character-in-rajamoulis-varanasi-2869609-2026-02-17",
      "headline": "I am a Shiva devotee: Prakash Raj reveals his character in Rajamouli's Varanasi Prakash Raj confirms his role in SS Rajamouli's mythological film, Varanasi. The actor adds star power to the film, which features Mahesh Babu, Priyanka Chopra and Prithviraj Sukumaran in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-gabru-film-release-date-may-8-2026-courage-resilience-2869634-2026-02-17",
      "headline": "Sunny Deol's Gabru set for May release following Border 2 success. Check date here Sunny Deol's next film, Gabru, is set for theatrical release on May 8, following the recent success of Border 2. Directed by Shashank Udapurkar, the movie features themes of courage, identity, and resilience."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-teen-driver-suv-crash-biker-killed-dead-ran-over-dwarka-accused-father-grief-apologises-forgiveness-shock-sahil-dhaneshra-2869913-2026-02-17",
      "headline": "Grave mistake, very, very sorry: Father of Delhi teen who drove SUV over bikerThe father of the teen driver, whose SUV ran over a 23-year-old biker in Delhi's Dwarka on February 3, apologised for the incident and said their family is in deep shock in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ravi-river-shahpur-kandi-dam-water-flow-indus-treaty-2869727-2026-02-17",
      "headline": "India to turn off Ravi water tap for Pakistan ahead of summerWater woes for Pakistan are unlikely to end soon. Ahead of a harsh summer, India is now set to block surplus water flow from the Ravi River to Pakistan with the completion of the Shahpur Kandi barrage. How will it impact Pakistan? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/himanta-biswa-sarma-reveals-2014-drama-assam-congress-sonia-gandhi-backing-cm-post-rahul-intervention-2869982-2026-02-18",
      "headline": "Sonia Gandhi backed me as CM, Rahul intervened: Himanta Sarma reveals 2014 dramaHimanta Biswa Sarma claimed that he had the backing of then Congress chief Sonia Gandhi as well 58 MLAs for the Assam CM post in 2014. However, Rahul Gandhi's intervention changed the situation, Sarma said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-congressman-randy-fine-under-fire-over-dogs-preferable-to-muslims-post-glbs-2869943-2026-02-17",
      "headline": "Dogs preferable to Muslims? US Congressman under fire for X postDespite the backlash, Florida Congressman Randy Fine doubled down, sharing images of dogs alongside a slogan linked to the historic Gadsden flag and accusing critics of hypocrisy in remarks about Islam and cultural norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tarique-rahman-takes-oath-as-bangladesh-pm-but-is-muhammad-yunus-real-winner-will-history-be-kind-explainer-2869334-2026-02-17",
      "headline": "Tarique Rahman becomes PM, but is Yunus the real winner in Bangladesh?As BNP's Tarique Rahman takes oath today, Muhammad Yunus has emerged as the biggest winner in Bangladesh. He pulled off most things he set out to do in the last 18 months and conducted an election by barring his bete noire, Sheikh Hasina's Awami League, from it. How did an 85-year-old Yunus manage to get things done his way?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indo-french-strategic-partnership-emmanuel-macron-india-innovation-and-defence-cooperation-mumbai-2869937-2026-02-17",
      "headline": "Jai Ho! Macron praises India-France strategic partnership at Mumbai innovation forumFrench President Emmanuel Macron and Prime Minister Narendra Modi highlighted deepening cooperation in technology, defence, and innovation at the India–France Innovation Forum in Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ai-startup-neosapien-founder-wearables-stolen-ai-summit-high-security-zone-delhi-police-files-case-2869887-2026-02-17",
      "headline": "Lost and found in 24 hours: AI startup devices stolen from AI summit recoveredA Bengaluru-based AI startup founder alleged that the company's wearable devices were stolen when exhibitors were asked to vacate their stalls ahead of the PM's visit. The stolen devices were recovered on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-abundant-life-church-explosion-boonville-fire-casualties-2869971-2026-02-17",
      "headline": "Firefighter in critical condition, 4 others injured in New York church explosionEmergency crews were called to Abundant Life Fellowship Church in Boonville after reports of a gas odour inside the building. Witnesses told investigators they had smelled gas before the blast. The explosion occurred while responders were already at the scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-father-sunil-malhotra-passes-away-delhi-family-mourns-loss-2869885-2026-02-17",
      "headline": "Sidharth Malhotra's father dies in Delhi after prolonged illness, actor shares postActor Sidharth Malhotra's father, Sunil Malhotra, died in Delhi on Saturday, February 14, following a prolonged illness. He was surrounded by family at the time of his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-military-strikes-3-drug-trafficking-boats-pacific-caribbean-11-killed-glbs-2869986-2026-02-18",
      "headline": "US strikes 3 suspected drug-trafficking boats in Pacific and Caribbean, 11 killedThe strikes took place Monday in the eastern Pacific Ocean and the Caribbean Sea. US Southern Command said all those killed were suspected traffickers and that no American personnel were injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/days-after-resigning-as-assam-congress-chief-bhupen-borah-to-join-bjp-on-february-22-says-himanta-sarma-2869866-2026-02-17",
      "headline": "Ex-Assam Congress chief Bhupen Borah to join BJP on Feb 22: Himanta SarmaAssam CM Himanta Biswa Sarma announced that former Assam Congress chief Bhupen Borah will join the BJP on February 22, along with several other Congress leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-today-group-unveils-sutra-an-ai-news-anchor-at-india-ai-impact-summit-2869747-2026-02-17",
      "headline": "India Today Group unveils Sutra, an AI news anchor, at India AI Impact SummitThe India Today Group has unveiled Sutra, an AI-assisted anchor, in partnership with BharatGen. The AI anchor has been deployed to provide contextual and relevant news from the India AI Impact Summit. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-envoy-sergio-gor-first-bengaluru-visit-tejasvi-surya-dosa-coffee-namma-auto-ride-2869829-2026-02-17",
      "headline": "US envoy's first Bengaluru visit with Tejasvi Surya features dosa, coffee and auto rideUS Ambassador Sergio Gor's first visit to Bengaluru included local experiences with BJP MP Tejasvi Surya and discussions on strengthening India-US ties in trade and technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-board-exam-2026-live-class-10-12-last-minute-tips-paper-analysis-student-reactions-2869329-2026-02-17",
      "headline": "CBSE Board Exam 2026 Live: Maths MCQs 'lengthy', check paper analysisThe CBSE Board Exams 2026 have officially commenced today for Class 10 and Class 12, with more than 43 lakh students appearing across examination centres nationwide. Exams are being held in a single shift from 10:30 am to 1:30 pm, so timely arrival at centres is crucial. Get complete exam day guidelines, last-minute preparation tips, dress code rules, and all essential updates to ensure a smooth and stress-free exam experience. Stay tuned for the latest news and live updates from the CBSE Board Exams 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/california-surf-legend-kurt-van-dyke-murdered-home-invasion-costa-rica-glbs-2869988-2026-02-18",
      "headline": "California surf legend Kurt Van Dyke murdered in brutal home invasion in Costa RicaKurt Van Dyke, 66, was discovered dead under his bed on Saturday with a sheet over his head and a knife nearby, authorities and local reports said. His body had multiple stab wounds and showed signs of asphyxiation ahead of an autopsy, according to Costa Rica's Judicial Investigation Department."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/indore/story/indore-mba-student-murder-accused-raped-corpse-drank-alcohol-searched-occult-practice-youtube-2869680-2026-02-17",
      "headline": "Indore man killed girlfriend, abused corpse, searched YouTube to speak to spiritThe man who murdered his girlfriend in Indore admitted to violating her corpse afterwards. He later searched on YouTube for ways to communicate with spirits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/iit-bombay-students-left-amused-as-dog-steals-the-spotlight-in-lecture-hall-2869872-2026-02-17",
      "headline": "IIT Bombay students left amused as dog steals the spotlight in lecture hallA video shot at IIT Bombay featuring a dog confidently standing on a classroom table has left the internet giggling hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tarique-rahman-oath-bnp-cabinet-hindu-minister-nitai-roy-chowdhury-who-is-he-2869682-2026-02-17",
      "headline": "Only Hindu minister in Tarique Rahman Cabinet. Who is Nitai Roy Chowdhury?Nitai Roy Chowdhury, a veteran BNP leader, is the only Hindu to be included in Prime Minister Tarique Rahman's Cabinet. A vocal critic of the Awami League, he had earlier blamed the Sheikh Hasina-led party for oppression of Hindus in Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-t20-world-cup-win-scotland-dipendra-airee-mumbai-2869974-2026-02-17",
      "headline": "Nepal end 4352-day long wait to finish T20 World Cup campaign on a highT20 World Cup, SCO vs NEP: Rohit Paudel's Nepal finished their campaign on a positive note after beating Nepal by seven wickets on Tuesday at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-french-president-emmanuel-macron-deals-defence-partnership-ai-collaboration-free-trade-2869731-2026-02-17",
      "headline": "Hammer missiles, choppers: India-France ties enter new phase with defence pushDescribing France as one of India's oldest strategic partners, Prime Minister Modi said the two nations have given their relationship unprecedented depth and energy, based on trust and a shared vision for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/nissan-gravite-launched-at-rs-665-lakh-takes-on-the-triber-2869880-2026-02-17",
      "headline": "Nissan Gravite launched at Rs 6.65 lakh, takes on the TriberNissan has launched the Gravite, a 7-seater compact MPV at Rs 6.65 lakh (ex-showroom) and it directly competes with the Renault Triber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-invites-bangladesh-tarique-rahman-to-strengthen-india-bangladesh-ties-glbs-2869878-2026-02-17",
      "headline": "Warm welcome awaits you: PM Modi's India invite to Bangladesh's Tarique RahmanIn a letter to Tarique Rahman following the Bangladesh Nationalist Party's (BNP) electoral win and inauguration of government, PM Modi expressed confidence in strengthening bilateral ties with the neighbouring country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-ai-take-away-jobs-fears-ai-summit-delhi-2026-technology-creation-opportunities-2869779-2026-02-17",
      "headline": "Will AI take away jobs? PM Modi addresses biggest concern among youthPrime Minister Narendra Modi has addressed the biggest fear among India's youth: whether AI will take away jobs. Here's what he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-iran-nuclear-talks-resume-geneva-amid-middle-east-tensions-heavy-military-buildup-oman-glbs-2869713-2026-02-17",
      "headline": "Iran signals progress in talks with US after live-fire drill, Khamenei's warningThe missiles launched from within Iran and along its coast struck targets in the Strait of Hormuz during drills. Authorities also announced temporary closure of parts of the waterway for safety during live-fire exercises. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-vs-namibia-preview-pitch-report-predicted-xi-2869990-2026-02-18",
      "headline": "Bruised Pakistan hope to avoid Namibian nightmare in must-win game T20 World Cup: Pakistan play their final group-stage game in the T20 World Cup against Namibia. A loss in this match will mean that Pakistan will get knocked out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/usman-tariq-press-conference-pakistan-vs-namibia-t20-world-cup-2869989-2026-02-18",
      "headline": "No panic in Pakistan camp: Usman Tariq on pressure before must-win Namibia clash T20 World Cup 2026, PAK vs NAM: Speaking to the reporters before Pakistan's must-win clash against Namibia, Usman Tariq opened up on the atmosphere inside the dressing room following the 61-run defeat to India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-tariq-babar-azam-shaheen-afridi-pakistan-press-conference-t20-world-cup-2869987-2026-02-18",
      "headline": "Babar Azam, Shaheen Afridi under pressure after India debacle? Usman Tariq opens up T20 World Cup, PAK vs NAM: Usman Tariq has backed Shaheen Shah Afridi and Babar Azam to bounce back following their disappointing performance against India, which saw Pakistan suffer a 61-run defeat at the R. Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-t20-world-cup-win-scotland-dipendra-airee-mumbai-2869974-2026-02-17",
      "headline": "Nepal end 4352-day long wait to finish T20 World Cup campaign on a high T20 World Cup, SCO vs NEP: Rohit Paudel's Nepal finished their campaign on a positive note after beating Nepal by seven wickets on Tuesday at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-india-australia-t20-world-cup-kaif-comments-2869954-2026-02-17",
      "headline": "India would have beaten Australia had Hardik Pandya played World Cup 2023 final: Kaif T20 World Cup: Mohammad Kaif said that Hardik Pandya would have made the difference for India against Australia had he played in the 2023 ODI World Cup. On Tuesday, the Aussies were eliminated at the group stage of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-jail-sourav-ganguly-gavaskar-kapil-letter-2869934-2026-02-17",
      "headline": "Hope Imran Khan gets the right treatment: Sourav Ganguly Former India captain Sourav Ganguly backed the letter signed by 14 former captains to the Pakistan government, seeking fair treatment for Imran Khan. Ganguly said that Imran put Pakistan on the world map and deserved to be treated well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajasthan-royals-indemnity-waiver-jaipur-stadium-safety-concerns-2869875-2026-02-17",
      "headline": "Royals seek waiver from state govt to host IPL in Jaipur after safety concerns Rajasthan Royals are racing to get their home ground ready for the Indian Premier League and have sought an indemnity waiver from the state government to host matches in Jaipur. The request follows concerns over the venue's readiness raised by an independent auditor and the Board of Control for Cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-ind-vs-ned-sitanshu-kotak-press-conference-2869879-2026-02-17",
      "headline": "No need to overanalyse Abhishek Sharma's duck against Pakistan: Sitanshu Kotak T20 World Cup, IND vs NED: India batting coach Sitanshu Kotak said that there was no need to overanalyse Abhishek Sharma's form in the tournament. Abhishek came back into the line-up after recovering from illness, but got out for a duck against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-semi-final-karnataka-vs-uttarakhand-devdutt-padikkal-2869863-2026-02-17",
      "headline": "Devdutt Padikkal charges towards India spot as Karnataka inch closer to Ranji final Devdutt Padikkal scored a career-best 232 to help Karnataka to a mammoth total in the Ranji Trophy semi-finals. Should Indian selectors consider him for the No.3 Test spot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-predicted-xi-arshdeep-singh-2869865-2026-02-17",
      "headline": "IND vs NED Predicted XI: Will Arshdeep Singh replace Kuldeep Yadav? T20 World Cup, IND vs NED: Suryakumar Yadav's India have qualified for the Super 8 and are favourites to finish at the top of their group. One potential change could be bringing Arshdeep Singh back in place of Kuldeep Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-plan-to-host-one-bbl-game-in-india-tnca-confirms-discussions-2869853-2026-02-17",
      "headline": "Cricket Australia plan to host one BBL game in India, TNCA confirms discussions Cricket Australia is exploring the possibility of staging a Big Bash League match in India next season as part of a broader strategy to tap into the country's vast and lucrative cricket market, according to a report by Sen Cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-press-conference-bumrah-abhishek-2869822-2026-02-17",
      "headline": "No rest for Bumrah: India want valuable Ahmedabad experience before Super 8T20 World Cup: India will not be resting Jasprit Bumrah and Abhishek Sharma in their match against the Netherlands, said batting coach Sitanshu Kotak. India are playing their last group-stage game in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-india-vs-netherlands-captain-scott-edwards-pre-match-press-conference-2869814-2026-02-17",
      "headline": "Netherlands urge more bilateral cricket for associates after strong T20 WC showNetherlands captain Scott Edwards said that a string of impressive performances from associate nations in the T20 World Cup should pave the way for more bilateral cricket against Test-playing countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-and-kashmir-near-maiden-final-auqib-nabi-2869777-2026-02-17",
      "headline": "Auqib Nabi outshines Bengal's Mohammed Shami as J&K close in on maiden finalAuqib Nabi claimed a nine-wicket match haul to outshine Mohammed Shami and push Jammu and Kashmir to the brink of a maiden Ranji Trophy final after Bengal were bowled out for 99 on day three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-super-8-icc-t20-world-cup-fans-2869775-2026-02-17",
      "headline": "Sikandar Raza revels in emotional celebration with fans after Zimbabwe's Super 8 berthT20 World Cup, IRE vs ZIM: Sikandar Raza and his Zimbabwean teammates celebrated with passionate fans after securing a Super 8 spot. Following the match, Raza thanked the supporters and pledged to keep Zimbabwe's flag flying high."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-scotland-vs-nepal-live-score-today-match-update-mumbai-2869742-2026-02-17",
      "headline": "Scotland vs Nepal Highlights T20 World Cup 2026 updates from MumbaiScotland (SCO) vs Nepal (NEP) Highlights, T20 World Cup: Nepal beat Scotland by 7 wickets after chasing down 171 with three balls to spare at the Wankhede Stadium in Mumbai. Dipendra Singh Airee made an unbeaten 50 off 23 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-australia-crash-out-zimbabwe-super-8-stage-washout-pallekele-2869716-2026-02-17",
      "headline": "Australia out, Zimbabwe reach Super 8 stage after Pallekele washoutT20 World Cup, IRE vs ZIM: Australia have been knocked out of the competition after the clash between Ireland and Zimbabwe in Pallekele on Tuesday was abandoned due to rain. The abandoned fixture sealed Zimbabwe's qualification for the Super 8 stage alongside Sri Lanka from Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-moved-out-of-india-in-future-2869698-2026-02-17",
      "headline": "IND-PAK conflict could force future World Cup out of India: ReportT20 World Cup: The geopolitical conflict between India and Pakistan might force future ICC tournaments outside the subcontinent, Australian media reported on February 16. As per the report, Australia could be the favoured destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lone-female-on-grid-f1-aspirant-atiqa-mir-climbs-higher-on-wsk-ladder-2869597-2026-02-17",
      "headline": "Lone female on grid,  F1 aspirant Atiqa Mir climbs higher on WSK ladderIndian racing prodigy Atiqa has shown skill and maturity beyond her years after making a voluntary switch from the Mini to the far more demanding Junior category, producing standout performances in the early part of her 2026 international karting season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-vs-zimbabwe-t20-world-cup-live-score-today-match-updates-pallekele-2869592-2026-02-17",
      "headline": "IRE vs ZIM highlights : Australia out, Zimbabwe reach Super 8 after washoutIreland (IRE) vs Zimbabwe (ZIM) Highlights, T20 World Cup: The Group clash between Ireland cricket team and Zimbabwe cricket team in Pallekele was washed out due to heavy rain. The shared point confirmed Zimbabwe's place in the Super 8 and knocked out Ireland and 2021 champions Australia national cricket team from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-canada-t20-world-cup-match-report-glenn-phillips-yuvraj-samra-chennai-2869589-2026-02-17",
      "headline": "New Zealand storm into Super 8s, knock Afghanistan out of T20 World CupT20 World Cup: New Zealand stormed into the Super 8s with an eight-wicket win over Canada in Chennai. Glen Phillips and Rachin Ravindra's chase ended Afghanistan's campaign despite Yuvraj Samra's record-breaking century."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-returns-india-odi-squad-ankle-injury-recovery-australia-series-2869570-2026-02-17",
      "headline": "Pratika Rawal added to ODI squad for Australia tour after long injury lay offStar batter Pratika Rawal has been added to India's ODI squad after recovering from an ankle injury. India are set to take on Australia in a three-match ODI series beginning on February 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-pakistan-government-humane-treatment-custody-kapil-sunil-14-captains-2869563-2026-02-17",
      "headline": "Treat Imran Khan fairly: Kapil, Gavaskar join 14 captains in appeal to Pak govtFormer India captains Kapil Dev and Sunil Gavaskar have joined a rare global cricketing appeal seeking better treatment for Imran Khan, the former Pakistan Prime Minister and 1992 World Cup-winning captain, who remains in jail amid growing health concerns.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hardik-singh-india-captain-fih-pro-league-hobart-leg-2869539-2026-02-17",
      "headline": "FIH Pro League: Hardik Singh to lead India in Hobart leg; Harmanpreet ruled outMidfielder Hardik Singh was named captain of the embattled Indian men's hockey team for its FIH Pro League matches in Hobart from February 20 to 25 after regular skipper Harmanpreet Singh opted out due to \"personal reasons.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-yuvraj-samra-youngest-men-t20-world-cup-centurion-2869524-2026-02-17",
      "headline": "Canada's Yuvraj Samra becomes youngest centurion in T20 World Cup historyCanada opener Yuvraj Samra became the youngest centurion in men's T20 World Cup history during Canada's clash against New Zealand at the M. A. Chidambaram Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-8-wickets-bengal-vs-jammu-and-kashmir-ranji-trophy-semi-final-2869515-2026-02-17",
      "headline": "Shami scalps 8 wickets in Ranji semis, puts India selectors on high alertMohammed Shami put India selectors on alert with an eight-wicket haul for Bengal in the Ranji Trophy semi-final against Jammu & Kashmir. The veteran pacer now has 38 wickets this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ian-healy-slams-australias-selection-calls-after-defeat-vs-sri-lanka-2869455-2026-02-17",
      "headline": "Ian Healy slams Australia's selection calls after defeat vs Sri LankaAUS vs SL, T20 World Cup: Former Australia wicketkeeper Ian Healy has strongly criticised the team's selection after a heavy defeat to Sri Lanka. Australia now face an uphill battle to qualify for the Super 8 with their final group match against Oman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-rajasthan-royals-ceo-new-role-mentor-india-head-coach-2869438-2026-02-17",
      "headline": "Gambhir to join Rajasthan Royals? IPL franchise approach India coachRajasthan Royals have approached India head coach Gautam Gambhir for a senior role in their setup amid an ownership change. However, Gambhir is unlikely to accept due to conflict-of-interest rules and national commitments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-abhishek-sharma-t20-world-cup-sunil-gavaskar-advice-take-single-2869421-2026-02-17",
      "headline": "Abhishek Sharma, just take a single first: Gavaskar's advice to India openerT20 World Cup: Sunil Gavaskar offered simple advice to Abhishek Sharma amid his tough start to the T20 World Cup. The former captain urged him to get off the mark first before unleashing his attacking game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-players-wait-to-shake-hands-with-india-after-t20-world-cup-defeat-ind-vs-pak-2869397-2026-02-17",
      "headline": "Did Pakistan players wait to shake hands with India after Colombo defeat?India defeated Pakistan by 61 runs in the ICC Men's T20 World Cup 2026 fixture. The Men in Blue maintained their no handshake policy against the arch-rivals."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}