{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-621-in-october-2632249-2024-11-12",
      "headline": "Retail inflation at a 14-month high, rises to 6.21% in OctoberThe inflation rate currently stands at 6.68% in rural areas, surpassing the urban inflation rate, which is recorded at 5.62%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-900-points-nifty-below-24000-key-factors-behind-stock-market-bloodbath-2632213-2024-11-12",
      "headline": "Sensex tanks 820 points, Nifty tumbles: 4 factors behind stock market bloodbathAfter opening in green, the S&P BSE Sensex reversed course, dragged down by banking, financial services, and auto stocks. The Nifty50, too, faced a broad-based decline, with nearly all sectoral indices closing in the red except for Nifty Realty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-ipo-10-things-to-know-subscription-status-gmp-price-band-key-details-good-bad-review-2632212-2024-11-12",
      "headline": "Zinka Logistics Solutions IPO: 10 things to know before subscribingZinka Logistics Solution Limited, established in April 2015, operates a digital platform called the BlackBuck app tailored for truck operators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-update-sensex-down-over-600-points-nifty-falls-200-afternoon-session-auto-bank-stocks-decline-2632167-2024-11-12",
      "headline": "Sensex, Nifty fall for fourth consecutive day; key reasons behind the slumpThe S&P BSE Sensex lost 659.08 points to 78,837.07, while the NSE Nifty50 was down 205.35 points to 23,935.95"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-will-it-reach-usd-100000-donald-trump-us-election-2632108-2024-11-12",
      "headline": "Bitcoin's comeback: Will it cross the $100,000 mark soon?Donald Trump's win has injected fresh optimism among crypto advocates, as he has previously championed a supportive regulatory framework for digital assets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tv-todays-cfo-yatender-kumar-tyagi-wins-silver-award-from-safa-for-best-presented-annual-report-in-financial-reporting-2632100-2024-11-12",
      "headline": "TV Today's CFO wins Silver Award from SAFA for Best Presented Annual Report in Financial reportingPresented by the South Asian Federation of Accountants (SAFA), this award recognises TV Today's excellence in financial transparency within the Service Sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-listing-date-latest-gmp-indicate-ahead-of-market-debut-share-price-2632095-2024-11-12",
      "headline": "Swiggy IPO listing: What does latest GMP indicate ahead of market debut? Bengaluru-based Swiggy opened for subscription with a price band of Rs 371 to Rs 390, aiming to raise Rs 11,327 crore through the Initial Public Offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2632068-2024-11-12",
      "headline": "Niva Bupa Health Insurance IPO allotment: Step-by-step guide to check statusNiva Bupa Health Insurance IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-nears-90000-dollars-strong-rally-will-it-continue-donald-trump-stance-2632047-2024-11-12",
      "headline": "Bitcoin price nears $90,000. What's behind the rally and will it continue? The recent rally in Bitcoin, now nearing $90,000, comes on the back of Donald Trump's pro-crypto stance following his recent election victory in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindalco-shares-gain-over-2-percent-after-beating-estimates-in-q2-report-should-you-buy-sell-or-hold-2632019-2024-11-12",
      "headline": "Hindalco shares gain 2% after beating estimates in Q2 report: Should you buy? Hindalco shares: Hindalco reported a 123% year-on-year (YoY) rise in standalone net profit, amounting to Rs 1,891 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-inflation-data-hindalco-share-price-today-2632016-2024-11-12",
      "headline": "Sensex, Nifty rise ahead of inflation data; Hindalco gains after Q2 resultsThe S&P BSE Sensex was up 148.85 points to 79,645 at 10:26 am, while the NSE Nifty was up 46.75 points to 24,188.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-maret-listing-decent-debut-premium-over-ipo-price-2632007-2024-11-12",
      "headline": "Sagility India shares list at 3.5% premium over IPO priceSagility India share market listing: The stock listed with a modest premium, drawing mixed views on valuation but strong demand from investors across segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-12-2024-precious-metals-record-hike-on-mcx-2631995-2024-11-12",
      "headline": "Gold, silver price today, November 12, 2024: Precious metals record hike on MCXGold Price Today November 12, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-donald-trump-us-elections-win-dollars-market-2631958-2024-11-12",
      "headline": "Bitcoin crosses $89,000 as Trump vows to make US 'crypto capital of the planet'Leading cryptocurrency bitcoin pushed to a new all-time high of $89,637 (approx Rs 75 lakh) on Tuesday. Trump has vowed to make the United States \"the crypto capital of the planet\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-day-3-check-latest-subscription-gmp-2631713-2024-11-11",
      "headline": "Niva Bupa Health Insurance IPO Day 3: Check latest subscription, GMPNiva Bupa Health Insurance IPO: The public issue has seen moderate interest and allotment for the Niva Bupa Health Insurance IPO is likely to be finalised on Tuesday, November 12, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-lic-shares-after-q2-results-expert-view-what-brokerages-say-2631680-2024-11-11",
      "headline": "Should you buy LIC shares after Q2 results? Here's what brokerages suggestLIC reported a 4% year-on-year (YoY) decline in standalone net profit, amounting to Rs 7,621 crore for the quarter ending September 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-flat-amid-volatile-trading-asian-paints-down-8-percent-2631639-2024-11-11",
      "headline": "Sensex, Nifty close flat amid volatile trading; Asian Paints down 8%The S&P BSE Sensex added 9.83 points to close at 79,496.15, while the NSE Nifty50 was down 6.90 points to end at 24,141.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-amazon-executives-summon-plan-government-for-foreign-investment-violations-report-2631614-2024-11-11",
      "headline": "Flipkart, Amazon under scrutiny for foreign investment violations: ReportWalmart-owned Flipkart and Amazon, both of which are experiencing rapid growth in India's Rs 70 billion e-commerce market, face rising regulatory scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-holdings-shares-hit-all-time-high-rise-70-percent-in-just-4-sessions-2631568-2024-11-11",
      "headline": "JSW Holdings shares hit all-time high, surging 70% in just 4 sessionsJSW Holdings Ltd shares: The rally has positioned the stock as one of the year's top performers, delivering multibagger returns with a 228.18% rise on a year-to-date (YTD) basis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-last-flights-today-bids-farewell-before-air-india-merger-loyalty-program-tickets-2631480-2024-11-11",
      "headline": "Goodbye, Vistara: Airline set for final flight today as it merges with Air IndiaThe Vistara airline began its operations on January 9, 2015, with an inaugural flight from Delhi to Mumbai."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uddhav-thackeray-bags-checking-helicopter-election-commission-maharashtra-elections-2632215-2024-11-12",
      "headline": "SOPs followed, says poll body on row over Uddhav Thackeray bag check: SourcesUddhav Thackeray had earlier shared a video showing election officials checking his helicopter after he arrived in Yavatmal to campaign for the Assembly polls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-minister-zameer-ahmed-khan-sorry-hdk-kaliya-admits-said-it-before-2632178-2024-11-12",
      "headline": "Karnataka minister apologises for 'racist' slur against HD KumaraswamyKarnataka cabinet minister Zameer Ahmed Khan apologised for his comments against HD Kumaraswamy's skin colour. Khan's comments were condemned by several leaders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zhuhai-china-hit-and-run-sports-car-accident-dead-injured-2632278-2024-11-12",
      "headline": "35 killed in China after car drives into group of people outside sports centre35 killed, 43 injured after car drives into group of people outside sports centre in Zhuhai, China"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/toxic-levels-of-lead-found-in-turmeric-haldi-sold-in-india-nepal-pakistan-study-2632218-2024-11-12",
      "headline": "Haldi in your food contains high levels of lead, new study revealsA recent study reveals alarming levels of lead in turmeric sold in India, Nepal, and Pakistan, with some samples far exceeding the safe limit set by India's FSSAI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/delhi-winter-delay-why-its-so-warm-in-november-2632275-2024-11-12",
      "headline": "Delhi winter delay: Why it's so warm in NovemberThe IMD's recent two-week forecast has dimmed hopes for a quick drop in temperatures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-621-in-october-2632249-2024-11-12",
      "headline": "Retail inflation at a 14-month high, rises to 6.21% in OctoberThe inflation rate currently stands at 6.68% in rural areas, surpassing the urban inflation rate, which is recorded at 5.62%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kai-trump-election-night-vlog-donald-trump-elon-musk-family-photo-2632164-2024-11-12",
      "headline": "Video: Trump's granddaughter shares behind-the-scenes look at Election NightKai Trump's vlog reveals how a now-viral family photo featuring Elon Musk came to be taken on election night – it was Trump who insisted on including the billionaire in the shot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-attacks-maha-vikas-aghadi-congress-development-railway-dalits-tribals-reservation-2632174-2024-11-12",
      "headline": "PhD in putting brakes on development: PM's big attack on Congress and alliesAddressing an election rally in Chimur, PM Modi launched a blistering attack on the Maha Vikas Aghadi alliance, calling it detrimental to Maharashtra's growth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/toxic-smog-blanketing-india-pakistan-is-visible-from-space-nasa-shares-image-2632119-2024-11-12",
      "headline": "Toxic smog blanketing India, Pakistan is visible from spaceNasa recently released satellite images revealing the extent of the pollution, which spans the densely populated Indo-Gangetic Plain across both countries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/african-elephants-largest-land-animals-disappearing-population-down-by-70-2632202-2024-11-12",
      "headline": "Population of African elephant, largest land animal, down by 70%The savanna elephant populations fell by about 70% on average at the surveyed sites and the forest elephant populations dropped by about 90% on average at the surveyed sites, with poaching and habitat loss as the main drivers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-blind-t20-world-cup-pakistan-blind-cricket-council-cricket-association-for-the-blind-in-india-2632171-2024-11-12",
      "headline": "Blind World Cup to go ahead without India if they don't come: Pakistan boardThe Pakistan Blind Cricket Council (PBCC) has responded to India Today's report of the Indian Blind Cricket Team awaiting NOC from the government to travel to Pakistan for Blind T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-explains-how-rapido-rides-fitness-hack-bengaluru-patchy-roads-potholes-hilarious-post-2632217-2024-11-12",
      "headline": "Man explains how Rapido rides are a 'fitness hack' on Bengaluru's 'patchy roads'Saurabh Aggarwal shared on LinkedIn that a gym membership isn't necessary in Bengaluru, where daily commutes offer a \"full core and quad workout\" due to the \"patchy\" roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-donald-trump-mar-a-lago-florida-estate-us-presidential-transition-2632116-2024-11-12",
      "headline": "'Not going till Trump throws him out': Elon Musk's Mar-a-Lago influence in focusMar-a-Lago has become the epicentre of Trump's presidential transition, with Elon Musk dining with the 78-year-old on the patio and enjoying golf since Donald Trump's election win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/delhi-government-releases-2025-26-nursery-admission-schedule-for-private-schools-2632216-2024-11-12",
      "headline": "Delhi school nursery admission 2025-26 to begin from November 25. Key datesThe Delhi Government's Directorate of Education has announced the admission schedule for entry-level classes in private schools for the 2025-26 academic year. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uddhav-thackeray-bags-inspected-election-officials-war-of-words-mahayuti-2632172-2024-11-12",
      "headline": "'Do Mahayuti leaders carry only underwear?' Spat over Uddhav Thackeray bag rowUddhav Thackeray, on Monday, posted a 150-second video of election officials frisking his bags at Wani helipad. The BJP alleged that Thackeray was afraid of his 'stolen money' getting caught."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/six-x-factors-that-will-decide-the-fate-of-maharashtra-in-the-assembly-polls-opinion-2632082-2024-11-12",
      "headline": "6 X-factors that will decide fate of Maharashtra in assembly pollsAlliances often disturb social coalitions — both the MVA and the Mahayuti have unnatural partners in the Shiv Sena (Uddhav Balasaheb Thackeray) and the NCP (Ajit Pawar) respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-early-unsupervised-social-media-exposure-harms-children-2631543-2024-11-11",
      "headline": "How early, unsupervised social media exposure harms childrenSocial media is highly addictive and despite the risk of digital abuse, children find it next to impossible to quit it\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-border-czar-tom-homan-old-video-immigration-democrats-2632200-2024-11-12",
      "headline": "You work for me, I'm a taxpayer: Trump's border czar's old reply to Democrats viralThe video shows Tom Homan squaring off with Congresswoman Pramila Jayapal during an immigration and citizenship hearing. Homan will be in charge of America's borders in the Donald Trump 2.0 administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/american-m4-rifles-terrorists-jammu-kashmir-afghanistan-pakistan-2632104-2024-11-12",
      "headline": "How American M4 rifles, left behind in Afghanistan, are becoming a threat in J&KExperts said the continued use of this assault rifle by terrorists in Jammu and Kashmir was a matter of concern, and it could be a possible result of the withdrawal of US forces from Afghanistan in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/shalini-passi-says-mother-punished-her-with-chilli-powder-for-saying-bad-things-2632140-2024-11-12",
      "headline": "Shalini Passi says mother punished her with chilli powder for saying 'bad things'Fabulous Lives vs Bollywood Wives-fame Shalini Passi talked about her childhood in an interview recently. She talked about not using any foul language because her mother had always taught her against it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-okhla-waste-to-energy-plant-toxic-emissions-ash-health-complications-2632067-2024-11-12",
      "headline": "Delhi's 'eco-friendly' waste-to-energy plant poisoning millions: ReportA five-year investigation by The New York Times has revealed that a waste-to-energy plant in Delhi's Okhla is exposing millions of people to highly toxic emissions and putting them at risk of serious health issues. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/thai-woman-discovers-surgical-needle-left-in-vagina-childbirth-18-years-pain-2632156-2024-11-12",
      "headline": "Thai woman discovers surgical needle left in vagina after enduring 18 years of painNow 36, the woman from Narathiwat province recalled the moment that occurred 18 years ago when a nurse accidentally dropped the needle into her vagina while stitching her up after delivery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/nana-patole-bjp-dog-remark-controversy-akola-kirit-somaiya-2632029-2024-11-12",
      "headline": "Maharashtra Congress chief compares BJP to 'dog': Time to show its placeThe Maharashtra Congress chief attacked the BJP for bringing down the Maha Vikas Aghadi government and singled out Devendra Fadnavis, saying that the former Chief Minister considers himself 'God'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/korean-actor-song-jae-rim-dies-at-39-2632266-2024-11-12",
      "headline": "Korean actor Song Jae-rim dies at 39South Korean star Song Jae-rim has died. He was only 39. The reason of the death is unknown as of now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/video/ricky-kej-on-4th-grammy-nomination-global-audience-appreciates-indian-music-2632261-2024-11-12",
      "headline": "Ricky Kej on 4th Grammy nomination: Global audience appreciates Indian music In an exclusive interview with India Today, Indian-American composer Ricky Kej expressed his emotions on being nominated for the prestigious Grammys. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-wedding-venue-annapurna-studios-in-hyderabad-know-its-significance-2632245-2024-11-12",
      "headline": "Naga Chaitanya-Sobhita's emotional call to get married at Annapurna Studios Naga Chaitanya and Sobhita Dhulipala have reportedly decided to get married in Hyderabad at the Annapurna Studios, and there's an emotional reason behind choosing this as their wedding venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nikkhil-advani-reveals-kal-ho-naa-ho-cost-rs-32-crore-brought-billions-in-revenue-2632179-2024-11-12",
      "headline": "Nikkhil Advani reveals Kal Ho Naa Ho cost Rs 32 crore, brought billions in revenueNikkhil Advani shared insights on the financial and cultural legacy of his film Kal Ho Naa Ho. He also talked about the earnings of the films and how much it would be in today's date."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-south-africa-neil-mckenzie-test-series-2632280-2024-11-12",
      "headline": "Sri Lanka appoint Neil McKenzie as consultant before South Africa TestsFormer South African batter Neil McKenzie has joined Sri Lanka as a consultant ahead of the two-match Test series against the Proteas, starting November 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-2632236-2024-11-12",
      "headline": "Virat and Rohit will dazzle with their bats in Australia: Chetan SharmaFormer India cricketer and chief selector Chetan Sharma has backed Virat Kohli and Rohit Sharma to find form in upcoming Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/leh-paralympics-2028-high-performance-centre-2632222-2024-11-12",
      "headline": "High performance training for para-athletes set to open in LehThe world's first high-altitude Para Sports Centre is set to be established in Leh. The institute will focus on training para-athletes for international competitions, including the 2028 Paralympics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-blind-t20-world-cup-pakistan-blind-cricket-council-cricket-association-for-the-blind-in-india-2632171-2024-11-12",
      "headline": "Blind World Cup to go ahead without India if they don't come: Pakistan boardThe Pakistan Blind Cricket Council (PBCC) has responded to India Today's report of the Indian Blind Cricket Team awaiting NOC from the government to travel to Pakistan for Blind T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ironman-valterri-bottas-completes-triathlon-days-after-being-sacked-by-sauber-2632162-2024-11-12",
      "headline": "F1: 'Ironman' Bottas completes triathlon days after being sacked by SauberSauber driver Valtteri Bottas completed an Ironman triathlon at his backyard. Bottas, who is set to leave Sauber at the end of the F1 season is showing no signs of dipping his physical  fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-masters-2024-treesa-gayatri-pair-exits-in-opening-round-2632157-2024-11-12",
      "headline": "Treesa-Gayatri make first round exit from Kumamoto MastersIndia's Treesa Jolly and Gayatri Gopichand lost to the Chinese Taipei pair of Hsu Yin-Hui and Lin Jhih Yun in the opening round of the Kumamoto Masters Japan Super 500 tournament on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2632128-2024-11-12",
      "headline": "'Auctioneer' R Ashwin sells himself among other stars ahead of IPL 2025 auctionStar India all rounder Ravichandran Ashwin conducted a mock auction ahead of the IPL 2025 where he sold himself among other stars ahead of the bidding event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-set-for-ranji-trophy-comeback-sparks-border-gavaskar-trophy-hopes-2632105-2024-11-12",
      "headline": "Mohammed Shami set to make Ranji Trophy comeback, sparks BGT hopesIndia pacer Mohammed Shami is set to make his comeback in the Ranji Trophy. Shami last played for India in the ODI World Cup Final in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-amelia-kerr-noman-ali-win-icc-player-of-the-month-awards-for-october-2632103-2024-11-12",
      "headline": "Amelia Kerr, Noman Ali win ICC Player of the Month awards for OctoberThe International Cricket Council (ICC) has honoured New Zealand's Amelia Kerr and Pakistan's Noman Ali as the ICC Players of the Month for October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-rahul-dravid-vvs-laxman-adelaide-test-2003-aus-vs-ind-2003-2632099-2024-11-12",
      "headline": "Recapping BGT heroics: When Dravid and Laxman did Kolkata 2001 encore in AdelaideStar India batters Rahul Dravid and VVS Laxman forged a magnificent 303-run partnership for the fifth wicket in the second Test vs Australia in Adelaide, 2003. The partnership helped India win the match by four wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-awaits-pakistans-call-on-hybrid-champions-trophy-as-india-declines-to-travel-2632078-2024-11-12",
      "headline": "ICC awaits Pakistan's call on hybrid Champions Trophy as India declines to travelThe International Cricket Council has asked the Pakistan Cricket Board for its stance on hosting the Champions Trophy under a hybrid model after India declined to travel to Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2632128-2024-11-12",
      "headline": "'Auctioneer' R Ashwin sells himself among other stars ahead of IPL 2025 auctionStar India all rounder Ravichandran Ashwin conducted a mock auction ahead of the IPL 2025 where he sold himself among other stars ahead of the bidding event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-set-for-ranji-trophy-comeback-sparks-border-gavaskar-trophy-hopes-2632105-2024-11-12",
      "headline": "Mohammed Shami set to make Ranji Trophy comeback, sparks BGT hopesIndia pacer Mohammed Shami is set to make his comeback in the Ranji Trophy. Shami last played for India in the ODI World Cup Final in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-amelia-kerr-noman-ali-win-icc-player-of-the-month-awards-for-october-2632103-2024-11-12",
      "headline": "Amelia Kerr, Noman Ali win ICC Player of the Month awards for OctoberThe International Cricket Council (ICC) has honoured New Zealand's Amelia Kerr and Pakistan's Noman Ali as the ICC Players of the Month for October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-rahul-dravid-vvs-laxman-adelaide-test-2003-aus-vs-ind-2003-2632099-2024-11-12",
      "headline": "Recapping BGT heroics: When Dravid and Laxman did Kolkata 2001 encore in AdelaideStar India batters Rahul Dravid and VVS Laxman forged a magnificent 303-run partnership for the fifth wicket in the second Test vs Australia in Adelaide, 2003. The partnership helped India win the match by four wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-awaits-pakistans-call-on-hybrid-champions-trophy-as-india-declines-to-travel-2632078-2024-11-12",
      "headline": "ICC awaits Pakistan's call on hybrid Champions Trophy as India declines to travelThe International Cricket Council has asked the Pakistan Cricket Board for its stance on hosting the Champions Trophy under a hybrid model after India declined to travel to Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-perth-pitch-good-pace-bounce-curator-india-first-test-2632059-2024-11-12",
      "headline": "Perth pitch to have good pace, bounce: Curator warns India ahead of first TestBorder-Gavaskar Trophy: India is set for a challenging start to their Australia tour, as the Optus Stadium curator revealed that the pitch for the opening Test has been prepared to deliver \"good bounce and pace,\" in line with Perth's reputation for fiery, fast surfaces.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-pakistan-fan-icc-champions-trophy-2025-bcci-pcb-2632053-2024-11-12",
      "headline": "Pakistan kyu nahi aa rahe aap? Fans question India's Suryakumar Yadav in SAA Pakistan fan was seen asking Suryakumar Yadav that why don't India come to Pakistan to play cricket. The schedule for the ICC Champions Trophy is yet to be released due to India's reluctance to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-bayern-munich-extend-ceo-jan-christian-dreesens-contract-2027-2632034-2024-11-12",
      "headline": "Bayern Munich extend CEO Jan-Christian Dreesen's contract till 2027 Bayern Munich has extended Jan-Christian Dreesen's contract as chief executive by two years through June 2027. Bayern said 57-year-old Dreesen's contract extension was unanimously agreed by the supervisory board.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alexander-zverev-atp-finals-andrey-rublev-carlos-alcaraz-casper-ruud-2632032-2024-11-12",
      "headline": "Alexander Zverev begins ATP final campaign with straight sets win over Andrey RublevAlexander Zverev began his ATP Finals campaign with straight sets win over Andrey Rublev at the Inalpi Arena. Zverev beat Rublev 6-4, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-tim-paine-on-dhruv-jurel-bgt-2632014-2024-11-12",
      "headline": "Tim Paine backs India's Dhruv Jurel to impress in Australia Test seriesTim Paine praised Dhruv Jurel's impressive batting on the challenging, bouncy wicket at the MCG during the second unofficial Test between Australia A and India A, where the 23-year-old scored 80 and 68, handling the pace and bounce with ease.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricketer-ben-manenti-recreates-yusuf-dikecs-iconic-olympic-pose-during-one-day-cup-match-2631991-2024-11-12",
      "headline": "Australian cricketer recreates Yusuf Dikec's iconic Olympic pose after run outAustralian cricketer Ben Manenti recreated Turkish shooter Yusuf Dikec's iconic pose from the Paris Olympics 2024 during a match between New South Wales and South Australia in the One Day Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-virat-front-page-australian-media-hindi-punjabi-font-2631980-2024-11-12",
      "headline": "Virat Kohli on front page as Aussie newspaper printed in Hindi, PunjabiBorder-Gavaskar Trophy: The \"Virat Kohli fever\" has swept through the Australian media, with the India batter featuring prominently on the front pages of various Australian newspapers. The Aussie newspapers feature Virat and Yashasvi Jaiswal with Hindi and Punjabi headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-uncertainty-pakistan-board-india-stand-off-hosting-rights-2631973-2024-11-12",
      "headline": "Champions Trophy in limbo amid Pakistan board, India stand-off over hostingThe 2025 ICC Champions Trophy faces an uncertain future as a standoff between the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI) over hosting arrangements threatens to derail the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-tim-paine-on-dhruv-jurel-bgt-2632014-2024-11-12",
      "headline": "Tim Paine backs India's Dhruv Jurel to impress in Australia Test seriesTim Paine praised Dhruv Jurel's impressive batting on the challenging, bouncy wicket at the MCG during the second unofficial Test between Australia A and India A, where the 23-year-old scored 80 and 68, handling the pace and bounce with ease.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricketer-ben-manenti-recreates-yusuf-dikecs-iconic-olympic-pose-during-one-day-cup-match-2631991-2024-11-12",
      "headline": "Australian cricketer recreates Yusuf Dikec's iconic Olympic pose after run outAustralian cricketer Ben Manenti recreated Turkish shooter Yusuf Dikec's iconic pose from the Paris Olympics 2024 during a match between New South Wales and South Australia in the One Day Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-virat-front-page-australian-media-hindi-punjabi-font-2631980-2024-11-12",
      "headline": "Virat Kohli on front page as Aussie newspaper printed in Hindi, PunjabiBorder-Gavaskar Trophy: The \"Virat Kohli fever\" has swept through the Australian media, with the India batter featuring prominently on the front pages of various Australian newspapers. The Aussie newspapers feature Virat and Yashasvi Jaiswal with Hindi and Punjabi headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-uncertainty-pakistan-board-india-stand-off-hosting-rights-2631973-2024-11-12",
      "headline": "Champions Trophy in limbo amid Pakistan board, India stand-off over hostingThe 2025 ICC Champions Trophy faces an uncertain future as a standoff between the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI) over hosting arrangements threatens to derail the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-nathan-mcsweeney-on-jasprit-bumrah-challenge-2631966-2024-11-12",
      "headline": "How Australia's debutant McSweeney is planning for 'unique' Bumrah challengeBorder-Gavaskar Trophy: Australia's uncapped opener Nathan McSweeney has admitted that facing Jasprit Bumrah will be \"quite the challenge\" as he prepares for his Test debut against India in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awaits-pakistan-board-decision-champions-trophy-india-decline-to-travel-2631954-2024-11-12",
      "headline": "ICC awaits Pakistan's decision on Champions Trophy after India decline to travelThe ICC has asked the PCB for a response about hosting the Champions Trophy in a hybrid model after India refused to travel to Pakistan. The PCB confirmed on Sunday that it received an email from the ICC about India's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-referee-david-coote-suspended-anti-liverpool-klopp-video-2631950-2024-11-12",
      "headline": "Premier League referee Coote suspended over alleged anti-Liverpool, Klopp videoThe English referees' body, PGMOL, suspended Premier League referee David Coote after a video allegedly showing him making derogatory remarks about Liverpool and former manager Jürgen Klopp surfaced online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-2024-rohan-bopanna-matthew-ebden-2631922-2024-11-12",
      "headline": "Rohan Bopanna, Matthew Ebden off to losing start in ATP Finals 2024ATP Finals 2024: Simone Boleli and Andrea Vavassori took 56 minutes to beat Rohan Bopanna, Matthew Ebden in the group stage match on Monday, November 11. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}