{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-to-list-tomorrow-check-allotment-status-latest-gmp-2719668-2025-05-05",
      "headline": "Ather Energy IPO to list tomorrow. Check allotment status, latest GMPAther Energy's IPO, which ran from April 28 to April 30, involved a mix of fresh equity worth Rs 2,626 crore and an offer for sale (OFS) of 1.1 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-2719650-2025-05-05",
      "headline": "Adani Ports shares jump 7% after Q4 results. Check target price, other detailsAdani Ports stock climbed to Rs 1,355 from its previous close of Rs 1,267.05, up 6.90% on the Bombay Stock Exchange (BSE). The upmove came after the company reported robust March quarter earnings and posted healthy operational growth in April, prompting several brokerages to raise their target prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-500-points-3-reasons-why-stock-market-is-rising-2719633-2025-05-05",
      "headline": "Sensex rises over 500 points. 3 reasons why stock market is risingForeign investor inflows, strong macro data, and improving global cues have fired up the bulls. While geopolitical risks linger, analysts say the rally could hold as long as key support levels stay intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-tumbles-over-5-after-q4-miss-buy-hold-or-sell-2719611-2025-05-05",
      "headline": "Kotak Mahindra Bank tumbles over 5% after Q4 miss. Buy, hold or sell?Kotak Mahindra Bank shares fell over 5% in early trade on Monday as investors reacted negatively to the lender's Q4 financial results. Despite some positives in asset quality, softer loan growth and pressure on core income metrics weighed on investor sentiment, especially after the recent rally in the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-share-price-dips-nearly-2-after-q4-profit-miss-buy-hold-or-sell-2719605-2025-05-05",
      "headline": "SBI share price dips nearly 2% after Q4 profit miss. Buy, hold or sell?SBI's share price was down 1.54% to Rs 787.75 on the Bombay Stock Exchange (BSE) at 10:04 am. Earlier in the trading session, the stock declined to Rs 783 on the BSE, marking its sixth consecutive session in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-350-points-nifty-above-24400-adani-ports-gains-2-2719590-2025-05-05",
      "headline": "Sensex jumps over 350 points, Nifty above 24,400; Adani Ports gains nearly 3%The BSE Sensex rose 341 points to 80,843, while the Nifty50 advanced 84 points to 24,421 around 9:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-opening-today-what-to-expect-from-sensex-nifty-key-details-2719575-2025-05-05",
      "headline": "Stock market opening: Sensex, Nifty likely to gain amid easing trade tensionsStock market opening today: Markets look set to kick off the week on a bullish note, as easing global tensions, robust foreign inflows, and Wall Street gains provide the perfect cocktail for investor optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-adani-ports-sbi-kotak-bank-tata-motors-and-more-2719565-2025-05-05",
      "headline": "Stocks to watch today: Adani Ports, SBI, Kotak Bank, Tata Motors and moreMarkets may open strong as global cues turn favourable and earnings momentum continues. Key stocks across banking, auto, infra, and FMCG could dominate investor attention this Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-representatives-lobby-trump-officials-drop-265-million-bribery-fraud-case-2719554-2025-05-05",
      "headline": "Adani aides lobby Trump officials to drop $265 million bribery case: ReportAdani's representatives are trying to make the case that his prosecution does not align with Trump's priorities and should be reconsidered, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-warren-buffett-warned-that-us-dollar-could-be-going-to-hell-2719265-2025-05-04",
      "headline": "Explained: Why Warren Buffett warned that US Dollar could be 'going to hell'The remarks reflected deeper concerns Buffett has long harboured: America's swelling deficit, a growing culture of bureaucratic inefficiency, and the rising use of trade policy as a political weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-greg-abel-warren-buffetts-heir-to-berkshires-118-trillion-empire-2719264-2025-05-04",
      "headline": "Who is Greg Abel, Warren Buffett's heir to Berkshire's $1.18 trillion empire?Greg Abel, who has served as vice chairman overseeing Berkshire's sprawling non-insurance operations, has been a trusted Warren Buffett lieutenant for over a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-sounds-alarm-on-dollar-as-he-retires-wouldnt-hold-currency-going-to-hell-2719247-2025-05-04",
      "headline": "Warren Buffett bows out with stark dollar warning: Currency going to hellWarren Buffett, who officially handed over the CEO reins to Vice Chairman Greg Abel at the meeting, indicated that a significant investment in a European country could prompt Berkshire to conduct more financing in foreign currencies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-slams-bollywood-calls-them-chor-for-copying-south-content-2719664-2025-05-05",
      "headline": "Nawazuddin Siddiqui slams Bollywood, calls them 'chor' for copying south contentNawazuddin Siddiqui slammed Bollywood for lacking originality, accusing the industry of copying stories and songs, especially from South films. While promoting 'Costao', he called the current trend of sequels and remakes a sign of 'creative bankruptcy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-composer-mickey-j-meyer-reacts-to-criticism-for-his-music-defends-score-2719643-2025-05-05",
      "headline": "HIT 3 composer Mickey J Meyer reacts to criticism for his music, defends scoreMusic composer Mickey J Meyer, who composed music for the recent Telugu film HIT 3 starring Nani and Srinidhi Shetty, has responded to criticism over his music with a post on his X account. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ajaz-khan-house-arrest-promised-role-in-ott-show-rape-case-filed-proposed-inside-house-police-maharashtra-mumbai-actor-2719653-2025-05-05",
      "headline": "Actor Ajaz Khan accused of rape, FIR registered: CopsA fellow actor has alleged that actor Ajaz Khan raped her on the pretext of marriage and a role in his show 'House Arrest'. Mumbai police filed an FIR against the 'Bigg Boss'-fame actor, while the investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-joins-kiara-advani-new-york-met-gala-debut-2719646-2025-05-05",
      "headline": "Sidharth Malhotra joins Kiara in New York as she gears up for Met Gala debutSidharth Malhotra is currently in New York along with his actor-wife Kiara Advani. She will be making her Met Gala debut on May 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-hilarious-met-gala-dig-proves-punjabi-humour-is-global-gold-video-2719619-2025-05-05",
      "headline": "Diljit Dosanjh's hilarious Met Gala dig proves Punjabi humour is global gold. VideoDiljit Dosanjh is all excited about his Met Gala debut, and he didn't hide that excitement in a new video on Instagram which is now going viral. The Punjabi singer-actor hilariously asked his fans not to send him wedding invites any more, because he's now got the most prestigious invite ever.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/met-gala-2025-dos-donts-shah-rukh-khan-fashion-biggest-night-2719596-2025-05-05",
      "headline": "Met Gala 2025: The dos, don'ts, and Shah Rukh Khan on fashion's biggest nightThe Met Gala 2025 promises glamour with India's biggest stars making waves. Shah Rukh Khan debuts alongside Priyanka Chopra in dazzling Indian outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-hari-hara-veera-mallu-shoot-trailer-songs-coming-soon-2719582-2025-05-05",
      "headline": "Pawan Kalyan joins Hari Hara Veera Mallu shoot, 'explosive' trailer coming soonAmid his busy schedule in politics, actor Pawan Kalyan has finally resumed the shooting of 'Hari Hara Veera Mallu'. The makers announced the same and added that only two days of shooting are left. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-vs-retro-box-office-collection-day-4-detailed-report-nani-leads-decent-hold-for-suriya-in-1st-weekend-2719576-2025-05-05",
      "headline": "HIT 3 vs Retro box office Day 4: Nani leads, decent hold for Suriya in 1st weekendBoth 'HIT: The Third Case' and 'Retro' finished their opening weekend on a decent note at the box office. However, it was Nani's film that emerged as the winner after crossing the benchmark of Rs 50 crore nett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-4-detailed-report-ajay-devgan-film-wins-audience-in-1st-weekend-monday-crucial-2719566-2025-05-05",
      "headline": "Raid 2 box office Day 4: Ajay's film wins audience in 1st weekend, Monday crucial'Raid 2' performed well in its opening weekend at the box office. The film is now eyeing the benchmark of Rs 100 crore in India, but it will have to register a good Monday to achieve the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-back-on-instagram-after-meltdown-thanks-ananya-panday-raghav-juyal-siddhanth-chaturvedi-2719560-2025-05-05",
      "headline": "Babil Khan back on Instagram after meltdown, thanks Siddhant, Ananya and othersActor Babil Khan made his comeback on Instagram hours after he deleted his account. He had posted two videos of him having a meltdown, which left fans worrying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prakash-raj-abir-gulaal-ban-fawad-khan-central-censorship-2719544-2025-05-05",
      "headline": "Actor Prakash Raj stirs 'intolerance' debate amid Fawad Khan's Abir Gulaal banPrakash Raj has voiced strong criticism against the practice of banning films in India while talking about Fawad Khan's 'Abir Gulaal'. He warned that such censorship, fuelled by political pressure, threatens the freedom of expression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-raghv-juyal-support-babil-khan-his-viral-meltdown-video-2719446-2025-05-04",
      "headline": "Siddhant Chaturvedi, Raghav Juyal support Babil Khan after viral meltdown videoSiddhant Chaturvedi and Raghav Juyal reacted to Babil Khan's viral video. The two extended their support to the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bradley-cooper-seal-romance-kiss-on-instagram-birthday-2719442-2025-05-04",
      "headline": "Gigi Hadid and Bradley Cooper seal romance with a kiss on InstagramSupermodel Gigi Hadid made Instagram official with Bradley Cooper. She shared a picture of the two kissing at her 30th birthday celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/taapsee-pannu-haseen-dillruba-3-in-works-kanika-dhillon-vikrant-massey-2719431-2025-05-04",
      "headline": "Taapsee Pannu's Haseen Dillruba 3 in works: ReportTaapsee Pannu and writer Kanika Dhillon are set to reunite again for Haseen Dilruba third part. As per a report, the scripting of the next part is officially in the works. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-kim-taehyung-v-jungkook-flaunt-military-muscles-in-gym-photos-army-reacts-2719386-2025-05-04",
      "headline": "BTS's V and Jungkook flaunt military muscles in gym photos, takes internet by stormBTS members Taehyung and Jungkook were seen flaunting their ripped arms in recently surfaced photos. The image has sparked excitement among fans as the duo prepares for their military discharge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-team-clarifies-widely-misinterpreted-viral-clips-assures-his-safety-2719390-2025-05-04",
      "headline": "Babil Khan's team clarifies 'widely misinterpreted' clips, assures his safetyBabil Khan's team issued a statement and addressed his now-deleted viral emotional videos. The team clarified that the actor's comments were 'widely misinterpreted and taken out of context.' "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-clarifies-taimur-remark-apologised-for-being-the-evil-villain-jewel-thief-netflix-2719377-2025-05-04",
      "headline": "Saif Ali Khan clarifies Taimur remark: Apologised for being the evil villainSaif Ali Khan recently clarified his recent comment about apologising to son, Taimur, after making him watch 'Adipurush.' The actor stated that he apologised to his son for playing the evil villain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-vs-retro-box-office-day-3-nani-film-races-past-suriya-thriller-2719361-2025-05-04",
      "headline": "HIT 3 vs Retro box office Day 3: Nani's film races past Suriya's thrillerThis week's South releases - Nani's 'HIT: The Third Case' and Suriya's 'Retro' - opened strong at the box office. However, the Telugu thriller has pulled ahead of the Tamil actioner in terms of collections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-meets-jaya-prada-fans-say-two-legends-in-one-frame-2719354-2025-05-04",
      "headline": "Dharmendra meets 'lovely co-star' Jaya Prada, fans say 'two legends in one frame'Veteran actors Dharmendra and Jaya Prada's reunion delighted fans. The two have worked together in films like 'Qayamat', 'Insaaf Kaun Karega' and 'Ganga Tere Desh Mein', among others. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-khalistan-event-deportation-of-hindus-pm-modi-amit-shah-jaishankar-caged-effigy-2719628-2025-05-05",
      "headline": "Caged effigies of PM, Amit Shah, Jaishankar paraded at Khalistan event in CanadaThe parade included a large truck with a mock-up of a jail that had effigies of PM Modi, Home Minister Amit Shah, and External Affairs Minister S Jaishankar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-himanshi-narwal-wife-navy-officer-online-hate-trolls-ncw-2719595-2025-05-05",
      "headline": "As Pahalgam's poster child of justice faces hate, women panel's tough messageThe outpouring of support for Himanshi Narwal, wife of a Navy officer killed in the Pahalgam terror attack, soon turned into hate on social media after she asked people not to target Muslims and Kashmiris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-man-body-found-kugam-river-imtiaz-ahmed-family-alleges-custodial-death-pahalgam-attack-2719502-2025-05-04",
      "headline": "Suspected Lashkar terrorist drowns while fleeing, family alleges custodial deathThe death of a 23-year-old man in Jammu and Kashmir's Kulgam, who allegedly drowned while escaping police custody, has sparked widespread outrage and demands for a judicial probe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ajaz-khan-house-arrest-promised-role-in-ott-show-rape-case-filed-proposed-inside-house-police-maharashtra-mumbai-actor-2719653-2025-05-05",
      "headline": "Actor Ajaz Khan accused of rape, FIR registered: CopsA fellow actor has alleged that actor Ajaz Khan raped her on the pretext of marriage and a role in his show 'House Arrest'. Mumbai police filed an FIR against the 'Bigg Boss'-fame actor, while the investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indians-leave-their-children-us-borders-heres-why-illegal-immigration-canada-mexico-cross-ice-donald-trump-2718611-2025-05-05",
      "headline": "Why Indians abandoning their children at US border is on Trump's radarThousands of parents, including those from India, leave their children on the US-Mexico or US-Canada border in the hope that they will be taken in and granted American citizenship. This risky act might no longer remain a ticket to citizenship as Trump's Immigration and Customs Enforcement (ICE) is cracking down on this route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-poonch-terror-hideout-busted-ieds-explosives-tiffin-boxes-steel-buckets-security-forces-police-operation-2719583-2025-05-05",
      "headline": "Terror hideout busted in J&K days after Pahalgam attack, IEDs found in tiffin boxIn a joint operation, the Army and Jammu and Kashmir Police uncovered a terror hideout in the forested Surankote area of Poonch, seizing explosive devices and communication gear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pleas-challenging-waqf-amendment-act-hearing-today-centre-affidavit-aimplb-2719571-2025-05-05",
      "headline": "Will Supreme Court pause Waqf Amendment Act? Key hearing todayWith Chief Justice Khanna retiring on May 13, the bench has limited time to hold a final hearing, as the case involves arguments from several lawyers representing the petitioners and the Centre, which has already submitted a 1,300-page interim affidavit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-back-on-instagram-after-meltdown-thanks-ananya-panday-raghav-juyal-siddhanth-chaturvedi-2719560-2025-05-05",
      "headline": "Babil Khan back on Instagram after meltdown, thanks Siddhant, Ananya and othersActor Babil Khan made his comeback on Instagram hours after he deleted his account. He had posted two videos of him having a meltdown, which left fans worrying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/279-year-old-mummy-reveals-never-before-seen-method-of-preserving-human-body-2719657-2025-05-05",
      "headline": "279-year-old mummy's secret leaves scientists shockedThe unusually well-preserved mummy in the church crypt of St Thomas am Blasenstein is the corps of a local parish vicar, Franz Xaver Sidler von Rosenegg, who died in 1746. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/iran-warns-us-israel-of-retaliation-amid-rising-tensions-over-houthi-attacks-glbs-2719531-2025-05-05",
      "headline": "Iran warns US, Israel amid tensions over Houthi strike: Will target your basesIran's Defence Minister Aziz Nasirzadeh's remarks came after Israeli PM Benjamin Netanyahu vowed to retaliate against Iran for the Tehran-backed Houthi group firing a missile that landed near Israel's main airport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fight-over-tandoori-roti-two-youth-died-wedding-procession-2719433-2025-05-04",
      "headline": "2 teens dead at UP wedding after fight over 'who gets tandoori roti first'A verbal spat over who would take the tandoori roti first soon turned violent, resulting in the deaths of two wedding guests, one of them a minor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-announces-100-tariff-on-foreign-films-calls-for-revival-of-hollywood-glbs-2719540-2025-05-05",
      "headline": "Trump slaps 100% tariff on foreign films, calls them threat to national securityDonald Trump announced a 100 per cent tariff on foreign-produced films to revive the US film industry, calling them \"propaganda and messaging\" and citing national security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/dmk-mp-a-rajas-close-shave-as-light-post-crashes-on-stage-during-his-address-2719601-2025-05-05",
      "headline": "Video: DMK MP's close shave as light post crashes on stage during his addressThe incident occurred while A Raja was addressing the gathering, and was captured on video, which has since gone viral on social media. The dramatic moment unfolded as strong winds swept through the venue, toppling the stage light mounted on a steel rod. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-un-security-council-to-meet-today-over-rising-india-pakistan-tensions-after-jk-attack-2719545-2025-05-05",
      "headline": "UN Security Council to meet today over rising India-Pak tensions after J&K attackThis development follows Pakistan's announcement that it will apprise the UN Security Council of what it describes as \"India's aggressive actions, provocations, and provocative statements\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-suggests-rishabh-pant-to-call-ms-dhoni-to-regain-form-2719635-2025-05-05",
      "headline": "Call MS Dhoni: Virender Sehwag's suggestion to Rishabh Pant for regaining formFormer India cricketer turned commentator Virender Sehwag has suggested struggling Rishabh Pant to call MS Dhoni to bounce back to form in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/gujarat-class-12-science-general-gujcet-results-declared-announced-check-scorecards-reports-direct-link-download-2719630-2025-05-05",
      "headline": "Gujarat Class 12 results 2025 declared for Science, General, GUJCET: Direct linkThe GSEB HSC Result 2025 has been declared today at 10:30 am. Students can check Gujarat Board 12th result online via gseb.org, WhatsApp, SMS or DigiLocker. Check the direct links here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/met-gala-2025-dos-donts-shah-rukh-khan-fashion-biggest-night-2719596-2025-05-05",
      "headline": "Met Gala 2025: The dos, don'ts, and Shah Rukh Khan on fashion's biggest nightThe Met Gala 2025 promises glamour with India's biggest stars making waves. Shah Rukh Khan debuts alongside Priyanka Chopra in dazzling Indian outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/possibility-of-terror-strikes-on-jails-in-jammu-security-heightened-sources-2719559-2025-05-05",
      "headline": "Jammu jails on high alert, security tightened after intel on terror strike: SourcesThese jails currently house several high-profile terrorists and their associates, who are known to provide support to terrorists through logistical help, shelter, and by facilitating their movement, even if they are not directly involved in attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-representatives-lobby-trump-officials-drop-265-million-bribery-fraud-case-2719554-2025-05-05",
      "headline": "Adani aides lobby Trump officials to drop $265 million bribery case: ReportAdani's representatives are trying to make the case that his prosecution does not align with Trump's priorities and should be reconsidered, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-modi-govts-caste-census-decision-feels-like-deja-vu-to-bihar-2718763-2025-05-02",
      "headline": "Why Modi govt's caste census decision feels like déjà vu to BiharIn assembly poll terms, the move blunts a formidable Opposition critique and affords the state's ruling alliance a fresh narrative of inclusivity"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-iit-bombay-graduate-rising-cost-of-living-india-middle-class-inflation-debate-2719614-2025-05-05",
      "headline": "Bengaluru woman's viral post on rising cost of living in India sparks debateMonali Dambre, an IIT Bombay graduate, shared her concerns on X, saying, \"I'm slowly coming to terms with the fact that the cost of living in India is getting really expensive - even in smaller, tier-3 cities.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-opens-unprovoked-firing-along-loc-for-11th-straight-night-army-retaliates-2719547-2025-05-05",
      "headline": "Pak continues unprovoked firing along LoC for 11th straight night, Army retaliatesThe Indian Army confirmed that it responded to unprovoked small arms fire by Pakistani troops during the night of May 4-5 across multiple sectors in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-500-points-3-reasons-why-stock-market-is-rising-2719633-2025-05-05",
      "headline": "Sensex rises over 500 points. 3 reasons why stock market is risingForeign investor inflows, strong macro data, and improving global cues have fired up the bulls. While geopolitical risks linger, analysts say the rally could hold as long as key support levels stay intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/maharashtra-class-12-results-declared-out-released-all-streams-check-direct-link-download-scorecard-marksheets-2719658-2025-05-05",
      "headline": "Maharashtra Class 12 result 2025 declared, 91.86% students pass. Direct linkThe Maharashtra HSC Result 2025 has been declared with a 91.86% pass rate. Students can check their Class 12 result at mahresult.nic.in, India Today Results and other official sites."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatres-father-yogesh-advises-son-not-to-imitate-vaibhav-suryavanshi-2719665-2025-05-05",
      "headline": "Ayush Mhatre advised not to imitate Vaibhav Suryavanshi by father YogeshChennai Super Kings' (CSK) batter Ayush Mhatre's father Yogesh has advised him not to imitate Vaibhav Suryavanshi following his breathtaking innings of 94 (48) vs Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-dc-hyderabad-predicted-xi-team-news-head-to-head-pitch-2719642-2025-05-05",
      "headline": "Delhi aim to gain lost momentum against out-of-form Hyderabad.IPL 2025, SRH vs DC: Pressure is on the Sunrisers Hyderabad, who are in a must-win position for a berth in the playoffs. Delhi Capitals will look to reclaim their spot in the top four when they meet the Orange Army on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-suggests-rishabh-pant-to-call-ms-dhoni-to-regain-form-2719635-2025-05-05",
      "headline": "Call MS Dhoni: Virender Sehwag's suggestion to Rishabh Pant for regaining formFormer India cricketer turned commentator Virender Sehwag has suggested struggling Rishabh Pant to call MS Dhoni to bounce back to form in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/lsgs-ayush-badoni-rues-poor-powerplay-after-37-run-loss-vs-pbks-in-dharamsala-2719612-2025-05-05",
      "headline": "LSG's Ayush Badoni rues poor powerplay after 37-run loss vs PBKS in DharamsalaLucknow Super Giants (LSG) batter Ayush Badoni rued his team's poor powerplay with the bat following their 37-run loss against Punjab Kings (PBKS). LSG lost three wickets in the powerplay and were restricted to 199/7 in their 20 overs chasing a target of 237."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsgs-ayush-badoni-delighted-with-his-valiant-74-vs-pbks-2719602-2025-05-05",
      "headline": "Ayush Badoni delighted with his valiant 74 vs PBKS: I always thrive under pressureLucknow Super Giants (LSG) batter Ayush Badoni revealed that he was delighted with his fiery innings of 74 against Punjab Kings (PBKS) in Match 54 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-harsh-dubey-replacement-2719600-2025-05-05",
      "headline": "Ranji history maker replaces injured Smaran Ravichandran at SRHIPL 2025: Prior to their clash against Delhi Capitals on Monday, Sunrisers Hyderabad have roped in young Vidarbha all-rounder Harsh Dubey as a replacement for Smaran Ravichandran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ricky-ponting-press-conference-shreyas-iyer-josh-inglis-pbks-vs-lsg-2719589-2025-05-05",
      "headline": "Shreyas Iyer took the call of promoting Josh Inglis: Ricky PontingIPL 2025, PBKS vs LSG: In the post-match press conference, Ricky Ponting said that Shreyas Iyer took the call of promoting Josh Inglis, who hit Mayank Yadav for three sixes in the second over, and scored 30 runs off 14 ballls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-prabhsimran-singh-priyansh-arya-pbks-vs-lsg-ipl-2025-2719580-2025-05-05",
      "headline": "How Ponting motivated Priyansh, Prabhsimran before LSG clashIPL 2025, PBKS vs LSG: Punjab Kings head coach Ricky Ponting praised Prabhsimran Singh and Priyansh Arya for their collective efforts throughout the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-2025-pbks-vs-lsg-feature-2719553-2025-05-05",
      "headline": "IPL 2025: What's gone wrong with Rishabh Pant?IPL 2025, PBKS vs LSG: Rishabh Pant has been terribly out of form, getting out cheaply regularly for the Lucknow Super Giants. On Sunday, Pant scored 18 runs against Punjab Kings in Dharamsala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/casper-ruud-jack-draper-madrid-open-atp-1000-2719548-2025-05-05",
      "headline": "Casper Ruud wins maiden ATP 1000 title after Madrid Open heistMadrid Open 2025: Norway's Casper Ruud won his maiden ATP Masters 1000 title after beating Jack Draper 7-5, 3-6, 6-4 in the final on Sunday, May 4 at Manolo Santana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-wicketkeeper-captaincy-aaron-finch-suggestion-2719526-2025-05-05",
      "headline": "Should Rishabh Pant give up the gloves to save LSG's playoffs hopes?IPL 2025, PBKS vs LSG: Former Australia captain Aaron Finch explained why Nicholas Pooran taking over the wicketkeeper's role will help Rishabh Pant and Lucknow Super Giants in their last three games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ricky-ponting-press-conference-shreyas-iyer-josh-inglis-pbks-vs-lsg-2719589-2025-05-05",
      "headline": "Shreyas Iyer took the call of promoting Josh Inglis: Ricky PontingIPL 2025, PBKS vs LSG: In the post-match press conference, Ricky Ponting said that Shreyas Iyer took the call of promoting Josh Inglis, who hit Mayank Yadav for three sixes in the second over, and scored 30 runs off 14 ballls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-prabhsimran-singh-priyansh-arya-pbks-vs-lsg-ipl-2025-2719580-2025-05-05",
      "headline": "How Ponting motivated Priyansh, Prabhsimran before LSG clashIPL 2025, PBKS vs LSG: Punjab Kings head coach Ricky Ponting praised Prabhsimran Singh and Priyansh Arya for their collective efforts throughout the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-2025-pbks-vs-lsg-feature-2719553-2025-05-05",
      "headline": "IPL 2025: What's gone wrong with Rishabh Pant?IPL 2025, PBKS vs LSG: Rishabh Pant has been terribly out of form, getting out cheaply regularly for the Lucknow Super Giants. On Sunday, Pant scored 18 runs against Punjab Kings in Dharamsala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/casper-ruud-jack-draper-madrid-open-atp-1000-2719548-2025-05-05",
      "headline": "Casper Ruud wins maiden ATP 1000 title after Madrid Open heistMadrid Open 2025: Norway's Casper Ruud won his maiden ATP Masters 1000 title after beating Jack Draper 7-5, 3-6, 6-4 in the final on Sunday, May 4 at Manolo Santana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-wicketkeeper-captaincy-aaron-finch-suggestion-2719526-2025-05-05",
      "headline": "Should Rishabh Pant give up the gloves to save LSG's playoffs hopes?IPL 2025, PBKS vs LSG: Former Australia captain Aaron Finch explained why Nicholas Pooran taking over the wicketkeeper's role will help Rishabh Pant and Lucknow Super Giants in their last three games of the season. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}