{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-2-shares-in-focus-trump-tariff-dalal-street-sensex-nifty-2702642-2025-04-02",
      "headline": "Stocks to watch on April 2: Shares in focus; Tata Motors, Swiggy, Coal IndiaShares of companies such as Maruti Suzuki, Tata Motors, Tata Steel, Tata Consumer, Swiggy, Godavari Power, and Indian Bank will be in focus due to key developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-rules-know-all-the-rates-slabs-deductions-zero-tax-on-incomes-up-to-rs-12-lakh-and-more-2702350-2025-04-02",
      "headline": "New Income Tax rules: Know all rates, slabs, deductions and moreThe government has amended the income tax slabs under the new tax regime for FY 2025-26. According to the new structure, those earning up to Rs 4 lakh will pay no taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-crash-vix-volatility-fear-index-rise-10-percent-what-should-investors-know-expert-view-2702281-2025-04-01",
      "headline": "Stock market crash: Why should investors watch out for rising volatility?The stock market fear index surged 10% on Tuesday as investors braced for the impact of US reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-impact-on-india-stock-market-crash-sensex-nifty-correction-explained-2702178-2025-04-01",
      "headline": "Sensex down over 1,400 points: US tariff panic or other factors at play?Is the surrounding uncertainty reciprocal tariffs the only factor behind today's stock market bloodbath, or are other underlying issues driving the sharp correction? Read on to find out what's spooking Dalal Street investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-epfo-raise-claim-withdrawal-limit-from-rs-1-lakh-to-rs-5-lakh-in-april-2025-check-here-2702170-2025-04-01",
      "headline": "Will EPFO raise claim withdrawal limit to Rs 5 lakh in April 2025? Check hereEPFO is planning to allow Provident Fund (PF) withdrawals via UPI and ATMs soon. This move will make it easier for members to withdraw their PF money without delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-what-is-no-contest-clause-meaning-rs-3800-crore-wealth-distribution-2702173-2025-04-01",
      "headline": "Ratan Tata's will includes a 'no-contest' clause: What does it mean?Ratan Tata dedicated most of his fortune, including his Tata Sons shares, to charity. However, he also ensured that his family, close friends, employees, and even his cherished pets were taken care of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/10-major-financial-rule-changes-from-april-1-new-tax-rules-upi-updates-pan-aadhaar-updates-tds-gst-rules-2702124-2025-04-01",
      "headline": "10 major financial rule changes from April 1: Tax, UPI updates and moreFrom April 1, you won't have to pay income tax if your annual income is up to Rs 12 lakh. Also, with a standard deduction of Rs 75,000, income up to Rs 12.75 lakh is tax-free under the new tax system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-rs-3800-crore-who-gets-what-family-trust-pet-dog-2702120-2025-04-01",
      "headline": "Ratan Tata's Rs 3,800 crore will: Who gets what?Ratan Tata will: The industrialist, who died on October 9, 2024, left most of his wealth, including shares in Tata Sons, to charitable causes. At the same time, he did not forget his family, close friends, staff, and even his beloved pets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-slashed-by-rs-41-from-today-2702099-2025-04-01",
      "headline": "Commercial LPG cylinder prices slashed by Rs 41 from todayWhile the price of commercial LPG cylinders has been reduced, the price of domestic cylinders used by households has not changed."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-revised-re-edited-version-releases-after-24-volutary-cuts-2702634-2025-04-02",
      "headline": "Mohanlal-starrer Empuraan's re-edited version out in theatres after 24 cutsThe re-edited version of actor Mohanlal and director Prithviraj Sukumaran's L2: Empuraan was screened in theatres on Tuesday. The makers voluntarily went for re-censoring and the censor board suggested 24 cuts, including deletion of two minutes of footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-splits-from-fiance-jonathan-davino-heres-why-glbs-2702597-2025-04-01",
      "headline": "Sydney Sweeney splits from fiancé Jonathan Davino: Here's whySydney Sweeney has ended her engagement to Jonathan Davino, prioritising her career over wedding plans. The Madame Webb star is focused on upcoming projects, including Euphoria and The Housemaid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-justin-baldoni-legal-battle-docuseries-on-discovery-2702577-2025-04-01",
      "headline": "Docuseries on Justin Baldoni, Blake Lively's legal feud in worksA docuseries on the legal battle between actors Blake Lively and Justin Baldoni's will be available on Discovery, promising an intriguing look into the complexities of legal disputes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lawrence-welcomes-baby-no-2-with-husband-cooke-maroney-glbs-2702587-2025-04-01",
      "headline": "Jennifer Lawrence welcomes second child with husband Cooke MaroneyActor Jennifer Lawrence welcomed her second child with her husband Cooke Maroney. The got married in October 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-saldana-joins-kendrick-lamar-and-gracie-abrams-in-webby-nominations-glbs-2702567-2025-04-01",
      "headline": "Zoe Saldaña joins Kendrick Lamar and Gracie Abrams in Webby nominationsWith nearly 13,000 entries from over 70 countries, the competition includes viral music videos, top podcasts, and unexpected social media sensations. Voting for the Webby People's Voice Award is open until April 17, with winners announced on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jason-momoa-confirms-he-is-returning-to-the-dune-universe-2702481-2025-04-01",
      "headline": "Jason Momoa confirms he is returning to the Dune universeHollywood star Jason Momoa will be returning to the science-fiction world of Dune, the actor confirmed in a recent interview. He played Duncan Idaho in the first part. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/barkha-bisht-karan-singh-grover-relationship-got-attracted-to-his-kindness-2702505-2025-04-01",
      "headline": "Barkha Bisht recalls relationship with Karan Singh GroverIn a candid interview, Barkha Bisht discussed her past relationships, revealing the reasons behind her breakup with Karan Singh Grover. She shared that she was attracted to his kindness, and grew apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-on-sardar-2-the-sequel-will-feature-a-much-bigger-war-2702468-2025-04-01",
      "headline": "Karthi on Sardar 2: The sequel will feature a much bigger warThe teaser for the highly anticipated sequel, Sardar 2, showcases Karthi reprising his dual roles as Indian spy Sardar and his son Vijay, gearing up for a much larger war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gulshan-devaiah-on-working-with-anurag-kashyap-hes-so-full-of-himself-2702491-2025-04-01",
      "headline": "Gulshan Devaiah on working with Anurag Kashyap: He's so full of himself but...Gulshan Devaiah recently revealed his thoughts on working with Anurag Kashyap, calling him confident yet collaborative. The actor shared his experience during a Reddit AMA session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/asit-modi-reacts-to-disha-vakanis-return-to-taarak-mehta-we-can-only-pray-2702490-2025-04-01",
      "headline": "Asit Modi reacts to Disha Vakani's return to Taarak Mehta: We can only prayProducer Asit Kumar Modi broke his silence on the ongoing rumours about the possibility of the return of the character Dayaben in Taarak Mehta Ka Ooltah Chashmah. He also revealed whether there's a possibility of actor Disha Vakani's return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-south-indian-sequels-beyond-baahubali-kgf-pushpa-that-clicked-with-fans-2702416-2025-04-01",
      "headline": "5 South Indian sequels beyond Baahubali, KGF, Pushpa, that clicked with fansLast weekend witnessed a slew of film releases, including sequels like Mohanlal's L2: Empuraan and Mad Square, as well as prequels such as Veera Dheera Sooran Part 2 and Robinhood. Here are five recent South Indian sequels that struck a chord with audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/esha-deol-wants-dhoom-to-re-release-2702424-2025-04-01",
      "headline": "Esha Deol wants Dhoom to re-release: Kids still remember me for the filmActor Esha Deol recently said she wants Dhoom to be released again in cinemas. Apart from Deol, the film starred Abhishek Bachchan, Uday Chopra and John Abraham in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/subham-teaser-samantha-turns-producer-with-a-quirky-horror-comedy-2702405-2025-04-01",
      "headline": "Subham teaser: Samantha turns producer with the quirky horror-comedyActor Samantha released the teaser of her debut production, Subham. The Telugu horror-comedy offers a sneak peek into its intriguing premise, showcasing the film's distinct blend of horror and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-screened-in-israel-as-tribute-to-india-israel-relations-2702394-2025-04-01",
      "headline": "John Abraham's Diplomat screened in Israel as tribute to India-Israel relationsIn a gesture celebrating India-Israel relations, Israel has screened John Abraham's film The Diplomat. Directed by Shivam Nair, the film hit theatres on March 14. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jessica-simpson-vocal-cord-remedy-chinese-herb-cocktail-with-snake-sperm-2702368-2025-04-01",
      "headline": "Drink snake sperm if you want good vocal: Singer Jessica SimpsonAmerican singer and actor Jessica Simpson recently shared her unusual method for maintaining her vocal cords, involving a Chinese herb cocktail containing snake sperm. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/andaz-apna-apna-salman-khan-aamir-khans-cult-comedy-to-re-release-on-april-25-2702393-2025-04-01",
      "headline": "Andaz Apna Apna: Salman Khan, Aamir Khan's cult comedy to re-release on April 25Bollywood's beloved comedy 'Andaz Apna Apna' is making a comeback to the big screen. The cult classic will be re-released in cinemas nationwide, delighting both new and old fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shalini-pandey-south-director-entered-van-when-she-was-changing-2702297-2025-04-01",
      "headline": "Actor Shalini Pandey says South director entered her van when she was changingActor Shalini Pandey, who made her debut with the Telugu film Arjun Reddy, said that a South director entered her van without knocking on the door. She also recalled how she reacted at the moment."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-to-be-tabled-in-lok-sabha-today-amid-nda-india-bloc-showdown-2702636-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf bill to be tabled in Lok Sabha today amid NDA-INDIA bloc showdown Live UpdatesThe Waqf (Amendment) Bill, 2024, is set to be introduced in the Lok Sabha today. The Bill seeks to amend the 1995 Waqf Act to address issues in managing Waqf properties, but the opposition plans to vote against it after a full discussion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/reciprocal-tariffs-to-be-effective-immediately-white-house-ahead-of-trumps-move-glbs-2702576-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tariffs announced on April 2 to be effective immediately: White HouseThe White House confirmed that President Trump will announce reciprocal tariffs on April 2, with auto tariffs set to take effect on April 3. Press Secretary Karoline Leavitt stated Trump is fine-tuning his tariff strategy with trade advisors for a \"perfect deal\" for Americans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-new-national-president-announcement-post-parliament-session-april-end-jp-nadda-successor-2702571-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP likely to get new national president by third week of April: SourcesThe BJP's search for a new party president to succeed Jagat Prakash Nadda is likely to pick speed once the Parliament session is over, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-a-usual-us-bombing-campaign-will-not-bring-iran-to-heel-2702482-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a usual US bombing campaign will not bring Iran to heelFor Trump, any amplified war with Iran will stand against his promises of not dragging the US into wars in faraway lands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-revised-re-edited-version-releases-after-24-volutary-cuts-2702634-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohanlal-starrer Empuraan's re-edited version out in theatres after 24 cutsThe re-edited version of actor Mohanlal and director Prithviraj Sukumaran's L2: Empuraan was screened in theatres on Tuesday. The makers voluntarily went for re-censoring and the censor board suggested 24 cuts, including deletion of two minutes of footage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangaldesh-awami-league-member-fled-india-2702626-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 1 lakh Awami League members fled to India, claims Bangladesh advisorA Bangladesh government advisor claims over 1 lakh Awami League members fled to India. He accuses Sheikh Hasina of conspiring from abroad and criticises her tenure.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-parliament-controversial-provisions-explained-2702387-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahead of Waqf war in Parliament, your guide to the new bill and row over itA big showdown is expected in Parliament today as the Waqf (Amendment) Bill will be taken up for discussion and passage. While the BJP and many of its allies have rallied behind the bill, the Opposition has vowed to stand against it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-ceasefire-agreement-loc-poonch-jammu-kashmir-indian-army-retaliates-2702528-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak violates ceasefire at LoC in Poonch, Indian Army retaliatesThe Indian Army successfully thwarted an infiltration attempt by the Pakistan Army in the Krishna Ghati area of Poonch district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/democratic-party-cory-booker-record-senate-speech-protest-donald-trump-2702628-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In longest ever Senate speech, Booker raves against Trump for 24 hours non-stopSen. Cory Booker set a 25-hour Senate speech record, protesting Trump's tariff plans and policies. Meanwhile, Trump announced new tariffs and layoffs affecting thousands.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-2-shares-in-focus-trump-tariff-dalal-street-sensex-nifty-2702642-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stocks to watch on April 2: Shares in focus; Tata Motors, Swiggy, Coal IndiaShares of companies such as Maruti Suzuki, Tata Motors, Tata Steel, Tata Consumer, Swiggy, Godavari Power, and Indian Bank will be in focus due to key developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-indias-northeast-must-worry-about-muhammad-yunuss-statement-in-china-2702439-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's Northeast must worry about Muhammad Yunus's statement in ChinaBy calling Bangladesh the 'guardian' of ocean access for the northeastern states, Yunus has drawn China in, weaponised geography and triggered regional security alarms"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sanitation-worker-income-tax-notice-rs-33-crore-uttar-pradesh-aligarh-2702503-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP sanitation worker earning Rs 15,000 monthly gets tax notice of Rs 33.88 croreThe man, who works as a cleaner at a SBI branch, receives a monthly salary of Rs 15,000. Last month, he received an Income Tax notice of over Rs 33 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/after-brain-rot-instagram-reels-are-now-leading-to-eye-disorders-doctors-issue-urgent-warning-2702381-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After 'brain rot', reels now leading to eye disorders: Docs raise concernExcessive screen time, particularly binge-watching reels on social media platforms is leading to a spike in eye disorders across all age groups, especially among children and young adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-janhvi-kapoor-aditya-roy-kapur-and-others-bring-glam-to-vivienne-westwood-show-2702573-2025-04-01#?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Kareena, Janhvi, Aditya and others bring glam to Vivienne Westwood's showFashion brand Vivienne Westwood hosted their first ever show in Mumbai on April 1. The star-studded affair saw several celebrities, including Kareena Kapoor, Janhvi Kapoor, Aditya Roy Kapur, Mira Rajput and Vaani Kapoor, among others, in attendance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/keralas-low-even-10-year-olds-high-on-drugs-finds-govt-survey-2702409-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala's low: Even 10-year-olds high on drugs, finds govt surveyThe Pinarayi Vijayan government is planning a massive awareness campaign as rampant drug abuse threatens an entire generation and spurs violent crimes"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-third-summon-kunal-kamra-joke-row-2702623-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai Police summons Kunal Kamra for third time over Eknath Shinde joke rowMumbai Police has issued a third summons to comedian Kunal Kamra over his parody video mocking Deputy Chief Minister Eknath Shinde.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/security-guard-beaten-up-mns-workers-raj-thackeray-mumbai-not-speaking-marathi-viral-video-2702538-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Security guard thrashed by Raj Thackeray's party workers for not knowing MarathiMNS workers were caught on camera confronting and thrashing a security guard for not being able to converse in Marathi. In the video, the security guard was seen with folded hands as the MNS workers rebuked him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-wife-married-lover-brings-her-back-sant-kabir-nagar-regrets-mistake-2702380-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man regrets getting wife married to lover, brings her back homeA man in Uttar Pradesh's Sant Kabir Nagar recently arranged his wife's marriage to her lover. But just a few days later, he went to her new husband's house, asking her to return as he was struggling to take care of their two children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/death-penalty-luigi-mangione-unitedhealthcare-ceo-brian-thompson-murder-us-prosecutors-2702509-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Death penalty sought for Luigi Mangione in UnitedHealthcare CEO's murder caseUS Attorney General Pamela Bondi has directed federal prosecutors to seek the death penalty for Luigi Mangione, accused of killing UnitedHealth CEO Brian Thompson in New York."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-weather-forecast-pitch-report-bengaluru-2702403-2025-04-02",
      "headline": "RCB vs GT pitch report, weather prediction IPL 2025: Will rain play spoilsport?RCB are set for an electrifying homecoming at Chinnaswamy Stadium, facing Gujarat Titans in their first IPL 2025 home fixture. With both teams coming off strong performances, fans can expect a high-scoring thriller under the Bengaluru lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-predicted-xi-fantasy-picks-2702643-2025-04-02",
      "headline": "IPL 2025, RCB vs GT predicted XI, fantasy picks: Players who can fetch you most pointsRoyal Challengers Bengaluru (RCB) and Gujarat Titans (GT) will lock horns in Match 14 of the Indian Premier League 2025 (IPL 2025). Both teams are full of several match-winners having the ability to turn the game in their team's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-rcb-vs-gt-preview-team-news-stats-prediction-2702635-2025-04-02",
      "headline": "RCB vs GT preview: After flying start, RCB look to conquer home disadvantageIPL 2025, RCB vs GT: After having made a solid start to their new season, RCB and new captain Rajat Patidar face a big test at home as they take on Gujarat Titans at M Chinnaswamy Stadium on Wednesday. With a revamped bowling attack and momentum on their side, they aim to overcome past woes at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-2011-world-cup-final-ms-dhoni-gautam-gambhir-anniversary-14-2702615-2025-04-02",
      "headline": "India's 2011 World Cup winning squad: Where are they now on 14th anniversary?14 years ago on this very day, MS Dhoni's India won the ODI World Cup after beating Sri Lanka by six wickets in front of a packed house at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-zaheer-khan-lsg-vs-pbks-press-conference-2702618-2025-04-02",
      "headline": "Zaheer Khan takes a dig at LSG curator: Didn't seem like a home gameIPL 2025, LSG vs PBKS: Mentor Zaheer Khan said that the Lucknow Super Giants didn't get the home advantage they would have expected in their clash against the Punjab Kings on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-lsg-vs-pbks-second-spot-lucknow-2702617-2025-04-02",
      "headline": "IPL 2025 Points Table, April 1: PBKS jump to 2nd after thrashing LSGPunjab Kings jumped to second in IPL 2025 points table after thrashing Lucknow Super Giants, as skipper Shreyas Iyer and Prabhsimran Singh star in a dominant chase at the Ekana Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-hyderabad-cricket-association-complimentary-passes-agreement-2702616-2025-04-02",
      "headline": "IPL 2025: SRH, Hyderabad board bury the hatchet over free ticket rowSunrisers Hyderabad and the Hyderabad Cricket Association reached a resolution over complimentary ticket distribution, safeguarding home IPL 2025 matches at the Rajiv Gandhi International Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-auction-tension-comment-2702600-2025-04-01",
      "headline": "Punjab Kings troll Rishabh Pant for auction tension joke after hammering LucknowIPL 2025, LSG vs PBKS: Punjab Kings took a cheeky dig at Rishabh Pant for his viral 'tension' comment earlier this year after hammering Lucknow Super Giants by 8 wickets on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-lsg-vs-pbks-second-spot-lucknow-2702617-2025-04-02",
      "headline": "IPL 2025 Points Table, April 1: PBKS jump to 2nd after thrashing LSGPunjab Kings jumped to second in IPL 2025 points table after thrashing Lucknow Super Giants, as skipper Shreyas Iyer and Prabhsimran Singh star in a dominant chase at the Ekana Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-hyderabad-cricket-association-complimentary-passes-agreement-2702616-2025-04-02",
      "headline": "IPL 2025: SRH, Hyderabad board bury the hatchet over free ticket rowSunrisers Hyderabad and the Hyderabad Cricket Association reached a resolution over complimentary ticket distribution, safeguarding home IPL 2025 matches at the Rajiv Gandhi International Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-auction-tension-comment-2702600-2025-04-01",
      "headline": "Punjab Kings troll Rishabh Pant for auction tension joke after hammering LucknowIPL 2025, LSG vs PBKS: Punjab Kings took a cheeky dig at Rishabh Pant for his viral 'tension' comment earlier this year after hammering Lucknow Super Giants by 8 wickets on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-isaiah-stewart-and-four-others-face-suspension-as-scuffle-broke-out-during-pistons-vs-timberwolves-glbs-2702582-2025-04-01",
      "headline": "NBA: Isaiah Stewart and four others face suspension as scuffle broke out during Pistons vs TimberwolvesDuring the NBA regular game between the Detroit Pistons and Minnesota Timberwolves on Sunday, March 30, at Target Center, five players faced a one-game suspension due to an on-court altercation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mo-bobat-rajat-patidar-2702568-2025-04-01",
      "headline": "Rajat Patidar been everything we expected: RCB director Mo BobatIPL 2025: RCB Director of Cricket Mo Bobat praised Rajat Patidar for his captaincy as the Royal Challengers Bengaluru are sitting on top of the table in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-shubman-gill-approachable-prasidh-krishna-2702558-2025-04-01",
      "headline": "Shubman Gill is very easy to approach: Prasidh Krishna praises GT captainPrasidh Krishna praised Shubman Gill's captaincy for Gujarat Titans, calling him approachable and supportive. Gujarat Titans aim to build momentum against in-form Royal Challengers Bangalore in their crucial IPL 2025 clash at Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-digvesh-rathi-notebook-celebration-priyansh-arya-virat-kohli-2702557-2025-04-01",
      "headline": "LSG's Digvesh Rathi does iconic notebook celebration, gets umpire warningIPL 2025, LSG vs PBKS: Lucknow spinner Digvesh Rathi pulled off the iconic notebook celebration to tease Punjab Kings batter Priyansh Arya after dismissing him. The celebration gained popularity during a banter between Virat Kohli and West Indies fast bowler Kesrick Williams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-punjab-kings-auction-joke-2702534-2025-04-01",
      "headline": "Rishabh Pant's Punjab Kings auction joke comes back to haunt him in LucknowIPL 2025, LSG vs PBKS: Several fans on social media trolled Rishabh Pant for his joke about Punjab Kings after the wicketkeeper-batter failed with the bat against PBKS on Tuesday, April 1. Pant has endured a dreadful start to the new season with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abdul-samad-arshdeep-singh-scoop-lsg-vs-pbks-2702529-2025-04-01",
      "headline": "Watch: Abdul Samad hits Arshdeep Singh for outrageous reverse scoopIPL 2025, LSG vs PBKS: Abdul Samad scored a brisk 12-ball 27 and also played an outrageous scoop for a boundary off Arshdeep Singh in the 18th over of Lucknow's innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-2nd-odi-live-streaming-hamilton-2702504-2025-04-01",
      "headline": "New Zealand vs Pakistan, 2nd ODI Live Streaming: When and where to watchPAK vs NZ, 2nd ODI: After winning the first ODI by 73 runs at McLean Park in Napier, New Zealand would be looking to claim the series in the second game at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-digvesh-rathi-notebook-celebration-priyansh-arya-virat-kohli-2702557-2025-04-01",
      "headline": "LSG's Digvesh Rathi does iconic notebook celebration, gets umpire warningIPL 2025, LSG vs PBKS: Lucknow spinner Digvesh Rathi pulled off the iconic notebook celebration to tease Punjab Kings batter Priyansh Arya after dismissing him. The celebration gained popularity during a banter between Virat Kohli and West Indies fast bowler Kesrick Williams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-punjab-kings-auction-joke-2702534-2025-04-01",
      "headline": "Rishabh Pant's Punjab Kings auction joke comes back to haunt him in LucknowIPL 2025, LSG vs PBKS: Several fans on social media trolled Rishabh Pant for his joke about Punjab Kings after the wicketkeeper-batter failed with the bat against PBKS on Tuesday, April 1. Pant has endured a dreadful start to the new season with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abdul-samad-arshdeep-singh-scoop-lsg-vs-pbks-2702529-2025-04-01",
      "headline": "Watch: Abdul Samad hits Arshdeep Singh for outrageous reverse scoopIPL 2025, LSG vs PBKS: Abdul Samad scored a brisk 12-ball 27 and also played an outrageous scoop for a boundary off Arshdeep Singh in the 18th over of Lucknow's innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-2nd-odi-live-streaming-hamilton-2702504-2025-04-01",
      "headline": "New Zealand vs Pakistan, 2nd ODI Live Streaming: When and where to watchPAK vs NZ, 2nd ODI: After winning the first ODI by 73 runs at McLean Park in Napier, New Zealand would be looking to claim the series in the second game at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-rishabh-pant-hattrick-failure-lucknow-super-giants-vs-punjab-kings-2702497-2025-04-01",
      "headline": "Rs 27 crore for what? Rishabh Pant slammed after hat-trick of failures for LSGRishabh Pant's dismal start to IPL 2025 continues as fans criticise the Lucknow Super Giants skipper for failing to justify his Rs 27 crore price tag. With just 17 runs in three matches, Pant's performance has left supporters frustrated and questioning his value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-virat-kohli-bromance-video-2702494-2025-04-01",
      "headline": "Watch: Mohammed Siraj hugs Virat Kohli ahead of first game vs RCB in 8 yearsIPL 2025, RCB vs GT: Mohammed Siraj reunited with his former teammates Virat Kohli, Rajat Patidar and Yash Dayal on the eve of the first game of the season in Bengaluru. Siraj will lead Gujarat's bowling attack against RCB on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-men-rob-walter-head-coach-2702484-2025-04-01",
      "headline": "Rob Walter steps down as South Africa men's head coachAfter signing a four-year deal with the Proteas, Rob Walter has put down his papers as the head coach of the South Africa men's white-ball teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-best-scouting-award-ashwani-kumar-mumbai-indians-shreevats-goswami-2702479-2025-04-01",
      "headline": "IPL should introduce Best Scouting Award: Ex-RCB starFormer India and RCB cricketer Shreevats Goswami has called for the introduction of a special award in the Indian Premier League to recognise the best scouting team each season, believing it would motivate franchises to take scouting more seriously and continue discovering fresh cricketing talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-charlotte-edwards-head-coach-england-2702461-2025-04-01",
      "headline": "MI coach replaces Jon Lewis as England Women's head coachEngland Women have named Charlotte Edwards as their new head coach, replacing Jon Lewis, who resigned from his position after the Ashes in Australia where they lost 0-16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-butter-autorickshaw-ride-bengaluru-rcb-vs-gt-2702457-2025-04-01",
      "headline": "IPL 2025: GT's Jos Buttler enjoys Bengaluru auto-ride ahead of RCB clashJos Buttler enjoyed a Bengaluru auto-rickshaw ride ahead of Gujarat Titans' IPL 2025 clash against Royal Challengers Bangalore, offering fans a candid glimpse of his off-field moments before the high-voltage showdown at Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/notre-dame-star-olivia-miles-declines-2025-wnba-draft-enters-transfer-portal-glbs-2702444-2025-04-01",
      "headline": "Notre Dame star Olivia Miles declines 2025 WNBA draft, enters transfer portalThe 2025 WNBA Draft has taken an unexpected turn as Notre Dame guard Olivia Miles has opted against turning pro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kai-trump-makes-bold-march-madness-predictions-picks-duke-and-uconn-as-champions-glbs-2702440-2025-04-01",
      "headline": "Kai Trump makes bold March Madness predictions, picks Duke and UConn as championsKai Trump, the 17-year-old granddaughter of former U.S. President Donald Trump, has entered the March Madness discussion with her predictions for the men's and women's NCAA basketball tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-lsg-vs-pbks-today-match-updates-lucknow-2702406-2025-04-01",
      "headline": "LSG vs PBKS Highlights: Punjab hammer Lucknow by 8 wicketsIPL 2025, Lucknow Super Giants (LSG) vs Punjab Kings (PBKS) Highlights: Punjab Kings clinch a dominating 8-wickets win over Lucknow Super Giants at the Ekana Stadium in Lucknow, credit to a brilliant 69-run knock by Prabhsimran Singh, topped off by an equally scintillating unbeaten 52 by Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-contract-list-updates-shreyas-iyer-ishan-kishan-rohit-sharma-virat-kohli-2702400-2025-04-01",
      "headline": "BCCI contracts: Shreyas Iyer set to return, Ishan Kishan likely to wait longerPunjab Kings captain Shreyas Iyer is set to regain his annual retainership contract after having lost it last year. Wicketkeeper-batter Ishan Kishan might have to wait longer to regain his contract despite having played a full season of domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rovman-powell-captaincy-sacking-dwayne-bravo-west-indies-cricket-board-2702361-2025-04-01",
      "headline": "Justice for Rovman Powell: Dwayne Bravo blasts West Indies board over captaincy changeDwayne Bravo slammed the West Indies cricket board for sacking Rovman Powell as the captain of the T20I side despite his impressive record as skipper. Powell was replaced by Shai Hope as the new T20I captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-gabe-vincent-and-dorian-finney-smith-make-history-for-lakers-against-rockets-glbs-2702322-2025-04-01",
      "headline": "NBA: Gabe Vincent and Dorian Finney-Smith make history for Lakers against RocketsThe Los Angeles Lakers defeated the Houston Rockets in a thriller, 104-98, on Monday, March 31, at Crypto.Com Arena. Bench duo Gabe Vincent and Dorian Finney-Smith had a top-flight shooting performance."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}