{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-300-points-lower-nifty-above-25900-lt-gains-2-percent-2834812-2025-12-12",
      "headline": "Sensex opens 300 points higher, Nifty above 25,900; L&T gains 2%Sensex opens 300 points lower, Nifty above 25,900; L&T gains 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-review-rs-10602-crore-price-band-gmp-subscribe-skip-details-2834808-2025-12-12",
      "headline": "ICICI Prudential IPO opens for bidding today: Subscribe or skip?ICICI Prudential AMC opens its highly anticipated IPO for public subscription, offering an opportunity for investors to consider entry into one of India's largest asset management companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-salary-cut-labour-ministry-explain-pf-wage-ceiling-not-affect-take-home-pay-under-new-labour-codes-2834798-2025-12-12",
      "headline": "Will the new PF wage rules really leave your take-home salary unchanged?Many salaried workers had feared that their net monthly income would reduce because the new codes require basic pay and related components to make up at least 50% of total salary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-free-trade-agreement-trade-talks-glbs-2834751-2025-12-12",
      "headline": "US should sign free trade agreement if happy with India's offer: Piyush GoyalCommerce Minister Piyush Goyal said the US should sign the free trade agreement with India if satisfied with New Delhi's proposals. The ongoing talks aim to boost bilateral trade and deepen strategic ties between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-pranav-adani-vision-bold-plan-we-invest-where-no-one-else-does-dharavi-redevelopment-infra-growth-india-2834741-2025-12-12",
      "headline": "We invest where no one else does: Pranav Adani outlines bold 2026 planPranav Adani said infrastructure will be the backbone of this journey. Roads, airports, ports, energy, utilities and sustainable urban living will play a big role in India's next phase of expansion, and this is where the group is sharply focused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/we-are-moving-towards-5-trillion-dollar-economy-pranav-adani-2834711-2025-12-11",
      "headline": "We are moving towards 5 trillion dollar economy: Pranav AdaniIn his first-ever television interview, Pranav Adani, Managing Director of Adani Enterprises, spoke to Aaj Tak about the Group's vision for 2026 and beyond. He highlighted the 'optimism' surrounding India's journey towards a $5 trillion and eventually a $10 trillion economy, emphasising the critical role of infrastructure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-427-points-higher-nifty-settles-below-25900-adani-enterprises-up-nearly-3-2834450-2025-12-11",
      "headline": "Sensex, Nifty break losing streak as US Fed rate cut boosts market sentimentsThe S&P BSE Sensex rose 426.86 points to end at 84,818.13, while the NSE Nifty50 climbed 140.55 points to 25,898.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-share-price-buy-sell-hold-expert-review-upcoming-outlook-results-2834444-2025-12-11",
      "headline": "Eternal stock slides 5% in a month: Should investors worry or look for an entry?The share price has seen sharp swings during the year, hitting a peak of Rs 368.45 on October 15 before correcting in the last quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-next-global-hotspot-luxury-real-estate-investment-2834387-2025-12-11",
      "headline": "Why India is the next global hotspot for luxury real estate investmentThe profile of the Indian homebuyer is changing in ways that directly favour the luxury segment. Millennials, who grew up with global exposure, digital access, and rising professional mobility, prefer premium homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meesho-surges-over-50-on-listing-day-what-investors-should-watch-out-for-next-2834365-2025-12-11",
      "headline": "Meesho's stellar debut has Dalal Street abuzz. What should investors watch next?A 50 percent listing pop has put Meesho in the spotlight, yet the real question now is whether its cost edge and logistics scale can hold as the value-ecommerce battle intensifies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-cut-how-the-move-shapes-global-markets-and-india-2834337-2025-12-11",
      "headline": "US Fed rate cut: How the move shapes global markets and IndiaThe Fed's third rate cut steadies some nerves and tests others, raising fresh questions on growth, liquidity and currency pressures, but what do these shifting global cues ultimately mean for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-tech-microsoft-intel-google-amazon-billions-investment-india-ai-trump-snub-2834269-2025-12-11",
      "headline": "India's big AI moment as Big Tech gives big snub to TrumpOver the last few weeks, tech giants like Microsoft and Amazon have pledged investments of more than $68 billion (about Rs 6.12 lakh crore), mostly in AI. It is hardly the picture of a 'dead economy' that Trump painted as Big Tech doubles down on India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eggoz-cancer-causing-eggs-social-media-heat-lab-test-report-fssai-nitrofuran-level-2834280-2025-12-11",
      "headline": "Eggoz faces social media heat over viral cancer claims: All you need to knowEggoz Nutrition, a brand that has built its reputation on selling fresh, chemical-free eggs, found itself at the centre of a storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/silver-price-rs-2-lakh-mark-december-gold-what-to-expect-2834278-2025-12-11",
      "headline": "Silver shines brighter than gold: Is the Rs 2 lakh mark now within reach?Silver prices have already scaled fresh highs around Rs 1.93 lakh, supported by surging industrial demand, a softer dollar and a wave of technical breakouts that analysts say could push the metal higher in the coming sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-delays-ais-mismatches-stricter-cpc-screening-2834245-2025-12-11",
      "headline": "ITR refunds running late? Here's why many taxpayers are waiting longer this yearTaxpayers have reported delays in receiving income tax refunds, with many cases marked as 'under processing' for months. Experts say stricter scrutiny, data mismatches, and a heavy processing backlog are the main factors behind the slowdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-edge-higher-as-markets-react-to-us-fed-rate-cut-2834233-2025-12-11",
      "headline": "Sensex, Nifty edge higher as markets react to US Fed rate cutBenchmark indices in India showed modest gains following the US Federal Reserve's third rate cut of the year. Analysts recommend caution despite easing volatility, citing both global and technical factors that could impact market direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-where-to-invest-large-vs-mid-vs-small-cap-hdfc-securities-md-ceo-dheeraj-relli-2834222-2025-12-11",
      "headline": "Large vs mid vs small cap: What makes sense for your money in a falling marketExperts expect small-cap and mid-cap stocks to outperform as the broader market stabilises. Since most retail investors hold a larger share of their portfolios in these two categories, any rebound is likely to directly benefit them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-ceo-lip-bu-tan-internal-deals-corruption-personal-wealth-growth-report-rivos-ai-chips-2834208-2025-12-11",
      "headline": "Intel's deals helped boost CEO Lip-Bu Tan's personal fortune, says reportThe report detailed how Tan's dual roles as Intel's CEO and a venture capitalist have led to potential conflicts of interest involving several of his portfolio companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-trade-deal-offer-best-ever-tough-nut-to-crack-us-representative-talks-negotiations-agriculture-dairy-2834197-2025-12-11",
      "headline": "India offering best-ever trade deal, but tough nut to crack: US officialThe US and India have opened critical trade talks in New Delhi, with India presenting its best market access offer yet, according to US Trade Representative Jamieson Greer. The discussions aim to resolve tariff disputes and firm up a trade deal between the two countries."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-cheers-aditya-dhar-dhurandhar-what-a-mammoth-task-hats-off-2834801-2025-12-12",
      "headline": "Vicky Kaushal cheers Aditya Dhar's Dhurandhar: What a mammoth task, hats off! Vicky Kaushal added his endorsement to Ranveer Singh's Dhurandhar, congratulating the cast and crew on its technical excellence and box office achievements. He also gave a special shout-out to his Uri director Aditya Dhar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shefali-shah-shares-sweet-dance-with-filmmaker-husband-vipul-on-25th-anniversary-2834789-2025-12-12",
      "headline": "Shefali Shah shares sweet dance with filmmaker husband Vipul on 25th anniversary Shefali Shah celebrates her 25th wedding anniversary with filmmaker husband Vipul Amrutlal Shah, sharing a heartfelt video of the couple dancing together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/akhanda-2-review-when-logic-leaves-the-theatre-and-boyapati-balakrishna-takes-over-2834762-2025-12-12",
      "headline": "Akhanda 2 review: When logic leaves theatre and Boyapati, Balakrishna take overRelease Date:Fri Dec 12, 2025 Akhanda 2: Thaandavam doesn't just continue the Boyapati–Balakrishna universe, it amplifies it into a realm where logic fearfully steps aside, divinity takes centre stage, and one man with a trishul becomes the entire security apparatus of the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/love-me-love-me-makers-announce-full-cast-for-wattpad-hit-young-adult-adaptation-2834775-2025-12-12",
      "headline": "Love Me Love Me makers announce full cast for Wattpad's hit young adult adaptation Love Me Love Me has revealed its full cast as Prime Video brings Stefania S's hit Wattpad series to life in a 2026 global release. The young adult romance follows June, a teen rebuilding her life in Italy while navigating love, secrets and hidden tensions at an elite school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-at-75-the-superstar-who-still-belongs-to-the-common-man-2834546-2025-12-12",
      "headline": "Rajinikanth at 75: The superstar who still belongs to the common man As the superstar turns 75 on December 12, the question is no longer: How big is Rajinikanth? It is: How has he managed to be this big for this long and still feel like one of us?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kylie-reacts-to-travis-kelces-viral-comment-about-never-arguing-with-taylor-swift-2834763-2025-12-12",
      "headline": "Kylie reacts to Travis Kelce's viral comment about never arguing with Taylor Swift Kylie Kelce reacted humorously to Travis Kelce's claim that he and Taylor Swift have \"never once\" argued, saying real relationships naturally have disagreements. She also joked about Jason Kelce staying silent during the discussion, noting that after eight years of marriage, he definitely couldn't say the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/dhurandhar-banned-gulf-countries-anti-pakistan-theme-glbs-2834759-2025-12-12",
      "headline": "Six Gulf nations ban Ranveer Singh's Dhurandhar over anti-Pakistan theme: Report Ranveer Singh's spy thriller Dhurandhar has been banned in six Gulf countries due to its anti-Pakistan messaging. Despite the ban, the film continues to perform strongly at the Indian box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saali-mohabbat-review-tisca-chopras-film-is-a-blend-of-suspense-and-emotion-2833726-2025-12-12",
      "headline": "Saali Mohabbat review: Tisca Chopra's film is a blend of suspense and emotionRelease Date:Fri Dec 12, 2025 Behind closed doors, nothing is what it seems. Saali Mohabbat, led by Radhika Apte, is a chilling peek into love, betrayal, and buried truths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supergirl-trailer-milly-alcock-leads-a-fierce-high-stakes-dc-saga-2834720-2025-12-11",
      "headline": "Supergirl trailer: Milly Alcock leads a fierce, high-stakes DC saga DC and James Gunn have unveiled the first trailer for 'Supergirl', featuring Milly Alcock as Kara Zor-El. The film, set for a June 2026 release, explores a darker origin and new adventures for the iconic character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-mourns-dharmendra-he-came-from-a-small-village-just-like-me-2834705-2025-12-11",
      "headline": "Kangana Ranaut mourns Dharmendra: He came from a small village, just like me Actor and politician Kangana Ranaut paid tribute to Bollywood icon Dharmendra at his prayer meet in New Delhi on December 11. Addressing the gathering, she talked about his inspiring journey and expressed support to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-on-paparazzi-we-use-them-when-we-need-to-promote-our-films-2834681-2025-12-11",
      "headline": "Huma Qureshi on paparazzi: We use them when we need to promote our films Actor Huma Qureshi shared insights into her nuanced relationship with the paparazzi at Agenda Aaj Tak 2025. She also spoke about her career challenges, not being part of any industry group and a new production venture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-shuts-down-talk-of-rift-with-irrfan-khan-that-was-just-news-2834668-2025-12-11",
      "headline": "Nawazuddin shuts down talk of rift with Irrfan Khan: That was just news Nawazuddin Siddiqui has dismissed long-standing speculation regarding a rift with Irrfan Khan. He highlighted that their professional history and personal rapport extended beyond their collaboration in the film 'The Lunchbox'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-hosts-prayer-meet-for-dharmendra-in-delhi-amit-shah-om-birla-attend-2834628-2025-12-11",
      "headline": "Hema Malini hosts prayer meet for Dharmendra in Delhi: Amit Shah, Om Birla attend Hema Malini hosted a prayer meeting for Dharmendra in New Delhi on Thursday. Several prominent figures from the political sphere, including Amit Shah, Om Birla and Kangana Ranaut, along with other personalities, paid their last respects to the veteran actor at the gathering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telangana-high-court-strikes-down-akhanda-2-ticket-hike-special-show-approval-2834612-2025-12-11",
      "headline": "Fresh blow to Akhanda 2 as Telangana High Court blocks ticket hike, special shows The premiere shows of Akhanda 2: Thaandavam face uncertainty after the Telangana High Court cancelled ticket price hikes and special shows. Starring Nandamuri Balakrishna, the film is set to hit theatres on December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-behind-the-scenes-video-by-soundarya-sparks-rajinikanth-birthday-buzz-2834608-2025-12-11",
      "headline": "Padayappa behind-the-scenes video by Soundarya sparks Rajinikanth birthday buzz A day ahead of Rajinikanth's birthday, Soundarya Rajinikanth has shared a special behind-the-scenes video from an interview for 'Padayappa'. The movie is scheduled to re-release in theatres on December 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-wife-2-priyamani-announces-new-season-of-her-legal-tamil-drama-2834570-2025-12-11",
      "headline": "Good Wife 2: Priyamani announces new season of her legal Tamil drama JioHotstar's South Unbound event in Chennai introduced a major lineup of 25 new regional originals, including Good Wife Season 2 with Priyamani. The show also stars Sampath Raj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/masterchef-india-comeback-date-platform-viewing-details-vikas-khanna-ranveer-brar-kunal-kapur-2834553-2025-12-11",
      "headline": "MasterChef India comeback: Date, platform and viewing details inside The popular cooking competition show 'MasterChef India' is set to return on Indian television. Featuring judges Vikas Khanna, Ranveer Brar, and Kunal Kapur, the upcoming season adopts the theme 'Pride of India.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-shoots-with-imtiaz-ali-gives-a-peek-into-his-430-am-punjab-routine-2834488-2025-12-11",
      "headline": "Diljit Dosanjh shares his 4 am routine as he begins new project with Imtiaz Ali Diljit Dosanjh's behind-the-scenes look at his work in Punjab offers insight into his daily routine and the significance of his recent Emmy-nominated film with Imtiaz Ali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lionel-messi-visit-kolkata-shah-rukh-khan-meet-argentina-football-legend-2834486-2025-12-11",
      "headline": "Shah Rukh Khan to meet Lionel Messi in Kolkata on December 13 Shah Rukh Khan has confirmed he will meet football star Lionel Messi during Messi's much-anticipated visit to Kolkata on December 13. The city is preparing for a grand welcome, with several high-profile events and dignitaries expected to attend."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-sets-its-own-air-norms-who-guidelines-only-advisory-centre-parliament-2834777-2025-12-12",
      "headline": "India sets own norms, WHO guidelines only advisory: Centre on air qualityWhile addressing the Rajya Sabha, Minister of State for Environment Kirti Vardhan Singh said WHO guidelines are only meant to help nations frame their own standards, factoring in geography, environmental conditions and local circumstances."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/former-home-minister-and-congress-leader-shivraj-patil-dies-at-90-at-his-home-in-maharashtra-2834811-2025-12-12",
      "headline": "Former Union Home Minister and Lok Sabha Speaker Shivraj Patil dies at 90The veteran Congress leader was suffering from a brief period of illness and breathed his last on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/to-de-indianise-us-companies-top-pollster-mark-mitchell-plans-consultancy-rasmussen-reports-american-polling-company-2834656-2025-12-11",
      "headline": "To de-Indianise US companies, top pollster Mark Mitchell plans to start consultancyMark Mitchell, CEO of a leading US polling firm, Rasmussen Reports, has criticised the H-1B visa programme, saying he wants to launch a consultancy to \"de-Indianise\" American companies. His comments come amid renewed scrutiny of foreign tech workers under Trump's second term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/explained-winners-and-losers-of-mexicos-new-tariff-strike-on-india-2834661-2025-12-12",
      "headline": "Explained: Winners and losers of Mexico's new tariff strike on India Starting January 1, 2026, Mexico will impose tariffs of 5%–50% on 1,460 products from non-FTA countries, targeting cheap Chinese imports but severely impacting India's auto, steel, textile, and chemical exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/build-for-generations-pranav-adani-maps-30-trillion-india-and-dharavi-revival-2834747-2025-12-12",
      "headline": "From ports to Dharavi: Pranav Adani reveals group's long-horizon India planIn an expansive first-ever TV interview, the director of Adani Enterprises laid out a full board of strategic priorities – from seaport benchmarks and airport capacity to Dharavi rehabilitation, 50-year infrastructure horizons, and a bullish bet on renewable energy, along with major projects in Opposition-ruled states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-vs-uddhav-thackeray-over-impeachment-motion-against-judge-over-deepam-row-2834753-2025-12-12",
      "headline": "Amit Shah vs Uddhav Thackeray over impeachment motion against judge in deepam rowThe flashpoint between Shiv Sena (UBT) chief Uddhav Thackeray and Union Home Minister Amit Shah is the move by INDIA bloc to impeach Justice GR Swaminathan of the Madras High Court over the lamp lighting row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/dhurandhar-banned-gulf-countries-anti-pakistan-theme-glbs-2834759-2025-12-12",
      "headline": "Six Gulf nations ban Ranveer Singh's Dhurandhar over anti-Pakistan theme: ReportRanveer Singh's spy thriller Dhurandhar has been banned in six Gulf countries due to its anti-Pakistan messaging. Despite the ban, the film continues to perform strongly at the Indian box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-artefacts-stolen-uk-museum-glbs-2834743-2025-12-12",
      "headline": "Indian artefacts among 600 British Empire items stolen in major UK museum burglaryThe collection, which documents Britain's historical ties with countries across the former empire, includes objects dating back to the late 19th century. Police said some of the stolen material carries major cultural significance, with Indian artefacts among the items targeted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/indigo-parent-company-tickets-flight-status-air-deccan-cheap-tickets-air-deccan-interglobe-aviation-history-airbus-dgca-2834694-2025-12-12",
      "headline": "Why founder of India's first low-cost airline accused IndiGo parent of sabotageCaptain R Gopinath brought Air Deccan in 2003 and introduced the LCC (low-cost carrier) model to India. But he had to sell Air Deccan to Vijay Mallya under pressure from investors after the airline made losses. Gopinath, the pioneer of budget air travel in India, blamed InterGlobe Aviation, IndiGo's parent company, for sabotaging Air Deccan. This is how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-speaks-to-trump-highlights-importance-of-shared-efforts-to-enhance-bilateral-trade-amid-tariff-tensions-2834640-2025-12-11",
      "headline": "Very warm conversation: PM, Trump discuss trade, defence amid tariff tensionsDuring the conversation, both PM Modi and Trump emphasised the need to maintain momentum in their shared efforts to enhance bilateral trade. Both expressed satisfaction at the steady strengthening of bilateral cooperation across all domains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-president-shahabuddin-sidelined-by-yunus-government-glbs-2834734-2025-12-11",
      "headline": "Humiliated, sidelined: Bangladesh President wants to quit mid-termBangladesh President Mohammed Shahabuddin expresses desire to leave office after feeling humiliated by the Yunus-led interim administration. He was elected unopposed in 2023 for a five-year term as the nominee of Hasina's Awami League, which has since been barred from contesting the 12 February election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/dhurandhar-akshaye-khanna-singlehood-carefree-life-india-2834394-2025-12-12",
      "headline": "What Akshaye Khanna said about marriage 14 years ago is India's reality todayIn a now-viral 14-year-old interview, Akshaye Khanna said he preferred a carefree, responsibility-free life and therefore did not want to marry. Today, many Indians find themselves living out those very views, choosing to remain single to protect their emotional well-being and prioritise their careers and ambitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nine-dead-after-bus-carrying-35-passengers-falls-into-gorge-in-andhra-pradeshs-chintur-2834791-2025-12-12",
      "headline": "9 dead after bus carrying 35 passengers falls into gorge in Andhra PradeshThe bus carrying 35 passengers lost control on the Chinturu-Bhadrachalam ghat road, plunging into a gorge. Nine died, and several others were trapped as rescue operations continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-mourns-dharmendra-he-came-from-a-small-village-just-like-me-2834705-2025-12-11",
      "headline": "Kangana Ranaut mourns Dharmendra: He came from a small village, just like meActor and politician Kangana Ranaut paid tribute to Bollywood icon Dharmendra at his prayer meet in New Delhi on December 11. Addressing the gathering, she talked about his inspiring journey and expressed support to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-pranav-adani-vision-bold-plan-we-invest-where-no-one-else-does-dharavi-redevelopment-infra-growth-india-2834741-2025-12-12",
      "headline": "We invest where no one else does: Pranav Adani outlines bold 2026 planPranav Adani said infrastructure will be the backbone of this journey. Roads, airports, ports, energy, utilities and sustainable urban living will play a big role in India's next phase of expansion, and this is where the group is sharply focused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/akhanda-2-review-when-logic-leaves-the-theatre-and-boyapati-balakrishna-takes-over-2834762-2025-12-12",
      "headline": "Akhanda 2 review: When logic leaves theatre and Boyapati, Balakrishna take overRelease Date:Fri Dec 12, 2025Akhanda 2: Thaandavam doesn't just continue the Boyapati–Balakrishna universe, it amplifies it into a realm where logic fearfully steps aside, divinity takes centre stage, and one man with a trishul becomes the entire security apparatus of the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-free-trade-agreement-trade-talks-glbs-2834751-2025-12-12",
      "headline": "US should sign free trade agreement if happy with India's offer: Piyush GoyalCommerce Minister Piyush Goyal said the US should sign the free trade agreement with India if satisfied with New Delhi's proposals. The ongoing talks aim to boost bilateral trade and deepen strategic ties between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiahs-air-travel-cost-karnataka-rs-47-crore-bjp-questions-his-socialist-image-2834735-2025-12-11",
      "headline": "Rs 47 crore spent on Siddaramaiah's air travel, BJP questions his 'socialist' imageAccording to the official data placed before the Council, the government booked 181 helicopter and special flight trips during this period—180 for the Chief Minister and one for Governor Thaawarchand Gehlot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-tickets-isl-aiff-2834745-2025-12-12",
      "headline": "Messi's visit brings spotlight, but Indian football has nothing to show forLionel Messi is visiting India for the GOAT tour. How ironic is it that the greatest of all time is coming to the country at a time when Indian football is at its worst possible state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-at-75-the-superstar-who-still-belongs-to-the-common-man-2834546-2025-12-12",
      "headline": "Rajinikanth at 75: The superstar who still belongs to the common manAs the superstar turns 75 on December 12, the question is no longer: How big is Rajinikanth? It is: How has he managed to be this big for this long and still feel like one of us?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/panna-friends-find-diamond-worth-rs-50-lakh-madhya-pradesh-mining-auction-2834237-2025-12-11",
      "headline": "2 Madhya Pradesh friends find diamond worth Rs 50 lakh after digging for 20 daysTwo young miners in Madhya Pradesh's Panna district uncovered a 15.34-carat gem-grade diamond worth over Rs 50 lakh barely weeks after starting work, a find now verified by officials and headed for auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-assam-demographic-invasion-muslim-population-warning-2834730-2025-12-11",
      "headline": "Once Muslims cross 50%, others won't survive: Himanta Sarma on Assam's demographyAssam CM Himanta Biswa Sarma warned of a \"demographic invasion,\" claiming other communities would not \"survive\" if the Muslim population exceeds 50% in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/birch-by-romeo-lane-nightclub-fire-luthra-brothers-return-to-india-delayed-passport-revocation-slows-repatriation-2834788-2025-12-12",
      "headline": "Luthra brothers' return to India delayed as passport revocation slows repatriationSaurabh and Gaurav Luthra, owners of the 'Birch by Romeo Lane' nightclub in Goa where 25 people lost their lives in a deadly blaze, were detained in Phuket five days after fleeing the country in the wake of the tragic incident."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nikhil-chaudhary-ipl-virat-kohli-exclusive-interview-australia-big-bash-2834417-2025-12-12",
      "headline": "Idolising Virat Kohli, Nikhil Chaudhary dreams IPL stint with RCB legend In an exclusive interview with India Today Digital, Nikhil Chaudhary spoke about his admiration for Virat Kohli and Kevin Pietersen, and shared his dream of representing Royal Challengers Bangalore in the Indian Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ryan-ten-doeschate-on-suryakumar-yadav-shubman-gill-poor-t20i-form-2026-world-cup-2834796-2025-12-12",
      "headline": "Gill, Suryakumar's form not a concern, they'll come good soon: Assistant coach India assistant coach Ryan ten Doeschate has defended captain Suryakumar Yadav and vice-captain Shubman Gill amid their poor T20I form. He expressed confidence that both players will regain form ahead of the 2026 T20 World Cup set to be hosted in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-shubman-gill-fixation-t20-world-cup-threat-2834790-2025-12-12",
      "headline": "Is Gautam Gambhir's fixation on Shubman Gill threatening India's T20 World Cup defence? IND vs SA, 2nd T20I: Gautam Gambhir's persistence with out-of-form Shubman Gill alongside Abhishek Sharma as India's openers has intensified concerns that India's T20 World Cup title defence may be undermined by stubborn selection and ignored warning signs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/finnish-football-stadium-fire-fc-haka-teenagers-club-relegation-investigation-2834776-2025-12-12",
      "headline": "Teenagers set Finnish football stadium ablaze after club suffers relegation A historic Finnish football venue now lies partly in ruins after a teen admitted to triggering the fire that destroyed FC Haka's stand. The incident deepened the club's turmoil just weeks after their relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-vs-nick-kyrgios-battle-of-sexes-billie-jean-king-slams-dubai-match-2834773-2025-12-12",
      "headline": "Billie Jean King slams Sabalenka vs Kyrgios Battle of sexes as stars stand firm Billie Jean King's criticism has intensified debate around the Sabalenka–Kyrgios exhibition, but the players remain unfazed. With both stars backing the event, the Battle of the Sexes clash is set to draw global attention in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-rodrygo-manchester-city-praise-real-madrid-uefa-champions-league-2834770-2025-12-12",
      "headline": "Pep Guardiola praises Real Madrid's Rodrygo amid rising Manchester City transfer buzz Pep Guardiola's praise for Rodrygo arrived at a moment when transfer talk around the Brazilian is heating up again. With City previously attempting a move, the admiration now carries layers far beyond a routine post-match compliment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/acc-mens-u19-asia-cup-dubai-teams-schedule-live-streaming-squads-2834642-2025-12-12",
      "headline": "U19 Men's Asia Cup 2025: Squads, schedule and all you need to know The ACC Men's U19 Asia Cup 2025 kicks off on 12 December in Dubai with eight teams vying for regional supremacy and showcasing Asia's next generation of cricket talent. Bangladesh are the defending champions while India and Pakistan are among the other contenders to lift the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-tickets-isl-aiff-2834745-2025-12-12",
      "headline": "Messi's visit brings spotlight, but Indian football has nothing to show for Lionel Messi is visiting India for the GOAT tour. How ironic is it that the greatest of all time is coming to the country at a time when Indian football is at its worst possible state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-suryakumar-yadav-axar-patel-no3-mullanpur-2834738-2025-12-12",
      "headline": "Did India promote Axar Patel to No. 3 to mask Suryakumar Yadav's failures? Robin Uthappa and Dale Steyn slammed India for sending in Axar Patel instead of Suryakumar Yadav during the Mullanpur T20I loss to South Africa. Axar's promotion failed as he scored just 21 off 21 while chasing a target of 214. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-2026-world-cup-ticket-prices-fan-backlash-2834744-2025-12-12",
      "headline": "FIFA accused of monumental betrayal as fans protest expensive World Cup tickets FIFA has been urged to halt World Cup ticket sales after it emerged that countries' most loyal fans faced paying extortionate prices for tickets, with the cheapest seats for the final costing over Rs 3.77 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-defend-axar-patel-promotion-south-africa-beat-india-2nd-t20i-2834729-2025-12-11",
      "headline": "Suryakumar defends India's decision to promote Axar at No.3 in Mullanpur lossIND vs SA, 2nd T20I: India captain Suryakumar Yadav defended the decision to promote Axar Patel to No. 3 despite India's 51-run defeat to South Africa in the 2nd T20I. South Africa leveled the T20I series 1-1 with a 51-run win in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/kolkata-ready-for-messi-70ft-statue-srk-and-sourav-ganguly-to-welcome-legend-ytvd-2834713-2025-12-11",
      "headline": "Kolkata Ready for Messi: 70ft Statue, SRK and Sourav Ganguly to Welcome LegendIn this Special Report, India Today's Anirban Sinha Roy reports on Kolkata's grand preparations for Lionel Messi. The football icon arrives on Saturday for a historic visit. A 70-foot statue, commissioned by West Bengal Minister Sujit Basu and crafted by artist Monty Pal, awaits him. The reporter notes, 'The football crazy city Kolkata is all gearing up for the grand welcome.' The main event at Vivekananda Yuvabharti Krirangan will see Chief Minister Mamata Banerjee, Sourav Ganguly, and Shah Rukh Khan felicitate the legend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-t20i-mullanpur-match-report-de-kock-90-india-collapse-2834710-2025-12-11",
      "headline": "Failed experiments, De Kock carnage: South Africa level series as India capitulateIND vs SA, 2nd T20I: Quinton de Kock's batting carnage and India's failed on-field experiments combined to script a disappointing 51-run defeat for the hosts in the second T20I in Mullanpur on Thursday, December 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-t20i-axar-patel-promotion-no-3-indian-team-management-slammed-2834690-2025-12-11",
      "headline": "Why send Axar at No. 3? Indian team management slammed for batting order shuffleIndia coach Gautam Gambhir's decision to promote Axar Patel up the order backfired spectacularly in the second T20I against South Africa in Mullanpur, triggering widespread criticism and fresh scrutiny of the team's muddled batting approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-golden-duck-india-vs-south-africa-second-t20i-gautam-gambhir-2834684-2025-12-11",
      "headline": "Shubman Gill fails again: Fans accuse Gambhir of favouritism in India's T20I teamIND vs SA, 2nd T20I: Shubman Gill failed to open his account in the Mullanpur T20I after Lungi Ngidi claimed his crucial wicket. Fans lashed out at Gautam Gambhir and the selection panel for favouritism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-arshdeep-wicketless-india-vs-south-africa-2nd-t20i-2025-2834680-2025-12-11",
      "headline": "Mullanpur horror for Bumrah, Arshdeep: India pacers leaks runs, go wicketlessJasprit Bumrah and Arshdeep Singh had a rare off day at the office as both men went wicketless and leaked runs against South Africa in the second T20I in Mullanpur. South Africa ended up scoring 213 as the Indian bowlers struggled with dew. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-credits-wpl-for-india-world-cup-win-pay-parity-urged-2834588-2025-12-11",
      "headline": "Everyone was criticising our team: Jemimah says WPL fuelled India's World Cup pushJemimah Rodrigues credited the Women's Premier League for elevating India's performance and helping them win the historic Women's World Cup. Shafali Verma, meanwhile, called for pay parity at the domestic level to better nurture the next generation of women cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-t20i-jitesh-sharma-deny-quinton-de-kock-hundred-mullanpur-2834669-2025-12-11",
      "headline": "Jitesh Sharma conjures magic behind stumps to deny Quinton de Kock hundredIND vs SA, 2nd T20I: Jitesh Sharma conjured a stunning piece of wicketkeeping to halt Quinton de Kock's blazing innings and deny the South African opener what appeared to be a certain hundred in the second T20I in Mullanpur on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-frustrated-arshdeep-singh-seven-wides-t20i-south-africa-2834659-2025-12-11",
      "headline": "Furious Gautam Gambhir caught on camera after Arshdeep bowls 7 wides in an overIND vs SA: Head coach Gautam Gambhir lost his cool as Arshdeep Singh bowled seven wides to complete the 11th over against South Africa on Thursday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-stance-india-pakistan-u19-asia-cup-handshake-policy-2834643-2025-12-11",
      "headline": "No handshakes again? ICC reveals stance for India vs Pakistan U19 Asia Cup clashThe ICC has revealed their stance for the upcoming India vs Pakistan clash in the U19 Asia Cup as the handshake debate resurfaces. Indian players have refused to shake hands with their Pakistani counterparts in major tournaments since the Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-harmanpreet-kaur-honoured-stadium-stands-mullanpur-punjab-2834607-2025-12-11",
      "headline": "Yuvraj Singh and Harmanpreet Kaur stands unveiled at Mullanpur StadiumIND vs SA: Yuvraj Singh and Harmanpreet Kaur had stadium stands named after them at the Mullanpur venue on December 11, where Punjab Chief Minister Bhagwant Mann felicitated the two stars.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/atherton-slams-mccullum-overprepared-claim-ashes-2025-england-2834606-2025-12-11",
      "headline": "Overprepared? McCullum's Ashes claim called tone deaf by former England captainFormer England captain Michael Atherton slammed Brendon McCullum's claim of overpreparing for the pink-ball Test as a bit tone deaf. England were comprehensively beaten during the pink-ball Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kohli-pant-named-delhi-squad-vijay-hazare-trophy-2025-26-2834574-2025-12-11",
      "headline": "Kohli, Pant named in Delhi's provisional squad for Vijay Hazare TrophyVirat Kohli and Rishabh Pant have been named in the Delhi provisional squad for the Vijay Hazare Trophy, the DDCA announced on Thursday, December 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-ticket-sale-where-to-buy-cost-all-you-need-to-know-2834542-2025-12-11",
      "headline": "T20 World Cup 2026 tickets go live: Where to buy, how much they costThe International Cricket Council (ICC) has announced that ticket sales for the T20 World Cup 2026 will go live on Thursday, with fans able to purchase them via https://tickets.cricketworldcup.com."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-stars-back-xabi-alonso-rodrygo-bellingham-courtois-2834531-2025-12-11",
      "headline": "Amid rumours of sacking, Real Madrid stars back manager Xabi AlonsoReal Madrid stars Rodrygo, Jude Bellingham and Thibaut Courtois came to the defence of Xabi Alonso as the Real Madrid boss is under serious scrutiny. Rumours are suggesting that Alonso's position is under serious scrutiny after a string of poor results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-live-score-ind-vs-sa-2nd-t20i-match-coverage-2834511-2025-12-11",
      "headline": "2nd T20I Highlights: IND (162-all-out), South Africa win by 51 runs in MullanpurIndia (IND) vs South Africa (SA) Highlights, 2nd T20I: South Africa win the second T20I and level the series 1-1. A superb knock from Quinton de Kock and a disciplined bowling performance help them win the 2nd T20I in Mullanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ab-de-villiers-warning-odi-batting-template-india-vs-south-africa-2834502-2025-12-11",
      "headline": "Is Gautam Gambhir right about batting orders being overrated? De Villiers weighs inAB de Villiers weighed in on India coach Gautam Gambhir's comment that batting orders in white-ball cricket are overrated. Gambhir made the remark following India's ODI series win against South Africa recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-interview-womens-world-cup-win-india-2834480-2025-12-11",
      "headline": "Shafali Verma: World Cup snub was tough, but god rewarded me for hard workShafali Verma missed out on India's initial Women's World Cup squad but came in as a replacement and went on to win the Player of the Match award in the final against South Africa in Navi Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jemimah-rodrigues-sunil-gavaskar-jamming-promise-interview-2834473-2025-12-11",
      "headline": "Jemimah says jam with Sunil Gavaskar soon, makes promise at Agenda AajTakAgenda AajTak: Jemimah Rodrigues said she will soon join the legendary Sunil Gavaskar for a jamming session. The Indian batter recently played a key role in helping India win the Women's World Cup."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}