{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bars-foreclosure-charges-on-floating-rate-loans-to-micro-small-businesses-2750292-2025-07-03",
      "headline": "RBI bars foreclosure charges on floating rate loans to micro, small businessesAccording to the new rules, no prepayment charges will be allowed on floating rate loans to MSEs or to individuals borrowing for business purposes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-poverty-income-inequality-ppp-mmrp-who-is-poor-world-bank-niti-aayog-2750057-2025-07-03",
      "headline": "How poor is 'poor' in India?Millions of Indians have exited extreme poverty, yet many still live one crisis away from hunger, debt, or despair. In this deep dive, we examine why poverty is retreating in numbers, but not in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-files-confidential-papers-for-ipo-to-raise-rs-4250-crore-report-2750174-2025-07-03",
      "headline": "Meesho files confidential papers for IPO to raise Rs 4,250 crore: ReportMeesho is a well-known player in India's booming e-commerce space, taking on giants like Amazon and Flipkart, with big global investors such as Prosus, Elevation Capital, WestBridge Capital, SoftBank, and Peak XV Partners backing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-settles-170-points-lower-nifty-below-25500-maruti-down-1-percent-2750131-2025-07-03",
      "headline": "Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%The S&P BSE Sensex was down by 170.22 points to end at 83,239.47, while the NSE Nifty50 fell by 48,10 points to close at 25,405.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/investing-mutual-fund-sip-regular-checks-money-management-portfolio-review-2750107-2025-07-03",
      "headline": "Don't set and forget: Why your SIPs need regular check-upsWhile the idea of 'set it and forget it' may seem peaceful, doing so could lead to long-term underperformance, missed opportunities, or even a shortfall in your retirement goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-and-ceo-nithin-kamath-cautions-investors-against-risks-in-unlisted-shares-2750088-2025-07-03",
      "headline": "Zerodha's Nithin Kamath cautions investors against risks in unlisted sharesNithin Kamath said that many people get carried away by the hype around buying shares of companies before they go public. But in reality, unlisted shares are risky and can leave investors stuck without a way to sell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crude-oil-wti-brent-forecast-middle-east-tension-iran-israel-conflict-sp-global-2750084-2025-07-03",
      "headline": "Has the oil market grown numb to conflict in the Middle East?Global oil demand growth in 2025 is on track to be just 870,000 barrels per day. This would make it the weakest year for oil demand since 2001, except during major economic disruptions like the 2008 financial crisis and the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-income-inequality-now-worse-than-british-era-says-financial-analyst-2750041-2025-07-03",
      "headline": "India's income inequality now worse than British era, says financial analystThe divide between India's rich and poor is bigger than ever, with almost half the people surviving on very little, while a privileged few hold most of the wealth, says Hardik Joshi, a financial analyst."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-ceo-sashidhar-jagdishan-moves-supreme-court-against-lilavati-hospital-fir-2749997-2025-07-03",
      "headline": "HDFC Bank CEO moves Supreme Court against Lilavati Hospital FIRThe clash between one of India's largest private banks and a big Mumbai hospital is linked to a financial transaction, but the exact details of the FIR or the amount involved were not shared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-itr-login-here-is-how-to-file-income-tax-using-net-banking-2749970-2025-07-03",
      "headline": "Lost your ITR login? Here's how to file income tax using net bankingIf you can't remember your Income Tax portal password, you don't need to reset it straight away. Most major banks in India allow you to access the e-Filing portal through their net banking services. It's a safe and easy way to file your return on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nestle-axis-bank-dividend-stock-ex-date-share-price-stock-market-july-3-2749960-2025-07-03",
      "headline": "Axis Bank, Nestle India set dividend record dates; last day to buy shares todayNestle India and Axis Bank have fixed July 4 as the record date, which will decide who is eligible to receive the dividend payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-3-nse-bse-trading-nykaa-rvnl-nestle-yes-bank-dmart-pnb-2749874-2025-07-03",
      "headline": "Stocks to watch on July 3: Nykaa, RVNL, Nestle, Yes Bank, Dmart, PNBInvestors are now watching company announcements for the April–June quarter results, while developments related to a possible trade deal between India and the United States are also being closely followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-allows-cab-aggregators-to-double-peak-hour-fares-under-new-guidelines-2749292-2025-07-02",
      "headline": "Ola, Uber get government okay for surge pricing, can charge double the base fareStates have been advised to implement the updated guidelines within the next three months. The revised fare structure is aimed at giving platforms flexibility during high-demand periods, while maintaining an overall regulatory framework for pricing and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-higher-nifty-above-25600-infosys-up-2-percent-us-india-trade-deal-it-shares-2749287-2025-07-02",
      "headline": "Sensex, Nifty open higher as IT stocks rally on hopes of US-India trade dealThe S&P BSE Sensex was up 103.13 points to 83,800.42, while the NSE Nifty50 added 21 points to 25,562.80 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financials-listing-share-price-gmp-signals-premium-market-debut-emkay-global-coverage-buy-rating-2749278-2025-07-02",
      "headline": "HDB Financials listing: GMP signals premium on market debut. Check hereThe company's shares will be listed on both the BSE and NSE. HDB Financial Services is a subsidiary of HDFC Bank and its IPO closed on June 27 with nearly 27 times the subscription."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-us-india-trade-deal-trading-setup-nse-bse-2749266-2025-07-02",
      "headline": "Stock market opening: Sensex, Nifty to rally over US-India trade deal?Gift Nifty futures, which are seen as an early indicator for Indian market openings, traded at 25,686.50 points at 8:24 am. This suggests that the Nifty 50 index could open higher than its previous closing level of 25,541.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-2-nse-bse-trading-hal-hyundai-maruti-suzuki-ril-rites-v-mart-2749258-2025-07-02",
      "headline": "Stocks to watch on July 2: HAL, Hyundai, Maruti Suzuki, RIL, RITES, V-MartHero MotoCorp reported a year-on-year rise in total sales by 10% to 5.54 lakh units in June, compared to 5.03 lakh units last year. Domestic sales rose by 6.9% to 5.25 lakh units. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-july-usd-24-billion-lg-hdb-reason-bse-nse-trading-upcoming-public-listings-2749017-2025-07-01",
      "headline": "July turns hot for IPOs as firms race to raise $2.4 billionFirms are gearing up to raise around $2.4 billion through initial public offerings (IPOs) in July. If this target is reached, it will mark the strongest IPO month since December 2023, following a solid $2 billion raised in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-blog-digital-india-10-years-linkedin-people-movement-2748806-2025-07-01",
      "headline": "Digital India turns 10, PM Modi says it's become a people's movementIn the blog titled 'A Decade of Digital India', on LinkedIn, PM Modi said the Digital India initiative is no longer just a government programme but a 'people's movement.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakondas-kingdom-release-postponed-again-new-date-to-be-announced-soon-2750265-2025-07-03",
      "headline": "Vijay Deverakonda's Kingdom release postponed again, new date to be announced soonA new release date for actor Vijay Deverakona's much-anticipated film 'Kingdom' will be announced soon. Film producer Naga Vamsi shared the latest update on his social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/paranthu-po-ram-mirchi-shiva-grace-antony-charming-family-film-joy-in-life-simple-things-2750270-2025-07-03",
      "headline": "Paranthu Po review: Charming family film teaches joy in life's simple thingsRelease Date:Fri Jul 04, 2025Paranthu Po movie review: Director Ram's 'Paranthu Po', starring Mirchi Shiva, Grace Antony and Mithul, is a profound story about self-discovery when you are busy running the city life. Without being too preachy, the film hits all the right notes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/is-the-traitors-seducing-new-india-through-deception-and-manipulation-karan-johar-apoorva-mukhija-purav-jha-2750079-2025-07-03",
      "headline": "Is The Traitors seducing new India through deception and manipulation?'The Traitors', which has already been renewed for the second season, celebrates lying and deception. Ahead of its finale tonight (July 3), here's decoding why the reality TV show is gaining popularity in India and its implications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/harshali-malhotra-bajrangi-bhaijaan-munni-to-make-a-south-debut-with-akhanda-2-2750167-2025-07-03",
      "headline": "Bajrangi Bhaijaan's Harshali Malhotra to make South film debut with Akhanda 2Harshali Malhotra, known as Munni from 'Bajrangi Bhaijaan', is making her South debut with 'Akhanda 2' alongside Nandamuri Balakrishna. She introduced her new role, Janani, through an Instagram post, marking her return to films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-reactions-alia-bhatt-karan-johar-and-sargun-mehta-share-excitement-2750141-2025-07-03",
      "headline": "Ramayana 1st glimpse: Alia Bhatt, KJo and Sargun Mehta share their excitementSeveral celebrities, including Alia Bhatt, Karan Johar and Sargun Mehta reacted to the first glimpse of the much-anticipated film 'Ramayana'. The film is slated for a theatrical release on Diwali 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-turns-25-smriti-irani-amar-upadhayay-ektaa-kapoor-get-nostalgic-2750205-2025-07-03",
      "headline": "Kyunki...turns 25: Smriti Irani, Amar Upadhayay, Ektaa Kapoor get nostalgic'Kyunki Saas Bhi Kabhi Bahu Thi' completed its 25-year run on July 3. On the special occasion, the cast, including Smriti Irani, Amar Upadhyay and Ektaa Kapoor shared their journey on the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-enjoy-strolling-on-london-streets-watch-viral-video-2750175-2025-07-03",
      "headline": "Anushka Sharma, Virat Kohli enjoy strolling on London streets. Watch viral videoA video of Anushka Sharma and Virat Kohli strolling on the London streets has emerged online. The two are currently holidaying in the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-paid-for-hollywood-walk-of-fame-star-all-you-need-to-know-about-the-process-2750128-2025-07-03",
      "headline": "Do actors pay for Hollywood Walk of Fame star? All about the processAfter the announcement of Deepika Padukone's latest Walk of Fame selection, many wonder about the process behind the recognition and whether celebs have to pay for it. Here's everything you need to know about it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-says-she-almost-didnt-audition-for-dangal-2750078-2025-07-03",
      "headline": "Exclusive: Fatima Sana Shaikh says she almost didn't audition for DangalFatima Sana Shaikh almost didn't audition for her breakthrough role in 'Dangal'. Her persistence and love for auditions continue to drive her career forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-review-with-ranbir-kapoor-yash-nitesh-tiwari-feels-like-a-moment-for-indian-cinema-2750117-2025-07-03",
      "headline": "Why Ranbir Kapoor-Yash's Ramayana feels like a moment for Indian cinemaNitesh Tiwari's 'Ramayana' is a cinematic moment shaped by faith, scale, and storytelling ambition. With Ranbir Kapoor, Sai Pallavi, Yash, and Sunny Deol leading a power-packed cast, the film dares to honour the epic as more than mythology. The first glimpse feels less like a teaser and more like the beginning of something historic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-turns-25-when-people-fell-at-ekta-kapoor-feet-cried-over-mihir-death-smriti-irani-2750111-2025-07-03",
      "headline": "Kyunki… turns 25: When people fell at Ekta Kapoor's feet, cried over Mihir's death'Kyunki Saas Bhi Kabhi Bahu Thi', the iconic Indian television show that redefined the small screen 25 years ago, is all set for a grand comeback with a new season. On the note, its creative director, Nivedita Basu, spoke to us discussing its relevance, craze and BTS moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-clash-with-aamir-khan-dil-hai-ke-manta-nahin-shoot-2750080-2025-07-03",
      "headline": "Anupam Kher recalls clash with Aamir Khan during Dil Hai Ke Manta Nahin shootAnupam Kher recalled a past disagreement with Aamir Khan during the shoot of 'Dil Hai Ke Manta Nahin', where Aamir criticised his scene interpretation. The actor shared the story while promoting his upcoming film 'Metro... In Dino', releasing on 4 July 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-background-score-gives-goosebumps-fans-praise-ranbir-kapoor-sai-pallavi-2750063-2025-07-03",
      "headline": "Ramayana 1st look: Fans praise Ranbir Kapoor, background score gives goosebumpsNitesh Tiwari's 'Ramayana's first glimpse is finally out. The film starring Ranbir Kapoor has given goosebumps to fans, with many praising the background score. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parag-tyagi-consoles-shefali-jariwala-father-at-prayer-meet-2750030-2025-07-03",
      "headline": "Parag Tyagi consoles Shefali Jariwala's father as he breaks down at prayer meetAn emotional video of late actor Shefali Jariwala's husband, Parag Tyagi, consoling her father has surfaced on social media. The video is from her prayer meeting held in Mumbai on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-not-first-indian-hollywood-walk-of-fame-meet-sabu-dastagir-elephant-boy-2750051-2025-07-03",
      "headline": "Deepika's honour is big, but she's not 1st Indian on Hollywood Walk of FameDeepika Padukone has been named a 2025 Hollywood Walk of Fame honouree. However, many don't know that the first Indian to receive this honour was Sabu Dastagir, a famous actor in Hollywood over 80 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumtaz-shammi-kapoor-love-affair-interview-wife-neila-devi-doesnt-like-her-talking-about-him-2749999-2025-07-03",
      "headline": "Actor Mumtaz says Shammi Kapoor's wife doesn't like her talking about himMumtaz recently shared that she doesn't talk about Shammi Kapoor to avoid upsetting his wife, Neila Devi. The couple worked together on several Bollywood classics, and were also in a relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-trailer-event-cancelled-in-hyderabad-sandhya-theatre-due-to-huge-fan-gathering-2750007-2025-07-03",
      "headline": "Hari Hara Veera Mallu trailer event cancelled in Hyderabad due to huge fan gatheringThe trailer screening event for 'Hari Hara Veera Mallu' at Hyderabad's Sandhya Theatre was cancelled due to an overwhelming turnout of fans raising safety concerns. Despite this, the trailer was released and screenings continued at other venues, generating excitement for the film's July 24 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-out-ranbir-kapoor-as-ram-sai-pallavi-sita-yash-ravana-nitesh-tiwari-2750026-2025-07-03",
      "headline": "Ramayana 1st glimpse out: Ranbir Kapoor, Yash, Sai Pallavi's film teases epic sagaThe first glimpse of Ranbir Kapoor's 'Ramayana' is finally out, offering a stunning visual spectacle. Directed by Nitesh Tiwari, the film also stars Sai Pallavi and Yash, and marks the beginning of a two-part epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-netflix-release-karnataka-ban-2749998-2025-07-03",
      "headline": "Kamal Haasan's Thug Life releases on Netflix, a month after theatrical release'Thug Life', starring Kamal Haasan and directed by Mani Ratnam, is now available on Netflix, streaming in five languages. The film began streaming on the platform 28 days after its theatrical release. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/relief-from-fuel-ban-on-old-vehicles-delhi-writes-to-central-pollution-body-2750212-2025-07-03",
      "headline": "Delhi's end-of-life vehicles won't be impounded, government to tweak policyThe Delhi government has also written to the Commission for Air Quality Management to hold onto the decision which mandates the denial of fuel to End-of-Life (EOL) vehicles in Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-shopkeeper-assaulted-aaditya-thackeray-marathi-language-row-2750202-2025-07-03",
      "headline": "If Marathi is insulted, things escalate: Aaditya Thackeray on shopkeeper's assaultAaditya Thackeray's remarks come a day after a video went viral showing Maharashtra Navnirman Sena (MNS) workers assaulting a shopkeeper for not knowing Marathi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-air-force-chief-united-states-defence-ties-chinese-equipment-india-operation-sindoor-2750158-2025-07-03",
      "headline": "Pak air chief in US after Chinese equipment comes a cropper in Op SindoorThe visit - the first by a PAF chief in over a decade - comes weeks after Pakistan Army Chief Asim Munir held a meeting with US President Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-2-updates-edgbaston-2750085-2025-07-03",
      "headline": "2nd Test, Day 2 Live: Shubman Gill hits 250, pushes India past 500England (ENG) vs India (IND), 2nd Test Day 2 Live Updates: Shubman Gill struck a historic 250 and forged a century stand with Washington Sundar for the seventh wicket to power India past the 500-run mark on Day 2 at Edgbaston. With the visitors eyeing a massive first-innings total, England are struggling for answers to stem the run flow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-review-with-ranbir-kapoor-yash-nitesh-tiwari-feels-like-a-moment-for-indian-cinema-2750117-2025-07-03",
      "headline": "Why Ranbir Kapoor-Yash's Ramayana feels like a moment for Indian cinemaNitesh Tiwari's 'Ramayana' is a cinematic moment shaped by faith, scale, and storytelling ambition. With Ranbir Kapoor, Sai Pallavi, Yash, and Sunny Deol leading a power-packed cast, the film dares to honour the epic as more than mythology. The first glimpse feels less like a teaser and more like the beginning of something historic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-4-results-novak-djokovic-jannik-sinner-iga-swiatek-2750145-2025-07-03",
      "headline": "Wimbledon Day 4 Live: Djokovic wins 2nd set vs Evans, Navaro through to Round 3Wimbledon 2025, Day 4 live score and updates: Emma Navarro is through to the third round of singles after beating Veronika Kudermetova. Alex de Minaur is currently up against Arthur Cazaux of France. Novak Djokovic is up against Daniel Evans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-democracy-india-political-parties-remark-ghana-parliament-reaction-2750163-2025-07-03",
      "headline": "PM says India has over 2,500 political parties, sets off buzz in Ghana ParliamentAddressing the Ghanian Parliament in English, PM Modi described India as mother of democracy and pointed out that the nation has over 2,500 political parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-double-hundred-indian-captain-record-england-test-2750268-2025-07-03",
      "headline": "Shubman Gill first Asian captain to score Test double hundred in SENA conditionsEngland vs India: Captain Shubman Gill became the first Asian skipper to score a Test double hundred on English soil — and across SENA (South Africa, England, New Zealand, Australia) conditions — during the Edgbaston Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cars-hurled-up-iran-israeli-strikes-tehran-operation-rising-lion-blast-2750256-2025-07-03",
      "headline": "Huge blast, then cars fling in air: Israeli strikes hit crowded Tehran area. VideoIranian media released footage claiming to show an Israeli airstrike in Tehran during Operation \"Rising Lion,\" amid escalating tensions over Iran's nuclear ambitions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/thiruvananthapuram/story/uk-unable-to-repair-f-35-stranded-in-kerala-likely-to-dismantle-fighter-jet-to-transport-it-back-sources-2750082-2025-07-03",
      "headline": "UK's F-35 fighter jet can't fly back, may be dismantled to move from KeralaThe British Royal Navy's F-35 fighter jet that made an emergency landing in Kerala on June 14 may be dismantled for airlifting to the UK. A 40-member technical team is expected to arrive in India on July 5 to undertake repairs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brazil-eyes-india-akash-missile-operation-sindoor-pakistan-china-pm-modi-brics-summit-air-defence-2750095-2025-07-03",
      "headline": "Brazil eyes India's Akash system that killed Pak missiles during Op SindoorBrics member Brazil has shown keen interest in India's Akash supersonic missiles, among other India-made military hardware. Brazil's interest in Akash comes after its stellar performance against Pakistani attacks during Operation Sindoor. PM Modi will be visiting Brazil this week and talks are likely to include defence cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/disha-salian-case-shiv-sena-mla-deepak-kesarkar-says-aaditya-thackeray-should-avoid-filmy-people-2750214-2025-07-03",
      "headline": "Aaditya Thackeray should avoid filmy people: Shiv Sena MLA on Disha Salian caseShiv Sena leader Deepak Kesarkar alleged that Aaditya Thackeray was defamed in the Disha Salian death case because of his association with the \"filmy people\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-poverty-income-inequality-ppp-mmrp-who-is-poor-world-bank-niti-aayog-2750057-2025-07-03",
      "headline": "How poor is 'poor' in India?Millions of Indians have exited extreme poverty, yet many still live one crisis away from hunger, debt, or despair. In this deep dive, we examine why poverty is retreating in numbers, but not in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-team-will-travel-to-india-to-compete-at-asia-cup-sports-ministry-source-2750154-2025-07-03",
      "headline": "Pakistan hockey team will travel to India for Asia Cup: Sports ministry sourceThe Pakistan hockey team will be allowed to compete in next month's Asia Cup in India, a source in the Sports Ministry said on Thursday. Approvals have been provided by the Ministry of Home Affairs (MHA), the Ministry of External Affairs (MEA), and the Sports Ministry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-gangrape-case-surviour-father-demands-highest-punishment-monojit-mishra-2749894-2025-07-03",
      "headline": "She is still traumatised: Kolkata rape survivor's father demands death penaltySpeaking to India Today TV, the rape survivor's father said his daughter is still traumatised because of the incident and demanded the strictest punishment for the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/melania-einstein-visa-why-some-americans-want-flotus-deported-us-donald-trump-immigration-policy-eb1-2750034-2025-07-03",
      "headline": "Melania and Einstein visa: Why some Americans want FLOTUS deportedA petition campaign demanding that First Lady Melania Trump, her parents, and son Barron be deported from the US has gained traction with thousands signing it. Melania reportedly entered the US on an EB-1 \"Einstein visa\", meant for individuals with exceptional ability. President Trump's critics are using the Melania case to slam his immigration policies as hypocritical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/rg-kar-kolkata-law-college-rape-the-bengal-i-took-pride-in-has-let-me-down-2750247-2025-07-03",
      "headline": "The Bengal I took pride in has let me down...The Bengal I loved, the land of Mahasweta Devi, Matangini Hazra, Bina Das, Suhasini Ganguly, of women who stood up, fought back, and led revolutions, is being buried under silence and shame. And we are letting it happen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/delhi-is-not-just-banning-cars-but-also-relationships-car-ban-fuel-2750232-2025-07-03",
      "headline": "Why Delhi's ban on old vehicles felt like losing a friendAfter huge public backlash, the Delhi Government has not only stayed the impounding of end-of-life vehicles but has also written to the environment body seeking a pause on the fuel ban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/loneliness-epidemic-in-a-hyperconnected-world-could-be-a-silent-path-to-depression-2750024-2025-07-03",
      "headline": "Loneliness in a hyperconnected world could be a silent path to depressionThe most paradoxical contributor to the loneliness epidemic is the rise of digital connectedness, a psychiatrist decodes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-agriculture-dairy-sector-donald-trump-explain-bilateral-trade-gm-crops-subsidy-explained-2749828-2025-07-03",
      "headline": "The thick red line: Why India shouldn't agree with US on agriThe India-US trade deal is reportedly stuck because of DC's tough demands on the agriculture and dairy sectors. India shouldn't give in to Donald Trump's demands because agriculture is hugely subsidised in the US, with farmers there getting over $61,000 against India's $282. If concessions are to be made, it should be by the US, and not India. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-edgbaston-boundaries-shortened-to-aid-england-bazball-india-spinners-2750245-2025-07-03",
      "headline": "Explained: Have Edgbaston boundaries been shortened to aid England's BazballThe boundary dimensions at Edgbaston sparked widespread curiosity as play got underway in the second Test between England and India. Former England pacer Steven Finn suggested that the shortened boundaries were in line with England's Bazball approach under Ben Stokes and Brendon McCullum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-hc-grants-bail-says-failed-relationship-not-grounds-for-rape-allegation-2750170-2025-07-03",
      "headline": "Failed romance not grounds for rape: Kerala High Court warns against law misuseThe Kerala High Court has ruled that a failed romantic relationship cannot be treated as rape. The court, while granting bail to the accused, stressed that arrest and remand must not be misused as punishment when consensual relationships later turn bitter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-diogo-jota-death-liverpool-jurgen-klopp-message-2750262-2025-07-03",
      "headline": "Diogo Jota death: Former Liverpool boss Jurgen Klopp sends emotional messageFormer Liverpool boss Jurgen Klopp sent an emotional message to remember Diogo Jota, who passed away after a car crash in Spain on Thursday, July 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tortured-students-stabbed-my-friend-chilling-allegations-against-kolkata-rapist-2750118-2025-07-03",
      "headline": "Tortured students, stabbed my friend: Chilling allegations against Kolkata 'rapist'Another student has come forward with disturbing allegations against Monojit Mishra, claiming that he routinely subjected students to mental harassment and even physical assault."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-double-hundred-indian-captain-record-england-test-2750268-2025-07-03",
      "headline": "Shubman Gill first Asian captain to score Test double hundred in SENA conditionsEngland vs India: Captain Shubman Gill became the first Asian skipper to score a Test double hundred on English soil — and across SENA (South Africa, England, New Zealand, Australia) conditions — during the Edgbaston Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/andy-murray-wimbledon-autographed-shirt-auction-2750263-2025-07-03",
      "headline": "Murray's autographed shirt from 2013 Wimbledon final up for auctionAndy Murray's autographed shirt from the Wimbledon 2013 final went up for auction. Murray won the grass court major after beating Novak Djokovic in straight sets in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-diogo-jota-death-liverpool-jurgen-klopp-message-2750262-2025-07-03",
      "headline": "Diogo Jota death: Former Liverpool boss Jurgen Klopp sends emotional messageFormer Liverpool boss Jurgen Klopp sent an emotional message to remember Diogo Jota, who passed away after a car crash in Spain on Thursday, July 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-edgbaston-boundaries-shortened-to-aid-england-bazball-india-spinners-2750245-2025-07-03",
      "headline": "Explained: Have Edgbaston boundaries been shortened to aid England's BazballThe boundary dimensions at Edgbaston sparked widespread curiosity as play got underway in the second Test between England and India. Former England pacer Steven Finn suggested that the shortened boundaries were in line with England's Bazball approach under Ben Stokes and Brendon McCullum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-virat-kohli-record-birmingham-2750231-2025-07-03",
      "headline": "Shubman breaks Kohli's 7-year-old record with 150 in BirminghamENG vs IND: Shubman Gill recorded the highest score by an Indian Test captain at Edgbaston in Birmingham, going past Virat Kohli's 149 in 2018. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-ravindra-jadeja-equals-kapil-dev-record-edgbaston-2750228-2025-07-03",
      "headline": "Ravindra Jadeja equals Kapil Dev's record with valiant 89 at EdgbastonRavindra Jadeja equalled Kapil Dev's record for the most fifty-plus scores in SENA countries with his valiant knock against England on Day 2 of the second Test. Jadeja scored 89 off 137 balls to put India in a strong spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-team-will-travel-to-india-to-compete-at-asia-cup-sports-ministry-source-2750154-2025-07-03",
      "headline": "Pakistan hockey team will travel to India for Asia Cup: Sports ministry sourceThe Pakistan hockey team will be allowed to compete in next month's Asia Cup in India, a source in the Sports Ministry said on Thursday. Approvals have been provided by the Ministry of Home Affairs (MHA), the Ministry of External Affairs (MEA), and the Sports Ministry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-tribute-diogo-jota-andre-silva-die-car-crash-football-mourns-2750148-2025-07-03",
      "headline": "Diogo Jota dies at 28: Doesn't make sense, says heartbroken Cristiano RonaldoPortugal great Cristiano Ronaldo was heartbroken after the sudden and tragic death of Diogo Jota, the 28-year-old Liverpool and Portugal forward, who was killed in a car crash in Spain alongside his younger brother, André Silva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-4-results-novak-djokovic-jannik-sinner-iga-swiatek-2750145-2025-07-03",
      "headline": "Wimbledon Day 4 Live: Djokovic wins 2nd set vs Evans, Navaro through to Round 3Wimbledon 2025, Day 4 live score and updates: Emma Navarro is through to the third round of singles after beating Veronika Kudermetova. Alex de Minaur is currently up against Arthur Cazaux of France. Novak Djokovic is up against Daniel Evans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-2-updates-edgbaston-2750085-2025-07-03",
      "headline": "2nd Test, Day 2 Live: Captain Gill pushes India past 500England (ENG) vs India (IND), 2nd Test Day 2 Live Updates: Shubman Gill's historic double century and Washington Sundar's steady hand put India in complete control on Day 2, as the visitors eye a massive first-innings total at Edgbaston. They have gone past the 500-run mark and England are struggling to find an answer to stop the run flow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-ravindra-jadeja-equals-kapil-dev-record-edgbaston-2750228-2025-07-03",
      "headline": "Ravindra Jadeja equals Kapil Dev's record with valiant 89 at EdgbastonRavindra Jadeja equalled Kapil Dev's record for the most fifty-plus scores in SENA countries with his valiant knock against England on Day 2 of the second Test. Jadeja scored 89 off 137 balls to put India in a strong spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-team-will-travel-to-india-to-compete-at-asia-cup-sports-ministry-source-2750154-2025-07-03",
      "headline": "Pakistan hockey team will travel to India for Asia Cup: Sports ministry sourceThe Pakistan hockey team will be allowed to compete in next month's Asia Cup in India, a source in the Sports Ministry said on Thursday. Approvals have been provided by the Ministry of Home Affairs (MHA), the Ministry of External Affairs (MEA), and the Sports Ministry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-tribute-diogo-jota-andre-silva-die-car-crash-football-mourns-2750148-2025-07-03",
      "headline": "Diogo Jota dies at 28: Doesn't make sense, says heartbroken Cristiano RonaldoPortugal great Cristiano Ronaldo was heartbroken after the sudden and tragic death of Diogo Jota, the 28-year-old Liverpool and Portugal forward, who was killed in a car crash in Spain alongside his younger brother, André Silva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-4-results-novak-djokovic-jannik-sinner-iga-swiatek-2750145-2025-07-03",
      "headline": "Wimbledon Day 4 Live: Djokovic wins 2nd set vs Evans, Navaro through to Round 3Wimbledon 2025, Day 4 live score and updates: Emma Navarro is through to the third round of singles after beating Veronika Kudermetova. Alex de Minaur is currently up against Arthur Cazaux of France. Novak Djokovic is up against Daniel Evans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-2-updates-edgbaston-2750085-2025-07-03",
      "headline": "2nd Test, Day 2 Live: Captain Gill pushes India past 500England (ENG) vs India (IND), 2nd Test Day 2 Live Updates: Shubman Gill's historic double century and Washington Sundar's steady hand put India in complete control on Day 2, as the visitors eye a massive first-innings total at Edgbaston. They have gone past the 500-run mark and England are struggling to find an answer to stop the run flow. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}