{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gautam-adani-celebrates-three-birthdays-every-year-2748051-2025-06-29",
      "headline": "Why Gautam Adani celebrates three birthdays every yearBaffling as it may seem, apart from the day he was born, Adani celebrates two other dates. They are dates when he actually snatched life from the jaws of death. These were times when he repeatedly stared down the abyss and emerged unscathed, yet profoundly transformed. Here then is the story of Adani's three birthdays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-teaser-prithviraj-sukumaran-ibrahim-ali-khan-fight-terrorism-in-kashmir-2748269-2025-06-30",
      "headline": "Sarzameen teaser: Ibrahim plays terrorist, Prithviraj a soldier in high-stakes dramaPrithviraj Sukumaran, Kajol and Ibrahim Ali Khan's upcoming film 'Sarzameen' is officially announced by JioHoistar. The movie will stream from July 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-label-hybe-is-coming-to-india-new-subsidiary-to-open-in-second-half-of-2025-2748263-2025-06-30",
      "headline": "BTS' label HYBE is coming to India: New subsidiary to open in second half of 2025HYBE is setting up a subsidiary in India by 2025 to tap into the country's vibrant music market and digitally savvy youth. This strategic expansion seeks to blend K-pop's global success formula with India's rich cultural diversity, potentially transforming the local music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukones-old-interview-demanding-work-life-balance-surfaces-amid-sandeep-reddy-vanga-row-2748239-2025-06-30",
      "headline": "Deepika Padukone's old interview demanding work-life balance surfaces amid Vanga rowActor Deepika Padukone had been advocating for work-life balance long before she walked out of filmmaker Sandeep Reddy Vanga's upcoming film 'Spirit.' An old interview of the actor has resurfaced, in which she spoke about the importance of fixed working hours for a film's cast and crew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-celebrates-25-years-in-industry-with-refugee-posters-2748249-2025-06-30",
      "headline": "Forever to go: Kareena Kapoor celebrates 25 years in industry with Refugee postersKareena Kapoor Khan celebrated 25 years in Bollywood, marking a journey of versatility and enduring stardom. She shared nostalgic posters from her debut film 'Refugee' as fans and celebrities joined in the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vishnu-manchu-admits-poor-vfx-kannappa-reacts-to-criticism-2748188-2025-06-30",
      "headline": "Vishnu Manchu admits to poor VFX in Kannappa, reacts to criticismActor Vishnu Manchu recently addressed the criticism over his latest release 'Kannappa'. He talked about the production challenges, and shared that he had to remove a few scenes due to poor VFX."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-25-years-refugee-premiere-with-kareena-kapoor-locked-in-projector-room-2748231-2025-06-30",
      "headline": "When Abhishek, Kareena were locked in projector room during Refugee premiereAs 'Refugee' completes 25 years, Abhishek Bachchan reflects on his debut and shares a memorable incident where he and Kareena Kapoor had to hide in a theatre projector room due to excited fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-amar-upadhyay-kyunki-saas-bhi-bahu-thi-2-premiere-postponed-2748230-2025-06-30",
      "headline": "Smriti Irani, Amar Upadhyay's Kyunki Saas Bhi...2 premiere postponed. Here's whyActors Smriti Irani and Amar Upadhyay's 'Kyunki Saas Bhi Kabhi Bahu Thi 2' premiere has been postponed. Upadhayay confirmed the development and shared the reason behind the delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-husband-parag-tyagi-family-immerse-actors-ashes-in-sea-2748222-2025-06-30",
      "headline": "Heartbroken Parag Tyagi immerses Shefali Jariwala's ashes into sea, her family joinsAn emotional Parag Tyagi and Shefali Jariwala's family were seen performing the last rites by immersing her ashes. The actor died on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-responds-to-trolls-reveals-why-he-stays-silent-on-family-rumours-2748201-2025-06-30",
      "headline": "Negativity sells: Abhishek Bachchan explains his silence over family rumoursAbhishek Bachchan has spoken out against online trolls for the first time, shedding light on his decision to remain silent about rumours involving his family. He emphasised the importance of peace and privacy over engaging with baseless speculation. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-backs-varun-dhawan-stand-shefali-jariwala-death-coverage-2748169-2025-06-30",
      "headline": "Janhvi Kapoor backs Varun Dhawan's stand on Shefali Jariwala's death coverageActor Janhvi Kapoor backed Varun Dhawan's plea to respect privacy during grief. The latter had called out the media over insensitive coverage of actor Shefali Jariwala's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-collection-day-3-detailed-report-vishnu-manchu-film-wraps-up-a-decent-1st-weekend-2748191-2025-06-30",
      "headline": "Kannappa box office Day 3: Vishnu Manchu's film wraps up a decent 1st weekend'Kannappa' finished its opening weekend at the box office on a decent note, collecting more than all the fresh releases in India. The film is now looking at passing the crucial Monday test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-box-office-day-3-brad-pitt-film-races-to-144-million-worldwide-2748184-2025-06-30",
      "headline": "F1 box office Day 3: Brad Pitt's racing drama off to a roaring $144 million startBrad Pitt's 'F1' is racing into the hearts of audiences. Directed by Joseph Kosinski, the film is climbing the box office charts, earning impressive numbers along the way.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-10-detailed-report-aamir-khan-film-beats-ghajini-creates-new-record-in-2nd-weekend-2748172-2025-06-30",
      "headline": "Sitaare Zameen Par box office Day 10: Aamir's film beats Ghajini, creates new recordAamir Khan's 'Sitaare Zameen Par' recorded a fabulous second weekend at the box office, and collected around Rs 122 crore in ten days. It also surpassed the lifetime earnings of Khan's sixth highest-grossing film, 'Ghajini'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-wife-aarti-share-birthday-posts-for-son-aarav-this-year-hasnt-been-easy-2748167-2025-06-30",
      "headline": "Ravi Mohan, wife Aarti share birthday posts for son Aarav: This year hasn't been easyRavi Mohan and Aarti Ravi shared moving birthday notes for their son Aarav. While Aarti reflected on the year gone by, Ravi described his sons as his pride.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/beyonce-manages-scary-mid-air-malfunction-during-houston-show-watch-viral-video-2748139-2025-06-30",
      "headline": "Beyonce manages scary mid-air malfunction during Houston show. WatchBeyonce handled a terrifying stage malfunction during her performance. The incident happened during her first of two shows in Houston."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-returns-to-hera-pheri-3-calls-akshay-kumar-his-longtime-friend-2748153-2025-06-30",
      "headline": "Paresh Rawal returns to Hera Pheri 3, calls Akshay Kumar his longtime friendActor Paresh Rawal confirmed that he was back to lead 'Hera Pheri 3' with Akshay Kumar and Suniel Shetty. The actor's announcement came over a month after his abrupt exit from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fast-and-furious-11-paul-walker-could-return-says-vin-diesel-2748145-2025-06-30",
      "headline": "Fast and Furious 11: Paul Walker could return, says Vin DieselVin Diesel has made a promising revelation about the upcoming 'Fast and Furious' installment. At a recent event, the actor shared that Paul Walker's character, Brian O'Conner, could potentially return to the franchise.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-calls-out-media-for-insensitive-coverage-of-shefali-jariwala-death-2748030-2025-06-29",
      "headline": "Varun Dhawan calls out media for insensitive coverage of Shefali Jariwala's deathVarun Dhawan criticised the media for insensitively covering Shefali Jariwala's funeral, urging respect for the grieving family. Priyanka Chopra called the news shocking and extended condolences to Shefali's family."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-case-accused-admitted-to-law-college-despite-low-rank-alleges-bjp-2748225-2025-06-30",
      "headline": "Who gave him seat? BJP flags rape-accused student's low rank, targets TrinamoolMalviya alleged that Zaib Ahmed was admitted to South Calcutta Law College despite securing a \"dismal\" rank of 2634 in the Calcutta University Law Entrance Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/massive-protest-in-dhaka-after-hindu-woman-cumilla-raped-by-bangladesh-nationalist-party-politician-2748118-2025-06-30",
      "headline": "Massive protest in Bangladesh after Hindu woman raped by local politicianA video of one of the protests showed students clapping and shouting slogans, demanding 'direct action' against the perpetrators. So far, the police have arrested five individuals, including the main accused, Fazor Ali-a member of the Khaleda Zia-led Bangladesh Nationalist Party (BNP)-in connection with the rape of a 21-year-old woman in Cumilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anti-ageing-skin-glow-medicines-found-at-shefali-jariwalas-house-police-2748292-2025-06-30",
      "headline": "Anti-ageing, skin glow medicines found at Shefali Jariwala's house: PoliceShefali Jariwala was found dead at her residence on June 27. The police officials collected anti-ageing and skin-glow medicines from her place during their investigation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/newlywed-tn-tiruppur-woman-dies-by-suicide-over-alleged-dowry-harassment-husband-inlaws-in-custody-2748168-2025-06-30",
      "headline": "Newlywed bride dies by suicide over dowry torture, had given Volvo car, 800 gm goldA 27-year-old newlywed woman died by suicide allegedly due to dowry-related harassment by her husband and in-laws. Police found her body in a parked car after she consumed pesticide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/quiet-revolution-94-crore-indians-social-security-schemes-ilo-lakhpati-didi-jeevan-beema-modi-ayushman-bharat-awas-yojana-2748217-2025-06-30",
      "headline": "How a quiet revolution has given a safety net to 94 crore IndiansFrom 19% in 2015 to 64% in 2025, India has quietly expanded its social security net to include 94.3 crore people, second only to China in absolute numbers. This silent revolution has been acknowledged by the International Labour Organisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-murdered-by-live-in-partner-body-dumped-20-km-away-accused-nabbed-within-20-hours-2748251-2025-06-30",
      "headline": "Live-in partner killed Bengaluru woman, took body on bike to dump in garbage truckThe Bengaluru police reportedly solved a murder case where a woman's body was found in a garbage truck. According to the police, the woman's live-in partner killed her and then dumped her body in a garbage truck to get rid of the evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-returns-to-hera-pheri-3-calls-akshay-kumar-his-longtime-friend-2748153-2025-06-30",
      "headline": "Paresh Rawal returns to Hera Pheri 3, calls Akshay Kumar his longtime friendActor Paresh Rawal confirmed that he was back to lead 'Hera Pheri 3' with Akshay Kumar and Suniel Shetty. The actor's announcement came over a month after his abrupt exit from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-constitution-assembly-did-not-include-term-secular-rss-preamble-indira-gandhi-emergency-2747289-2025-06-30",
      "headline": "Why framers of India's Constitution didn't include secular in itAs the 50th anniversary of the Emergency rekindles debate over secularism, it is worth recalling that the framers of the Constitution debated and decided against the inclusion of the term 'secular' in it. Here's why the Constituent Assembly decided not to use 'secular' to define the nature of the State."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-monsoon-weather-updates-himachal-on-red-alert-schools-shut-as-landslides-and-rain-cripple-daily-life-2748260-2025-06-30",
      "headline": "Himachal on red alert; schools shut as landslides and rain cripple daily lifeThree deaths have been reported in the last 24 hours in Himachal due to heavy rains, taking the total toll to 20 since the monsoons began. The weather department has said heavy to very heavy rains are likely to occur at a few places in the districts of Kangra, Mandi, Solan and Sirmaur till Monday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/shefali-jariwala-died-of-cardiac-arrest-why-sudden-drop-in-blood-pressure-could-be-fatal-2748210-2025-06-30",
      "headline": "Shefali Jariwala's death: Why sudden drop in BP could cause fatal cardiac arrestActor Shefali Jariwala's sudden death reportedly due to cardiac arrest has raised alarm over heart health risks among young women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/10-killed-after-a-fire-broke-out-following-a-reactor-explosion-at-chemical-factory-in-telangana-2748291-2025-06-30",
      "headline": "10 dead, several injured after reactor explodes at Telangana chemical factoryAn explosion at a chemical factory in Telangana's Sangareddy district killed ten workers and injured several others, prompting a major rescue effort and orders for relief from Chief Minister Revanth Reddy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-hat-trick-titles-2748157-2025-06-30",
      "headline": "Carlos Alcaraz targets historic Wimbledon three-peat, chases place among legendsCarlos Alcaraz will begin his quest for a rare Wimbledon three-peat on Monday, aiming to join an exclusive club of legends when the 2025 Championships get underway at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-iaf-lost-fighter-jets-political-constraints-indian-defence-attache-indonesia-embassy-clarification-congress-attacks-government-2748084-2025-06-29",
      "headline": "Defence attache says jets lost to Pak due to constraints. Then, a clarificationIndia's defence attache to Indonesia admitted that the Air Force lost \"some aircraft\" early on in Operation Sindoor. The remark stoked controversy back home, prompting the Indian Embassy in Jakarta to issue a sternly-worded clarification."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/enemies-will-be-avenged-irans-top-cleric-issues-fatwa-against-trump-netanyahu-2748134-2025-06-30",
      "headline": "Enemies of God: Iran's top cleric issues fatwa against Trump, NetanyahuShirazi called on Muslims across the world to unite and strongly oppose these enemies, American and Israeli leaders, and their actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/namazwadi-not-samajwadi-bjp-hits-out-at-tejashwi-yadav-over-anti-waqf-protest-2748220-2025-06-30",
      "headline": "Namazwadi, not Samajwadi: BJP hits out at Tejashwi over anti-Waqf protestBJP MP Sudhanshu Trivedi was responding to the RJD leader's remarks on throwing the newly-passed Waqf Act 'into the dustbin.' Trivedi claimed that Tejashwi Yadav's remarks reflected the fact that the INDIA bloc has 'no respect for Parliament or the judiciary.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-kills-son-play-in-rain-stabs-2748108-2025-06-30",
      "headline": "10-year-old boy wanted to play in rain, father stabbed him to death in DelhiA 10-year-old boy in Delhi was fatally stabbed by his father after insisting on playing in the rain. The accused, a daily wage labourer, has been arrested and a murder case has been filed.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-defends-viral-video-househelp-child-eating-on-floor-internet-reacts-2748204-2025-06-30",
      "headline": "Bengaluru woman defends video of househelp's child eating on floor, sparks backlashA Bengaluru-based nutritionist defended her video after it drew flak for showing her domestic worker's child eating on the floor, triggering debate over privilege and intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-elon-musk-a-wonderful-guy-amid-feud-over-big-beautiful-bill-2748117-2025-06-30",
      "headline": "A wonderful guy: Trump's praise for Elon Musk amid feud over 'Big Beautiful Bill'Donald Trump called the former advisor Elon Musk a \"wonderful guy\" and predicted he would \"do well always.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/gaganyaan-mission/story/indias-shubhanshu-shukla-working-on-experiment-to-power-gaganyaan-mission-2748228-2025-06-30",
      "headline": "Shux begins working on experiment to power Gaganyaan MissionThe results could provide Isro with new options to develop the critically needed life support system for the Gaganyaan Mission, the Indian human spaceflight mission. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-case-two-accused-recorded-assault-on-phones-to-blackmail-survivor-police-source-2748192-2025-06-30",
      "headline": "2 accused filmed assault to blackmail survivor: Police source on Kolkata rape caseThe accused admitted to capturing the brutal incident and confessed that the videos and images were intended to be used as tools to blackmail the survivor into silence."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmood-red-ball-head-coach-2748265-2025-06-30",
      "headline": "Pakistan appoint former all-rounder as 'acting coach' for Test teamPakistan have appointed former all-rounder Azhar Mahmood as their acting red-ball head coach. Pakistan finished at the bottom in the 2023-25 edition of the World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-prepares-england-test-pietersen-guidance-dual-spin-2748221-2025-06-30",
      "headline": "Armed with English wisdom, Kuldeep makes bold promise ahead of Test comebackEngland vs India: Spinner Kuldeep Yadav recalled his experience of learning from Kevin Pietersen about the nuances of bowling in England. The wrist-spinner might make his way into the XI for the second Test, starting July 02 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-india-birmingham-record-2748226-2025-06-30",
      "headline": "Can India make a comeback in Birmingham?  Here's what history suggestsENG vs IND: Shubman Gill's India are looking to make a comeback in the five-match Test series after losing the opening Test at Headingley in Leeds by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-1-schedule-streaming-carlos-alcaraz-aryna-sabalenka-2748160-2025-06-30",
      "headline": "Day 1, Schedule and Live Streaming: Alcaraz, Sabalenka, Paolini in actionWimbledon 2025 Day 1: Carlos Alcaraz, Aryna Sabalenka and Jasmine Paolini are amongst the top names to be in action in their respective first round matches of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-hat-trick-titles-2748157-2025-06-30",
      "headline": "Carlos Alcaraz targets historic Wimbledon three-peat, chases place among legendsCarlos Alcaraz will begin his quest for a rare Wimbledon three-peat on Monday, aiming to join an exclusive club of legends when the 2025 Championships get underway at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-finger-injury-update-west-indies-vs-australia-2nd-test-2748140-2025-06-30",
      "headline": "Steve Smith shares update on finger injury before Grenada TestWI vs AUS: After missing the first Test due to a finger injury, veteran batter Steve Smith sounded confident of making the cut for the second Test in Grenada. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-1-schedule-streaming-carlos-alcaraz-aryna-sabalenka-2748160-2025-06-30",
      "headline": "Day 1, Schedule and Live Streaming: Alcaraz, Sabalenka, Paolini in actionWimbledon 2025 Day 1: Carlos Alcaraz, Aryna Sabalenka and Jasmine Paolini are amongst the top names to be in action in their respective first round matches of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-hat-trick-titles-2748157-2025-06-30",
      "headline": "Carlos Alcaraz targets historic Wimbledon three-peat, chases place among legendsCarlos Alcaraz will begin his quest for a rare Wimbledon three-peat on Monday, aiming to join an exclusive club of legends when the 2025 Championships get underway at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-finger-injury-update-west-indies-vs-australia-2nd-test-2748140-2025-06-30",
      "headline": "Steve Smith shares update on finger injury before Grenada TestWI vs AUS: After missing the first Test due to a finger injury, veteran batter Steve Smith sounded confident of making the cut for the second Test in Grenada. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-barbora-krejcikova-title-defence-2748135-2025-06-30",
      "headline": "Definitely not difficult: Krejcikova confident before title defenceWimbledon 2025: Barbora Krejcikova said that instead of taking the pressure of being the defending champion, she wants to enjoy the game when she steps out to face Alexandra Eala in the first round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-preview-aryna-sabalenka-coco-gauff-iga-swiatek-2748120-2025-06-30",
      "headline": "Can Aryna Sabalenka, Iga Swiatek, Coco Gauff finally conquer the grass?Wimbledon 2025: Eyes will be on Aryna Sabalenka, Coco Gauff and Iga Swiatek as they are set to take part in the grass-court major, which starts on Monday. Barbora Krejcikova, in the meantime, will be looking to defend her crown. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-inter-miami-vs-psg-report-lionel-messi-no-revenge-2748089-2025-06-29",
      "headline": "Lionel Messi cruelly denied revenge as PSG dominate Inter Miami 4-0Lionel Messi's quest for poetic closure ended in silence as Paris Saint-Germain, his former club, ruthlessly dismantled Inter Miami 4-0 in Atlanta's Mercedes-Benz Stadium, knocking them out of the 2025 Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-1st-test-day-2-report-sean-williams-keshav-maharaj-2748088-2025-06-29",
      "headline": "ZIM vs SA 1st Test: South Africa gain control on Day 2 despite Williams' hundredSean Williams scored a fighting 137 to help Zimbabwe avoid follow-on in the first Test against South Africa. Despite his efforts, South Africa ended Day 2 with a strong lead, signalling a tough challenge for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-shubman-gill-fantastic-inexperience-denies-2748082-2025-06-29",
      "headline": "India were fantastic under Shubman Gill: England's Jamie SmithDespite India's defeat at Headingley, England batter Jamie Smith lauded Shubman Gill's captaincy and India's all-round effort, countering criticism about the team's inexperience and calling their performance \"fantastic\" across the four hard-fought days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/austrian-gp-mclaren-lando-norris-win-ferrari-lewis-hamilton-redemption-2748080-2025-06-29",
      "headline": "Austrian GP: Lando Norris leads McLaren domination, Ferrari snaps redemptionMcLaren stole the show at the Austrian Grand Prix with a dominant 1-2 finish, while Red Bull faced heartbreak on home turf as Verstappen crashed out early and Williams suffered a disastrous double DNF."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afc-womens-asia-cup-qualifiers-india-vs-timor-leste-report-manisha-kalyan-2748057-2025-06-29",
      "headline": "India continue impressive run in Women's Asian Cup qualifiers with Timor-Leste winThe Indian senior women's team delivered a commanding 4-0 win over Timor-Leste in the AFC Asian Cup qualifiers on Sunday, June 29. The victory strengthens their position on top of Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-t20is-smriti-mandhana-maiden-hundred-captaincy-2748041-2025-06-29",
      "headline": "Smriti Mandhana eyes more T20I success after maiden hundred: Still work in progressSmriti Mandhana said that her batting in T20Is is still a work in progress after scoring her maiden hundred in the format on June 28. Mandhana became the second Indian batter to score a T20I hundred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-shubman-gill-fantastic-inexperience-denies-2748082-2025-06-29",
      "headline": "India were fantastic under Shubman Gill: England's Jamie SmithDespite India's defeat at Headingley, England batter Jamie Smith lauded Shubman Gill's captaincy and India's all-round effort, countering criticism about the team's inexperience and calling their performance \"fantastic\" across the four hard-fought days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/austrian-gp-mclaren-lando-norris-win-ferrari-lewis-hamilton-redemption-2748080-2025-06-29",
      "headline": "Austrian GP: Lando Norris leads McLaren domination, Ferrari snaps redemptionMcLaren stole the show at the Austrian Grand Prix with a dominant 1-2 finish, while Red Bull faced heartbreak on home turf as Verstappen crashed out early and Williams suffered a disastrous double DNF."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afc-womens-asia-cup-qualifiers-india-vs-timor-leste-report-manisha-kalyan-2748057-2025-06-29",
      "headline": "India continue impressive run in Women's Asian Cup qualifiers with Timor-Leste winThe Indian senior women's team delivered a commanding 4-0 win over Timor-Leste in the AFC Asian Cup qualifiers on Sunday, June 29. The victory strengthens their position on top of Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-t20is-smriti-mandhana-maiden-hundred-captaincy-2748041-2025-06-29",
      "headline": "Smriti Mandhana eyes more T20I success after maiden hundred: Still work in progressSmriti Mandhana said that her batting in T20Is is still a work in progress after scoring her maiden hundred in the format on June 28. Mandhana became the second Indian batter to score a T20I hundred. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-women-slow-over-rate-penalty-2748038-2025-06-29",
      "headline": "ENG-W vs IND-W: England handed fine for slow over-rate in Trent Bridge T20IENG-W vs IND-W: England's rough start to the T20I series against India worsened after they were fined 10% of their match fees for a slow over-rate in their 97-run loss at Trent Bridge on June 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-criticism-mohammed-azharuddin-2748031-2025-06-29",
      "headline": "Give Shubman Gill a fair chance: Mohammed Azharuddin slams India captain criticsMohammed Azharuddin has jumped to the defence of Shubman Gill ,saying that the Indian Test team captain should be given a fair chance. Gill's captaincy has been criticised after India's loss in the Headingley Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-feature-title-2747934-2025-06-29",
      "headline": "Wimbledon looms for Djokovic: Final shot at glory or end of an era?Wimbledon 2025: Former World No.1 Novak Djokovic has had his fair share of struggles this year, but the Serb has plenty to look forward to when he begins his campaign in the grass-court major. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-chelsea-vs-benfica-weather-stoppage-enzo-maresca-2748012-2025-06-29",
      "headline": "US not right place for Club World Cup: Chelsea boss Enzo Maresca on match stoppageEnzo Maresca was left fuming at the fact that Chelsea's game against Benfica in the Club World Cup was halted for almost two hours due to weather conditions in Charlotte. Maresca claimed that the US may not be the right place to host the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-harpreet-brar-nets-session-shubman-gill-text-birmingham-test-2747998-2025-06-29",
      "headline": "Shubman Gill texted me: How Harpreet Brar joined India nets in BirminghamHarpreet Brar joined India's nets in Birmingham after a personal invite from skipper Shubman Gill, sparking fresh buzz around spin tactics and bowling combinations ahead of the second Test against England at Edgbaston."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-steve-smith-likely-to-play-2nd-test-reveals-andrew-mcdonald-2747993-2025-06-29",
      "headline": "WI vs AUS: Steve Smith likely to play 2nd Test, reveals head coach Andrew McDonaldAustralia batter Steve Smith is likely to play in the second Test against the West Indies, revealed head coach Andrew McDonald. Smith missed the first Test after sustaining a finger injurey during the World Test Championship (WTC) final 2025 vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-accident-recovery-dinshaw-pardiwala-2747977-2025-06-29",
      "headline": "Will I ever play again? Pant's surgeon recalls rehab process after accidentRishabh Pant's surgeon recalled the Indian wicketkeeper's journey after his car accident in December 2022. Pant was out of the game for close to 16 months after the accident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wouldve-gone-for-wickets-in-leeds-gill-isnt-like-that-sanjay-manjrekar-2747973-2025-06-29",
      "headline": "Kohli would've gone for wickets in Leeds, Gill isn't like that: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has compared Shubman Gill's captaincy style with Virat Kohli following India's loss in the first Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-rahul-dravid-step-down-after-2023-odi-world-cup-final-australia-ahmedabad-2747906-2025-06-29",
      "headline": "Rohit on Dravid: Wanted to step down after 2023 ODI World Cup heartbreakRohit Sharma revealed that Rahul Dravid did not want to continue as coach following the heartbreak against Australia in the ODI World Cup, but the Indian skipper pushed him on to continue as they went on to win the T20 World Cup in Barbados. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-jasprit-bumrah-leeds-test-2747965-2025-06-29",
      "headline": "Jasprit Bumrah threat? Smith reveals why he attacked Jadeja in Leeds TestENG vs IND: Jamie Smith played a couple of crucial knocks under pressure as England sealed the Leeds Test to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-317-2747940-2025-06-29",
      "headline": "UFC 317: Topuria wins lightweight gold after 1st round KO vs Oliviera, Pantoja retainsIlia Topuria put up yet another clinical display as his first-round knockout against Charles Oliviera saw him crowned as the new UFC lightweight champion. Meanwhile, Alexandre Pantoja submitted Kai-Kara France to retain his gold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-gets-emotional-on-t20-world-cup-win-anniversary-2747960-2025-06-29",
      "headline": "Pandya gets emotional on T20 World Cup win anniversary: Did it for my countryIndia all-rounder Hardik Pandya got emotional on the first anniversary of India's T20 World Cup 2024 victory as he shared a heartwarming video with his fans."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}