{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-confirms-data-breach-clears-ciso-of-wrongdoing-amid-hacker-claims-2614583-2024-10-10",
      "headline": "Star Health confirms data breach, clears CISO of wrongdoing amid claimsStar Health Insurance released a statement acknowledging the cyberattack. The company confirmed that it was a victim of a targeted malicious cyberattack, which led to unauthorised access to certain data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-mumbai-tata-group-philanthropy-investments-education-technology-steel-2614512-2024-10-10",
      "headline": "Remembering Ratan Tata, a beacon of philanthropyRatan Tata death: Ratan Tata played a key role with his philanthropic efforts in various sectors, including healthcare, technology, disaster relief and social welfare. Here's how Ratan Tata made a profound impact through his philanthropy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-visionary-who-fuelled-indias-startup-revolution-paytm-ola-firstcry-upstox-2614508-2024-10-10",
      "headline": "Ratan Tata: The visionary who fuelled India's startup revolutionEven after his retirement, Ratan Tata continued to embody the spirit of entrepreneurship, emerging as a formidable investor and mentor to a multitude of startups across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-today-press-conference-doubtful-after-ratan-tatas-demise-2614473-2024-10-10",
      "headline": "TCS Q2 results today, press conference doubtful after Ratan Tata's demiseRatan Naval Tata, one of India's most influential industrialists and chairman emeritus of the Tata Group, passed away late Wednesday night at the age of 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-10-2024-precious-metals-record-hike-on-mcx-2614472-2024-10-10",
      "headline": "Gold, silver price today, October 10, 2024: Precious metals record hike on MCXGold Price Today October 10, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-tata-shares-in-spotlight-after-ratan-tata-death-2614464-2024-10-10",
      "headline": "Sensex, Nifty open higher; Tata shares in spotlight after Ratan Tata's deathThe S&P BSE Sensex added 110.95 points to 81,578.05, while the NSE NIfty50 gained 19.80 points to 25,001.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/businessman-niranjan-hiranandani-ratan-tata-london-trip-pet-dog-industry-titan-dies-mumbai-2614460-2024-10-10",
      "headline": "When Ratan Tata cancelled London trip for his pet: Niranjan Hiranandani recountsRatan Tata death: Businessman Niranjan Hiranandani, who had invested in his friend Ratan Tata-backed Goodfellows, a companionship startup for senior citizens in 2022, recalled the veteran industrialist's down-to-earth nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-businessman-death-tata-group-legacy-tata-group-philanthropy-pm-modi-condoles-2614428-2024-10-10",
      "headline": "Ratan Tata: The titan who built a billion-dollar empire without chasing billionaire statusRatan Tata's legacy endures as a titan who built a billion-dollar empire while never appearing on any billionaire lists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-condolences-pour-in-mukesh-ambani-adani-anand-mahindra-goenka-pm-modi-bid-farewell-2614417-2024-10-10",
      "headline": "Condolences pour in as India's business world bids farewell to Ratan TataThe former Tata Chairman had been undergoing treatment for a prolonged illness at Breach Candy Hospital in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-passes-away-age-86-leader-who-took-tata-group-from-usd-5-billion-to-100-billion-2614413-2024-10-10",
      "headline": "Ratan Tata: Leader who took Tata Group from $5 billion to $100 billionRatan Tata took over as Chairman of Tata Sons in 1991, succeeding JRD Tata. At that time, the Tata Group was largely an Indian conglomerate with annual revenues of around $5 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-confirms-central-panel-ccpa-show-cause-notice-response-due-in-15-days-2614138-2024-10-09",
      "headline": "Ola Electric confirms Central panel show cause notice, response due in 15 daysThe notice accuses the company of failing to meet standards in areas concerning customer service and product advertisements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-ipo-gmp-expected-listing-gains-crashes-due-to-rich-valuation-fears-2614117-2024-10-09",
      "headline": "Hyundai Motor IPO: GMP crashes due to rich valuation fears. Check hereThe company, a subsidiary of South Korean auto giant Hyundai Motor Company, plans to raise Rs 27,856 crore through the sale of shares, priced between Rs 1,865 and Rs 1,960 each. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-rbi-inflation-outlook-triggers-profit-booking-2614022-2024-10-09",
      "headline": "Sensex, Nifty end lower as RBI inflation outlook triggers profit bookingThe S&P BSE Sensex lost 161.71 points to close at 81,467.10, while the NSE Nifty50 was down 31.20 points to end at 24,981.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-centre-offer-a-festive-gift-for-government-employees-union-cabinet-meeting-today-2613992-2024-10-09",
      "headline": "DA hike: Will Centre offer a festive gift for government employees?Currently, central government employees receive DA at 50% of their basic salary, and pensioners receive DR at 50% of their basic pension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/torrent-power-ltd-multibagger-power-stock-hits-record-high-peak-on-massive-rs-1680-crore-order-2613963-2024-10-09",
      "headline": "Multibagger power stock hits record high peak on massive Rs 1,680 crore orderA total of 1.51 lakh shares were traded, resulting in a turnover of Rs 29.36 crore on the BSE. The company's market capitalisation rose to Rs 92,624 crore following the surge in its stock price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-raises-upi-lite-upi-123pay-limits-how-it-affects-your-wallet-explained-2613897-2024-10-09",
      "headline": "RBI raises UPI Lite, UPI 123Pay limits at MPC: How it affects your walletRBI MPC meeting: The central bank raised the transaction limits for two key UPI services—UPI 123Pay and UPI Lite—offering more convenience for millions of users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-key-takeaways-on-gdp-growth-inflation-interest-rate-2613856-2024-10-09",
      "headline": "RBI MPC meeting: Key takeaways on GDP growth, inflation, and interest rateRBI MPC meeting: The committee led by Governor Shaktikanta Das decided to keep interest rates unchanged and shifted its policy stance from 'withdrawal of accommodation' to 'neutral'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-repo-rate-unchanged-stock-market-rally-sensex-surges-600-nifty-up-200-points-2613837-2024-10-09",
      "headline": "Stock market rally: Sensex surges 600 points as RBI holds repo rate The S&P BSE Sensex added 591.46 points to 82,225.81, while the NIfty50 gained 197 points to 25,210.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-ipo-opens-on-october-15-all-you-need-to-know-price-band-issue-size-dates-details-2613808-2024-10-09",
      "headline": "Hyundai Motor IPO opens on October 15: All you need to know Hyundai Motor India aims to raise Rs 27,855 crore, making it the largest IPO in the history of the Indian stock market. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-accorded-state-funeral-maharashtra-chief-minister-eknath-shinde-2614425-2024-10-10",
      "headline": "State funeral for Ratan Tata, Amit Shah to attend, Maharashtra's day of mourning Live UpdatesRatan Tata funeral: The Maharashtra government has declared a day of mourning as a mark of respect for Ratan Tata. The legendary business leader and chairman emeritus of Tata Sons died on Wednesday at 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-chairman-emeritus-of-tata-sons-dies-2614389-2024-10-09",
      "headline": "Ratan Tata, titan of Indian business and philanthropist icon, dies at 86Ratan Tata death: Ratan Tata, a visionary industrialist and chairman emeritus of Tata Sons, died on Wednesday. He had been undergoing treatment for the past few days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-revenge-ford-motors-bill-ford-insulted-indica-car-2614477-2024-10-10",
      "headline": "When Ratan Tata turned the tables on auto giant Ford after being humiliatedRatan Tata death: Ratan Tata's timely decision to not sell its fledging car division to Ford in 1999 was instrumental in Tata Motors becoming the automobile behemoth that it is today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-personal-life-never-getting-married-simi-garewal-rendezvous-2614553-2024-10-10",
      "headline": "Sometimes I long for it: When Ratan Tata spoke of never being marriedIn a rare appearance on a talk show with his 'friend' Simi Garewal in 1997, the business titan opened up on never being married and admitted that he sometimes longed for a wife and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-dies-updates-tata-chairman-pm-modi-industrialist-2614414-2024-10-10",
      "headline": "Live: Manmohan Singh, LK Advani, Supriya Sule, Kumar Mangalam Birla pay last respectsRatan Tata Death News Updates: Ratan Naval Tata, the former Tata Group chairman who transformed a staid group into India's largest and most influential conglomerate with a string of eye-catching deals, has died. He was 86. Tata, who was chairman of the Salt to Software group for more than two decades, breathed his last at south Mumbai's Breach Candy Hospital at 11.30 pm on Wednesday, October 9. A Padma Vibhushan recipient, Tata, was educated at Cornell University and worked on the shop floor at the family-run group after returning to India in 1962. He became chairman of Tata Industries a decade later and in 1991 took over as the chairman of the Tata Group from his uncle, JRD, who had been in charge for more than half a century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/piyush-goyal-breaks-down-on-air-remembering-ratan-tata-says-country-lost-a-titan-2614483-2024-10-10",
      "headline": "Video: Minister Piyush Goyal tears up on air while remembering Ratan TataUnion Minister Piyush Goyal while speaking to India Today broke down in tears while remembering his time spent with Ratan Tata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-love-of-flying-passion-f-16-super-hornet-jets-air-india-2614555-2024-10-10",
      "headline": "Ratan Tata's love of flying: A near-death experience and tryst with F-16 jetWhile Ratan Tata's love for aviation was legendary, having flown the F-16 fighter jet and Boeing's F-18 Super Hornet, he also had a near-death experience as a student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shantanu-naidu-pays-tribute-to-ratan-tata-goodbye-my-dear-lighthouse-linkedin-post-2614466-2024-10-10",
      "headline": "Ratan Tata's assistant pays tribute to national icon: Goodbye, dear lighthouseShantanu Naidu, serving as the general manager at the office of Ratan Tata, paid tribute to the national icon and his mentor in a post on  LinkedIn. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-last-rites-state-funeral-parsi-rituals-in-mumbai-tata-group-zoroastrianism-beliefs-2614556-2024-10-10",
      "headline": "How Ratan Tata's last rites will be conducted through Parsi ritualsRatan Tata funeral: Parsis do not cremate or bury their loved ones, unlike Hindus and Muslims, and they consider a human body as a gift of nature, which has to be returned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-tracing-legendary-life-pictures-2614418-2024-10-10",
      "headline": "In pics: A time capsule of Ratan Tata's illustrious lifeRatan Tata died on Wednesday night at the age of 86. He had been undergoing treatment at a hospital in Mumbai for the past few days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-how-he-would-like-to-be-remembered-union-minister-ashwini-vaishnaw-post-tata-group-2614493-2024-10-10",
      "headline": "Ratan Tata had once shared how he would like to be remembered: A person who...In a video shared by Union Minister Ashwini Vaishnaw, Ratan Tata could be heard saying that he would like to be remembered as a person who made a difference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2013-how-ratan-tata-was-different-from-jrd-tata-2614596-2024-10-10",
      "headline": "From the archives (2013) | How Ratan Tata was different from JRD TataFormer Tata Steel MD Jamshed J. Irani recalls the important differences in the styles of functioning between Ratan Tata and his predecessor"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/simi-garewal-heartbroken-ex-girlfriend-ratan-tata-death-wedding-rendezvous-with-simi-garewal-2614456-2024-10-10",
      "headline": "Simi Garewal heartbroken over friend Ratan Tata's death: Hard to bear your lossFormer actor Simi Garewal shared a post on X and mourned the death of industrialist Ratan Tata. The industry icon died on October 9 at the Breach Candy Hospital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-veteran-industrialist-philanthropist-animal-lover-pet-dogs-skips-meeting-king-charles-2614469-2024-10-10",
      "headline": "Ratan Tata's love for pets: VIP entry for strays at Taj hotel, Tata HouseRatan Tata was known for his immense love for animals. A lover of dogs, the corporate titan had decreed in 2018 that any strays outside the Tata Group's headquarters in downtown Mumbai be allowed shelter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-news-famous-quotes-2614427-2024-10-10",
      "headline": "Ratan Tata's 10 nuggets of wisdom: None can destroy iron but its own rust canRatan Tata, the visionary industrialist and chairman emeritus of Tata Sons, died at a Mumbai hospital on Wednesday night. He was 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vettaiyan-x-reviews-rajinikanth-amitabh-bachchan-fahadh-faasil-rana-daggubati-tj-gnanavel-2614519-2024-10-10",
      "headline": "Vettaiyan X Reviews: Fans praise Rajinikanth, Big B's film as 'massy and classy'Rajinikanth and Amitabh Bachchan's investigative thriller Vettaiyan has been receiving tremendous love from fans everywhere. The movie directed by TJ Gnanavel, also stars Rana Daggubati and Fahadh Faasil in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-visionary-who-fuelled-indias-startup-revolution-paytm-ola-firstcry-upstox-2614508-2024-10-10",
      "headline": "Ratan Tata: The visionary who fuelled India's startup revolutionEven after his retirement, Ratan Tata continued to embody the spirit of entrepreneurship, emerging as a formidable investor and mentor to a multitude of startups across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-passes-away-age-86-leader-who-took-tata-group-from-usd-5-billion-to-100-billion-2614413-2024-10-10",
      "headline": "Ratan Tata: Leader who took Tata Group from $5 billion to $100 billionRatan Tata took over as Chairman of Tata Sons in 1991, succeeding JRD Tata. At that time, the Tata Group was largely an Indian conglomerate with annual revenues of around $5 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/star-health-acknowledges-data-breach-affecting-31-million-customers-report-says-data-was-sold-deliberately-2614501-2024-10-10",
      "headline": "Star Health acknowledges data breach affecting 31 million customersStar Health says it is investigating a possible data breach that may have led to data of 31 million customers being compromised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-1st-test-harry-brook-double-hundred-joe-root-multan-2614564-2024-10-10",
      "headline": "After Joe Root, Harry Brook hits double hundred in record partnership for EnglandAfter Joe Root, Harry Brook scored his maiden double hundred as England piled on the misery on Pakistan in the Multan Test. Brook continued his fine run of form against Pakistan with the knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/businessman-niranjan-hiranandani-ratan-tata-london-trip-pet-dog-industry-titan-dies-mumbai-2614460-2024-10-10",
      "headline": "When Ratan Tata cancelled London trip for his pet: Niranjan Hiranandani recountsRatan Tata death: Businessman Niranjan Hiranandani, who had invested in his friend Ratan Tata-backed Goodfellows, a companionship startup for senior citizens in 2022, recalled the veteran industrialist's down-to-earth nature."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/hurricane-milton-makes-landfall-florida-flash-floods-likely-2614430-2024-10-10",
      "headline": "Life-threatening hurricane Milton makes landfall in Florida, flash floods likelyOver two million people have been asked to evacuate even as millions more live in the projected path of the storm. Over 1 million homes and businesses were without power in Florida on Wednesday.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/when-ratan-tata-came-to-defence-of-a-woman-who-got-flak-for-calling-him-chhotu-2614551-2024-10-10",
      "headline": "When Ratan Tata came to defence of a woman who got flak for calling him 'chhotu'As the nation mourned the death of business tycoon Ratan Tata, a touching moment from his social media journey has resurfaced. Here's the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vettaiyan-movie-review-rajinikanth-gets-rooted-script-tj-gnanavel-middling-drama-amitabh-bachchan-rana-daggubati-fahadh-faasil-2614602-2024-10-10",
      "headline": "Vettaiyan review: Rajinikanth gets a rooted script in TJ Gnanavel's middling dramaReleased-Thu Oct 10, 2024Vettaiyan movie review: Director TJ Gnanavel's Vettaiyan, starring Rajinikanth, Amitabh Bachchan and Rana Daggubati, is a social commentary on extrajudicial killings. Good, solid moments get overshadowed by predictability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-opens-up-about-sleep-deprivation-stress-2614594-2024-10-10",
      "headline": "New mother Deepika Padukone opens up about sleep deprivation, stressBollywood star and producer Deepika Padukone recently opened up about battling mental health issues. Deepika and her husband, actor Ranveer Singh, recently welcomed a baby. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-karan-veer-mehra-losing-his-father-khatron-ke-khiladi-14-salman-khan-2614598-2024-10-10",
      "headline": "Bigg Boss 18 Day 3: Actor Karan Veer Mehra recalls losing his father at 10In the latest episode of Bigg Boss 18, Karan Veer Mehra recalled losing his father at an early age. Karan, who left the housemates emotional with his story, revealed he did not cry during his father's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vettaiyan-the-good-and-bad-of-rajinikanth-investigative-drama-2614593-2024-10-10",
      "headline": "Vettaiyan: The good and bad of Rajinikanth's investigative drama Vettaiyan, starring superstar Rajinikanth, has hit the screens. The film is expected to set the box office on fire. Here are some positive and negative aspects about the film before you book your tickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/dyson-launched-washg1-in-india-a-cord-free-wet-floor-cleaner-for-rs-64900-2614482-2024-10-10",
      "headline": "Dyson WashG1 launched in India at Rs 64,900, brings cord-free wet floor cleaningDyson introduced its first cordless wet floor cleaner, the WashG1, in India. This is  a dedicated cord-free wet floor cleaner featuring a 1-litre clean-water tank remove both wet and dry debris in a single clean. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sundar-pichai-and-bill-gates-pay-tribute-to-ratan-tata-tech-leaders-mourn-loss-of-iconic-visionary-2614558-2024-10-10",
      "headline": "Sundar Pichai and Bill Gates pay tribute to Ratan TataThe world is mourning the loss of one of India's most iconic industrialists, Ratan Tata, who passed away on Wednesday at the age of 86. As news of his passing spread, global tech leaders like Sundar Pichai and Bill Gates paid heartfelt tributes, honouring his visionary leadership and legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oneplus-13-confirmed-to-come-with-pre-installed-coloros-15-2614506-2024-10-10",
      "headline": "OnePlus 13 confirmed to come with pre-installed ColorOS 15OnePlus 13 is expected to launch in China this month. While the details are still under wraps, the company has announced that the upcoming device will come with ColorOS 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/star-health-acknowledges-data-breach-affecting-31-million-customers-report-says-data-was-sold-deliberately-2614501-2024-10-10",
      "headline": "Star Health acknowledges data breach affecting 31 million customersStar Health says it is investigating a possible data breach that may have led to data of 31 million customers being compromised. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-2024-25-auction-list-harmanpreet-singh-salima-tete-2614605-2024-10-10",
      "headline": "Hockey India League: Harmanpreet Singh leads auction list of over 1000 starsIndia captains Harmanpreet Singh and Salima Tete leads the auction list that features more than 1000 stars who have registered for the upcoming Hockey India League 2024-25, which will begin from October 13 in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-latham-new-zealand-captaincy-rebrand-test-team-india-tour-2614597-2024-10-10",
      "headline": "Captain Tom Latham hopes to rebrand New Zealand's Test team during India tourThe New Zealand Test captain, Tom Latham, is excited to transition from \"caretaker\" to full-time leader, eager to put his \"own spin on things\" starting with the upcoming India tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-nitish-reddy-gautam-gambhir-coach-bowling-heroics-delhi-t20is-2614584-2024-10-10",
      "headline": "Nitish Reddy recalls Gautam Gambhir's advice after bowling heroics in Delhi T20IIndia vs Bangladesh, 2nd T20I: Nitish Kumar Reddy won the Player of the Match award in just his second T20I. He smashed 34-ball 74 and picked up two wickets in India's 86-run victory in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-for-dropping-joe-root-easy-catch-during-1st-test-2614576-2024-10-10",
      "headline": "Babar, it hurts: Fans troll Pakistan batter for dropping Joe Root's easy catchPakistan vs England: Pakistan fans slammed star batter Babar Azam for dropping an easy catch of England's Joe Root on Day 4 of the ongoing first Test in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-1st-test-harry-brook-double-hundred-joe-root-multan-2614564-2024-10-10",
      "headline": "After Joe Root, Harry Brook hits double hundred in record partnership for EnglandAfter Joe Root, Harry Brook scored his maiden double hundred as England piled on the misery on Pakistan in the Multan Test. Brook continued his fine run of form against Pakistan with the knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-nitish-kumar-reddy-hardik-pandya-delhi-2614547-2024-10-10",
      "headline": "India want Nitish Kumar Reddy to compliment Hardik Pandya: Aakash ChopraAakash Chopra feels that Nitish Kumar Reddy is being fast tracked by India to be an all-rounder who would Hardik Pandya in the team. Nitish was the star of the show in India's thumping win in the 2nd T20I. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-canada-hp-commentator-racist-remark-viral-video-backlash-2614536-2024-10-10",
      "headline": "Commentator makes racist remark against Nepal cricketer, faces backlash from fansIn a video that is going viral on social media, a commentator can be heard making a racist remark against Nepal cricketers. Fans of the Nepal cricket team have urged the cricket administrators to take action against the commentator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-joe-root-double-hundred-multan-virat-kohli-20000-runs-2614499-2024-10-10",
      "headline": "Root hits double hundred in Multan Test, emulates Virat with 20,000 runs Pakistan vs England, 2nd Test: Joe Root hit his sixth Test double hundreds, going past Alastair Cook in another elite England list. Root became only the second active cricketer to go past 20,000 runs in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-2nd-t20i-rinku-singh-press-conference-gautam-gambhir-delhi-2614490-2024-10-10",
      "headline": "Gautam Gambhir has given us full freedom to play our natural game: Rinku SinghRinku Singh has opened up about Gautam Gambhir's coaching style and claimed that the Indian coach has given the team full freedom to play their natural game. India have won 5 out of 5 matches in T20Is under Gambhir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/former-sheffield-united-defender-george-baldock-found-dead-in-swimming-pool-2614481-2024-10-10",
      "headline": "Former Sheffield United defender George Baldock found dead in swimming poolFormer Sheffield United defender George Baldock was found dead in a swimming pool at his home on October 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ratan-tata-dies-sachin-tendulkar-mourns-visits-residence-in-mumbai-2614476-2024-10-10",
      "headline": "Sachin Tendulkar mourns death of Ratan Tata: In life and demise, he moved the nationAfter sharing an emotional note, mourning the death of industrialist Ratan Tata, Sachin Tendulkar visited the industrialist's residence early on Thursday to pay homage. BCCI secretary Jay Shah was among the many who expressed condolences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-canada-hp-commentator-racist-remark-viral-video-backlash-2614536-2024-10-10",
      "headline": "Commentator makes racist remark against Nepal cricketer, faces backlash from fansIn a video that is going viral on social media, a commentator can be heard making a racist remark against Nepal cricketers. Fans of the Nepal cricket team have urged the cricket administrators to take action against the commentator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-joe-root-double-hundred-multan-virat-kohli-20000-runs-2614499-2024-10-10",
      "headline": "Root hits double hundred in Multan Test, emulates Virat with 20,000 runs Pakistan vs England, 2nd Test: Joe Root hit his sixth Test double hundreds, going past Alastair Cook in another elite England list. Root became only the second active cricketer to go past 20,000 runs in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-2nd-t20i-rinku-singh-press-conference-gautam-gambhir-delhi-2614490-2024-10-10",
      "headline": "Gautam Gambhir has given us full freedom to play our natural game: Rinku SinghRinku Singh has opened up about Gautam Gambhir's coaching style and claimed that the Indian coach has given the team full freedom to play their natural game. India have won 5 out of 5 matches in T20Is under Gambhir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/former-sheffield-united-defender-george-baldock-found-dead-in-swimming-pool-2614481-2024-10-10",
      "headline": "Former Sheffield United defender George Baldock found dead in swimming poolFormer Sheffield United defender George Baldock was found dead in a swimming pool at his home on October 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ratan-tata-dies-sachin-tendulkar-mourns-visits-residence-in-mumbai-2614476-2024-10-10",
      "headline": "Sachin Tendulkar mourns death of Ratan Tata: In life and demise, he moved the nationAfter sharing an emotional note, mourning the death of industrialist Ratan Tata, Sachin Tendulkar visited the industrialist's residence early on Thursday to pay homage. BCCI secretary Jay Shah was among the many who expressed condolences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-press-conference-gautam-gambhir-suryakumar-yadav-delhi-2614474-2024-10-10",
      "headline": "Full freedom, play your game: Rinku Singh's life under Gambhir-SuryakumarRinku Singh has opened up about his life under the Gautam Gambhir-Suryakumar Yadav regime and claimed that both the coach and captain have given the team full freedom. Rinku scored a match-winning fifty in Delhi on October 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-red-ball-cricket-delhi-2614455-2024-10-10",
      "headline": "Red-ball love: Rinku Singh explains how he carved out Delhi masterclass vs BangladeshIND vs BAN 2nd T20I: Rinku Singh revealed his love for red-ball cricket as the reason for his blistering 53 in the Delhi encounter. The Uttar Pradesh batter averages nearly 54 in first-class cricket, boasting seven hundreds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ratan-tata-death-indian-cricket-team-rohit-sharma-suryakumar-yadav-tributes-2614448-2024-10-10",
      "headline": "Man with a heart of gold: Rohit Sharma, cricketing world mourn Ratan Tata's deathThe members of the cricketing world, led by Rohit Sharma and Suryakumar Yadav, paid their tributes to the late Ratan Tata after his death on Wednesday, October 9. Mr. Tata passed away on late Wednesday night at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-india-vs-sri-lanka-semifinals-qualification-scenario-harmanpreet-kaur-2614443-2024-10-10",
      "headline": "How close are India to semis berth after record win vs Sri Lanka?Women's T20 World Cup: India gave themselves a massive boost for a semis berth after beating Sri Lanka by 82 runs on Wednesday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-fifty-gods-plan-t20-world-cup-miss-delhi-2614434-2024-10-10",
      "headline": "'God's plan' unfolding for Rinku after unlucky T20 World Cup missIndia vs Bangladesh: After setting Delhi's Arun Jaitley Stadium ablaze with a 26-ball fifty, Rinku Singh pointed to his tattoo that reads \"God's Plan,\" then gazed up at the sky like he knew the universe had his back. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2nd-t20i-nitish-kumar-reddy-rinku-singh-2614394-2024-10-10",
      "headline": "IND vs BAN: Nitish Kumar Reddy gives perfect 'all-round' audition in Delhi India all-rounder Nitish Kumar Reddy gave a perfect audition of his all-round skills in the second T20I against Bangladesh in Delhi as he scored 74 (34) and picked 2/23 in four overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanted-rinku-nitish-and-hardik-to-play-in-tough-situation-suryakumar-yadav-2614391-2024-10-09",
      "headline": "Wanted Rinku, Nitish and Hardik to play in tough situation: Suryakumar YadavIndia got off to a jittery start and were reeling at 41/3 in the power-play in the Delhi T20I but captain Suryakumar Yadav said it helped the Indian team test their middle-order batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-india-vs-sri-lanka-semifinals-qualification-scenario-harmanpreet-kaur-2614443-2024-10-10",
      "headline": "How close are India to semis berth after record win vs Sri Lanka?Women's T20 World Cup: India gave themselves a massive boost for a semis berth after beating Sri Lanka by 82 runs on Wednesday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-fifty-gods-plan-t20-world-cup-miss-delhi-2614434-2024-10-10",
      "headline": "'God's plan' unfolding for Rinku after unlucky T20 World Cup missIndia vs Bangladesh: After setting Delhi's Arun Jaitley Stadium ablaze with a 26-ball fifty, Rinku Singh pointed to his tattoo that reads \"God's Plan,\" then gazed up at the sky like he knew the universe had his back. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2nd-t20i-nitish-kumar-reddy-rinku-singh-2614394-2024-10-10",
      "headline": "IND vs BAN: Nitish Kumar Reddy gives perfect 'all-round' audition in Delhi India all-rounder Nitish Kumar Reddy gave a perfect audition of his all-round skills in the second T20I against Bangladesh in Delhi as he scored 74 (34) and picked 2/23 in four overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanted-rinku-nitish-and-hardik-to-play-in-tough-situation-suryakumar-yadav-2614391-2024-10-09",
      "headline": "Wanted Rinku, Nitish and Hardik to play in tough situation: Suryakumar YadavIndia got off to a jittery start and were reeling at 41/3 in the power-play in the Delhi T20I but captain Suryakumar Yadav said it helped the Indian team test their middle-order batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-issues-public-apology-after-criticism-in-bangladesh-unrest-2614385-2024-10-09",
      "headline": "Shakib issues public apology after criticism in Bangladesh unrest Bangladesh all-round cricketer Shakib Al Hasan issued an apology for staying silent during the protests in the county. Shakib recently retired from T20Is and is set to play his farewell Test at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-happy-with-indian-team-ticking-all-boxes-in-womens-t20-world-cup-2614375-2024-10-09",
      "headline": "Harmanpreet happy with Indian team 'ticking all boxes' in Women's T20 World CupWomen's T20 World Cup 2024: Harmanpreet Kaur was happy with the Indian team 'ticking all the boxes' in their clash against Sri Lanka. India beat Sri Lanka by 82 runs to claim the 2nd spot in Group A. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ind-vs-ban-2nd-t20i-riyan-parag-2614373-2024-10-09",
      "headline": "Nitish Reddy thanks team management for giving him 'license' after all-round showNitish Kumar Reddy thanked the team management for giving him license to go big after match-winning show against Bangladesh in the second T20I in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-beat-sri-lanka-report-dubai-2614327-2024-10-09",
      "headline": "Harman, bowlers help India hammer Sri Lanka, remain in semis raceWomen's T20 World Cup: India beat Sri Lanka by 82 runs and improved their net run rate to +0.560, thereby strengthening their chances of going through to the semi-finals. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}