{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-closes-873-points-lower-nifty-falls-below-25000-eternal-down-4-2727592-2025-05-20",
      "headline": "Sensex closes 873 points lower, Nifty falls below 25,000; Eternal down 4%The S&P BSE Sensex lost 872.98 points to end at 81,186.44, while the NSE Nifty50 was down by 261.55 points to close at 24,683.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-itr-u-check-who-can-file-penalties-and-last-date-2727537-2025-05-20",
      "headline": "What is ITR-U? Check who can file, penalties, and last dateIf you missed filing your return on time or made a mistake in your previous ITR, the ITR-U gives you another chance to set things right—this time with more time on your hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-gcc-coverage-south-city-bangalore-hyderabad-bengaluru-chennai-hyderabad-2727538-2025-05-20",
      "headline": "South India emerges as top choice for GCC offices in early 2025With Bengaluru, Chennai, and Hyderabad collectively securing a dominant 64% share of all GCC office leasing in Q1 2025, the southern region has firmly established itself as the preferred destination for global corporations setting up specialised capability centres in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-boom-in-india-guess-what-is-fuelling-the-rs-65-lakh-crore-surge-2727514-2025-05-20",
      "headline": "Mutual fund boom in India: Guess what's fuelling the Rs 65 lakh crore surgeMumbai alone leads the chart, contributing 27% (Rs 17.75 lakh crore), followed by Delhi at 12.63%, Bengaluru at 5.39%, Pune at 4%, and Kolkata at 3.49%. These numbers haven't changed much since last year, according to data from the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-positive-opening-reasons-behind-sensex-nifty-fall-explained-2727500-2025-05-20",
      "headline": "Explained: Why Sensex tanked nearly 900 points todayAt today's closing, the Sensex had plunged 872.98 points to settle at 81,186.44, while the Nifty 50 fell 261.55 points to end at 24,683.90. All major sectoral indices closed in the red, with Auto, Media, Financial Services, and Healthcare stocks among the worst hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-nifty-rally-pause-what-should-investors-do-book-profit-paras-cochin-shipyard-ideaforge-2727480-2025-05-20",
      "headline": "Is the defence stock party over? Here's what investors need to knowShares of Paras Defence and Cochin Shipyard dropped more than 6% each during the day. The broader Nifty India Defence index was also down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-uan-step-by-step-guide-to-get-it-back-in-minutes-2727476-2025-05-20",
      "headline": "Lost your UAN? Here's a step-by-step guide to get it back in minutesYour UAN is more than just a number. Without your UAN, you can't check your PF balance, update your account, or even withdraw money when you need it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-cochin-shipyard-why-these-defence-stocks-tumbled-over-6-today-2727451-2025-05-20",
      "headline": "Paras Defence, Cochin Shipyard: Why these defence stocks tumbled over 6% todayLeading the slide were Paras Defence, Cochin Shipyard. Both fell over 6% in intraday trade. The broader Nifty India Defence index dropped 1.4% to around 11:50 am, marking its second straight day of decline after a blistering multi-week rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-checklist-who-must-file-deadlines-documents-and-the-truth-about-zero-tax-2727441-2025-05-20",
      "headline": "ITR checklist: Who must file, deadlines, documents and the truth about 'zero tax'In the 2025–26 Union Budget, the government gave a big relief, i.e., no tax on income up to Rs 12 lakh under the new tax regime. But here's the catch: You must file your ITR to claim it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-protean-egov-shares-are-in-free-fall-2727426-2025-05-20",
      "headline": "Explained: Why Protean eGov shares are in free fallAfter crashing 20% on Monday, the stock fell another 13% in early trade, briefly hovering near the Rs 995 mark—perilously close to its 52-week low of Rs 930."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pfizer-share-price-jump-12-percent-why-reason-q4-fy25-profit-rise-dividend-2727401-2025-05-20",
      "headline": "Pfizer share price rises 12% today. Here's whyPfizer stock: The stock jumped 11.91% during the day to touch a high of Rs 4,995.85 on the stock exchanges, after starting the day at Rs 4,698.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bangladesh-trade-route-curbs-economic-impact-explained-2727389-2025-05-20",
      "headline": "Explained: How Bangladesh is hurting itself by curbing Indian exportsIndia's new import rules sharply limit Bangladesh's access through Northeast land ports, forcing key goods onto restricted sea routes. The move comes after Bangladesh imposed similar restrictions on Indian goods."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/even-akshay-is-clueless-suniel-shetty-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727570-2025-05-20",
      "headline": "Even Akshay is clueless: Suniel Shetty reacts to Paresh Rawal's exit from Hera Pheri 3Actor Suniel Shetty spoke about the sudden announcement of Paresh Rawal's exit from 'Hera Pheri 3'. In an exclusive interview with us, the actor called it a 'big crisis.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kiara-advani-on-her-first-bikini-shot-from-yrf-war-2-first-action-film-2727558-2025-05-20",
      "headline": "Kiara Advani lists her firsts from War 2: First action film, first bikini shotActor Kiara Advani listed her 'lots of firsts' from Hrithik Roshan and Jr NTR-starrer 'War 2.' This is the first time she has collaborated with filmmaker Ayan Mukerji for an action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-aarti-divorce-blames-keneeshaa-for-marriage-failure-2727575-2025-05-20",
      "headline": "Ravi Mohan's wife Aarti blames 'third person' for failure of marriage in new noteAarti Ravi, estranged wife of actor Ravi Mohan, blamed a third person in a new statement. She clarified the accusations levelled against her by Ravi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vj-aishwarya-hits-back-at-reporter-who-questioned-attire-film-event-slams-media-silence-2727515-2025-05-20",
      "headline": "Tamil actor blasts reporter for 'sleeveless' comment, questions media silenceA woman anchor called out a reporter who questioned her attire at a film event and criticised the media's silence. She said such incidents affected her mentally and questioned the ethics of the film press."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-groups-twice-enhypen-announce-new-music-bts-to-reunite-next-month-2727492-2025-05-20",
      "headline": "K-pop groups TWICE, ENHYPEN, and BTS set for comebacks in 2025The second quarter of 2025 is shaping up to be a rollercoaster for K-pop fans—with groups like TWICE, ENHYPEN making a comeback and BTS all set to reunite after completing their mandatory military service. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-to-lead-as-major-general-punia-in-upcoming-war-drama-2727489-2025-05-20",
      "headline": "Operation Khukri: Randeep Hooda to lead as Major General Punia in war dramaRandeep Hooda will star as Major General Raj Pal Punia in 'Operation Khukri', a war drama based on the Indian Army's daring 2000 rescue mission in Sierra Leone. The film highlights the bravery of 233 Indian soldiers trapped for 75 days in enemy territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-sanu-daughter-shannon-interview-coachella-cannes-2727493-2025-05-20",
      "headline": "Singer Shannon says 'didn't take' father Kumar Sanu's help: Had my own journeyShannon K has successfully established herself as an independent artist, performing at Coachella and contributing to the Cannes film 'Tanvi The Great'. She credits hard work to nepotism and aims to inspire young Indian musicians worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ridhi-dogra-after-being-bullied-for-opposing-abir-gulaal-release-2727462-2025-05-20",
      "headline": "I'm a citizen too: Ridhi Dogra after being bullied for opposing Abir Gulaal releaseActor Ridhi Dogra recently revealed that she was bullied on social media for opposing her film 'Abir Gulaal's' release following the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-interview-thug-life-2727379-2025-05-20",
      "headline": "Ulaganayagan to Vinveli Nayaga: Kamal Haasan on Thug Life, death and legacyKamal Haasan is upbeat about his upcoming film, 'Thug Life', which marks his reunion with Mani Ratnam 37 years after their iconic 'Nayakan'. In a chat with India Today, he spoke in detail about the film, among several other topics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/denzel-washington-receives-honorary-palme-dor-at-cannes-film-festival-2025-2727450-2025-05-20",
      "headline": "Denzel Washington receives honorary Palme d'Or at Cannes: Blessed beyond measureHollywood actor Denzel Washington received the prestigious Honorary Palme d'Or at the Cannes Film Festival during the premiere of his new film 'Highest 2 Lowest'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tom-cruise-hints-at-end-of-mission-impossible-the-final-reckoning-2727434-2025-05-20",
      "headline": "Tom Cruise hints at end of Mission Impossible franchiseTom Cruise has hinted that 'Mission Impossible: The Final Reckoning' could mark the end of the iconic franchise. The new title and his recent comments have fuelled speculation about Ethan Hunt's final mission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-demanded-rs-25-crore-for-hera-pheri-3-akshay-kumar-legal-action-2727456-2025-05-20",
      "headline": "Paresh Rawal quit Hera Pheri 3 over fee demand, tiff with Akshay Kumar: SourcesParesh Rawal demanded Rs 25 crore for his role as Babu Rao Apte in 'Hera Pheri 3', following which he made an exit from the franchise. This irked Akshay Kumar, who has now decided to take legal action against him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-teaser-hrithik-roshan-jr-ntr-kiara-advani-promise-high-octane-action-ride-ayan-mukerji-2727433-2025-05-20",
      "headline": "War 2 teaser: No mercy, only guns do the talking in Hrithik Roshan, Jr NTR's film'War 2' teaser starring Hrithik Roshan and Jr NTR was released on May 20. The film, directed by Ayan Mukerji, will release in theatres on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/shraddha-kapoor-quits-rahi-anil-barves-film-rs17-core-fee-director-reacts-2727399-2025-05-20",
      "headline": "Did Shraddha Kapoor quit Rahi Anil's film over Rs 17 crore fee? Director reactsReports claim Shraddha Kapoor exited director Rahi Anil Barve's upcoming thriller film produced by Ekta Kapoor after allegedly demanding a Rs 17 crore fee. However, director Barve dismissed these claims as mere rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-boyfriend-shikhar-pahariya-sister-khushi-kapoor-orry-become-cheerleaders-at-cannes-2727396-2025-05-20",
      "headline": "Janhvi Kapoor's boyfriend Shikhar, sister Khushi become her cheerleaders at CannesActor Janhvi Kapoor is set to walk the Cannes red carpet for her film 'Homebound' screening. Ahead of the grand appearance, the actor received a shout-out from her squad, who accompanied her to the French Riviera. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-worldwide-box-office-collection-day-19-detailed-report-ajay-devgn-film-hits-rs-200-crore-globally-2nd-in-club-after-chhaava-2727388-2025-05-20",
      "headline": "Raid 2 box office: Ajay's film hits Rs 200 crore worldwide, 2nd after ChhaavaAjay Devgn's 'Raid 2' has entered the Rs 200 crore club at the worldwide box office. The film has also breached the Rs 150 crore nett mark back home. It is only the second Bollywood film this year after 'Chhaava' to have achieved the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-rocks-beige-outfit-at-italy-event-with-blackpink-lisa-liu-yifei-bulgari-2727380-2025-05-20",
      "headline": "Priyanka Chopra rocks beige outfit at Italy event with Lisa and Liu YifeiPriyanka Chopra looked gorgeous in a beige outfit as she attended the Bulgari event with Blackpink's Lisa and Liu Yifei. Several photos from the event have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-the-final-reckoning-box-office-collection-day-3-detailed-report-tom-cruise-film-sees-big-drop-on-monday-2727367-2025-05-20",
      "headline": "Mission Impossible 8 box office Day 3: Tom Cruise's film sees big drop on MondayWhile 'Mission: Impossible - The Final Reckoning' opened on a strong note at the Indian box office on Saturday, the film saw a huge drop on its first Monday. It is still looking at gathering solid numbers towards the second weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-simi-garewal-attend-cannes-screening-satyajit-rays-aranyer-din-ratri-2727360-2025-05-20",
      "headline": "Sharmila Tagore, Simi Garewal attend Cannes screening of Ray's Aranyer Din RatriVeteran actors Sharmila Tagore and Simi Garewal attended the screening of Satyajit Ray's iconic film, 'Aranyer Din Ratri.' The pictures of the two walking the red carpet with the team have gone viral. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-names-abhishek-banerjee-for-operation-sindoor-delegation-after-yusuf-pathan-row-sources-2727496-2025-05-20",
      "headline": "Trinamool names Abhishek Banerjee for Op Sindoor delegation after Yusuf Pathan rowAfter Yusuf Pathan opted out of the Operation Sindoor delegation, the Trinamool Congress today named Abhishek Banerjee as its representative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-isi-spy-haryana-youtuber-jyoti-malhotra-identify-indian-agents-sources-2727474-2025-05-20",
      "headline": "Pak's ISI was using 'spy' Haryana YouTuber to identify Indian agents: SourcesYouTuber Jyoti Malhotra is being interrogated by the National Investigation Agency, Intelligence Bureau and Haryana Police for her alleged involvement in cross-border influence operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-amendment-act-hearing-waqf-by-user-interim-order-2727384-2025-05-20",
      "headline": "Supreme Court hears petitions challenging Waqf law, may pass interim orderWaqf law hearing: It was decided in the last hearing that only five leading petitions would be heard from among the raft of pleas filed against the law, which expands the government's role in regulating Waqf properties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/major-mobile-networks-go-down-in-spain-weeks-after-nationwide-power-blackout-local-media-2727562-2025-05-20",
      "headline": "Spain hit by mobile network outage weeks after nationwide power blackoutAll leading providers in Spain, including Spanish telecom giant Telefonica, are down, with customers being unable to make calls, receive texts or use their mobile data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-awami-league-ban-muhammad-yunus-islamists-cant-kill-sheikh-hasina-al-sheikh-mujibur-rahman-2727402-2025-05-20",
      "headline": "Why Yunus govt, Bangladesh Islamists can't kill Awami LeagueThe Awami League, banned by Muhammad Yunus' interim government, isn't a political party but a cult. Outlawed thrice in the past, the party sprang back to life each time, and commands a 40% vote share. It is the inheritor of Mujibur Rahman's legacy, whose life is integral to Bangladesh's freedom struggle, and Bengali nationalism. This is why Islamists or Yunus won't be able to sink the AL boat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-jyoti-malhotra-caught-spying-for-pakistan-whats-the-punishment-for-espionage-in-india-2727593-2025-05-20",
      "headline": "11 caught 'spying' for Pak: What's the punishment for espionage in India?The recent arrests of eleven people, including popular travel blogger Jyoti Malhotra, have exposed a covert network leaking sensitive military and security information to foreign operatives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/covid-19-cases-surge-asia-mild-increase-india-vigilance-thailand-singapore-hong-kong-2727486-2025-05-20",
      "headline": "What's behind the sudden spike of Covid-19 cases in Asia?Covid-19 cases have surged in several Asian countries, including Hong Kong, Singapore, and Thailand. India, however, reports a mild increase."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/intelligence-bureau-chief-tapan-kumar-deka-gets-one-year-extension-till-june-2026-2727599-2025-05-20",
      "headline": "Intelligence Bureau chief Tapan Kumar Deka gets one-year extension till June 2026Deka, a 1988 batch Himachal Pradesh cadre IPS officer, was initially appointed Director of Intelligence Bureau for a tenure of two years with effect from June 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/luke-coutinho-on-the-rise-of-heart-attacks-in-the-fit-and-young-2727572-2025-05-20",
      "headline": "Luke Coutinho on the rise of heart attacks in the 'fit and young'In an exclusive interview, Luke Coutinho broke down how being 'fit' and working out isn't enough to keep your heart healthy; it's, at the end of the day, the overall lifestyle that counts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vj-aishwarya-hits-back-at-reporter-who-questioned-attire-film-event-slams-media-silence-2727515-2025-05-20",
      "headline": "Tamil actor blasts reporter for 'sleeveless' comment, questions media silenceA woman anchor called out a reporter who questioned her attire at a film event and criticised the media's silence. She said such incidents affected her mentally and questioned the ethics of the film press."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/indian-army-india-pakistan-drone-attack-air-defence-firepower-operation-sindoor-2727497-2025-05-20",
      "headline": "'Kill enemy in the sky': Army flaunts firepower that crushed Pak threatsThe Indian Army's sophisticated arsenal successfully neutralised a barrage of Pakistani drones and projectiles that targeted civilian areas in retaliation to India's Operation Sindoor. In an exclusive interaction with India Today's Gaurav Sawant from the frontline, the Army showcased the range of ammunition deployed to counter the Pakistani threat between May 7 and 10.\r\n\r\n\"Our gunners delivered exceptional results. We live by the motto 'Akashe Shatrun Jahi' (Kill the enemy in the sky). We will not spare our enemies,\" a woman officer from the Air Defence Regiment told India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/naani-ke-ghar-rasna-and-dark-room-the-indian-summer-vacation-in-the-90s-gave-us-2727541-2025-05-20",
      "headline": "The lost summers of 'Naani Ka Ghar': What 90s kids had that Gen Z doesn'tBack when summer meant a train to Naani's house, not a flight to a resort. When cousins were your first best friends, not just names on a family WhatsApp group. Let's rewind to the Great Indian summer vacation of the 90s-the kind that today's kids may never truly know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-uk-professor-who-lost-oci-tag-testified-against-india-at-us-congress-on-kashmir-heres-what-happened-2727461-2025-05-20",
      "headline": "Indian-origin professor who lost OCI tag testified against India on KashmirNitasha Kaul, a UK-based Indian-origin professor, lost her Overseas Citizen of India (OCI) status over anti-India activities. The Kashmiri Pandit academician testified before a US Congressional Committee after the revocation of Article 370, criticising human rights violations in Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-positive-opening-reasons-behind-sensex-nifty-fall-explained-2727500-2025-05-20",
      "headline": "Explained: Why Sensex tanked nearly 900 points todayAt today's closing, the Sensex had plunged 872.98 points to settle at 81,186.44, while the Nifty 50 fell 261.55 points to end at 24,683.90. All major sectoral indices closed in the red, with Auto, Media, Financial Services, and Healthcare stocks among the worst hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/no-jobs-in-us-uk-canada-for-foreign-students-harvard-grad-warns-iitians-2727518-2025-05-20",
      "headline": "No jobs in US, UK, Canada for foreign students: Harvard grad warns IITiansIndian entrepreneur Rajesh Sawhney has warned students, even IITians, about falling job opportunities in the US, UK, and Canada amid stricter immigration laws and a changing job market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astrophysicist-jayant-narlikar-dies-pm-modi-calls-it-monumental-loss-2727528-2025-05-20",
      "headline": "Jayant Narlikar, astrophysicist who challenged Big Bang Theory, diesDr. Narlikar's most celebrated contribution is the Hoyle-Narlikar theory, developed in collaboration with British astrophysicist Sir Fred Hoyle in the 1960s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/harvey-weinstein-trial-actor-jessica-mann-testimony-erectile-injection-rape-2727506-2025-05-20",
      "headline": "Ex-actor reveals Harvey Weinstein's 'monster side': Took erectile shot, raped meIn her testimony, Jessica Mann narrated how her consensual relationship with disgraced Hollywood mogul Harvey Weinstein spiralled into instances of rape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsoft-engineer-interrupts-ceo-satya-nadellas-keynote-speech-says-microsoft-is-killing-palestinians-2727495-2025-05-20",
      "headline": "Microsoft engineer interrupts CEO keynote, says company is killing PalestiniansAt the Microsoft Build event on Monday, an engineer from the company interrupted CEO Satya Nadella during his keynote speech, saying, \"Satya, how about you show how Microsoft is killing Palestinians?\". The employee was immediately escorted out of the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-missile-drone-attack-golden-temple-army-guns-head-granthi-operation-sindoor-2727358-2025-05-20",
      "headline": "Golden Temple gave rare go-ahead to deploy guns to counter Pak drones: OfficerIn an unprecedented move, the chief religious official of the Golden Temple permitted the Indian Army to deploy air defence systems within the shrine's premises to counter Pakistani drone and missile attacks amid India's Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-demanded-rs-25-crore-for-hera-pheri-3-akshay-kumar-legal-action-2727456-2025-05-20",
      "headline": "Paresh Rawal quit Hera Pheri 3 over fee demand, tiff with Akshay Kumar: SourcesParesh Rawal demanded Rs 25 crore for his role as Babu Rao Apte in 'Hera Pheri 3', following which he made an exit from the franchise. This irked Akshay Kumar, who has now decided to take legal action against him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hundreds-of-kailash-yatra-pilgrims-stranded-after-landslide-in-uttarakhands-pithoragarh-2727502-2025-05-20",
      "headline": "Landslide on Adi Kailash Yatra route, hundreds of pilgrims strandedThe landslide has blocked the route completely due to which both locals and pilgrims are stranded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-in-range-attack-ceasefire-pak-army-rawalpindi-lt-gen-sumer-ivan-dcunha-deep-hole-to-hide-2727342-2025-05-20",
      "headline": "Top Army officer says India can strike all of Pak: They'll need deep hole to hideThe entire territory of Pakistan is within India's strike range, and if the Pakistani Army relocates its headquarters, it would need to find a very deep hole to hide, a top Indian Army officer underscored India's military prowess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-new-delhi-bypass-bangladesh-trade-commerce-kaladan-multi-modal-project-myanmar-siliguri-corridor-2727179-2025-05-20",
      "headline": "How India will bypass Bangladesh roads and roadblocksAfter Bangladeshi interim leader Muhammad Yunus referred to India's \"landlocked\" Northeast during a China visit, New Delhi responded by restricting Bangladeshi exports and fast-tracking alternative connectivity plans for the Northeast, bypassing Bangladesh. The key to that is the Kaladan Multi-Modal Transit Project, which will link Kolkata with Mizoram via Myanmar."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-r-ashwin-tom-moody-csk-2727588-2025-05-20",
      "headline": "CSK have to let go R Ashwin if they are to release funds: MoodyIPL 2025: Tom Moody said that the Chennai Super Kings (CSK) have to let go R Ashwin before the season to free up their purse. CSK bought Ashwin for Rs 9.75 crore in the mega auction last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-sanjiv-goenka-lucknow-2727582-2025-05-20",
      "headline": "LSG owner Sanjiv Goenka posts heartwarming image with Pant after IPL exitLSG owner Sanjiv Goenka shared a heartwarming image with Rishabh Pant after the team's exit from the IPL 2025. Lucknow were eliminated after their loss to Hyderabad at the Ekana stadium on May 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-nico-williams-not-transfer-target-joan-laporta-confirms-2727550-2025-05-20",
      "headline": "FC Barcelona not looking at Nico Williams in transfer plans: Laporta confirmsBarcelona president Joan Laporta has confirmed that the club is no longer pursuing a move for Athletic Club winger Nico Williams. While the Spaniard was previously on their shortlist, Barcelona are now focusing on other targets ahead of the summer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-final-manchester-united-vs-tottenham-patrice-evra-2727540-2025-05-20",
      "headline": "No excuses: Evra sends rallying call to Manchester United before Europa finalPatrice Evra sent a rallying call to the Manchester United players, urging them to give their all in the upcoming Europa League final against Tottenham Hotspur on Wednesday, May 21. Evra said that United will have no excuses during the match in Bilbao. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-landmark-csk-vs-rr-record-2727529-2025-05-20",
      "headline": "MS Dhoni nears big six-hitting landmark as CSK look to salvage prideIPL 2025: MS Dhoni is on the cusp of becoming only the fourth Indian in Men's T20s to hit 350 or more sixes. The 42-year-old Dhoni has scored 180 runs from 12 matches in the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-new-test-captain-shubman-gill-rishabh-pant-selection-committee-2727513-2025-05-20",
      "headline": "Indian selectors undecided about Test captaincy after Gill, Pant talks: ReportAccording to a latest report from Sky Sports, the Indian selection committee is still undecided about whom to name as the new Test captain after holding informal talks with both Shubman Gill and Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kaka-brazil-coaching-staff-join-carlo-ancelotti-world-cup-qualifiers-2727511-2025-05-20",
      "headline": "Ballon d'Or winner Kaka eager to join Ancelotti's Brazil coaching staffFormer Ballon d'Or winner Kaka has expressed his interest in joining Carlo Ancelotti's coaching staff for the Brazil national team, stating he's ready to serve his country again as the five-time champions prepare for a new era under the Italian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-best-batting-performance-daniel-vettori-2727491-2025-05-20",
      "headline": "SRH gave their best batting performance in LSG win: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori heaped praise on his team's batting performance in their win over Lucknow Super Giants on May 19, specifically from the likes of Abhishek Sharma as he hailed his side's display as their best this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-batting-spot-captaincy-mohammed-kaif-2727483-2025-05-20",
      "headline": "Rishabh Pant didn't know his own role as LSG captain in IPL 2025: Mohammed KaifMohammed Kaif feels that Rishabh Pant didn't know his own role as the skipper of LSG after his struggles with the bat continued on Monday, April 19. Pant was dismissed for just 7 runs during the match at the Ekana stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-arthur-ashe-stadium-modernise-transformation-2727471-2025-05-20",
      "headline": "US Open's Ashe Stadium to undergo 800 million dollars transformationThe United States Tennis Association has self-funded the massive 800 million dollars project to transform and modernise the famed Arthur Ashe Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-preview-predicted-xi-delhi-pitch-conditions-2727458-2025-05-20",
      "headline": "Battered Chennai, Rajasthan look to avoid wooden spoon finishIPL 2025, CSK vs RR: MS Dhoni's Chennai Super Kings and Sanju Samson's Rajasthan Royals will be looking for a win in a game that has no bearing as far as qualification for the playoffs is concerned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kaka-brazil-coaching-staff-join-carlo-ancelotti-world-cup-qualifiers-2727511-2025-05-20",
      "headline": "Ballon d'Or winner Kaka eager to join Ancelotti's Brazil coaching staffFormer Ballon d'Or winner Kaka has expressed his interest in joining Carlo Ancelotti's coaching staff for the Brazil national team, stating he's ready to serve his country again as the five-time champions prepare for a new era under the Italian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-best-batting-performance-daniel-vettori-2727491-2025-05-20",
      "headline": "SRH gave their best batting performance in LSG win: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori heaped praise on his team's batting performance in their win over Lucknow Super Giants on May 19, specifically from the likes of Abhishek Sharma as he hailed his side's display as their best this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-batting-spot-captaincy-mohammed-kaif-2727483-2025-05-20",
      "headline": "Rishabh Pant didn't know his own role as LSG captain in IPL 2025: Mohammed KaifMohammed Kaif feels that Rishabh Pant didn't know his own role as the skipper of LSG after his struggles with the bat continued on Monday, April 19. Pant was dismissed for just 7 runs during the match at the Ekana stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-arthur-ashe-stadium-modernise-transformation-2727471-2025-05-20",
      "headline": "US Open's Ashe Stadium to undergo 800 million dollars transformationThe United States Tennis Association has self-funded the massive 800 million dollars project to transform and modernise the famed Arthur Ashe Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-preview-predicted-xi-delhi-pitch-conditions-2727458-2025-05-20",
      "headline": "Battered Chennai, Rajasthan look to avoid wooden spoon finishIPL 2025, CSK vs RR: MS Dhoni's Chennai Super Kings and Sanju Samson's Rajasthan Royals will be looking for a win in a game that has no bearing as far as qualification for the playoffs is concerned. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}