{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurate-rising-rajasthan-global-investment-summit-jaipur-2646741-2024-12-08",
      "headline": "PM Modi to inaugurate 'Rising Rajasthan Global Investment Summit' tomorrowAiming to bolster investment opportunities in Rajasthan, Prime Minister Narendra Modi to unveil the Rising Rajasthan Global Investment Summit in Jaipur on Monday, December 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unacademy-ceo-gaurav-munjal-denies-reports-of-sale-deal-with-allen-career-institute-2646516-2024-12-07",
      "headline": "Not doing any sale: Unacademy CEO Gaurav Munjal denies reports of takeover dealReports earlier suggested that Allen Career Institute was in talks to acquire Unacademy for $800 million, significantly lower than its peak valuation of $3.4 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-can-become-the-ai-capital-of-the-world-metas-sandhya-devanathan-2646252-2024-12-07",
      "headline": "India can become the AI capital of the world: Meta's Sandhya DevanathanSandhya Devanathan, Vice President and Head of India at Meta, discusses the company's AI initiatives, including Meta AI and Llama models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-are-going-to-be-future-ready-priyank-kharge-on-ai-transforming-job-market-2646186-2024-12-06",
      "headline": "We are going to be future ready: Priyank Kharge on AI transforming job marketSharing his thoughts on AI creating a job deficit, Priyank Kharge, Minister of IT and Biotechnology of Karnataka said that technological evolution creates new opportunities rather than eliminating them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forging-the-future-cp-gurnani-aditya-ghosh-discuss-ais-role-in-empowering-india-2646110-2024-12-06",
      "headline": "Forging the future: CP Gurnani, Aditya Ghosh discuss AI's role in empowering IndiaCP Gurnani highlighted the necessity of blending AI with human capabilities. Aditya Ghosh emphasised the accessibility of AI, calling this era a \"magical time\" akin to the Industrial Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/firms-leveraging-ai-to-empower-workforce-on-right-track-says-professor-das-narayandas-2645981-2024-12-06",
      "headline": "Firms using AI to empower workforce likely to excel in future: Professor Das NarayandasSpeaking at the India Today-Business Today AI Conference 2024, during a session titled 'Leadership.Change.AI', he emphasised that organisations focusing on how AI can augment their workforce are likely to emerge as industry leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mcx-share-price-hits-rs-7000-milestone-as-stock-rallies-over-8-percent-high-volume-2645915-2024-12-06",
      "headline": " MCX share price hits Rs 7,000 milestone as stock rallies over 8%The stock has delivered an impressive growth trajectory, with gains of over 100% in the past year, over 300% in the last three years, and more than 500% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-today-jumps-over-6-percent-explained-2645894-2024-12-06",
      "headline": "Explained: Why Vedanta share price jumped over 6% todayThe surge in stock price follows an announcement from Vedanta Resources Finance II PLC, a subsidiary of VRL, that it had redeemed the full amount of $1.2 billion in bonds due in 2025 but extended to 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcements-repo-rate-unchanged-homebuyers-may-have-to-wait-till-2025-for-emi-relief-2645893-2024-12-06",
      "headline": "RBI MPC: Homebuyers may have to wait till 2025 for EMI reliefThe RBI has kept key lending rates unchanged with Governor Shaktikanta Das explaining the Monetary Policy Committee's (MPC) focus on economic stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-crr-to-4-how-this-liquidity-boost-will-benefit-the-economy-2645873-2024-12-06",
      "headline": "RBI cuts CRR to 4%: How this liquidity boost will benefit economyThe decision to cut CRR is expected to benefit the banking sector, particularly public sector banks, by lowering the cost of funds and increasing lending capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-to-activate-uan-for-employment-linked-incentive-eli-scheme-to-december-15-2645519-2024-12-06",
      "headline": "EPFO extends deadline to activate UAN for ELI scheme. Check final dateThe EPFO has extended the deadline to link UAN and Aadhaar under the ELI scheme to mid-December, aiming to boost job creation with incentives for employees and employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-policy-repo-rate-action-crticisim-piyush-goyal-nirmala-sitharaman-2645843-2024-12-06",
      "headline": "'Our job is…': RBI Governor defends policy amid criticism over lending ratesShaktikanta Das explained that the decision to hold rates stems from a dual focus on managing inflation and supporting growth. He acknowledged the recent rise in inflation, primarily due to food prices, and the moderation in economic growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-cash-reserve-ratio-crr-understanding-rbi-liquidity-management-tool-how-will-crr-impact-economy-2645799-2024-12-06",
      "headline": "What is Cash Reserve Ratio? Understanding RBI's liquidity management toolThe RBI cut the Cash Reserve Ratio (CRR) to 4% on December 6, injecting Rs 1.16 lakh crore into the banking system to boost liquidity, credit flow, and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-key-takeaways-lower-gdp-forecast-crr-boost-inflation-projection-new-podcast-ai-2645801-2024-12-06",
      "headline": "Lower GDP forecast to CRR boost: 6 key takeaways from RBI MPCThe MPC decided by a 4-2 majority to maintain the policy repo rate at 6.5%. Governor Shaktikanta Das explained that this decision was based on an assessment of the economy and financial conditions. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-says-syrian-president-bashar-al-assad-has-left-damascus-on-plane-as-army-says-his-rule-ends-2646778-2024-12-08",
      "headline": "Russia says President Assad has left Syria as rebels take control of DamascusSyrian rebels announced on Sunday that they had seized control of the capital, Damascus, in an offensive, and proclaimed the end of Assad's decades-long \"tyranny\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-mens-asia-cup-india-vs-bangladesh-final-2646779-2024-12-08",
      "headline": "Bangladesh successfully defend U19 Asia Cup title after beating India U19 Men's Asia Cup 2024: Bangladesh, led by Azizul Hakim, won the tournament after beating Mohamed Amaan's India in the final by 59 runs on Sunday, December 8 at the Dubai International Cricket Stadium.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-protest-march-punjab-haryana-delhi-chalo-shambhu-border-talks-government-2646614-2024-12-08",
      "headline": "Farmers suspend 'Dilli Chalo' march for today after 9 injured in tear gas shellingThe farmers were stopped by the Haryana Police just a few meters away from the Shambhu border, resulting in clashes. The police responded by firing tear gas shells to disperse the protesters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-civil-war-russias-upper-house-konstantin-kosachyov-says-will-help-if-needed-but-civil-war-is-syrias-fight-2646781-2024-12-08",
      "headline": "Will help if needed, but civil war is Syria's fight: Russian lawmaker Syrians will have to face a full-scale civil war on their own, said Konstantin Kosachyov, deputy chairman of Russia's upper house of parliament, on Sunday, while indicating that Moscow remains willing to support the Syrian people under specific circumstances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/why-solo-trips-are-essential-even-when-you-have-a-partner-or-kids-2646687-2024-12-08",
      "headline": "Why solo trips are essential, even when you have a partner or kidsTravelling solo might seem odd when you have a partner, but it offers unique benefits that strengthen both your relationship and personal growth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/weather-update-delhi-temperature-may-drop-to-3-degrees-celsius-cold-wave-north-india-western-disturbance-himalaya-snowfall-2646734-2024-12-08",
      "headline": "Delhi braces for cold wave as temperature likely to plunge to 3°C next weekCurrently, Delhi's minimum temperature hovers around 7°C. However, the chilling conditions are predicted to intensify due to a combination of factors, including snowfall in the northern hills and the influence of a Western Disturbance, which could bring light showers to the plains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-shares-dreamy-wedding-pics-with-naga-chaitanya-2646794-2024-12-08",
      "headline": "Sobhita Dhulipala shares dreamy wedding pics with Naga ChaitanyaActor Sobhita Dhulipala on Sunday shared dreamy wedding photos with actor Naga Chaitanya. The pair got married in Hyderabad on December 4. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/bhut-jolokia-lost-its-sting-bhot-naga-mircha-raja-mirchi-worlds-hottest-ghost-chilli-pepper-scoville-heat-unit-2646592-2024-12-08",
      "headline": "Why Bhut Jolokia, once world's hottest chilli pepper, is losing its stingBhut Jolokia or Naga Mircha from India's northeast was recorded as the world's hottest chilli pepper in 2007. It is becoming a victim of its fame and witnessing an erosion in its heat quotient. Here's what led to the Ghost Pepper losing its sting and what can be done to preserve its heat and unique flavour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-u19-asia-cup-final-aus-w-vs-ind-w-indian-cricket-team-2646785-2024-12-08",
      "headline": "Sombre Sunday: India complete unwanted hat-trick on December 8 in cricketIndian cricket faced a tough day as the men's team lost the pink-ball Test to Australia, the women's team was defeated in the ODI series, and the U-19 team fell to Bangladesh in the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-game-11-d-gukesh-beats-ding-liren-singapore-2646787-2024-12-08",
      "headline": "D Gukesh beats Ding Liren in Game 11 for crucial late leadD Gukesh secured a thrilling win in Game 11 of the World Chess Championship on Sunday, December 8 to take a crucial late lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-assembly-eknath-shinde-shiv-sena-mla-bjp-devendra-fadnavis-speaker-chief-minister-2646738-2024-12-08",
      "headline": "11 MLAs from Shinde Sena to take oath as cabinet ministers: SourcesWhile six former ministers from the previous government are likely to be inducted into the cabinet, five new MLAs are expected to secure cabinet berths."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bashar-al-assad-plane-disappears-crash-shot-down-speculation-altitude-loss-flightradar-syria-civil-war-2646706-2024-12-08",
      "headline": "Assad killed in plane crash? Buzz as Syrian Air flight disappears from radarAn aircraft, believed to have been carrying Syrian President Bashar al-Assad, took off from Damascus airport around the time rebel forces seized control of the capital. However, it vanished from radar mid-flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/ahead-of-hyundai-creta-maruti-brezza-mahindra-scorpio-meet-chart-topper-indian-suv-2646700-2024-12-08",
      "headline": "Meet chart-topper Indian SUV. Ahead of Creta, Brezza, Scorpio in 2024This affordable, 5-star safety-rated Indian SUV is available in both ICE and EV versions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-shahid-afridi-message-to-pcb-pakistan-cricket-team-2646746-2024-12-08",
      "headline": "Don't send team to India for any events: Shahid Afridi's message to PCBFormer Pakistan captain Shahid Afridi has urged the PCB to boycott cricket events in India unless India agrees to play in Pakistan. Afridi emphasised self-reliance and criticised the ICC for prioritising profits over fair play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-elect-donald-trump-criticises-russia-role-syria-says-lost-all-interest-because-of-ukraine-2646745-2024-12-08",
      "headline": "Trump criticises Russia's role in Syria: Lost all interest because of UkraineUS President-elect Donald Trump criticized Russia for abandoning Syrian President Bashar al-Assad and losing interest due to the Ukraine war. Trump said that Assad fled his country and Russia was not interested in protecting him any longer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/covert-alliances-and-the-assault-on-syrian-cities-a-strategic-campaign-2646681-2024-12-08",
      "headline": "Covert alliances and the assault on Syrian cities: A strategic campaignSyria's fate hangs in the balance: Can internal unity and global intervention stop the country from collapsing into chaos?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-men-too-should-take-the-cervical-cancer-vaccine-2646091-2024-12-06",
      "headline": "Why men too should take the cervical cancer vaccineOncologist Dr Niti Raizada says vaccinating both women and men against the human papillomavirus can significantly contain cervical cancer while protecting males from related cancers"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syrian-unrest-who-is-abu-mohammed-al-julani-rebel-leader-who-overthrew-assad-regime-2646710-2024-12-08",
      "headline": "Who is Abu Mohammed al-Julani, Syrian rebel leader who overthrew Assad regime?Abu Mohammed al-Julani is currently Syria's most recognisable rebel leader, having gradually stepped into the limelight since severing ties with Al-Qaeda in 2013. He re-branded his group and emerged as the ruler of rebel-held northwestern Syria.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rohit-sharma-captaincy-jasprit-bumrah-workload-adelaide-test-2646676-2024-12-08",
      "headline": "Bumrah can't bowl from both ends: Rohit defends captaincy calls in 2nd TestAustralia vs India, 2nd Test: Captain Rohit Sharma responded to criticism about his handling of the fast bowlers in the pink-ball Test. Rohit said it's unfair to expect Jasprit Bumrah to shoulder the bulk of the workload, saying winning a Test match involves a collective effort. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-beauty-influencer-uses-green-chillies-natural-lip-plumper-viral-video-2646670-2024-12-08",
      "headline": "Delhi influencer uses green chillies as 'natural lip plumper'. Video angers InternetA Delhi-based beauty influencer has angered the internet after she shared a video of herself using green chillies as a \"natural lip plumper\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-435-07-12-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/syria-bashar-al-assad-government-opposition-rebel-war-hafez-damascus-2646711-2024-12-08",
      "headline": "End of 54 years of Assad dynasty as rebels proclaim new chapter for SyriaThe collapse of Bashar al-Assad's government marks the end of a nearly 54-year dynasty that began in 1971 under his father, Hafez al-Assad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-edmonton-apartment-murder-harshandeep-singh-indian-student-arrested-2646662-2024-12-08",
      "headline": "20-year-old Indian student, working as security guard, shot dead in CanadaA 20-year-old Indian student, Harshandeep Singh, was shot dead in Edmonton in Canada and the police arrested two suspects and charged them with first-degree murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/sharmila-tagore-fun-birthday-lunch-with-sara-saif-ali-khan-kareena-kapoor-2646802-2024-12-08",
      "headline": "Inside Sharmila Tagore's fun birthday lunch with Sara, Saif and KareenaActor Sara Ali Khan shared a bunch of photos on her Instagram handle to mark her grandmother and actor Sharmila Tagore's birthday. The images also featured Kareena Kapoor and Saif Ali Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-shares-dreamy-wedding-pics-with-naga-chaitanya-2646794-2024-12-08",
      "headline": "Sobhita Dhulipala shares dreamy wedding pics with Naga ChaitanyaActor Sobhita Dhulipala on Sunday shared dreamy wedding photos with actor Naga Chaitanya. The pair got married in Hyderabad on December 4. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/shalini-passi-says-she-would-like-to-take-mira-rajput-with-her-on-bigg-boss-18-2646786-2024-12-08",
      "headline": "Shalini Passi says she would like to take Mira Rajput with her on BB 18Fabulous Lives vs Bollywood Wives star Shalini Passi recently disclosed two celebrities she would love to take with her on Salman Khan's Bigg Boss 18, one of whom is Shahid Kapoor's wife and influencer Mira Rajput. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-iulia-vantur-father-birthday-celebration-2646758-2024-12-08",
      "headline": "Photos: Salman Khan attends Iulia Vantur's father's birthday celebrationBollywood superstar Salman Khan recently attended Iulia Vantur's father's intimate birthday celebration in Mumbai. Iulia later shared photos from the bash on her social media handle. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-balanced-approach-shelved-leaned-into-aggression-adelaide-robin-uthappa-2646796-2024-12-08",
      "headline": "Siraj is gonna give it back to Australia doubly in kind in Gabba: GavaskarMohammed Siraj faced intense challenges in Adelaide but earned Sunil Gavaskar's backing to retaliate with fiery performances in Gabba after a heated exchange with Travis Head and relentless bouncers from Australia's pace attack marked the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-sachin-tendulkar-pv-sindhu-wedding-2646789-2024-12-08",
      "headline": "Sindhu, finance Venkata Datta Sai invite Sachin Tendulkar for weddingSachin Tendulkar wished PV Sindhu as the badminton star is set to marry Venkata Datta Sai on December 22. Sindhu recently bagged the Syed Modi international title after beating China's Wu Luo Yu in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-game-11-d-gukesh-beats-ding-liren-singapore-2646787-2024-12-08",
      "headline": "D Gukesh beats Ding Liren in Game 11 for crucial late leadD Gukesh secured a thrilling win in Game 11 of the World Chess Championship on Sunday, December 8 to take a crucial late lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-u19-asia-cup-final-aus-w-vs-ind-w-indian-cricket-team-2646785-2024-12-08",
      "headline": "Sombre Sunday: India complete unwanted hat-trick on December 8 in cricketIndian cricket faced a tough day as the men's team lost the pink-ball Test to Australia, the women's team was defeated in the ODI series, and the U-19 team fell to Bangladesh in the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-mens-asia-cup-india-vs-bangladesh-final-2646779-2024-12-08",
      "headline": "Bangladesh successfully defend U19 Asia Cup title after beating India U19 Men's Asia Cup 2024: Bangladesh, led by Azizul Hakim, won the tournament after beating Mohamed Amaan's India in the final by 59 runs on Sunday, December 8 at the Dubai International Cricket Stadium.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jay-shah-icc-chairman-ravi-shastri-success-interview-2646777-2024-12-08",
      "headline": "Jay Shah is no one's fool, he will do wonders as ICC Chair: Ravi Shastri Former India captain Ravi Shastri heaped praise on Jay Shah's administrative acumen, backing the newly-appointed ICC chair to make the global cricket body a more powerful organisation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-ab-de-villiers-siraj-verbal-spat-travis-head-adelaide-test-2646776-2024-12-08",
      "headline": "That's Siraj for you: AB de Villiers reacts to pacer's verbal spat with HeadFormer South African legend AB de Villiers shared his views on Mohammed Siraj's fiery exchange with Travis Head during the Adelaide Test, praising the Indian pacer's passion while advocating limits on personal or offensive sledging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-run-drought-affecting-captaincy-harbhajan-singh-adelaide-test-2646772-2024-12-08",
      "headline": "Rohit Sharma's run drought affecting his captaincy? Harbhajan explainsHarbhajan Singh emphasised the pressing need for Rohit Sharma to rediscover his form as both a batter and captain, following India's humiliating defeat in Adelaide, where questions about his leadership and batting slump grew louder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-dan-ashworth-leaves-manchester-united-sporting-director-role-after-5-months-2646766-2024-12-08",
      "headline": "Dan Ashworth leaves Manchester United sporting director role after 5 monthsDan Ashworth has resigned as Manchester United's sporting director after five months. The decision, described as mutual, follows United's recent defeat to Nottingham Forest in the Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-prabath-jayasuriya-record-2646761-2024-12-08",
      "headline": "Prabath Jayasuriya joins Shakib, Jadeja in elite club with 5-wicket haul SA vs SL, 2nd Test: Prabath Jayasuriya took his 10th five-wicket haul in Test cricket in the second Test against South Africa at the St George's Park in Gqeberha. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jay-shah-icc-chairman-ravi-shastri-success-interview-2646777-2024-12-08",
      "headline": "Jay Shah is no one's fool, he will do wonders as ICC Chair: Ravi Shastri Former India captain Ravi Shastri heaped praise on Jay Shah's administrative acumen, backing the newly-appointed ICC chair to make the global cricket body a more powerful organisation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-ab-de-villiers-siraj-verbal-spat-travis-head-adelaide-test-2646776-2024-12-08",
      "headline": "That's Siraj for you: AB de Villiers reacts to pacer's verbal spat with HeadFormer South African legend AB de Villiers shared his views on Mohammed Siraj's fiery exchange with Travis Head during the Adelaide Test, praising the Indian pacer's passion while advocating limits on personal or offensive sledging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-run-drought-affecting-captaincy-harbhajan-singh-adelaide-test-2646772-2024-12-08",
      "headline": "Rohit Sharma's run drought affecting his captaincy? Harbhajan explainsHarbhajan Singh emphasised the pressing need for Rohit Sharma to rediscover his form as both a batter and captain, following India's humiliating defeat in Adelaide, where questions about his leadership and batting slump grew louder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-dan-ashworth-leaves-manchester-united-sporting-director-role-after-5-months-2646766-2024-12-08",
      "headline": "Dan Ashworth leaves Manchester United sporting director role after 5 monthsDan Ashworth has resigned as Manchester United's sporting director after five months. The decision, described as mutual, follows United's recent defeat to Nottingham Forest in the Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-prabath-jayasuriya-record-2646761-2024-12-08",
      "headline": "Prabath Jayasuriya joins Shakib, Jadeja in elite club with 5-wicket haul SA vs SL, 2nd Test: Prabath Jayasuriya took his 10th five-wicket haul in Test cricket in the second Test against South Africa at the St George's Park in Gqeberha. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-josh-hazlewood-return-for-brisbane-test-pat-cummins-update-2646752-2024-12-08",
      "headline": "Hazlewood to return for Brisbane Test vs India? Cummins gives big updateAustralia skipper Pat Cummins revealed Josh Hazlewood's possible return for the Brisbane Test after missing the Adelaide match. The pacer's absence didn't hinder Australia, but his comeback might force Scott Boland out despite his impressive performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-shahid-afridi-message-to-pcb-pakistan-cricket-team-2646746-2024-12-08",
      "headline": "Don't send team to India for any events: Shahid Afridi's message to PCBFormer Pakistan captain Shahid Afridi has urged the PCB to boycott cricket events in India unless India agrees to play in Pakistan. Afridi emphasised self-reliance and criticised the ICC for prioritising profits over fair play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-adelaide-test-rohit-sharma-captaincy-ravi-shastri-body-language-2646735-2024-12-08",
      "headline": "Captain Rohit Sharma needs to be more involved, more animated: Ravi ShastriAustralia vs India, 2nd Test: Ravi Shastri said Rohit Sharma's body language did not inspire the team in Adelaide, urging him to return to the top of the batting order and lead the team from the front. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-pm-assures-pcb-of-full-support-on-champions-trophy-source-2646732-2024-12-08",
      "headline": "Pakistan PM assures board of full support on Champions Trophy: SourcePakistan PM Shehbaz Sharif has promised PCB chairman Mohsin Naqvi full support regarding the Champions Trophy hosting issue, emphasising the importance of maintaining national pride. The ICC has agreed to a hybrid model for the tournament, allowing India to play in Dubai, while Pakistan seeks government guidance for further decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-england-2nd-odi-charlie-dean-hat-trick-2646733-2024-12-08",
      "headline": "Charlie Dean joins James Anderson in elite club with ODI hat-trick  SA-W vs ENG-W: Charlie Dean became the seventh English bowler to take a hat-trick in ODIs. She achieved the feat in the second ODI against South Africa at the Kingsmead in Durban. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-adam-gilchrist-prank-blindfold-adelaide-test-2646730-2024-12-08",
      "headline": "Watch: Rishabh Pant pranks Adam Gilchrist during Adelaide Test Rishabh Pant brought levity to a tough match by pranking Adam Gilchrist during the Adelaide Test, leaving fans smiling amidst India's struggles. The cheeky gesture showcased the camaraderie shared between two wicketkeeping greats, even as India faced defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-virat-kohli-in-nets-sunil-gavaskar-2646723-2024-12-08",
      "headline": "Virat Kohli in nets after pink-ball Test loss: Gavaskar praises star's dedicationSunil Gavaskar heaped praise on Virat Kohli for hitting the nets soon after India's pink-ball Test loss to Australia in Adelaide on Sunday, December 8. Kohli didn't have the best of times in the pink-ball Test as he registered low scores. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/michail-antonio-stable-condition-west-ham-statement-car-accident-essex-premier-league-2646720-2024-12-08",
      "headline": "West Ham confirm Michail Antonio in stable condition after horror car-accidentWest Ham striker Michail Antonio is recovering after a serious car accident. The club confirmed his stable condition and urged privacy, as fans and the football world rallied around the club's record Premier League goalscorer during his recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-england-2nd-odi-charlie-dean-hat-trick-2646733-2024-12-08",
      "headline": "Charlie Dean joins James Anderson in elite club with ODI hat-trick  SA-W vs ENG-W: Charlie Dean became the seventh English bowler to take a hat-trick in ODIs. She achieved the feat in the second ODI against South Africa at the Kingsmead in Durban. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-adam-gilchrist-prank-blindfold-adelaide-test-2646730-2024-12-08",
      "headline": "Watch: Rishabh Pant pranks Adam Gilchrist during Adelaide Test Rishabh Pant brought levity to a tough match by pranking Adam Gilchrist during the Adelaide Test, leaving fans smiling amidst India's struggles. The cheeky gesture showcased the camaraderie shared between two wicketkeeping greats, even as India faced defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-virat-kohli-in-nets-sunil-gavaskar-2646723-2024-12-08",
      "headline": "Virat Kohli in nets after pink-ball Test loss: Gavaskar praises star's dedicationSunil Gavaskar heaped praise on Virat Kohli for hitting the nets soon after India's pink-ball Test loss to Australia in Adelaide on Sunday, December 8. Kohli didn't have the best of times in the pink-ball Test as he registered low scores. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/michail-antonio-stable-condition-west-ham-statement-car-accident-essex-premier-league-2646720-2024-12-08",
      "headline": "West Ham confirm Michail Antonio in stable condition after horror car-accidentWest Ham striker Michail Antonio is recovering after a serious car accident. The club confirmed his stable condition and urged privacy, as fans and the football world rallied around the club's record Premier League goalscorer during his recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-women-series-brisbane-match-report-highlights-2646717-2024-12-08",
      "headline": "India register record low in Brisbane, as Australia clinch thumping series winAustralia women's team registered a thumping win against India in Brisbane to take an unassailable 2-0 win in the 3-match series. Ellyse Perry scored her fastest hundred vs India as the Harmanpreet Kaur team sunk to new low.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-travis-head-supper-impressive-pat-cummins-praise-siraj-fight-reacts-2646712-2024-12-08",
      "headline": "Cummins heaps praise on Head's Adelaide Test knock, reacts on Siraj fightTravis Head's counterattacking 140 off 141 in the Adelaide Test powered Australia to a resounding 10-wicket win, leveling the series 1-1. Pat Cummins hailed Head's knock as a game-changer in a high-stakes encounter against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-2nd-test-sunil-gavaskar-training-message-hotel-rooms-adelaide-brisbane-2646697-2024-12-08",
      "headline": "Don't sit in your hotel room: Gavaskar urges India to practice more in AustraliaAustralia vs India: Legendary Sunil Gavaskar urged the Indian cricket team to use the off-days between Tests for training. Gavaskar spoke against 'optional training', urging Rohit Sharma and his team to fine tune their skills before the third Test, starting December 14 in Brisbane. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}