{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-board-meeting-today-agenda-futures-and-options-new-asset-class-controversy-madhabi-puri-buch-2608637-2024-09-30",
      "headline": "Sebi board meeting today. What's on the agenda?On the agenda are discussions surrounding tighter norms for Futures & Options (F&O) trading, the introduction of a 'New Asset Class,' and the much-anticipated mutual fund lite regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-lists-at-25-percent-premium-over-ipo-price-hold-or-sell-2608629-2024-09-30",
      "headline": " Manba Finance lists at 25% premium over IPO price. Hold or sell? Will Manba Finance shares continue to rise after listing on Dalal Street or is it time to cash in on your gains? Here's all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-allotment-step-by-step-guide-to-check-application-status-latest-gmp-2608615-2024-09-30",
      "headline": "KRN Heat Exchanger IPO allotment: Step-by-Step guide to check statusKRN Heat Exchanger IPO allotment: Investors who participated in the KRN Heat Exchanger IPO can check their allotment status through the websites of the Bombay Stock Exchange and Bigshare Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1000-points-nifty-falls-it-financial-shares-2608562-2024-09-30",
      "headline": "Sensex crashes over 1,000 points. What's making D-Street bulls nervous?Stock market crash: The Sensex was down 1,018.81 points to 84,553.04 at 11:50 am and the Nifty50 tanked 290.20 points to trade at 25,888.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-settles-legal-dispute-with-bharatpe-ends-all-company-ties-2608545-2024-09-30",
      "headline": "Ashneer Grover settles with BharatPe after ugly legal battle, ends ties to firmThe resolution comes after a tumultuous period marked by allegations of financial misconduct against Ashneer Grover and his family during his tenure at BharatPe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-becomes-worlds-third-richest-person-enters-200-billion-dollar-club-2608535-2024-09-30",
      "headline": "Mark Zuckerberg becomes world's fourth-richest person, enters $200 billion clubMark Zuckerberg's net worth has surged to $200 billion, positioning him as the fourth-richest person globally, right behind Amazon founder Jeff Bezos,, Tesla CEO Elon Musk and LVMH Chairman Bernard Arnault.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-report-deadline-extension-october-7-who-benefits-2608529-2024-09-30",
      "headline": "Income tax audit report deadline extended to October 7. Who benefits? Income tax audit report deadline: Originally set for September 30, 2024, the new deadline is now October 7, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-share-price-listing-at-25-percent-premium-subscribe-or-not-2608518-2024-09-30",
      "headline": "Manba Finance shares list at 25% premium over IPO priceManba Finance IPO listing: Despite making a decent debut on the stock exchanges, the listing fell short of what the GMP had indicated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-slumps-700-points-nifty-falls-below-26000-amid-profit-booking-2608512-2024-09-30",
      "headline": "Sensex slumps 700 points, Nifty falls below 26,000 amid profit bookingThe S&P BSE Sensex was down 685.85 points to 84,886 at 10:14 am, while the NSE Nifty50 fell 191.60 points to 25,987.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Modi vs Modi: The succession war brewing at Godfrey PhillipsAs the legal showdown unfolds, it's Modi vs Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-observation-andhra-pradesh-tirupati-temple-laddu-row-2608641-2024-09-30",
      "headline": "Why go to press without proof on ghee, Supreme Court asks AndhraThe Supreme Court emphasised that individuals holding constitutional office should keep religion separate from politics, while hearing petitions on the alleged adulteration of Tirupati temple laddus. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-congress-mallikarjun-kharge-ill-prime-minister-narendra-modi-jammu-and-kashmir-2608505-2024-09-30",
      "headline": "Amit Shah slams Mallikarjun Kharge for 'dragging PM into his health matters'Amit Shah hit out at Congress President Mallikarjun Kharge for his statement about ousting PM Modi before dying, suggesting it reflects the \"hatred and fear\" the Congress has towards the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-on-hezbollah-leader-sayyed-hassan-nasrallah-beirut-lebanon-2608614-2024-09-30",
      "headline": "Satellite pics show smoke and ruins at site of Hezbollah chief's killingDays after the attack in which Hezbollah leader Hassan Nasrallah was killed, satellite images showed the extent of destruction on the group's central command headquarters in Beirut."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/mehbooba-mufti-hassan-nasrallah-killing-solidarity-himanta-biswa-sarma-bjp-india-bloc-terrorists-kashmir-protests-2608670-2024-09-30",
      "headline": "INDIA bloc takes BJP fire over Mehbooba Mufti's Nasrallah solidarity remarkPDP chief Mehbooba Mufti's decision to call off her election campaign for a day after Hezbollah commander Hassan Nasrallah was killed in an Israeli airstrike has been met with heavy criticism from the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-rescue-spacecraft-docked-why-she-can-not-return-immediately-2608642-2024-09-30",
      "headline": "Why Sunita Williams cannot return from Space on Dragon immediatelyThe SpaceX Crew-9 mission, carrying NASA astronaut Nick Hague and Roscosmos cosmonaut Alexander Gorbunov, was specifically launched to provide a safe return option for Williams and Wilmore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/malayalam-actor-siddique-prearrest-bail-supreme-court-actress-rape-case-2608657-2024-09-30",
      "headline": "Malayalam actor Siddique granted pre-arrest bail by Supreme Court in rape caseThe relief to the Malayalam actor came days after the Kerala High Court refused the pre-arrest bail plea in the sexual assault case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rohit-sharma-angry-umpire-lbw-kanpur-test-2608668-2024-09-30",
      "headline": "Watch: Rohit Sharma loses cool after LBW call, gets out next delivery in KanpurIndia vs Bangladesh, Kanpur Test: Rohit Sharma was seen punching the air in anger after an LBW decision against him was overturned. Rohit was seemingly upset with break in momentum after he gave India a rapid start in their first innings on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-reacts-on-winning-dadasaheb-phalke-award-2608578-2024-09-30",
      "headline": "Mithun Chakraborty on Dadasaheb Phalke honour: Could not have imagined thisMithun Chakraborty expressed his surprise and joy at receiving the Dadasaheb Phalke Award. He dedicated the award to his family and fans. He will be honoured at the 70th National Film Awards on October 8, 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-pager-blasts-international-warrant-kerala-born-businessman-rinson-jose-norta-global-bac-gold-appolo-2608628-2024-09-30",
      "headline": "Hezbollah pager blasts: International warrant for Kerala-born businessman A Kerala-born Norwegian businessman, Rinson Jose, whose name had come up in the Hezbollah exploding-pagers case, has gone missing. This has prompted authorities in  Norway to issue an international warrant for his arrest. Jose's Bulgaria-based firm was previously investigated for supplying pagers to Hezbollah, which were later detonated in Lebanon, causing at least 30 casualties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1000-points-nifty-falls-it-financial-shares-2608562-2024-09-30",
      "headline": "Sensex crashes over 1,000 points. What's making D-Street bulls nervous?Stock market crash: The Sensex was down 1,018.81 points to 84,553.04 at 11:50 am and the Nifty50 tanked 290.20 points to trade at 25,888.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-five-fronts-houthis-yemen-hezbollah-lebanon-iran-iraq-syria-shia-groups-israeli-defence-forces-idf-2608591-2024-09-30",
      "headline": "Israel's battle for survival sees 3 of 5 war fronts scorching nowA year since the October 7 attack by Hamas, Israel is now fighting for its existence on three of its five war fronts. It is battling Hamas in the Gaza Strip, Hezbollah in Lebanon and Houthi rebels in Yemen. But Israel is just dealing with Iran's proxy groups for now, and the war could escalate massively if Iran joins in directly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/agra-cop-disguises-herself-as-tourist-to-take-late-night-auto-ride-to-test-women-safety-2608643-2024-09-30",
      "headline": "Disguised as tourist, woman cop takes late-night auto ride in Agra. And then...An Agra cop disguised herself as a tourist and took a late-night auto ride to test the city's emergency services. Read on to know what happened next. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-report-deadline-extension-october-7-who-benefits-2608529-2024-09-30",
      "headline": "Income tax audit report deadline extended to October 7. Who benefits? Income tax audit report deadline: Originally set for September 30, 2024, the new deadline is now October 7, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/youtuber-gaurav-taneja-wife-ritu-rathee-shares-reality-after-separation-rumours-new-video-2608557-2024-09-30",
      "headline": "Video: YouTuber Gaurav Taneja's wife Ritu shares 'reality' after separation rumours\"Reality,\" Ritu Rathee captioned her post, in which she addressed separation rumours and asked social media users to refrain from interfering in their personal matters.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-of-india-dy-chandrachud-yeah-raps-lawyer-supreme-court-not-coffee-shop-2608551-2024-09-30",
      "headline": "Allergic to people saying yeah: Chief Justice schools petitioner in courtChief Justice DY Chandrachud took exception to a petitioner's use of the term \"yeah\" while addressing the bench during a hearing in the Supreme Court today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/up-police-reacts-to-viral-video-of-man-doing-pull-ups-holding-highway-signboard-2608625-2024-09-30",
      "headline": "UP Police reacts to viral video of man doing pull-ups holding highway signboardA man performed pull-ups while holding onto the iron structure behind the signboard that read, \"NH 931, Munshiganj 06 (left arrow) and Amethi 3.5 (right arrow).\"  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-settles-legal-dispute-with-bharatpe-ends-all-company-ties-2608545-2024-09-30",
      "headline": "Ashneer Grover settles with BharatPe after ugly legal battle, ends ties to firmThe resolution comes after a tumultuous period marked by allegations of financial misconduct against Ashneer Grover and his family during his tenure at BharatPe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-robust-military-presence-middle-east-defend-israel-white-house-national-security-spokesperson-john-kirby-2608536-2024-09-30",
      "headline": "US has robust military presence in Middle East to defend Israel: White HouseWhite House national security spokesman John Kirby expressed concern over escalating tensions in the Middle East but asserted Israel's right to eliminate the threat to its people and its land. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/emergency-film-kangana-ranaut-cbfc-censor-board-cut-sikh-community-bombay-high-court-2608597-2024-09-30",
      "headline": "'Emergency' makers agree to cuts in film after Sikh backlash, court toldThe Bombay High Court was informed that the makers of Kangana Ranaut's upcoming film Emergency and the CBFC have agreed on certain cuts, following controversy over the film's portrayal of the Sikh community. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/new-citroen-aircross-suv-launched-in-india-at-rs-849-lakh-2608655-2024-09-30",
      "headline": "New Citroen Aircross SUV launched in India at Rs 8.49 lakhNew Citroen Aircross SUV has come with several improvements to enhance its safety, comfort and overall driving experience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-airstrike-hezbollah-lebanon-syria-border-currency-pound-exchange-2608544-2024-09-30",
      "headline": "Ground Report: Here's how currency is exchanged at Lebanon-Syria borderUnlike in other countries, people from both Lebanon and Syria can easily exchange currency near the border informally. People crossing over to the other side of the border can exchange currency from civilians at the market exchange rate. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-flood-rain-champaran-bagmati-gandak-imd-forecast-alert-kosi-muzaffarpur-gopalganj-2608467-2024-09-30",
      "headline": "Bihar floods: Schools, power grid inundated, 6 barrages breached in 24 hoursHeavy rain in Nepal's catchment areas has caused many rivers in Bihar to flow at or above danger levels in several bordering districts, affecting thousands of people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-hamas-war-lebanon-beirut-airstrike-2608442-2024-09-30",
      "headline": "4 killed in Israeli strike on building in Beirut, 1st attack inside city limits Live UpdatesAs Israel continued to strike Lebanon, the Health Ministry in Beirut claimed that at least 105 people were killed in the attacks in the past 24 hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-says-son-ibrahim-doesnt-ask-for-acting-tips-sara-reads-scenes-with-me-2608661-2024-09-30",
      "headline": "Saif Ali Khan says son Ibrahim doesn't ask for acting tips from him Actor Saif Ali Khan recently spoke about his children, Ibrahim Ali Khan and Sara Ali Khan, on The Great Indian Kapil Show. He said Ibrahim doesn't seek professional advice from him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-dadasaheb-phalke-win-not-a-shock-to-family-actor-daughter-in-law-madalsa-2608656-2024-09-30",
      "headline": "Mithun Chakraborty's Dadasaheb Phalke win 'not a shock' to family: Actor MadalsaIn an exclusive interview with us, actor Mithun Chakraborty's daughter-in-law, Madalsa Sharma, spoke about him winning the Dadasaheb Phalke Award. She expressed her excitement and mentioned the family can't wait to celebrate together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-says-she-broke-down-in-front-of-her-children-while-filming-maria-2608658-2024-09-30",
      "headline": "Angelina Jolie says she broke down in front of her children while filming MariaAngelina Jolie delved into her emotional experiences while filming her latest project, 'Maria.' She highlighted the significance of having her children by her side during the production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-rapper-suga-fined-11000-dollars-for-drink-driving-2608645-2024-09-30",
      "headline": "BTS rapper Suga fined $11,000 for drink-driving: Report BTS rapper Min Yoongi, also known by his stage name Suga, has reportedly been fined 11,000 US dollars for drink-driving. His licence has also been revoked. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rohit-sharma-angry-umpire-lbw-kanpur-test-2608668-2024-09-30",
      "headline": "Watch: Rohit Sharma loses cool after LBW call, gets out next delivery in KanpurIndia vs Bangladesh, Kanpur Test: Rohit Sharma was seen punching the air in anger after an LBW decision against him was overturned. Rohit was seemingly upset with break in momentum after he gave India a rapid start in their first innings on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-most-team-sixes-calendar-year-bazball-approach-rohit-sharma-2608666-2024-09-30",
      "headline": "India top England to clinch most Test sixes in a calendar yearIndia has shattered England's record for the most Test sixes in a calendar year, with 90 sixes in just 14 innings. Led by Rohit Sharma, India's aggressive batting is rewriting Test cricket's boundaries in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-score-fastest-team-fifty-hundred-in-tests-rohit-yashasvi-bangladesh-kanpur-2608651-2024-09-30",
      "headline": "India break world record for fastest team fifty and hundred in Test cricketIndia vs Bangladesh: Team India broke the record for fastest team fifty and fastest team hundred by getting there in three overs and ten overs respectively during day four of the second Test in Kanpur on Monday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rohit-sharma-three-sixes-kanpur-test-2608650-2024-09-30",
      "headline": "Kanpur Test: Rohit Sharma in T20 mode, starts innings with 3 massive sixesIndia captain Rohit Sharma was in T20 mode as the opener hit 3 sixes to start his innings in the Kanpur Test on Monday, September 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-ravindra-jadeja-300th-wicket-kanpur-2608636-2024-09-30",
      "headline": "Ravindra Jadeja emulates Kapil Dev, Ashwin with 3000 runs-300 wickets Test doubleRavindra Jadeja emulated Kapil Dev and R Ashwin with his 300th Test wicket to complete an elite double on September 30, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-vs-south-africa-t20is-ross-adair-hundred-rigby-abu-dhabi-2608620-2024-09-30",
      "headline": "Hitting hundred or playing rugby: Ireland's T20I hero Ross Adair reveals pickRoss Adair revealed his pick between scoring a hundred in cricket or playing Rugby after his heroics with the bat in the 2nd T20I against South Africa on Sunday, September 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-carles-cudrat-east-bengal-fc-coach-resigns-bino-george-interim-2608613-2024-09-30",
      "headline": "Cuadrat resigns as East Bengal FC coach after horror start to ISL campaignCarles Cuadrat stepped down from his role as East Bengal FC manager on September 30, after the side's horrific start to their Indian Super League 2024-25 campaign. Cuadrat joined the side in 2023, and went on to guide the side to their Kalinga Super Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-catch-tamim-iqbal-reaction-2608609-2024-09-30",
      "headline": "Kanpur Test catch will motivate Rohit Sharma to run an extra lap: Tamim IqbalIndia vs Bangladesh: Bangladesh opener Tamim Iqbal praised Rohit Sharma's effort on the field after the India captain took a sensational one-handed catch. Tamim said Rohit worked hard on his fitness in the lead-up to India's home cricket season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-far-ahead-of-babar-azam-comparing-baseless-zaheer-abbas-2608592-2024-09-30",
      "headline": "Virat Kohli far ahead of Babar, comparing them is baseless: Zaheer AbbasPakistan legend Zaheer Abbas has called the comparisons between Virat Kohli and Babar Azam 'baseless,' pointing out the Indian star's unmatched consistency. Abbas also praised the Indian team and stressed the importance of Test cricket in the modern era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odis-travis-head-bowling-mitchell-marsh-bristol-2608577-2024-09-30",
      "headline": "Travis Head is very underrated as a bowler: Mitchell Marsh after ENG vs AUS ODIsAustralia captain Mitchell Marsh has claimed that Travis Head is very underrated as a bowler after his heroics with the ball during the series against England. Head picked up 4 wickets in the final ODI in Bristol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-kanpur-tes-mohammed-siraj-stunning-catch-shakib-al-hasan-rohit-sharma-2608568-2024-09-30",
      "headline": "After Rohit, Siraj takes stunning catch to dismiss Shakib in Kanpur TestMohammed Siraj took a stunning catch o dismiss Shakib al Hasan on Day 4 of the second Test between India and Bangladesh  in Kanpur, only a few moments after Rohit had taken a similar catch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-carles-cudrat-east-bengal-fc-coach-resigns-bino-george-interim-2608613-2024-09-30",
      "headline": "Cuadrat resigns as East Bengal FC coach after horror start to ISL campaignCarles Cuadrat stepped down from his role as East Bengal FC manager on September 30, after the side's horrific start to their Indian Super League 2024-25 campaign. Cuadrat joined the side in 2023, and went on to guide the side to their Kalinga Super Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-catch-tamim-iqbal-reaction-2608609-2024-09-30",
      "headline": "Kanpur Test catch will motivate Rohit Sharma to run an extra lap: Tamim IqbalIndia vs Bangladesh: Bangladesh opener Tamim Iqbal praised Rohit Sharma's effort on the field after the India captain took a sensational one-handed catch. Tamim said Rohit worked hard on his fitness in the lead-up to India's home cricket season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-far-ahead-of-babar-azam-comparing-baseless-zaheer-abbas-2608592-2024-09-30",
      "headline": "Virat Kohli far ahead of Babar, comparing them is baseless: Zaheer AbbasPakistan legend Zaheer Abbas has called the comparisons between Virat Kohli and Babar Azam 'baseless,' pointing out the Indian star's unmatched consistency. Abbas also praised the Indian team and stressed the importance of Test cricket in the modern era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odis-travis-head-bowling-mitchell-marsh-bristol-2608577-2024-09-30",
      "headline": "Travis Head is very underrated as a bowler: Mitchell Marsh after ENG vs AUS ODIsAustralia captain Mitchell Marsh has claimed that Travis Head is very underrated as a bowler after his heroics with the ball during the series against England. Head picked up 4 wickets in the final ODI in Bristol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-kanpur-tes-mohammed-siraj-stunning-catch-shakib-al-hasan-rohit-sharma-2608568-2024-09-30",
      "headline": "After Rohit, Siraj takes stunning catch to dismiss Shakib in Kanpur TestMohammed Siraj took a stunning catch o dismiss Shakib al Hasan on Day 4 of the second Test between India and Bangladesh  in Kanpur, only a few moments after Rohit had taken a similar catch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mominul-haque-2nd-bangladesh-batter-to-hit-test-hundred-in-india-2608566-2024-09-30",
      "headline": "Mominul Haque becomes 2nd Bangladesh batter to hit Test hundred in IndiaMominul Haque became the second Bangladesh to score a Test hundred in India on the fourth day of the second Test between India and Bangladesh.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/samit-dravid-india-u19-vs-australia-youth-test-miss-knee-injury-2608565-2024-09-30",
      "headline": "Rahul Dravid's son Samit misses U19 1st youth Test vs Australia due to knee injurySamit, the son of legendary India cricketer Rahul Dravid, missed the first of the two youth Tests against Australia U19 team in Chennai due to a knee injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-catch-shubman-gill-reaction-2608527-2024-09-30",
      "headline": "Watch: Rohit Sharma takes stunning one-handed catch, wows Shubman GillIndia vs Bangladesh, Kanpur Test: Rohit Sharma came up with a sensational fielding effort. The India captain took a one-handed catch to dismiss Bangladesh wicketkeeper-batter Litton Das on Monday in Kanpur. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-madrid-derby-fans-unrest-diego-simeone-wanda-metropolitano-2608528-2024-09-30",
      "headline": "Players provoking fans should be sanctioned: Simeone after Madrid derby fiascoAtletico Madrid boss Diego Simeone has claimed that players who provoke fans should also be sanctioned after the unrest in the Wanda Metropolitano during the Madrid derby on Sunday, September 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-vvs-laxman-india-women-team-unmatched-preparation-2608523-2024-09-30",
      "headline": "VVS Laxman lauds India women's team's unmatched preparationFormer India batter VVS Laxman has lauded the India women's cricket team for their rigorous preparation ahead of the Women's T20 World Cup. Laxman highlighted the commitment and intensity shown by the team under the guidance of head coach Amol Muzumdar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iftikhar-ahmed-slams-pakistan-media-champions-cup-final-2608516-2024-09-30",
      "headline": "Watch: Pakistan's Iftikhar loses his cool at media after Champions Cup finalPakistan's Iftikhar Ahmed has lambasted the media for overhyping young cricketers after just one good performance, following his team's Champions Cup final loss. Iftikhar stressed the importance of allowing players to prove themselves in domestic cricket before making international claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-love-for-test-cricket-kanpur-2608506-2024-09-30",
      "headline": "Jasprit Bumrah reiterates love for Test cricket: My favourite formatJasprit Bumrah has reiterated his love for Test cricket and said it is his favourite format. Bumrah has been India's joint-highest wicket-taker in Tests this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-captain-dhananjaya-de-silva-on-wtc-final-prospects-2608496-2024-09-30",
      "headline": "Sri Lanka not looking too far ahead: Dhananjaya de Silva on WTC final prospectsSri Lanka's Test captain Dhananjaya de Silva emphasizes focusing on immediate goals despite the team's rapid rise in the WTC standings. With crucial tours ahead, de Silva aims to maintain the team's momentum without looking too far ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-vvs-laxman-india-women-team-unmatched-preparation-2608523-2024-09-30",
      "headline": "VVS Laxman lauds India women's team's unmatched preparationFormer India batter VVS Laxman has lauded the India women's cricket team for their rigorous preparation ahead of the Women's T20 World Cup. Laxman highlighted the commitment and intensity shown by the team under the guidance of head coach Amol Muzumdar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iftikhar-ahmed-slams-pakistan-media-champions-cup-final-2608516-2024-09-30",
      "headline": "Watch: Pakistan's Iftikhar loses his cool at media after Champions Cup finalPakistan's Iftikhar Ahmed has lambasted the media for overhyping young cricketers after just one good performance, following his team's Champions Cup final loss. Iftikhar stressed the importance of allowing players to prove themselves in domestic cricket before making international claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-love-for-test-cricket-kanpur-2608506-2024-09-30",
      "headline": "Jasprit Bumrah reiterates love for Test cricket: My favourite formatJasprit Bumrah has reiterated his love for Test cricket and said it is his favourite format. Bumrah has been India's joint-highest wicket-taker in Tests this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-captain-dhananjaya-de-silva-on-wtc-final-prospects-2608496-2024-09-30",
      "headline": "Sri Lanka not looking too far ahead: Dhananjaya de Silva on WTC final prospectsSri Lanka's Test captain Dhananjaya de Silva emphasizes focusing on immediate goals despite the team's rapid rise in the WTC standings. With crucial tours ahead, de Silva aims to maintain the team's momentum without looking too far ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odi-series-harry-brook-new-brand-captaincy-bristol-2608489-2024-09-30",
      "headline": "England played new brand of cricket well: Harry Brook after Australia series lossHarry Brook has claimed that England played the new brand of cricket well despite their series loss to Australia on September 29, Sunday. England suffered a major collapse in the 5th ODI loss against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/every-time-pakistan-lost-to-india-in-1990s-people-thought-match-was-fixed-nazar-2608486-2024-09-30",
      "headline": "Every time Pakistan lost to India in 1990s, people thought match was fixed: Nazar Former Pakistan cricketer Mudassar Nazar opens up about the immense pressure and match-fixing suspicions faced by the team in the early 1990s. He reveals the psychological impact of these suspicions, especially during matches against arch-rival India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-boss-erik-ten-hag-unconcerned-about-future-after-spurs-loss-2608471-2024-09-30",
      "headline": "Manchester United boss Erik ten Hag unconcerned about future after Spurs lossManchester United boss Erik ten Hag said that he isn't thinking about his future at the club despite their recent loss to Tottenham Hotspur on September 29, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-carlo-ancelotti-disappointed-1-1-derby-draw-vs-atletico-2608470-2024-09-30",
      "headline": "Real Madrid manager Ancelotti disappointed after 1-1 derby draw at AtleticoReal Madrid manager Carlo Ancelotti was frustrated after his team let hosts Atletico Madrid salvage a 1-1 draw with a goal late into extra time in their LaLiga match on Sunday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}