{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-window-closed-tax-refund-eligiblity-2845428-2026-01-02",
      "headline": "Missed the revised ITR filing deadline? Know what happens to tax refundIn most cases, refunds are issued within a few weeks to a few months. Delays may occur due to mismatches in TDS details, bank account validation issues, or cases selected for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-update-brokerage-targets-views-buy-sell-hold-2845403-2026-01-02",
      "headline": "ITC shares tumble 4%, down 13% in 2 days: Buy the dip or stay away?The sharp sell-off comes after the finance ministry revised the taxation structure for cigarettes, effective February 1, 2026. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mcx-share-price-crash-explained-stock-split-ex-split-adjustment-2845396-2026-01-02",
      "headline": "MCX shares crash 80% in early deals, but the fall is not what it seemsMCX shares fell by more than 80% on trading screens on Friday, hitting an intraday low of Rs 2,192 on the BSE. This was compared with Thursday's closing price of Rs 10,988.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/devyani-international-share-price-sapphire-foods-merger-shares-in-focus-kfc-pizza-hut-india-2845368-2026-01-02",
      "headline": "Devyani International and Sapphire Foods India shares in focus. Here's whyDevyani International shares were trading at Rs 152.80, up Rs 5.37 or 3.64% during the morning session as of 9:39 am. In contrast, Sapphire Foods India shares were trading lower at Rs 253.95, down Rs 8.75 or 3.33%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-auto-shares-rise-fmcg-itc-godfrey-phillips-2845357-2026-01-02",
      "headline": "Sensex, Nifty open higher driven by auto, metal stocks as FMCG continues to fallThe S&P BSE Sensex was up 172.34 points to 85,360.94, while the NSE Nifty50 rose 44.10 points to 26,190.65 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-today-precious-metals-start-2026-after-record-2025-gains-2845353-2026-01-02",
      "headline": "Gold, silver price today: How have precious metals started 2026?Gold and silver prices moved higher on Friday, recovering part of the losses seen late last week, even as investors looked back at the historic gains these metals delivered through 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-founder-10-minute-delivery-unsafe-gig-workers-explained-deepinder-goyal-2845337-2026-01-02",
      "headline": "Is 10-minute delivery really unsafe? Zomato CEO answers after gig workers strikeWhile delivery services on platforms such as Zomato and Blinkit were largely unaffected on New Year's Eve, questions around whether 10-minute delivery models put pressure on riders gained traction on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepinder-goyal-defends-gig-economy-as-zomato-blinkit-unaffected-by-gig-workers-strike-2845287-2026-01-01",
      "headline": "If system was unfair...: Deepinder Goyal as Zomato unaffected by gig workers' strikeZomato and its quick-commerce arm Blinkit recorded their highest-ever single-day orders on New Year's Eve, delivering over 75 lakh orders despite a nationwide gig workers' strike. Founder and CEO Deepinder Goyal said such scale shows a system seen as unfair cannot consistently attract or retain workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/special-report-indias-economy-faces-trump-tariffs-and-trade-impasse-entering-2026-ytvd-2845174-2026-01-01",
      "headline": "Special Report: India's Economy Faces Trump Tariffs and Trade Impasse Entering 2026In this Special Report, an unidentified speaker analyses the state of the Indian economy as the nation steps into 2026. While highlighting a 'stupendous 2025' marked by major reforms like GST simplification and the Jan Vishwas Bill, the report warns that India enters the new year 'playing on a strong economic pitch, but also on a sticky wicket'. Key challenges identified include the ongoing trade impasse with the US, punitive 'Trump tariffs' of 50%, and a depreciating rupee which breached the 91 mark against the dollar. The programme notes that while GDP growth remains robust at 8%, high food inflation and sluggish job creation persist. With five state elections due in 2026, the report also flags concerns over rising state debts due to populist spending, even as all eyes turn to the upcoming Union Budget in February to restore confidence and boost private investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-hiked-new-year-domestic-lpg-rates-no-change-oil-companies-atf-2845096-2026-01-01",
      "headline": "Commercial LPG cylinder price hiked by Rs 111 on New Year, highest since June 2025On New Year's Day, the price of a 19-kg commercial LPG cylinder was increased by Rs 111 — the steepest hike in six months, — with effect from today. The price of a 14.2-kg domestic LPG cylinder, however, remains unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-itc-godfrey-phillips-crash-tobacco-cess-move-2845086-2026-01-01",
      "headline": "Sensex, Nifty end lower as ITC, Godfrey Phillipss crash on tobacco cess moveThe S&P BSE Sensex fell 32 points to close at 85,188.60, while the NSE Nifty50 was up by 16.95 points to end at 26,146.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-gold-stocks-real-estate-best-investment-2026-money-compound-wealth-creation-2845060-2026-01-01",
      "headline": "Silver vs gold vs stock vs real estate: What can deliver most gains in 2026Should it be gold, which has just seen its strongest year since 1979? Or silver, which has surged over 150%, marking one of its best-ever annual performances?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-draft-rules-four-labour-codes-wages-working-hours-women-workers-feedback-45-days-2844974-2026-01-01",
      "headline": "Inside draft labour code rules. What the fine print says on wages, working hoursThe draft Rules relate to the Code on Wages, the Code on Social Security, the Industrial Relations Code and the Code on Occupational Safety, Health and Working Conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-godfrey-phillips-shares-fall-tobacco-stocks-down-excise-duty-health-national-security-cess-2026-2844941-2026-01-01",
      "headline": "ITC, Godfrey Phillips shares tank up to 16%: Why are tobacco shares falling todayShares of Godfrey Phillips India Ltd fell sharply in early trade, sliding nearly 16%. Shares of ITC Ltd also came under pressure, falling around 9% during early trade. The stock slipped to about Rs 362.70, touching its 52-week low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-openinh-bell-sensex-opens-180-points-higher-nifty-abover-26150-itc-down-2-percent-2844928-2026-01-01",
      "headline": "Sensex opens 180 points higher, Nifty above 26,150; ITC down 2%The S&P BSE Sensex was up 104.21 points to 85,324.81, while the NSE Nifty50 gained 28.60 points to 26,158.20 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/is-stock-market-open-today-bse-mcx-holiday-new-year-2026-commodity-nse-list-holidays-2844921-2026-01-01",
      "headline": "Stock market holiday today? Check if NSE and BSE are closed for New Year 2026Major international stock markets across China, Hong Kong, Japan, Singapore, France, Germany, the UAE, the UK and the US are closed on New Year's Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-tobacco-pan-masala-tax-hike-2026-excise-cess-replacement-glbs-2844873-2026-01-01",
      "headline": "Extra excise duty on tobacco products, cess on pan masala to take effect February 1The new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indraprastha-gas-limited-reduces-piped-cooking-gas-prices-in-delhi-ncr-2844791-2025-12-31",
      "headline": "Indraprastha Gas Limited reduces piped cooking gas prices in Delhi-NCRThe reduction follows the sector regulator Petroleum and Natural Gas Regulatory Board's (PNGRB) recent overhaul of pipeline tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-to-clock-strong-growth-despite-global-headwinds-rbi-governor-2844789-2025-12-31",
      "headline": "Indian economy to clock strong growth despite global headwinds: RBI GovernorRBI Governor Sanjay Malhotra said maintaining financial stability, resilient institutions and prudent regulation remains central to safeguarding the economy from external shocks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/full-circle-ahan-shetty-on-honouring-suniel-shettys-legacy-with-border-2-2845488-2026-01-02",
      "headline": "Full circle: Ahan Shetty on honouring Suniel Shetty's legacy with Border 2 Ahan Shetty described joining Border 2 as a full-circle moment, recalling his father Suniel Shetty's involvement in the iconic song Sandese Aate Hain and the emotional significance of his own participation in Ghar Kab Aaoge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/does-tanya-mittal-really-have-150-bodyguards-bigg-boss-19-finalist-clarifies-2845479-2026-01-02",
      "headline": "Does Tanya Mittal really have 150 bodyguards? Bigg Boss 19 finalist clarifies 'Bigg Boss 19' finalist Tanya Mittal addressed the claims on whether she owns 150 bodygaurds. She also gave a tour of her factory in a recent video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sarvam-maya-nears-rs-75-crore-mark-emerges-as-one-of-nivin-paulys-biggest-hits-2845460-2026-01-02",
      "headline": "Sarvam Maya nears Rs 75 crore mark, emerges as one of Nivin Pauly's biggest hits Nivin Pauly's Sarvam Maya directed by Akhil Sathyan continues its steady first-week run, driven by strong overseas support and positive word of mouth, placing it on course for the Rs 75 crore milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-launches-two-animated-feature-films-2845465-2026-01-02",
      "headline": "Taarak Mehta Ka Ooltah Chashmah launches two animated feature films. See details The popular Taarak Mehta Ka Ooltah Chashmah franchise announced the launch of two feature-length 3D animated films. Viewers will be able to watch both films on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-2-sequel-shelved-producer-naga-vamsi-vijay-deverakonda-new-film-rowdy-janardhana-2026-2845466-2026-01-02",
      "headline": "Vijay Deverakonda's Kingdom 2 shelved, confirms producer Naga Vamsi Producer Naga Vamsi has officially confirmed that a sequel to the 2025 film Kingdom, which featured Vijay Deverakonda in the lead, will not move forward. The confirmation comes after months of speculation regarding the future of the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-song-launch-longewala-varun-dhawan-sonu-nigam-ahan-shetty-2845469-2026-01-02",
      "headline": "Varun Dhawan, Sonu Nigam, Ahan Shetty fly economy for Border 2 song launch Varun Dhawan, Sonu Nigam and Ahan Shetty travelled in economy class with the media and PR team from Mumbai to Jaisalmer for the launch of a Border 2 song at Longewala, while some other team members reportedly chose private flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-creators-defend-will-byers-coming-out-scene-backlash-low-ratings-2845441-2026-01-02",
      "headline": "Duffer Brothers say Will's coming out was nine years in the making The Duffer brothers remain proud of Will's pivotal moment in the series finale despite a drop in ratings and a wave of online criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-opens-up-on-life-after-divorce-with-ben-affleck-in-my-happy-era-2845419-2026-01-02",
      "headline": "Jennifer Lopez opens up on life after divorce with Ben Affleck: In my happy era During the first night of her new Las Vegas residency, 'Up All Night', Jennifer Lopez reflected on her life's transformation and recent divorce from Ben Affleck, jokingly saying she is \"learning\" and \"growing.\" She concluded that she is currently in her \"happy era.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-controversy-explained-sanjay-dutt-dialogue-that-led-to-the-revised-cut-2845433-2026-01-02",
      "headline": "Dhurandhar controversy explained: Sanjay Dutt dialogue that led to the revised cut A single dialogue in Ranveer Singh's blockbuster spy drama sparked outrage and legal action. Here's how Dhurandhar ended up with a muted version in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-2026-with-a-family-beach-getaway-2845436-2026-01-02",
      "headline": "Athiya Shetty, KL Rahul welcome 2026 with a family beach getaway Athiya Shetty and KL Rahul ushered in the New Year by spending quality time with their daughter Evaarah at the beach. The actor shared select moments on social media while maintaining their family's privacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-new-year-celebration-new-york-2845417-2026-01-02",
      "headline": "Ranveer Singh-Deepika Padukone ring in New Year in NYC with fans. See viral pics Bollywood actors Ranveer Singh and Deepika Padukone were seen celebrating New Year 2026 in New York City with fans. Photos shared by fans have now gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/spirit-poster-sparks-buzz-triptii-dimri-rumoured-partner-sam-merchant-reacts-2845407-2026-01-02",
      "headline": "Spirit poster sparks buzz: Triptii Dimri's rumoured partner Sam Merchant reacts Actor Triptii Dimri's appearance in the first look poster of Spirit has drawn a response from her rumoured boyfriend, Sam Merchant. His reaction to the poster has sparked buzz on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-yash-toxic-film-casino-shoot-behind-the-scenes-video-leaked-2845401-2026-01-02",
      "headline": "Yash, Nayanthara's BTS video from Toxic set leaked, excited fans react A behind-the-scenes (BTS) clip featuring Nayanthara and Yash on the sets of Toxic has caught the attention of fans. The Yash-starrer is gearing up for a grand release on March 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/drashti-dhami-shares-first-pics-of-daughter-leela-kritika-kamra-rubina-dilaik-jennifer-winget-react-2845390-2026-01-02",
      "headline": "Hello world: Drashti Dhami shares first pics of daughter Leela. Celebs react Television actor Drashti Dhami revealed her daughter Leela's face for the first time on social media. Leela celebrated her first birthday on January 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-spongebob-movie-search-for-squarepants-review-nineties-nostalgia-but-childish-2845180-2026-01-02",
      "headline": "The SpongeBob Movie Search for SquarePants review: Nineties nostalgia but childishRelease Date:Wed Jan 01, 2025 The SpongeBob Movie: Search for SquarePants releases early in India, offering a nostalgic animated adventure. The film explores bravery and friendship but may feel too childish for adult viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nadiya-meets-nicole-kidman-in-sydney-memorable-encounter-with-hollywood-star-2845371-2026-01-02",
      "headline": "Watch: Veteran actor Nadiya's ultimate fangirl moment with Nicole Kidman Veteran actor Nadiya recounted her memorable encounter with Hollywood star Nicole Kidman during a trip to Australia, sharing photos and her excitement over the meeting. She also described Kidman's humility in an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ikkis-war-drama-agastya-nanda-dharmendra-opening-day-7-crore-2845365-2026-01-02",
      "headline": "Ikkis box office Day 1: Dharmendra's final film earns Rs 7 crore on opening day Sriram Raghavan's war biopic 'Ikkis opened to decent numbers at the box office. The movie, which also features Dharmendra in his last screen role, faced box office competition from the ongoing hit 'Dhurandhar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kirti-kulhari-rajeev-siddhartha-confirm-relationship-instagram-new-year-2026-2845360-2026-01-02",
      "headline": "Four More Shots' Kirti Kulhari-Rajeev Siddhartha confirm romance on New Year Actors Kirti Kulhari and Rajeev Siddhartha made their relationship public on New Year's Day 2026 by sharing affectionate photos on Instagram. The duo shared space while working on Four More Shots Please. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-dramas-2026-indian-watchlist-fantasy-romance-political-thrillers-netflix-jiohotstar-2845341-2026-01-02",
      "headline": "K-drama 2026 watchlist: What's coming next? The 2026 K-drama lineup promises a mix of fantasy, romance, and political thrillers for Indian viewers. This diverse slate highlights Korea's growing global influence and storytelling ambition."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-has-right-to-defend-itself-against-bad-neighbours-who-back-terrorism-says-s-jaishankar-2845454-2026-01-02",
      "headline": "India has right to defend itself from bad neighbours backing terror: S JaishankarExternal Affairs Minister S Jaishankar said India has every right to decide and take whatever action is necessary to defend itself against a \"bad neighbour\" that persistently sponsors terrorism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/poison-was-distributed-rahul-gandhi-slams-indore-administration-on-water-contamination-deaths-2845485-2026-01-02",
      "headline": "Poison, not water: Rahul Gandhi slams MP govt over Indore contamination deathsA severe water contamination crisis in Indore has led to multiple deaths, sparking intense political blame games between Congress and BJP. The tragedy highlights serious governance failures in Madhya Pradesh, raising urgent calls for accountability and action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/janmabhumi-prints-iuml-muslim-league-chandrika-newspaper-editorial-kerala-technical-error-bjp-iuml-2845449-2026-01-02",
      "headline": "When BJP readers woke up to Muslim League editorial: Kerala's New Year mix-upA newspaper printing error has amused Kerala's political circles. BJP mouthpiece Janmabhumi accidentally carried the editorial page of Muslim League's Chandrika in its Kannur–Kasaragod edition. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-protests-live-updates-anti-ayatollah-khamenei-economy-crisis-currency-collapse-trump-shia-qom-2845443-2026-01-02",
      "headline": "Live: Trump warns Khamenei regime of US intervention; unrest spreads, 6 killedAnti-Khamenei Protests live updates: Protests in Iran entered their sixth day on Friday, spreading to dozens of cities, including the Shia clerical bastion of Qom. US President Donald Trump warned Iran against killing protesters. At least six people were killed as protesters clashed with the theocratic regime's security forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/insv-kaundinya-oman-voyage-sanjeev-sanyal-brahmin-sailor-kalinga-funan-indianised-kingdom-southeast-asia-maritime-history-2845292-2026-01-02",
      "headline": "Project Kaundinya and a Brahmin warrior who won a Siam princess's heartThe INSV Kaundinya, a sail ship made of stitched wooden planks, is sailing the ancient maritime route from India to Oman. It is named after a Brahmin sailor from Kalinga whose journey in 1st century CE reshaped history. Kaundinya crossed the seas, fought pirates, won a princess's heart and became a part of the founding of Funan, Southeast Asia's earliest known Indianised kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-may-deploy-troops-balochistan-threat-to-india-baloch-leader-mir-yar-baloch-jaishankar-warns-2845492-2026-01-02",
      "headline": "China may deploy troops: Baloch leader warns S Jaishankar of 'serious threat'A Baloch representative has warned that China may deploy troops in Balochistan in the coming months, calling it a serious and imminent threat to regional security and India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-retirement-sydney-press-conference-racial-bias-islam-2845413-2026-01-02",
      "headline": "Targeted for who I am, what I say: Usman Khawaja alleges racial stereotypingUsman Khawaja, in an emotional 50-minute address to the press, spoke of race, faith and belonging, describing years of scrutiny and stereotyping that, he said, shaped his career. The Australian opener announced he would retire from international cricket at the end of the ongoing Ashes series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-hyderabad-student-bags-rs-25-crore-package-highest-in-institute-history-2845394-2026-01-02",
      "headline": "IIT Hyderabad student bags Rs 2.5 crore package, highest in institute historyIIT Hyderabad final-year student Edward Nathan Varghese has secured a record Rs 2.5 crore package from Dutch trading firm Optiver, the highest ever offer at the institute since its inception"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-sits-on-car-bonnet-to-guide-driver-in-dense-fog-viral-video-raises-safety-fears-2845426-2026-01-02",
      "headline": "Man sits on car bonnet to guide driver in dense fog, video raises safety fearsA video showing a man sitting on the bonnet of a car to help the driver navigate through zero visibility conditions has sparked concern among social media users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mount-etna-begins-violent-eruption-in-2026-whats-happening-beneath-the-surface-2845471-2026-01-02",
      "headline": "Watch: Mount Etna begins exploding with towering lava eruptionsThe renewed activity marks the opening chapter of what scientists fear could be another restless year for Europe's most active volcano."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/marriage-refusal-triggers-mumbai-woman-slashes-private-parts-of-lover-2845392-2026-01-02",
      "headline": "Mumbai woman calls lover home for New Year party, chops off his private partsThe accused, a 25-year-old woman, has been booked for grievous assault after she attacked her 42-year-old partner with a sharp weapon. The incident occurred at Kalina in Santacruz East in Mumbai, where the woman resides."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/retired-air-force-officer-killed-ghaziabad-property-dispute-up-2845352-2026-01-02",
      "headline": "Retired Air Force officer asks sons to vacate house in UP, they get him killedA retired Indian Air Force officer was shot dead in Ghaziabad after allegedly asking his sons to vacate the house so he could sell the property. Police later revealed that the sons allegedly plotted the murder and hired a contract killer.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-controversy-explained-sanjay-dutt-dialogue-that-led-to-the-revised-cut-2845433-2026-01-02",
      "headline": "Dhurandhar controversy explained: Sanjay Dutt dialogue that led to the revised cutA single dialogue in Ranveer Singh's blockbuster spy drama sparked outrage and legal action. Here's how Dhurandhar ended up with a muted version in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/find-everything-your-baby-needs-this-holiday-season-on-amazons-everyday-essentials-2842500-2025-12-27",
      "headline": "Find everything your baby needs this holiday season on Amazon's Everyday EssentialsAs part of the New Year selections, the specially curated New Year Store —available until 31 December 2025—brings up to 50% off across a wide selection of everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-government-evm-survey-lok-sabha-public-trust-bjp-rahul-gandhi-2845369-2026-01-02",
      "headline": "Majority trusts EVMs, says Karnataka survey; BJP hits back at Rahul GandhiA Karnataka survey on Lok Sabha polls 2024 found over 83%of respondents trust EVMs, showing strong faith in the electoral process.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/montauk-project-stranger-things-conspiracy-secrets-mkultra-revealed-duffer-brothers-eleven-origins-camp-hero-2845447-2026-01-02",
      "headline": "Did a secret US mind-control experiment inspire Stranger Things?The chilling Montauk Project conspiracy, packed with alleged time travel and psychic experiments, was the direct spark for Stranger Things' original title and plot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-future-fifa-world-cup-qualification-dream-isl-sponsor-new-season-2845389-2026-01-02",
      "headline": "Dear Indian football, give us the World Cup dream back, and this time a real oneIndian football still lives inside the dreams of its children, even as the system around them crumbles. In 2026, the game must choose whether to rebuild belief or quietly watch that dream slip away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-pilot-saurabh-kumar-landed-in-vancouver-drunk-failed-breath-tests-canadian-authorities-2845385-2026-01-02",
      "headline": "Air India pilot landed in Canada drunk, failed smell tests; authorities seek actionCanadian authorities have accused an Air India pilot of reporting for duty under the influence of alcohol, prompting a safety investigation and regulatory scrutiny. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/below-average-temperatures-january-boost-winter-crop-yield-india-2845376-2026-01-02",
      "headline": "India is expecting a cold January. Here's how it could be a blessingIndia is likely to benefit from below-average temperatures this January, boosting yields for winter crops like wheat, rapeseed, and chickpeas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/beyond-temples-and-tombs-a-prayer-for-india-in-2026-2844967-2026-01-02",
      "headline": "Beyond temples and tombs: A prayer for India in 2026A call to reclaim constitutional values in a time of noise, nostalgia, and normalised hate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/happy-new-year-indeed-2026-is-full-of-long-weekend-friyays-2845269-2026-01-02",
      "headline": "Happy New Year indeed, 2026 is full of long weekend Friyays2026 is full of long weekends, with many festivals and holidays falling on Fridays. Even Monday offs are just as good."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-founder-10-minute-delivery-unsafe-gig-workers-explained-deepinder-goyal-2845337-2026-01-02",
      "headline": "Is 10-minute delivery really unsafe? Zomato CEO answers after gig workers strikeWhile delivery services on platforms such as Zomato and Blinkit were largely unaffected on New Year's Eve, questions around whether 10-minute delivery models put pressure on riders gained traction on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-future-selection-gautam-gambhir-agarkar-odi-world-cup-2027-2845349-2026-01-02",
      "headline": "Despite silencing critics, bigger questions await Virat Kohli, Rohit Sharma in 2026Virat Kohli and Rohit Sharma endured intense scrutiny in 2025 but repeatedly proved their value with standout performances. With limited ODI opportunities this year, the legendary duo will attract even more attention as consistency, competition and age will determine their future in team India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/madhya-pradesh/story/madhya-pradesh-19-deaths-in-months-anger-erupts-women-protest-in-jabalpur-over-illicit-liquor-2845442-2026-01-02",
      "headline": "19 deaths in months: Anger erupts, women protest in Jabalpur over illicit liquorWomen of the area say that alcohol has claimed at least 19 lives in a few months, grief and anger grip Jabalpur localities as anger mounts, especially in women who have lost their sons, husbands and brothers to the deadly menace. Read the story to find out how the women are leading the protest against liquor sales in the area."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-warning-to-icc-no-one-will-watch-2026-t20-world-cup-2845481-2026-01-02",
      "headline": "R Ashwin delivers blunt warning to ICC: No one will watch 2026 T20 World Cup Former India spinner Ravichandran Ashwin has questioned the appeal of the 2026 ICC Men's T20 World Cup, warning that the tournament risks losing viewer interest due to the frequency of ICC events and a widening gap in quality between competing teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-england-squad-sydney-test-shoaib-bashir-matthew-potts-gus-atkinmson-2845463-2026-01-02",
      "headline": "Ashes: England include Bashir, Potts in 12-member team for fifth Test in Sydney England have named their 12-member team for the fifth Ashes Test at Sydney Cricket Ground. The management has included Shoaib Bashir and  Matthew Potts in the team for the final game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-match-simulations-india-vs-new-zealand-fitness-clearance-injury-comeback-2845458-2026-01-02",
      "headline": "Shreyas Iyer's comeback route revealed: India batter set for simulation matches Shreyas Iyer is nearing full fitness after months of rehabilitation at the COE. However, with squad decisions looming, his inclusion in India's ODI plans for New Zealand may hinge on timing rather than form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sjoerd-marijne-returns-indian-womens-hockey-coach-2026-world-cup-qualifiers-2845451-2026-01-02",
      "headline": "Sjoerd Marijne returns as head coach of Indian women's hockey team Sjoerd Marijne has returned as head coach of the Indian women's hockey team, taking charge at a crucial juncture ahead of the 2026 FIH Women's World Cup Qualifiers in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-virat-kohli-rohit-sharma-more-odis-bcci-2845427-2026-01-02",
      "headline": "BCCI should host more ODIs to keep Kohli, Rohit in action: Irfan Pathan Former all-rounder Irfan Pathan has urged the BCCI to organise longer ODI series and multi-nation tournaments, to keep Virat Kohli and Rohit Sharma in action for long. Both Kohli and Rohit now only play one format, having retired from Tests and T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-vs-eng-scg-curator-reveals-sydney-pitch-for-fifth-test-2845416-2026-01-02",
      "headline": "SCG curator shrugs off pressure ahead of Ashes finale SCG curator Adam Lewis admits he and his team have a few pre-match nerves but insists there is no pressure on them to produce a quality pitch for the fifth Ashes Test."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-retirement-sydney-press-conference-racial-bias-islam-2845413-2026-01-02",
      "headline": "Targeted for who I am, what I say: Usman Khawaja alleges racial stereotyping Usman Khawaja, in an emotional 50-minute address to the press, spoke of race, faith and belonging, describing years of scrutiny and stereotyping that, he said, shaped his career. The Australian opener announced he would retire from international cricket at the end of the ongoing Ashes series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-future-fifa-world-cup-qualification-dream-isl-sponsor-new-season-2845389-2026-01-02",
      "headline": "Dear Indian football, give us the World Cup dream back, and this time a real one Indian football still lives inside the dreams of its children, even as the system around them crumbles. In 2026, the game must choose whether to rebuild belief or quietly watch that dream slip away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-declines-coaching-india-test-cricket-gautam-gambhir-struggles-2845412-2026-01-02",
      "headline": "Australian legend refutes suggestion to replace Gambhir as Indian Test coach Former Australia cricketer Jason Gillespie has declined fan's request to coach the Indian Test team amid their ongoing struggles. India faces a tough rebuilding phase after losing key players and facing criticism over coaching and selection policies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/raman-lamba-career-rashid-patel-fight-death-indian-cricket-regret-2845382-2026-01-02",
      "headline": "Raman Lamba: A career remembered for a day Indian cricket regrets Raman Lamba's career remains one of Indian cricket's most haunting stories. A violent Duleep Trophy clash and a tragic on-field death later forced the sport to confront uncomfortable truths about safety, discipline and responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-future-selection-gautam-gambhir-agarkar-odi-world-cup-2027-2845349-2026-01-02",
      "headline": "Despite silencing critics, bigger questions await Virat Kohli, Rohit Sharma in 2026 Virat Kohli and Rohit Sharma endured intense scrutiny in 2025 but repeatedly proved their value with standout performances. With limited ODI opportunities this year, the legendary duo will attract even more attention as consistency, competition and age will determine their future in team India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-robin-uthappa-advice-australian-batsmen-cheteshwar-pujara-ajinkya-rahane-2845339-2026-01-02",
      "headline": "Play like Pujara and Rahane: Australian batters receive advice after MCG debacleFormer India cricketer Robin Uthappa has urged Australian batters to adopt patience like Cheteshwar Pujara and Ajinkya Rahane on challenging wickets. His advice comes after Australia's heavy collapse during the fourth Test of the Ashes 2025-26 in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-australian-open-comeback-wildcard-entry-days-after-marriage-2845338-2026-01-02",
      "headline": "Venus Williams makes Australian Open comeback at 46Venus Williams will return to the Australian Open at 45 after receiving a wildcard entry. The seven-time Grand Slam champion makes her comeback five years after her last appearance, rewriting age records in Melbourne."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/bjp-leader-sangeet-som-calls-shah-rukh-khan-traitor-for-buying-bangladeshi-cricketer-mustafizur-ytvd-2845334-2026-01-02",
      "headline": "BJP Leader Sangeet Som Calls Shah Rukh Khan 'Traitor' For Buying Bangladeshi Cricketer MustafizurA major political controversy has erupted over Kolkata Knight Riders (KKR) acquiring Bangladeshi cricketer Mustafizur Rahman for the IPL. BJP leader Sangeet Som launched a scathing attack on KKR owner Shah Rukh Khan, stating, 'Traitors like Shah Rukh Khan are buying cricket players like Rehman.' Som argued that players from Bangladesh should not be welcomed while Hindus face atrocities there. The Shiv Sena (UBT) also criticized the move, alleging the funds could nurture terrorism. Conversely, Karnataka Minister Priyank Kharge defended the decision, asserting it aligns with BCCI regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-2026-wishlist-bcci-fan-experience-t20-world-cup-domestic-2845318-2026-01-02",
      "headline": "Looking ahead: My wishlist for Indian cricket in 20262026 is a chance for Indian cricket to grow—fans deserve consistency, honesty, and insight, on and off the field. Here's what I hope the game brings in the year ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-usman-khawaja-retirement-announcement-sydney-test-racial-stereotyping-press-conference-2845311-2026-01-02",
      "headline": "Ashes: Usman Khawaja announces retirement in fiery presser before Sydney TestUsman Khawaja will retire from international cricket after the Sydney Ashes Test against England. The veteran opener confirmed his decision in a blunt press conference, where he also spoke against racial stereotyping he faced during his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-vs-sunderland-liverpool-vs-leeds-tottenham-vs-brentford-premier-league-reports-new-year-2845309-2026-01-02",
      "headline": "Premier League's dull start to 2026: Man City, Liverpool, Tottenham draw blanksThe Premier League stumbled into 2026 as City, Liverpool and Tottenham failed to score on New Year's Day. Wasteful finishing, rigid defending and mounting pressure defined a flat afternoon that subtly shifted momentum elsewhere league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-series-highlights-australia-leads-3-1-england-breaks-18-match-winless-streak-melbourne-2845285-2026-01-01",
      "headline": "Australian PM Anthony Albanese hosts Ashes stars ahead of pink Test in SydneyAustralian PM Anthony Albanese hosted Australia and England players ahead of the final Ashes Test, joking that teams must ensure the Sydney match reaches day three for Jane McGrath Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/palestinian-flag-helmet-jammu-kashmir-police-inquiry-private-cricket-league-2845270-2026-01-01",
      "headline": "J&K Police summon cricketer, organiser over Palestine flag at local tournamentJammu and Kashmir Police investigate private cricket event after player displays Palestinian flag, summoning key individuals for clarification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-lee-india-women-cricket-team-strength-conditioning-coach-after-wpl-2026-2845268-2026-01-01",
      "headline": "Nicholas Lee to join as India women's strength and conditioning coach post-WPL 2026Nicholas Lee is set to take over as strength and conditioning coach of the India women's cricket team after WPL 2026, bringing vast experience from international and franchise cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-update-aiff-given-conditions-2845252-2026-01-01",
      "headline": "Clubs ready to restart ISL, but only if 2 conditions are met by AIFFThirteen ISL clubs have told the AIFF that they are ready to play the league this season if the Indian football body meets certain conditions. The AIFF has been asked to assume full financial responsibility for the league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gabon-suspends-national-football-team-excludes-aubameyang-africa-cup-of-nations-exit-2845247-2026-01-01",
      "headline": "So bad they shut it down: Gabon suspend team, axe Aubameyang after AFCON flopGabon's government have suspended the national football team, sacked the coaching staff, and removed Pierre-Emerick Aubameyang and Bruno Ecuele Manga following a disappointing Africa Cup of Nations campaign, according to Reuters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/damien-martyn-meningitis-hospital-adam-gilchrist-2845228-2026-01-01",
      "headline": "Damien Martyn's battle with meningitis: Adam Gilchrist provides positive updateFormer Australia cricketer Adam Gilchrist has provided a crucial update on Damien Marytn, who is in a coma. Martyn was admitted to the hospital, fighting the life-threatening disease meningitis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-enzo-maresca-premier-league-manager-sacked-new-years-day-2845224-2026-01-01",
      "headline": "Enzo Maresca becomes first Premier League manager to be sacked on New Year's DayChelsea parted ways with Enzo Maresca on New Year's Day, making him the first Premier League manager to be sacked on January 1 as the club looks to reset its season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-quits-pakistan-test-coaching-pcb-conflicts-2845206-2026-01-01",
      "headline": "I was humiliated: Jason Gillespie reveals why he quit Pakistan cricketJason Gillespie revealed he quit as Pakistan's Test coach after just eight months due to strained relations with the PCB, citing poor communication, humiliating decisions, and mixed on-field results during his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-new-year-celebration-india-vs-new-zealand-2845193-2026-01-01",
      "headline": "Gautam Gambhir welcomes New Year in London, spends family time with daughtersIndia head coach Gautam Gambhir spent the New Year's in London with his family. Gambhir posted photos from his trip on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/stefanos-tsitsipas-back-injury-2025-tennis-season-retirement-2845187-2026-01-01",
      "headline": "Stefanos Tsitsipas recalls contemplating retirement in 2025: Couldn't walk for two daysStefanos Tsitsipas says a crippling back injury in 2025 left him unable to walk for days and close to retirement, but pain-free rehabilitation has renewed his confidence and focus on staying healthy in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-enzo-maresca-part-ways-season-back-on-track-2845163-2026-01-01",
      "headline": "Chelsea part ways with Enzo Maresca to get their season back on trackChelsea have confirmed the departure of head coach Enzo Maresca, saying both parties felt a change was needed to get the season back on track amid key objectives still in play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-warns-odi-cricket-slow-death-2027-world-cup-2845146-2026-01-01",
      "headline": "Ravichandran Ashwin warns ODI cricket could face slow death after 2027 World CupFormer India off-spinner Ravichandran Ashwin expresses concerns about the decline of the One-Day International format, citing the influence of T20 cricket, the dominance of star players, and challenges posed by ICC scheduling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/todd-murphy-test-comeback-ashes-australia-england-lyon-injury-scg-2845142-2026-01-01",
      "headline": "Todd Murphy on competition with Nathan Lyon: Was never going to keep my placeAustralian spinner Todd Murphy has a chance of playing the fifth Ashes Test against England with Nathan Lyon ruled out of the series due to a high-grade right hamstring injury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vladimir-kramnik-sues-fide-defamation-daniel-naroditsky-controversy-2845115-2026-01-01",
      "headline": "Vladimir Kramnik sues FIDE for defamation after Daniel Naroditsky controversyFormer world chess champion Vladimir Kramnik has initiated legal proceedings against FIDE, the world chess governing body, in a Swiss court, following an ethics inquiry into his allegations of cheating among top players after the death of American Grandmaster Daniel Naroditsky."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}