{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-swings-in-final-hours-of-trading-before-trumps-tariff-announcement-glbs-2703078-2025-04-02",
      "headline": "Wall Street swings in final hours of trading before Trump's tariff announcementUS stocks remained volatile on Wednesday morning in anticipation of President Donald Trump's tariff announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-mundra-port-sets-record-with-200-mmt-annual-cargo-handling-business-update-2703051-2025-04-02",
      "headline": "Adani's Mundra Port sets record with 200-MMT annual cargo handlingMundra Port's growing cargo volume further cements its role as India's largest trade gateway. The steady rise in throughput reflects APSEZ's investment in supply chain and logistics infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poonam-gupta-is-rbi-new-deputy-governor-all-you-need-to-know-2702977-2025-04-02",
      "headline": "Poonam Gupta is RBI's new Deputy Governor: All you need to knowPoonam Gupta is a well-known economist with nearly 20 years of experience at the World Bank and the International Monetary Fund (IMF). She has also been a government adviser in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rally-despite-us-donald-trump-liberation-day-reciprocal-tariffs-2702917-2025-04-02",
      "headline": "Sensex, Nifty rally as stock market ignores US tariff threat: 3 key takeawaysThe Sensex and Nifty witnessed a strong rally despite uncertainty around Trump's 'Liberation Day' tariff announcement. Broader market indices also mirrored the uptrend, and to everyone's surprise, volatility took a backseat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/received-a-wrong-tax-demand-notice-here-is-how-to-rectify-it-online-2702895-2025-04-02",
      "headline": "Received a wrong tax demand notice? Here's how to rectify it onlineThis feature was introduced in January 2025 and allows taxpayers to request corrections through the e-filing Income Tax Return (ITR) portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-gain-ahead-of-us-donald-trump-liberation-day-tariff-annoucement-2702885-2025-04-02",
      "headline": "Sensex ends nearly 600 points higher, Nifty settles above 23,300; Zomato up 5%The S&P BSE Sensex surged 592.93 points to close at 76,617.44, while the NSE Nifty50 added 166.65 points to end at 23,332.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forbes-billionaires-list-2025-mukesh-ambani-net-worth-richest-in-world-elon-musk-jeff-bezos-mark-zuckerberg-2702884-2025-04-02",
      "headline": "Forbes Billionaires List 2025: Mukesh Ambani drops out of top 10. Check rankingThe 2025 list shows that the world has 3,028 billionaires, an increase of 247 compared to last year. The combined wealth of these billionaires stands at $16.1 trillion, which is nearly $2 trillion more than in 2024. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-money-for-home-office-staff-rs-35-crore-dog-tito-care-rs-12-lakh-report-2702838-2025-04-02",
      "headline": "Ratan Tata leaves over Rs 3 crore for home and office staff in his willIn his will, Ratan Tata set aside nearly Rs 3.5 crore for his home and office staff, including domestic helpers, drivers, and office assistants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-check-target-price-52-week-high-buy-or-sell-2702828-2025-04-02",
      "headline": "Zomato share price rises 3%. Check target price, 52-week high, buy or sell?Today's gain comes on the back of developments such as Goldman Sachs buying a stake in Zomato and a report indicating that the company has laid off 600 customer support employees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-now-open-for-nps-subscribers-here-is-how-to-apply-2702780-2025-04-02",
      "headline": "Unified Pension Scheme now open for NPS subscribers. Here's how to applyCentral government employees who have worked for more than 10 years are entitled to a guaranteed pension of Rs 10,000 per month. Additionally, those with 10–25 years of service will receive a pension that is in line with the years they served."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-consumer-products-stock-price-rises-8-percent-today-key-reasons-explained-2702773-2025-04-02",
      "headline": "Explained: Why Tata Consumer Products share price gained 8% todayAt around 11:34 am, shares were trading 7.47% higher at Rs 1,066 on the Bombay Stock Exchange (BSE), after hitting an intraday high of Rs 1,073.55 earlier in the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-activity-in-march-expands-at-fastest-pace-in-8-months-2702741-2025-04-02",
      "headline": "Manufacturing activity in March expands at fastest pace in 8 monthsThe HSBC India Manufacturing Purchasing Managers' Index (PMI), compiled by S&P Global, bounced to 58.1 in March from 56.3 in February, higher than a preliminary estimate of 57.6 and firmly above 50.0 which separates growth from contraction."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reunites-with-daughter-malti-marie-shares-pic-from-home-2703155-2025-04-02",
      "headline": "Priyanka Chopra finally 'home' with daughter Malti Marie, shares adorable picActor Priyanka Chopra is ecstatic to be back home in Los Angeles with her daughter, Malti Marie. She shared an adorable photo of their reunion with the little munchkin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-khan-on-ageism-fitness-comfort-food-botox-at-book-launch-event-2703111-2025-04-02",
      "headline": "Kareena Kapoor Khan says age is just a number, wants to work all her lifeKareena Kapoor Khan discussed her enduring passion for acting and how age is just a number in her career. The Bollywood star shared her desire to work throughout her life, inspiring many with her dedication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-megan-fox-is-letting-machine-gun-kelly-stay-with-her-post-breakup-glbs-2703108-2025-04-02",
      "headline": "Why Megan Fox is letting Machine Gun Kelly stay with her post-breakupMegan Fox and Machine Gun Kelly welcomed their daughter despite separating earlier. Kelly shared the joyous news with an emotional post.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/when-tom-cruise-cried-after-reunion-with-val-kilmer-on-top-gun-maverick-set-2703076-2025-04-02",
      "headline": "When Tom Cruise cried after reunion with Val Kilmer on Top Gun Maverick setHollywood stars Tom Cruise and Val Kilmer had an emotional reunion on the set of Top Gun: Maverick. Kilmer died in Los Angeles on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-congratulates-brother-nagendra-babu-as-he-joins-andhra-pradesh-member-of-legislative-council-2703099-2025-04-02",
      "headline": "Chiranjeevi congratulates brother Nagendra as he joins Andhra Legislative CouncilActor Chiranjeevi is ecstatic as his brother, Nagendra Babu, took oath as a Member of the Andhra Pradesh Legislative Council. He shared pictures of the celebration with his wife, Surekha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupriya-goenka-co-star-got-excited-during-intimate-scene-felt-violated-2703072-2025-04-02",
      "headline": "Anupriya Goenka: Co-star got excited during intimate scene, felt violatedActor Anupriya Goenka, best known for her role in Asur, recalled an inappropriate experience with a co-star. In an interview, Goenka shared that she felt uncomfortable when he touched her inappropriately during the filming of a scene. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyuns-agency-gold-medalist-faces-financial-collapse-amid-his-controversy-reports-2703069-2025-04-02",
      "headline": "Gold Medalist faces financial collapse amid Kim Soo-hyun's controversy: ReportGold Medalist, the agency behind actor Kim Soo-hyun, is reportedly facing financial ruin amid a scandal involving its star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-white-lotus-season-3-finale-to-be-longest-episode-in-series-history-glbs-2703058-2025-04-02",
      "headline": "The White Lotus Season 3 finale to be longest episode in series historyThe White Lotus signs off Season 3 in style with its longest episode ever. A 90-minute thriller packed with drama and surprises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-and-sanjay-dutt-reuniting-for-actioner-ganga-ram-2703047-2025-04-02",
      "headline": "Salman Khan, Sanjay Dutt reuniting for actioner Ganga Ram: ReportBollywood stars Salman Khan and Sanjay Dutt will be reuniting for an actioner. The film will reportedly be called Ganga Ram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-proves-slice-of-life-is-alive-can-bollywood-catch-up-2703049-2025-04-02",
      "headline": "When Life Gives You Tangerines proves slice-of-life is alive; Can Bollywood catch up?The global success of the K-drama When Life Gives You Tangerines highlights the enduring appeal of the romance and slice-of-life genres, raising questions about Bollywood's current focus on action and thrillers over heartfelt storytelling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ronit-roy-on-why-he-started-his-security-agency-hunger-poverty-desperation-2703002-2025-04-02",
      "headline": "Hunger, poverty, desperation: Ronit Roy on why he started his security agencyActor Ronit Roy shared his journey of being \"written off\" by Bollywood and starting a security agency due to financial struggles. He also opened up about battling alcoholism and poverty. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-divorce-insurance-review-lee-dong-wook-2703038-2025-04-02",
      "headline": "The Divorce Insurance review: Lee Dong-wook's charm works, but the show? HardlyReleased-Mon Mar 31, 2025K-drama star Lee Dong-wook's new show, The Divorce Insurance, is currently streaming on Prime Video. Read our review to find out if it is your cup of tea. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/harrison-ford-calista-flockharts-romantic-nyc-outing-captivates-fans-glbs-2703020-2025-04-02",
      "headline": "Harrison Ford & Calista Flockhart's romantic NYC outing captivates fansHarrison Ford and Calista Flockhart shared a romantic moment in NYC before Flockhart's play. Married since 2010, the couple's strong bond remains evident despite Ford's recent health setback.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaaved-jaaferi-dance-61-hip-hop-india-2-watch-2703019-2025-04-02",
      "headline": "Jaaved Jaaferi's dance at 61 can give 20-year-olds a run for their money. WatchJaaved Jaaferi showcased his exceptional dance skills on Hip Hop India 2, leaving audiences amazed with his energy and charisma at 61. The episode featured a memorable dance-off between him and Remo D'Souza, highlighting Jaaferi's timeless talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/now-you-see-me-3-release-date-announced-fourth-film-also-greenlit-cinemacon-2702973-2025-04-02",
      "headline": "Now You See Me 3 release date announced. Fans ask 'is this a magic trick?'The much-loved Now You See Me franchise is back with its third instalment, set to release on November 14, 2025. While fans are excited about the announcement, they are left equally sceptical.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-world-tour-will-take-time-even-after-their-reunion-2702874-2025-04-02",
      "headline": "Here's why the BTS world tour will take time even after their reunionThe BTS world tour will take some time even after all the members have returned from the South Korean army. Their company, HYBE, released a statement about the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-clears-air-around-the-paradise-being-india-mad-max-2702995-2025-04-02",
      "headline": "Actor Nani clears air around Paradise being India's Mad MaxActor Nani recently cleared the confusion around his upcoming film, The Paradise, being presumed as \"India's Mad Max\". The film, directed by Srikanth Odela, will go on floors this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-delay-rumours-october-20-release-2702944-2025-04-02",
      "headline": "Kantara Chapter 1 makers shut down delay rumours, film eyes October releaseKannada actor Rishab Shetty's Kantara: Chapter 1 is on track for a grand release in October. The makers dismissed rumours about the film being delayed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-hans-raj-hans-wife-dies-after-prolonged-illness-2702942-2025-04-02",
      "headline": "Singer Hans Raj Hans's wife Resham Kaur dies after prolonged illnessSinger and former Lok Sabha MP Hans Raj Hans lost his wife, Resham Kaur, to prolonged illness on Wednesday.  She was admitted to a hospital in Jalandhar where she breathed her last. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaguar-fighter-aircraft-air-force-crash-gujarat-jamnagar-defence-2703120-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Air Force fighter jet breaks into pieces after crashing in Gujarat, pilot injuredAn aircraft of the Air Force crash-landed in Gujarat's Jamnagar, injuring one pilot. The cause behind the crash is yet to be ascertained."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-non-muslims-waqf-board-interfere-religious-matters-parliament-bill-lok-sabha-2703009-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why non-Muslims in Waqf board? Amit Shah explains, condemns 'fearmongering'Union Home Minister Amit Shah clarified that non-Muslim members would only look after the administration of property donated by someone under Waqf Law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/musk-will-leave-soon-trump-tells-close-aides-politico-reports-glbs-2703106-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will leave after DOGE work over: White House on Musk exiting Trump admin buzzElon Musk will soon step back from his role in the Trump administration, where he was tasked with cutting government spending, as both Musk and Trump agreed on his return to business.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-debate-boards-owned-18-lakh-acre-in-100-years-added-21-lakh-acre-in-last-12-amit-shah-2703089-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Boards owned 18 lakh acres in 100 years, added 21 lakh acres in last 12The history of Waqf in India started with the gift of two villages in the 12th century. Home Minister Amit Shah stated in Parliament that Waqf boards owned 18 lakh acres from 1913 to 2013. However, 21 lakh acres have been added in the last 12 years. It was in 2013 that the Waqf Act of 1995 was amended. Shah was speaking during the debate on the Waqf Amendment Bill, 2024, tabled earlier on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bangladesh-muhammad-yunus-remarks-northeast-india-china-economy-2703048-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bangladesh's Yunus needs new friends, so he's turning to BeijingBangladesh's interim government chief adviser, Muhammad Yunus, stirred controversy with his remarks on 'integrating' Northeast India into China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-best-home-defeat-bengaluru-2703138-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohammed Siraj's best in Bengaluru ends RCB's unbeaten start to new seasonIPL 2025, RCB vs GT: Mohammed Siraj reserved his best bowling performance in Bengaluru for the game against RCB as Gujarat Titans secured a dominant win on Wednesday. Jos Buttler's unbeaten 73 helped Gujarat chase 170 in just 17.5 overs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/myanmar-magnitude-56-earthquake-injured-dead-south-coast-2703123-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar hit by 5.6 magnitude earthquake just days after devastating tremors killed 3,000Myanmar hit by 5.6 magnitude earthquake just days after devastating tremors killed 3,000"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-uncovers-george-soros-backed-funding-routes-indian-ngos-2702906-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED uncovers George Soros-backed funding routes to Indian NGOsThe ED has flagged several attempts made by Geroge Soros-linked foundation to funnel disguised donations to Indian NGOs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/lakme-fashion-week-2025-tarun-tahiliani-fdci-sunil-sethi-accessible-luxury-2702962-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's behind the rise of bridge-to-luxury labels in India?Tarun Tahiliani, along with other top designers, is reshaping Indian fashion with bridge-to-luxury labels, thereby making designer wear more accessible, versatile, and in tune with a new generation that values both style and affordability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/not-able-to-use-google-pay-paytm-other-upis-you-are-not-alone-2703096-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not able to use Google Pay, Paytm, other UPIs? You are not aloneUsers across India are facing difficulties making digital payments as popular UPI platforms, including Google Pay, Paytm and SBI, experienced service disruptions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-are-dirty-15-nations-list-donald-trump-tariff-liberation-day-april-2-2702686-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Dirty 15' list: Which countries will suffer most from Trump's tariffs?The Trump administration has claimed that existing trade rules favour other countries at the expense of the US, and the new tariffs are seen as a response to these concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/making-annamalai-former-tamil-nadu-bjp-captain-may-help-the-party-use-him-as-an-impact-player-in-2026-2702851-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Making Annamalai former Tamil Nadu BJP captain may help the party use him as an Impact player in 2026According to reports, Annamalai may not remain BJP chief in Tamil Nadu because of the party's move to rekindle an alliance with the AIADMK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-shubhanshu-shukla-part-of-ax-4-launch-space-station-2703053-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nasa announces when Indian astronaut will launch to Space StationShubhanshu Shukla, a seasoned Indian Air Force (IAF) pilot, will serve as the mission pilot aboard a SpaceX Dragon spacecraft. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-lalu-yadav-rjd-chief-waqf-amendment-bill-pm-modi-parliament-lok-sabha-2703035-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Lalu Yadav aided Amit Shah's Waqf attack on OppositionIn a dig at Lalu Yadav, Union Home Minister Amit Shah said Prime Minister Narendra Modi fulfilled the RJD chief's wish that he wanted imprisonment of those committing land theft through the amended Waqf Act in 2013 during the Congress-led UPA regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-man-pulled-alive-from-rubble-5-days-death-toll-injured-missing-thailand-2702737-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar earthquake: Man pulled alive from rubble after 5 days, toll crosses 3,000Rescue teams in Myanmar pulled a 26-year-old man alive from the rubble five days after a devastating 7.7 magnitude earthquake killed more than 3,000 people, injured thousands, and left 441 still missing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/jhansi-viral-video-pet-dog-slips-under-moving-train-as-owner-tries-to-board-2702945-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pet dog slips under moving train as owner tries to board. Video infuriates InternetA pet dog slipped under a moving train as its owner dragged it to board. A video of the shocking incident went viral on social media.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/union-environment-ministry-on-tree-felling-at-hcu-uoh-kancha-gachibowli-ranga-reddy-telangana-govt-2703054-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre seeks Telangana's reply on tree razing complaints at Hyderabad UniversityThe Centre has ordered Telangana to take legal action over illegal tree felling in Kancha Gachibowli area near University of Hyderabad campus. Meanwhile actor Dia Mirza backed students protesting to save green cover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-goa-domestic-cricket-mumbai-explains-decision-2703067-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Yashasvi Jaiswal chose to switch from Mumbai to Goa in domestic cricketOpening batter Yashasvi Jaiswal confirmed Goa offered him captaincy in domestic cricket, explaining his move out of Mumbai. The 23-year-old is all set to play for Goa, who were promoted from Plate to Elite group in Ranji Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/uber-for-teens-in-india-who-can-ride-key-benefits-and-how-it-works-2702952-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uber for Teens in India: Who can ride, key benefits and how it worksAs the service rolls out across the country, it is poised to become an integral part of the daily lives of Indian families, offering a reliable and secure mode of transportation for the younger generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/meet-a-company-that-sold-more-cars-than-hyundai-tata-mahindra-combined-in-fy25-2702963-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet a company that sold more cars than Hyundai, Tata, Mahindra combined in FY25This carmaker unveiled its maiden battery electric vehicle (BEV) at Bharat Mobility Global Expo 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariffs-announcement-live-updates-liberation-day-reciprocal-tariffs-india-china-us-2703060-2025-04-02#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "No 'tit-for-tat' with US on tariffs: Mexico President ahead of Trump's announcementTrump Tariffs Announcement Live Updates: All eyes will be on US President Donald Trump's big announcement on the reciprocal tariffs at the Rose Garden on Wednesday at 4 pm ET (around 1.30 am IST). Since taking office in January, Trump has imposed tariffs on Mexico, Canada and China, all of whom have hit back with retaliatory levies. The White House has confirmed that Trump's proposed reciprocal tariffs announced today will go into effect immediately. Will India be in the firing line? Watch indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamras-offer-to-banker-who-had-to-cut-short-vacation-after-cops-summons-2702925-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra's offer to banker who had to cut short vacation after cops' summonsA banker who attended Kunal Kamra's controversial show in the city was summoned as a witness after a case was registered against the comedian. Sharing a media report stating that the banker had to cut short his holiday, the comedian offered to 'schedule your next vacation anywhere you'd like in India.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-act-land-cant-be-turned-waqf-property-overnight-draconian-section-40-to-be-history-2702821-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Draconian Section 40 to be history, land can't be turned Waqf property overnightThe Waqf (Amendment) Bill, 2024, that was tabled in the Lok Sabha, seeks to scrap Section 40 of the Waqf Act. The Section allows the waqf boards and the Tribunal to declare any land as Waqf property. Minority Affairs Minister Kiren Rijiju called it the \"most draconian\" provision, alleging it was misused for mass land conversions. The new Bill allows these decisions to be challenged in courts."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-jos-buttler-embarrassment-2703156-2025-04-02",
      "headline": "Jos Buttler turned wicketkeeping embarrassment into match-winning 73IPL 2025, RCB vs GT: Jos Buttler dropped a simple catch of Phil Salt, but made amends with a thunderous 73-run knock against the Royal Challengers Bengaluru at the M Chinnaswamy Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-best-home-defeat-bengaluru-2703138-2025-04-02",
      "headline": "Mohammed Siraj's best in Bengaluru ends RCB's unbeaten start to new seasonIPL 2025, RCB vs GT: Mohammed Siraj reserved his best bowling performance in Bengaluru for the game against RCB as Gujarat Titans secured a dominant win on Wednesday. Jos Buttler's unbeaten 73 helped Gujarat chase 170 in just 17.5 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rcb-vs-gt-injury-scare-fielding-2703137-2025-04-02",
      "headline": "Virat Kohli suffers injury scare after blow on finger while fieldingIPL 2025, RCB vs GT: Virat Kohli sustained a finger injury while fielding in Royal Challengers Bengaluru's first home match on Wednesday at the M Chinnaswamy Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-virat-kohli-fans-arshad-warsi-instagram-name-mix-up-2703128-2025-04-02",
      "headline": "Virat Kohli fans flood actor Arshad Warsi's Instagram after hilarious name mix-upIPL 2025, RCB vs GT: Virat Kohli's fans mistakenly flooded actor Arshad Warsi's Instagram with comments after bowler Arshad Khan dismissed Kohli in an IPL 2025 match. This mix-up echoes past incidents where fans have targeted namesakes of cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-rashid-khan-rcb-vs-gt-2703125-2025-04-02",
      "headline": "Sai Kishore outbowls Rashid Khan as Afghan star goes wicketless vs RCBIPL 2025: Rashid Khan had figures of 4-0-54-0 against RCB while Sai Kishore rattled the opposition bowlers with figures of 4-0-22-2 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-pickleball-daughter-samaira-tilak-varma-2703103-2025-04-02",
      "headline": "Watch: Rohit Sharma enjoys pickleball with daughter Samaira, MI mate Tilak VarmaIPL 2025: Ahead of Mumbai Indians' away game in Lucknow on Friday, Rohit Sharma and Tilak Verma were seen enjoying a game of pickleball with the former captain's daughter, Samaira, at their team hotel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/dwayne-bravo-press-conference-kkr-vs-srh-ipl-2025-2703109-2025-04-02",
      "headline": "Bravo's advice for 'reckless' KKR batters: Focus on smarts of the gameIPL 2025, KKR vs SRH: In the pre-match press conference, Kolkata Knight Riders' mentor Dwayne Bravo said his team's batters need to be focussed on the smarts of the game rather than recklessly going for shots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dwayne-bravo-home-advantage-kkr-vs-srh-press-conference-2703087-2025-04-02",
      "headline": "It's fans who make the difference: Bravo on 'home advantage'IPL 2025, KKR vs SRH: Kolkata Knight Riders' mentor said that fans play a bigger role than the nature of surfaces as far as getting home advantage is considered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-cristiano-ronaldo-phil-salt-rcb-vs-gt-2703073-2025-04-02",
      "headline": "Fired up Siraj brings out Ronaldo celebration after castling Phil SaltIPL 2025, RCB vs GT: Mohammed Siraj pulled off Cristiano Ronaldo's iconic celebration after getting the wicket of Phil Salt in the match on April 2 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-goa-domestic-cricket-mumbai-explains-decision-2703067-2025-04-02",
      "headline": "Why Yashasvi Jaiswal chose to switch from Mumbai to Goa in domestic cricketOpening batter Yashasvi Jaiswal confirmed Goa offered him captaincy in domestic cricket, explaining his move out of Mumbai. The 23-year-old is all set to play for Goa, who were promoted from Plate to Elite group in Ranji Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-tweet-mumbai-goa-domestic-cricket-rumours-yashasvi-jaiswal-2703066-2025-04-02",
      "headline": "Suryakumar Yadav denies Goa move rumours in strongly-worded postMumbai's Suryakumar Yadav is not following Yashasvi Jaiswal to Goa. The batter denied the rumours in a sharp post on social media on April 2.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/dwayne-bravo-press-conference-kkr-vs-srh-ipl-2025-2703109-2025-04-02",
      "headline": "Bravo's advice for 'reckless' KKR batters: Focus on smarts of the gameIPL 2025, KKR vs SRH: In the pre-match press conference, Kolkata Knight Riders' mentor Dwayne Bravo said his team's batters need to be focussed on the smarts of the game rather than recklessly going for shots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dwayne-bravo-home-advantage-kkr-vs-srh-press-conference-2703087-2025-04-02",
      "headline": "It's fans who make the difference: Bravo on 'home advantage'IPL 2025, KKR vs SRH: Kolkata Knight Riders' mentor said that fans play a bigger role than the nature of surfaces as far as getting home advantage is considered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-cristiano-ronaldo-phil-salt-rcb-vs-gt-2703073-2025-04-02",
      "headline": "Fired up Siraj brings out Ronaldo celebration after castling Phil SaltIPL 2025, RCB vs GT: Mohammed Siraj pulled off Cristiano Ronaldo's iconic celebration after getting the wicket of Phil Salt in the match on April 2 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-goa-domestic-cricket-mumbai-explains-decision-2703067-2025-04-02",
      "headline": "Why Yashasvi Jaiswal chose to switch from Mumbai to Goa in domestic cricketOpening batter Yashasvi Jaiswal confirmed Goa offered him captaincy in domestic cricket, explaining his move out of Mumbai. The 23-year-old is all set to play for Goa, who were promoted from Plate to Elite group in Ranji Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-tweet-mumbai-goa-domestic-cricket-rumours-yashasvi-jaiswal-2703066-2025-04-02",
      "headline": "Suryakumar Yadav denies Goa move rumours in strongly-worded postMumbai's Suryakumar Yadav is not following Yashasvi Jaiswal to Goa. The batter denied the rumours in a sharp post on social media on April 2.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-test-match-weather-smog-bcci-india-home-matches-schedule-2703057-2025-04-02",
      "headline": "Delhi Test match after Diwali: Fans slam bizarre BCCI home season scheduleThe Indian Cricket Board announced their home schedule for 2024-25. Fans called out the scheduling of the Test match in New Delhi right after the festival of Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-rajat-patidar-bengaluru-crowd-reception-video-2703055-2025-04-02",
      "headline": "Bengaluru crowd roars for captain Rajat Patidar after Virat Kohli's requestIPL 2025, RCB vs GT: The crowd at the M Chinnaswamy Stadium gave a huge cheer for Rajat Patidar after their new captain walked up for the toss for the first time at home. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/roinku-singh-bat-rohit-sharma-virat-kohli-2703039-2025-04-02",
      "headline": "Rinku Singh strikes again: After Virat Kohli, asks Rohit Sharma for new batKKR batter Rinku Singh slipped into the Mumbai Indians dressing room and asked for Rohit Sharma's bat. Rinku, who last year had bugged Kohli for his bats twice, struck once again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-final-four-schedule-how-to-watch-and-the-four-teams-left-standing-glbs-2703034-2025-04-02",
      "headline": "NCAA Tournament Final Four: Schedule, how to watch, and the four teams left standingThe NCAA Men's Basketball Tournament, also known as March Madness, is down to its final four teams as the competition nears its end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-south-africa-2025-26-home-season-schedule-2703025-2025-04-02",
      "headline": "India to play West Indies, South Africa in 2025-26 home season: Full ScheduleThe Board of Control for Cricket in India (BCCI) on Wednesday, April 02 announced the home season schedule for the senior men's team. India will play two Tests against the West Indies and a full-fledged series across all formats against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-duffy-new-zealand-icc-t20i-rankings-pakistan-2703023-2025-04-02",
      "headline": "New Zealand pacer crowned No.1 after dream Pakistan T20IsNew Zealand fast bowler Jacob Duffy has been rewarded with the No.1 ranking for bowlers in T20Is. The speedster took 13 wickets in the series at an economy rate of 6.16 with best figures of 4-0-20-4 in Mount Maunganui. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nigerian-boxer-gabriel-oluwasegun-olanrewaju-dies-after-collapsing-in-ring-during-fight-in-ghana-glbs-2703014-2025-04-02",
      "headline": "Nigerian boxer Gabriel Oluwasegun Olanrewaju dies after collapsing in ring during fight in GhanaNigerian professional boxer Gabriel Oluwasegun Olanrewaju tragically died after collapsing in the third round of a light-heavyweight fight against Ghana's Jon Mbanugu on Saturday, March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-fifty-two-points-people-draped-all-over-stephen-curry-says-steve-kerr-as-warriors-edge-out-grizzlies-glbs-2703004-2025-04-02",
      "headline": "NBA: Fifty-Two points, people draped all over Stephen Curry, says Steve Kerr as Warriors edge out GrizzliesGolden State Warriors head coach Steve Kerr was in awe after Stephen Curry delivered an exceptional 52-point performance against the Memphis Grizzlies on Tuesday, April 1, during the NBA regular season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-south-africa-2025-26-home-season-schedule-2703025-2025-04-02",
      "headline": "India to play West Indies, South Africa in 2025-26 home season: Full ScheduleThe Board of Control for Cricket in India (BCCI) on Wednesday, April 02 announced the home season schedule for the senior men's team. India will play two Tests against the West Indies and a full-fledged series across all formats against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-duffy-new-zealand-icc-t20i-rankings-pakistan-2703023-2025-04-02",
      "headline": "New Zealand pacer crowned No.1 after dream Pakistan T20IsNew Zealand fast bowler Jacob Duffy has been rewarded with the No.1 ranking for bowlers in T20Is. The speedster took 13 wickets in the series at an economy rate of 6.16 with best figures of 4-0-20-4 in Mount Maunganui. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nigerian-boxer-gabriel-oluwasegun-olanrewaju-dies-after-collapsing-in-ring-during-fight-in-ghana-glbs-2703014-2025-04-02",
      "headline": "Nigerian boxer Gabriel Oluwasegun Olanrewaju dies after collapsing in ring during fight in GhanaNigerian professional boxer Gabriel Oluwasegun Olanrewaju tragically died after collapsing in the third round of a light-heavyweight fight against Ghana's Jon Mbanugu on Saturday, March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-fifty-two-points-people-draped-all-over-stephen-curry-says-steve-kerr-as-warriors-edge-out-grizzlies-glbs-2703004-2025-04-02",
      "headline": "NBA: Fifty-Two points, people draped all over Stephen Curry, says Steve Kerr as Warriors edge out GrizzliesGolden State Warriors head coach Steve Kerr was in awe after Stephen Curry delivered an exceptional 52-point performance against the Memphis Grizzlies on Tuesday, April 1, during the NBA regular season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sara-tendulkar-mumbai-franchise-global-e-cricket-premier-league-2702968-2025-04-02",
      "headline": "Sara Tendulkar becomes franchise owner for Global e-Cricket Premier LeagueSara Tendulkar, the daughter of legendary Indian cricketer Sachin Tendulkar, has become a team owner of the Mumbai franchise in the Global e-Cricket Premier League (GEPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-live-score-bengaluru-today-match-updates-2702996-2025-04-02",
      "headline": "RCB vs GT Highlights: Jos Buttler's 73 powers Gujarat Titans to 8-wicket winIPL 2025, Royal Challengers Bengaluru (RCB) vs Gujarat Titans (GT) Live Score: Jos Buttler scored an unbeaten 73 as Gujarat Titans raced to an eight-wicket win against the hosts, led by Rajat Patidar, at the M Chinnaswamy Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-returns-rajasthan-royals-captain-rr-vs-pbks-2702970-2025-04-02",
      "headline": "Sanju Samson returns as RR captain, cleared to keep wickets by BCCIRajasthan Royals batter Sanju Samson is set to return to his full-time leadership role in the team's next match against Punjab Kings. Samson has recovered from his finger surgery and has been declared fully fit by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/whoop-there-she-is-jason-and-kylie-kelce-welcome-baby-girl-no-4-glbs-2702896-2025-04-02",
      "headline": "Whoop, there she is! Jason and Kylie Kelce welcome baby girl No. 4Jason and Kylie Kelce welcomed their fourth daughter, Finnley \"Finn\" Anne Kelce, on March 30. The couple shared heartwarming photos of their growing family, continuing their tradition of timeless, classic names.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-digvesh-singh-fined-25-per-cent-of-match-fees-for-breaching-code-of-conduct-2702873-2025-04-02",
      "headline": "Digvesh Singh fined 25 per cent of match fees for breaching IPL Code of ConductLucknow Super Giants (LSG) wrist spinner Digvesh Singh has been fined 25 per cent of his match fees for breaching Code of Conduct against Punjab Kings (PBKS) in Match 13 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-mumbai-domestic-team-goa-2702869-2025-04-02",
      "headline": "Star batter Yashasvi Jaiswal leaves Mumbai cricket in shock move to GoaStar batter Yashavi Jaiswal has left Mumbai in a shock move. The India opener, who had a dramatic rags to riches in Mumbai, is set to leave the state association to play for Goa next season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-pitch-controversy-lsg-vs-curator-eden-wicket-csk-kkr-sujan-mukherjee-2702860-2025-04-02",
      "headline": "Pitch curators vs IPL franchise: What do the BCCI rules say?Pitches are the new obsession of the Indian Premier League. After Kolkata and Chennai, Lucknow is the latest franchise to complain about the home wicket. But are those complaints justified? What does the BCCI rulebook say?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-shubman-gills-centuries-in-rcb-vs-gt-2023-2702846-2025-04-02",
      "headline": "IPL, RCB vs GT flashback: When Prince Gill outclassed King Kohli at ChinnaswamyVirat Kohli and Shubman Gill engaged in a battle of King vs Prince during the Indian Premier League 2023 (IPL 2023) at the M. Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-pak-2nd-odi-mitchell-hay-ben-sears-faheem-ashraf-naseem-shah-2702767-2025-04-02",
      "headline": "Hay, Sears crush Pakistan by 84 runs in 2nd ODI as New Zealand seal series 2-0New Zealand beat Pakistan by 84 runs in the second ODI of the three-match series on Wednesday, April 2 at Seddon Park, Hamilton. Mitchell Hay (99) and Ben Sears (5/59) guided the hosts to a comprehensive win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-nikola-jokic-scores-career-high-61-points-but-falls-short-as-timberwolves-edge-nuggets-in-2ot-thriller-glbs-2702750-2025-04-02",
      "headline": "NBA: Nikola Jokić scores career-high 61 points but falls short as Timberwolves edge Nuggets in 2OT thrillerNikola Jokic scored a career-high 61 points; however, the Denver Nuggets still fell short in a double-overtime thriller against the Minnesota Timberwolves in a regular NBA game on Tuesday, April 1, at Ball Arena, losing 140-139."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-pbks-zaheer-khan-on-rishabh-pants-form-2702740-2025-04-02",
      "headline": "Rishabh Pant will soon come good as a batter: LSG mentor Zaheer KhanLucknow Super Giants (LSG) mentor Zaheer Khan has backed captain Rishabh Pant to soon come good as a batter in the Indian Premier League 2025 (IPL 2025). Pant has scored just 17 runs to his name from three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-pbks-nehal-wadhera-full-press-conference-2702731-2025-04-02",
      "headline": "My plan was to make sure pressure didn't get to Shreyas Iyer: Nehal WadheraPunjab Kings (PBKS) batter Nehal Wadhera opened up about his game plan after his match-winning innings against Lucknow Super Giants (LSG) at the Ekana Stadium. Wadhera scored an unbeaten 43* (25) with the help of three fours and four sixes."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}