{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-77-points-higher-nifty-above-24750-tata-motors-up-4-percent-2783801-2025-09-08",
      "headline": "Sensex closes 77 points higher, Nifty above 24,750; Tata Motors up 4%The S&P BSE Sensex gained 76.54 points to close at 80,787.30, while the NSE Nifty50 added 32.15 points to end at 24,773.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-tops-global-crypto-adoption-rankings-again-in-2025-report-2783757-2025-09-08",
      "headline": "India tops global crypto adoption rankings again in 2025: ReportMajor markets like India, Vietnam, and Pakistan drove APAC's crypto surge, pushing transaction volume from $1.4 trillion to $2.36 trillion in a year, according to the report."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-fake-loan-dropped-a-credit-score-overnight-explains-sebi-registered-analyst-2783725-2025-09-08",
      "headline": "How a fake loan dropped a credit score overnight, explains Sebi-registered analystA Sebi-registered analyst has shared a real-life story of how a single fake loan caused a credit score to crash overnight, showing just how vulnerable personal finances can be to fraud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/andhra-pradesh-nara-lokesh-trump-tariff-seafood-hosiery-industry-rajdeep-sardesai-south-conclave-2025-2783719-2025-09-08",
      "headline": "How is Andhra Pradesh dealing with Trump tariffs? Nara Lokesh answersWhen asked about the impact of Trump tariffs on Andhra Pradesh's growth plans, Nara Lokesh described the situation as a challenge but also an opportunity to reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-life-and-health-insurance-how-much-will-you-really-save-2783695-2025-09-08",
      "headline": "No GST on life and health insurance: How much will you really save?Under the proposal, premiums for life and health insurance could be completely exempt from GST. You would pay only the base premium quoted by your insurer, without the 18% tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-much-will-trump-tariffs-hurt-india-here-is-what-top-adviser-said-2783671-2025-09-08",
      "headline": "How much will Trump tariffs hurt India? Here's what top adviser saidTrump doubled tariffs on Indian goods last month, arguing that New Delhi's imports of Russian oil were helping to fund Moscow's war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-government-fixes-september-30-deadline-here-is-what-it-means-2783652-2025-09-08",
      "headline": "UPS to NPS: Government fixes September 30 deadline, here's what it meansThe government has given central employees under the Unified Pension Scheme (UPS) a one-time chance to shift back to the National Pension System (NPS), with 30 September 2025 set as the deadline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-russian-oil-sanctions-tariffs-second-phase-impact-on-india-2783649-2025-09-08",
      "headline": "Trump warns of fresh Russia oil sanctions: Should India worry?Russian barrels have been critical to India's energy needs. At one point, nearly 40% of crude imports came from Russia. The discounted supply saved billions of dollars and kept petrol prices under control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-why-cas-are-seeking-extension-of-september-15-deadline-2783609-2025-09-08",
      "headline": "ITR filing: Why CAs are seeking extension of September 15 deadlineThe pressure on taxpayers is mounting with the September 15 ITR deadline just days away. Professional groups are demanding an extension, citing delays, technical snags, and even natural disasters that have slowed down the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-date-time-value-october-debut-stock-market-report-2783566-2025-09-08",
      "headline": "LG Electronics eyes Rs 15,000 crore IPO debut in October: ReportThe consumer electronics major plans to raise around Rs 15,000 crore through the share sale, making it the largest IPO of 2025 so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hero-motocorp-names-harshavardhan-chitale-as-new-ceo-2783544-2025-09-08",
      "headline": "Who is Harshavardhan Chitale, Hero MotoCorp's incoming CEOHarshavardhan Chitale, who currently heads the professional business of Dutch lighting major Signify, will take over from acting CEO Vikram Kasbekar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/video/upcoming-10-ipos-this-week-will-dalal-street-deliver-big-returns-bt-show-market-opening-2783537-2025-09-08",
      "headline": "10 IPOs lined up this week: Will Dalal Street deliver big returns?While the IPO market remains attractive, the overall market sentiment is improving slowly, and investors should not rush in with high expectations."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/navya-nair-fined-aud-1980-australia-undeclared-jasmine-flowers-2783818-2025-09-08",
      "headline": "Actor Navya Nair fined over Rs 1 lakh for carrying Jasmine flowers to AustraliaMalayalam actor Navya Nair was fined AUD 1,980 (Rs 1.14 lakh) for carrying jasmine flowers to Australia. The actor shared a video of her wearing the jasmine flowers and called this experience a learning moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/k-pop-group-treasure-ace-srks-pose-speak-about-india-3rd-mini-album-love-pulse-2783821-2025-09-08",
      "headline": "K-pop group TREASURE ace SRK's pose, speak about India, 3rd mini album LOVE PULSEIn this India-exclusive interview with India Today's Bhavna Agarwal, K-pop group TREASURE, the 10-member K-pop group that debuted in 2020 under YG Entertainment, open up about their journey from debut days to their latest comeback with the 3rd mini album Love Pulse. Known for their powerful performances and playful energy, the members reflect on how far they've come, what advice they would give to their younger debut selves, and how their bond has only grown stronger over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-says-he-formed-a-theatre-group-in-jail-with-murder-convicts-2783704-2025-09-08",
      "headline": "Sanjay Dutt says he formed a theatre group in jail with murder convictsActor Sunjay Dutt recently opened up on Kapil Sharma's show about his time in prison. He shared that he ran a radio station, and directed a theatre group with convicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-trailer-promises-starry-cameos-shah-rukh-khan-aamir-khan-2783802-2025-09-08",
      "headline": "Aryan Khan's The Ba***ds of Bollywood trailer promises starry cameos, big dramaAryan Khan's 'The Ba***ds of Bollywood' trailer is finally out. Directed by Aryan Khan, the seven-episode series, promises starry cameos and a whole lot of drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/narain-karthikeyan-ajith-kumar-asian-le-mans-series-2783792-2025-09-08",
      "headline": "Narain Karthikeyan on teaming up with Ajith Kumar for Asian Le Mans SeriesNarain Karthikeyan and Tamil superstar Ajith Kumar are partnering to race in the Asian Le Mans Series. At the India Today Conclave South 2025, India's first-ever Formula One driver praised Ajith and opened up about their collaboration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/a-silent-voice-anime-most-powerful-exploration-of-bullying-and-mental-health-2783650-2025-09-08",
      "headline": "A Silent Voice, anime's most powerful exploration of bullying and mental healthIn this week's Animania, we discuss how, in a world of flashy battles, 'A Silent Voice' won hearts by confronting bullying, disability and mental health with raw honesty and unforgettable emotion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-defends-sandalwood-against-comparisons-with-other-indian-film-industries-2783763-2025-09-08",
      "headline": "Rukmini Vasanth defends Sandalwood against comparisons with other film industriesActor Rukmini Vasanth defended Sandalwood against the perception that it does not measure up to Bollywood, Kollywood, Mollywood, and Tollywood. At the India Today Conclave South 2025, she cited the massive success of 'KGF' and 'Kantara' to support her point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urmila-matondkar-dances-to-rangeela-at-51-fans-celebrate-her-queen-energy-2783726-2025-09-08",
      "headline": "Urmila Matondkar dances to Rangeela at 51, fans celebrate her queen energy. WatchActor Urmila Matondkar recreated her iconic dance track 'Rangeela Re' from Rangeela. In her recent post she spoke about how the 90s musical honours the Navrasas of Indian literature and poetry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-wife-namrata-shirodkar-children-sitara-gautam-ghatamaneni-enjoy-lady-gaga-new-york-concert-2783782-2025-09-08",
      "headline": "Namrata Shirodkar, children Sitara and Gautam enjoy Lady Gaga's New York concertMahesh Babu's wife, Namrata Shirodkar, had a great time with children, Sitara and Gautam Ghatamaneni, as they enjoyed Lady Gaga's New York concert. She shared  pictures from the memorable evening on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-honours-father-colonel-vasanth-venugopal-philanthropy-war-widows-2783775-2025-09-08",
      "headline": "Rukmini Vasanth discusses losing father in 2007 Uri mission, helping war widowsAt the India Today Conclave South 2025, actor Rukmini Vasanth spoke about losing her father, Colonel Vasanth Venugopal in 2007 during a mission in Jammu and Kashmir's Uri. She emphasised the importance of community and philanthropy in supporting war widows and their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rukmini-vasanth-on-kantara-toxic-and-kannada-cinemas-global-spotlight-moment-2783774-2025-09-08",
      "headline": "Actor Rukmini Vasanth on Kantara, Toxic, Kannada cinema's global spotlight momentAt India Today South Conclave 2025, actor Rukmini Vasanth, who will be seen in 'Kantara' and 'Toxic', opens up about Kannada cinema's global moment, her journey with 'Sapta Sagaradaache Ello', and why she believes chasing quality roles matters more than fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-praises-rishab-shetty-yash-kantara-toxic-2783734-2025-09-08",
      "headline": "Rukmini Vasanth on working with Rishab Shetty, Yash: They have grand visionsAt the India Today Conclave South 2025, actor Rukmini Vasanth shared her experience working with Rishab Shetty and Yash in upcoming films. She highlighted the passion and visionary approach behind 'Kantara: Chapter 1' and 'Toxic', signalling fresh creative energy in Kannada cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aly-goni-backlash-silence-ganesh-chaturthi-celebration-2783580-2025-09-08",
      "headline": "Aly Goni on backlash during Ganpati celebration: It was my first timeTelevision actor Aly Goni responded to controversy over his silence during Ganesh Chaturthi celebrations. He claimed in a recent interview that it was his first time attending a Ganpati puja. He also emphasised respect for all religions. The actor was earlier questioned for his silence during religious chants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehnaaz-gill-reveals-brother-shehbaz-badesha-hospitalised-bigg-boss-19-premiere-salman-khan-wildcard-contestant-2783709-2025-09-08",
      "headline": "Shehnaaz Gill shares brother Shehbaz was hospitalised after Bigg Boss 19 premiereShehnaaz Gill recently revealed that her brother Shehbaz Badesha was hospitalised after the 'Bigg Boss 19' premiere. The actor shared that he was diagnosed with dengue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saba-azad-trolls-dating-hrithik-roshan-songs-of-paradise-soni-razdan-2783615-2025-09-08",
      "headline": "Deep-seated sexism: Saba Azad on trolls asking her to quit work after dating HrithikActor Saba Azad recently addressed trolls criticising her relationship with her actor-boyfriend Hrithik Roshan. She called out sexist remarks from social media users and addressed the challenges female actors face in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shekhar-suman-crumbled-battled-depression-after-son-aayush-death-2783663-2025-09-08",
      "headline": "Shekhar Suman says he crumbled, battled depression after son Aayush's deathActor Shekhar Suman recently opened up about the tragic loss of his elder son Aayush to a rare heart ailment. He reflected on how his wife Alka stood by him in the moment of grief."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-reality-check-to-contestants-on-food-wastage-punjab-floods-2783684-2025-09-08",
      "headline": "Bigg Boss 19: Salman's reality check to contestants on food wastage, Punjab floodsSalman Khan didn't hold back on 'Bigg Boss 19' Weekend Ka Vaar as he schooled contestants for wasting food, drawing a powerful comparison with the devastating Punjab floods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-sreeleela-mark-ganpati-celebrations-together-amid-dating-rumours-2783660-2025-09-08",
      "headline": "Kartik Aaryan, Sreeleela celebrate Ganpati together amid dating rumoursKartik Aaryan and Sreeleela celebrated Ganesh Chaturthi together at Kartik's place. Several pictures of the duo celebrating with their families have gone viral.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tiger-shroff-flaunts-abs-throws-t-shirt-to-fans-at-mumbais-gaiety-galaxy-baaghi-4-watch-2783614-2025-09-08",
      "headline": "Tiger Shroff flaunts abs, throws t-shirt to fans at Mumbai's Gaiety Galaxy. WatchTiger Shroff recently visited the iconic Gaiety Galaxy amid 'Baaghi 4' success. The actor surprised fans after he removed his T-shirt and flaunted his abs. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gen-z-protests-nepal-kp-sharma-oli-corruption-social-media-restrictions-2783683-2025-09-08",
      "headline": "Huge Gen Z protest in Nepal over social media ban; 16 dead, 100 injured in firingSixteen people were killed and over 100 were injured in Nepal as thousands of Gen Z protesters, angered by corruption and a government ban on 26 social media platforms, have launched a massive agitation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-updates-curfew-in-kathmandu-oli-government-in-emergency-huddle-security-forces-use-tear-gas-2783755-2025-09-08",
      "headline": "Live: Shoot-at-sight order issued as protesters set Parliament building gate on fireNepal protests Live: Sixteen people were killed and over 100 were injured in Nepal as tens of thousands protested in Kathmandu on Monday against a government ban on major social media platforms, including Facebook, X and YouTube, for not registering under state rules. Demonstrators stormed barricades in New Baneswar, surrounded Parliament and forced riot police to retreat. Security forces responded with tear gas and water cannons. One person was killed and 80 injured, including two journalists. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/aadhaar-will-count-as-id-for-bihar-voter-list-revision-but-not-as-citizenship-proof-poll-body-to-supreme-cou-2783779-2025-09-08",
      "headline": "Aadhaar valid ID for voter list, but not citizenship: Supreme Court to poll bodyThe court ordered that Aadhaar be treated as the 12th document in the list of acceptable identity proofs under the voter registration framework in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-voter-list-revision-vote-chori-electoral-roll-political-rhetoric-free-and-fair-election-india-today-south-conclave-2783603-2025-09-08",
      "headline": "Polls largely free and fair: Ex-Election Commissioners call 'vote chori' rhetoricThree former Election Commissioners said at the India Today South Conclave that elections in India are largely free and fair, and claims of 'vote chori' are routine political rhetoric. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-incredulous-idea-nobel-peace-prize-department-of-war-film-apocalypse-now-lt-col-bill-kilgore-iran-venezuela-2783680-2025-09-08",
      "headline": "America's Absurdocalypse NowUS President Donald Trump, who campaigned as a \"Peace President\", has escalated military actions abroad and on US soil, and even rebranded the Defence Department the Department of War. His pursuit of the Nobel Peace Prize stands in sharp contrast to a war-lover persona, American airstrikes on Iran, and threats to California."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-ex-election-commissioners-believe-poll-body-chief-gyanesh-kumar-is-wrong-on-rahul-gandhi-vote-chori-allegations-2783796-2025-09-08",
      "headline": "Why ex-ECs believe poll body chief is wrong on Rahul GandhiThree former Election Commissioners said at the India Today South Conclave that CEC Gyanesh Kumar's affidavit demand and combative tone in response to Congress leader Rahul Gandhi's \"vote chori\" claim weren't right. They said the EC should have probed the matter instead to preserve public trust in the electoral process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/believe-in-pm-modis-leadership-we-will-support-ndas-veep-candidate-nara-lokesh-2783657-2025-09-08",
      "headline": "Telugu pride? Bharat First, says Nara Lokesh, backs NDA's vice president candidateAt the India Today Conclave South 2025, Andhra Pradesh Minister Nara Lokesh reaffirmed TDP's commitment to the NDA, pledging unconditional support to the coalition and backing its candidate in Vice-Presidential elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/nirf-2025-all-rise-again-for-iim-ahmedabad-why-iim-calcutta-is-slipping-2783104-2025-09-06",
      "headline": "NIRF 2025: All rise again for IIM Ahmedabad; why IIM Calcutta is slippingThe education ministry's National Institutional Ranking Framework (NIRF) 2025 ratings show that while the older IIMs are holding strong, newer ones are rapidly closing the gap\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-nepal-banned-social-media-whatsapp-tiktok-facebook-genz-revolution-2783741-2025-09-08",
      "headline": "Why Nepal banned social media? All about the move that sparked GenZ revolutionNepal's sweeping ban on major social media platforms has triggered a massive youth-led uprising, with thousands of Gen Z protesters flooding the streets of Kathmandu. Clashes with security forces have left one dead, dozens injured, and the army deployed as the government scrambles to contain the unrest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-man-shot-dead-california-stopping-public-urination-2783677-2025-09-08",
      "headline": "Haryana man, 26, shot dead in US after stopping another from urinating in publicA man from Haryana's Jind was fatally shot in California after he objected to a person urinating in public. Kapil had gone to the US through the illegal Dunki route, and the authorities are yet to arrest his killer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-cm-rekha-gupta-who-is-husband-manish-gupta-business-income-controversy-official-meeting-aap-bjp-2783618-2025-09-08",
      "headline": "Who's Manish Gupta, Delhi CM Rekha Gupta's husband seen in official meeting?Images of Manish Gupta, the husband of Delhi CM Rekha Gupta, seated next to his wife in an official meeting, have drawn the AAP's criticism. His presence at one such meeting had earlier fuelled charges of a \"Phulera-like system\" of the Panchayat OTT series from the AAP. So, who's Manish Gupta, who Rekha Gupta said, \"did a lot for her\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rukmini-vasanth-on-kantara-toxic-and-kannada-cinemas-global-spotlight-moment-2783774-2025-09-08",
      "headline": "Actor Rukmini Vasanth on Kantara, Toxic, Kannada cinema's global spotlight momentAt India Today South Conclave 2025, actor Rukmini Vasanth, who will be seen in 'Kantara' and 'Toxic', opens up about Kannada cinema's global moment, her journey with 'Sapta Sagaradaache Ello', and why she believes chasing quality roles matters more than fame."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-caught-shoplifting-us-target-store-breaks-down-cops-interrogation-video-bodycam-footage-2783662-2025-09-08",
      "headline": "Indian woman caught shoplifting in US, breaks down as cops interrogate. Video viralIn a viral video, an Indian woman was seen sitting in an interrogation room with folded hands as police officers questioned her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gurugram-gurgaon-urban-floods-waterlogging-sahibi-river-lost-aravalli-hills-delhi-haryana-hydrology-natural-drainage-2781896-2025-09-08",
      "headline": "There was once a river in GurgaonBefore Gurgaon became Gurugram, a city of glass facades and corporate towers, it was shaped by the flow of the Sahibi River. Once a lifeline for farms, wetlands, and wildlife, that river now survives only as the foul-smelling Najafgarh drain that drains into the Yamuna in northern Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-is-manoj-tumu-indian-american-engineer-rs-352-crore-salary-at-meta-2783805-2025-09-08",
      "headline": "Who is Manoj Tumu, 23-year-old techie who bagged Rs 3.52 crore AI job at Meta?At just 23, Indian-American engineer Manoj Tumu has landed an AI role at Meta with a salary package worth Rs 3.52 crore ($400,000), after working at Amazon and other top tech companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-visa-policy-change-ends-third-country-interview-scheduling-for-indian-applicants-2783495-2025-09-08",
      "headline": "New US short-term visa rule means longer waits for IndiansThe US has introduced a new visa rule requiring all non-immigrant visa applicants to attend interviews only in their country of citizenship or residence, a move that is expected to particularly affect Indians and further lengthen already long wait times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-trailer-promises-starry-cameos-shah-rukh-khan-aamir-khan-2783802-2025-09-08",
      "headline": "Aryan Khan's The Ba***ds of Bollywood trailer promises starry cameos, big dramaAryan Khan's 'The Ba***ds of Bollywood' trailer is finally out. Directed by Aryan Khan, the seven-episode series, promises starry cameos and a whole lot of drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-backs-us-tariffs-on-india-trump-right-idea-russian-oil-ukraine-war-sanctions-2783608-2025-09-08",
      "headline": "Right idea to tariff those who...: Zelenskyy amid Trump's India offensiveUkrainian President Volodymyr Zelensky has voiced strong support for imposing secondary tariffs on countries that continue to maintain economic ties with Russia, including the ongoing purchase of Russian oil and gas. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-russian-oil-sanctions-tariffs-second-phase-impact-on-india-2783649-2025-09-08",
      "headline": "Trump warns of fresh Russia oil sanctions: Should India worry?Russian barrels have been critical to India's energy needs. At one point, nearly 40% of crude imports came from Russia. The discounted supply saved billions of dollars and kept petrol prices under control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/red-sea-cable-cut-who-lays-internet-beneath-sea-global-network-connectivity-houthis-yemen-war-mumbai-andaman-cochin-2783722-2025-09-08",
      "headline": "Red Sea cable cut: Who lays internet line under the sea?A cut in the Red Sea cable disrupted internet services across India, Pakistan, and the Middle East. These vital undersea cables are laid and maintained by private companies and international consortiums. In India, around 17 international undersea cables emerge at 14 stations across Mumbai, Chennai, Cochin, Tuticorin, and Trivandrum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-reporters-diary-rajgir-india-win-2783462-2025-09-08",
      "headline": "Discovering Rajgir through hockey: A reporter's diary of Asia Cup 2025From sweltering heat to electrifying hockey fever, Rajgir offered unforgettable moments during the Hockey Asia Cup 2025. While India lifted the title, it was the city's passionate fans who stole the show, proving that this ancient cultural hub in Bihar could become a rising center for sports in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/narayan-karthikeyan-conclave-south-india-formula-one-2783724-2025-09-08",
      "headline": "How can India build its next F1 star? Narain Karthikeyan explainsIndia's first-ever Formula One driver Narain Karthikeyan, speaking at the India Today South Conclave, explained what the country needs to do to produce its next F1 star. Since Karthikeyan's debut, no other Indian racer has competed in motorsport's most prestigious race."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protests-social-media-ban-parliament-casualties-violence-oli-india-border-security-2783727-2025-09-08",
      "headline": "Army out in Kathmandu as Nepal Gen Z protest intensifies: 10 latest developmentsGen-Z-led protests in Nepal have intensified, prompting authorities to deploy the army and impose curfews in Kathmandu. Police firing in Damak killed six and injured over 80, while clashes in New Baneshwar left several wounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/spacex-fires-super-heavy-rocket-ahead-of-11th-starship-test-flight-2783795-2025-09-08",
      "headline": "SpaceX gearing up for Starship Super Heavy's 11th test flightSpaceX has been steadily pushing Starship through a series of developmental flights aimed at proving out its design for deep-space travel. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-icc-player-month-august-2025-england-series-performance-2783837-2025-09-08",
      "headline": "Mohammed Siraj earns ICC Player of the Month nomination for AugustMohammed Siraj has been nominated as ICC Player of the Month for August 2025 after a brilliant England Test series. He's been shortlisted alongside New Zealand's Matt Henry and West Indies' Jayden Seales in the men's category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/vishal-tk-kalaivani-boxer-push-up-challenge-india-today-conclave-2783823-2025-09-08",
      "headline": "Watch: Vishal TK, Kalaivani get into push-up challenge at South Conclave400m national record holder Vishal TK and boxer Kalaivani Srinivasan got into a fun push-up contest at the India Today South Conclave. Before that, the duo passionately spoke about the changing landscape of athletics in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/vishal-tk-india-running-revolution-schools-conclave-south-2783816-2025-09-08",
      "headline": "Indian schools need to play big part in country's sporting revolution: Vishal TKIndia's 400m specialist Vishal TK believes that schools need to play a big part in promoting sports culture in India. Speaking at the India Today South Conclave, Vishal said that India has a lot of potential in the world of athletics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasim-jaffer-on-suryakumar-yadavs-poor-form-asia-cup-2025-2783798-2025-09-08",
      "headline": "Suryakumar Yadav not scoring runs while leading India is a concern: Wasim JafferWasim Jaffer has expressed concern over Suryakumar Yadav's poor batting form while leading India's T20I side. The Asia Cup 2025 will be a crucial test for Surya's captaincy and batting in a major event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/kalaivani-srinivasan-conclave-south-india-boxing-family-pressure-2783797-2025-09-08",
      "headline": "How Kalaivani Srinivasan punched past gender stereotypes to achieve boxing gloryBoxer Kalaivani Srinivasan, speaking at the India Today South Conclave 2025, shared how her relatives were initially doubtful of her career but gradually came to support her as she began winning medals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/asia-cup-hockey-title-drought-ends-india-eye-success-2026-world-cup-wrap-2783666-2025-09-08",
      "headline": "Asia Cup hockey title drought ends: Can India repeat their success at 2026 World Cup?The Indian men's hockey team ended their Asia Cup title drought and now turn their focus to the 2026 World Cup. How will India shape up for next year's tournament in Belgium and the Netherlands?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-disrespected-punjab-kings-ipl-depression-exit-2783729-2025-09-08",
      "headline": "I was disrespected at Punjab Kings, felt like getting into depression: GayleChris Gayle revealed he was disrespected during his time with Punjab Kings in the IPL. This mistreatment led to depression and an early exit from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/coach-shukri-conrad-slams-south-africa-after-record-odi-loss-vs-england-2783723-2025-09-08",
      "headline": "Embarrassing: Coach Shukri Conrad slams South Africa after record ODI lossDespite sealing the series 2-0, South Africa crashed to a record-breaking 342-run defeat against England in the third ODI. Head coach Shukri Conrad labelled the display 'embarrassing,' while captain Temba Bavuma conceded it 'wasn't good enough,' especially in contrast to their recent heroics in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/narayan-karthikeyan-conclave-south-india-formula-one-2783724-2025-09-08",
      "headline": "How can India build its next F1 star? Narain Karthikeyan explainsIndia's first-ever Formula One driver Narain Karthikeyan, speaking at the India Today South Conclave, explained what the country needs to do to produce its next F1 star. Since Karthikeyan's debut, no other Indian racer has competed in motorsport's most prestigious race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-ready-for-asia-cup-salman-agha-2783665-2025-09-08",
      "headline": "Pakistan in good shape before Asia Cup: Skipper Salman AghaPakistan T20I captain Salman Agha has said that his team is in good shape ahead of the Asia Cup 2025. Pakistan beat Afghanistan in the final of the tri-series and are coming into the tournament with good momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-team-preview-rashid-khan-spin-bowling-2783606-2025-09-08",
      "headline": "Spin-powered Afghanistan are no longer just challengers, but contendersAsia Cup 2025: After their success in the 2024 T20 World Cup, Afghanistan have evolved from being mere challengers to genuine contenders for the ACC Asia Men's T20 Cup, which begins on September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-disrespected-punjab-kings-ipl-depression-exit-2783729-2025-09-08",
      "headline": "I was disrespected at Punjab Kings, felt like getting into depression: GayleChris Gayle revealed he was disrespected during his time with Punjab Kings in the IPL. This mistreatment led to depression and an early exit from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/coach-shukri-conrad-slams-south-africa-after-record-odi-loss-vs-england-2783723-2025-09-08",
      "headline": "Embarrassing: Coach Shukri Conrad slams South Africa after record ODI lossDespite sealing the series 2-0, South Africa crashed to a record-breaking 342-run defeat against England in the third ODI. Head coach Shukri Conrad labelled the display 'embarrassing,' while captain Temba Bavuma conceded it 'wasn't good enough,' especially in contrast to their recent heroics in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/narayan-karthikeyan-conclave-south-india-formula-one-2783724-2025-09-08",
      "headline": "How can India build its next F1 star? Narain Karthikeyan explainsIndia's first-ever Formula One driver Narain Karthikeyan, speaking at the India Today South Conclave, explained what the country needs to do to produce its next F1 star. Since Karthikeyan's debut, no other Indian racer has competed in motorsport's most prestigious race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-ready-for-asia-cup-salman-agha-2783665-2025-09-08",
      "headline": "Pakistan in good shape before Asia Cup: Skipper Salman AghaPakistan T20I captain Salman Agha has said that his team is in good shape ahead of the Asia Cup 2025. Pakistan beat Afghanistan in the final of the tri-series and are coming into the tournament with good momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-team-preview-rashid-khan-spin-bowling-2783606-2025-09-08",
      "headline": "Spin-powered Afghanistan are no longer just challengers, but contendersAsia Cup 2025: After their success in the 2024 T20 World Cup, Afghanistan have evolved from being mere challengers to genuine contenders for the ACC Asia Men's T20 Cup, which begins on September 9."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}