{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/middle-class-stuck-in-debt-trap-says-marcellus-investments-saurabh-mukherjea-2713887-2025-04-24",
      "headline": "Middle-class stuck in debt trap, says Marcellus Investment's Saurabh MukherjeaUsing data from the Reserve Bank of India, Mukherjea estimates that 5-10% of middle-class households are now stuck in a debt trap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-share-upi-with-family-check-steps-to-use-bhim-app-upi-circle-2713877-2025-04-24",
      "headline": "Want to share UPI with family? Check steps to use BHIM app's UPI CircleUPI Circle is a feature where the main UPI account holder or the primary user can authorise up to five trusted people, i.e., secondary users to make UPI payments using his account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-clears-ed-notice-pmla-act-report-share-prce-fall-over-50-percent-in-last-6-months-2713873-2025-04-24",
      "headline": "Gensol says no ED notice received by company, stock continues steep fallGensol share price: The stock fell 5% to hit the lower circuit limit and has fallen over 50% in the last 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hul-q4-results-net-profit-4-percent-drop-rs-2464-crore-final-dividend-announced-2713861-2025-04-24",
      "headline": "HUL Q4 profit falls 4% to Rs 2,464 crore; announces Rs 24 final dividendThe FMCG major reported a consolidated net profit of Rs 2,464 crore for the March quarter, down 3.7% from Rs 2,558 crore in the same period last year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rallis-india-shares-tumbled-over-6-after-q4-results-here-is-why-2713844-2025-04-24",
      "headline": "Explained: Why Rallis India shares tumbled over 6% after Q4 resultsThe Tata Group company posted a wider net loss of Rs 32 crore for the quarter ended March 31, 2025, compared to Rs 22 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-for-daughter-sukanya-samriddhi-yojana-still-offers-high-interest-check-rates-2713841-2025-04-24",
      "headline": "Saving for daughter? Sukanya Samriddhi Yojana still offers high interest. Check ratesSukanya Samriddhi Yojana not only offers high interest but also tax-free returns, thus making it one of the safest savings options for families with a girl child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-brokerage-firm-ubs-upgrade-for-india-stock-markets-but-china-still-favourite-key-reasons-2713804-2025-04-24",
      "headline": "UBS upgrades stance on Indian stock markets, but finds China 'more attractive'Despite India's promising fundamentals, China remains UBS's top pick among emerging markets (EM), thanks to cheaper valuations and a stronger risk-reward profile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-175-points-lower-nifty-below-24300-indusind-bank-up-2-percent-profit-booking-2713788-2025-04-24",
      "headline": "Sensex, Nifty slip as investors book profit after 7-day market rallyThe S&P BSE Sensex fell by 159.23 points to 79,957.26, while the NSE Nifty50 was down by 72.20 points to 24,256.75 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icai-review-account-books-gensol-engineering-fraud-blusmart-jaggi-brothers-2713784-2025-04-24",
      "headline": "ICAI to examine books of crisis-hit Gensol Engineering and BluSmartGensol Engineering and BluSmart are currently facing scrutiny after serious questions were raised about their financial dealings and governance practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-what-to-expect-from-sensex-nifty-april-24-dalal-street-rally-nse-bse-gift-city-2713764-2025-04-24",
      "headline": "Stock market opening: Sensex, Nifty to extend gains beyond 80,000?Sensex, Nifty expectation: Gift Nifty futures were trading at 24,415.5 at 8:01 am, up 0.3% from Wednesday's Nifty50 close of 24,328.95, signalling a higher opening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-24-trading-nse-bse-sensex-nifty-2713756-2025-04-24",
      "headline": "Stocks to watch on April 24: HUL, Nestle, SBI Life, Axis Bank, Adani GreenShares of HUL, Axis Bank, Tech Mahindra, Nestle, Persistent Systems and SBI Life Insurance Company will be closely watched today as the companies are set to announce their fourth quarter earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/luxury-items-rs-10-lakh-tax-collected-at-source-1-percent-from-april-22-cbdt-new-rules-2713583-2025-04-23",
      "headline": "From watches to antiques, these luxury goods above Rs 10 lakh face 1% TCSThe Central Board of Direct Taxes (CBDT) has issued fresh guidelines to enforce the levy, which aims to plug tax leaks and boost visibility on big-ticket purchases."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-breaks-silence-on-trolling-after-split-with-saira-banu-2713870-2025-04-24",
      "headline": "AR Rahman breaks silence on trolling after split: Even God gets reviewed, who am I?Singer and music composer AR Rahman finally broke his silence surrounding the online trolling following his separation announcement with wife Saira Banu. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-fan-from-kerala-pitches-film-script-at-hit-3-kerala-event-viral-video-2713856-2025-04-24",
      "headline": "Nani's fan pitches film script at event, actor's encouraging gesture wins heartAn ardent fan of Telugu actor Nani from Kerala pitched a film script to him at the Kochi event of his upcoming film, 'HIT 3'. The actor promised to read his synopsis and encouraged him to pursue cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-14-detailed-report-will-sunny-deol-film-reach-rs-100-crore-in-3rd-weekend-2713838-2025-04-24",
      "headline": "Jaat box office Day 14: Will Sunny Deol's film reach Rs 100 crore in 3rd weekend?With 'Phule' and 'Ground Zero' hitting the screens this weekend, Sunny Deol's 'Jaat' will be looking at slowly but eventually surpassing the benchmark of Rs 100 crore at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-kaiju-no-8-a-must-watch-2713683-2025-04-24",
      "headline": "Monster mayhem meets midlife-crisis and comedy: Why Kaiju No 8 is not to be missedKaiju No 8 follows Kafka Hibino, a 32-year-old who aspires to join the Defence Force to fight Kaijus alongside his friend Mina, despite repeated failures. Watch the anime for its relatable protagonist, stylish action and seamless comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lyricist-manoj-muntashirs-strong-video-message-to-pm-modi-after-terror-attack-2713828-2025-04-24",
      "headline": "Lyricist Manoj Muntashir's strong video message to PM Modi after terror attackLyricist Manoj Muntashir shared a video message to PM Modi while condemning the Pahalgam terror attack. He demanded strong action from the government in response to the brutality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/firefly-review-a-light-hearted-film-depicting-the-complexities-of-depression-nivedhitha-shiva-rajkumar-2713796-2025-04-24",
      "headline": "Firefly review: A light-hearted Kannada film depicting complexities of depressionReleased-Thu Apr 24, 2025Firefly movie review: This Kannada film is a quirky depiction of the various stages of depression, written and directed by Vamshi Krishna, who also stars as the lead in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-stars-hania-amir-mawra-hocane-break-silence-on-pahalgam-attack-echo-united-stand-against-terrorism-2713798-2025-04-24",
      "headline": "Fawad Khan, other Pakistani actors condemn Pahalgam attack, unite against terrorismPopular Pakistani actors like Mawra Hocane, Hania Amir and Fawad Khan, among others, expressed their anger and frustration at the Pahalgam attack, which claimed 26 innocent Indian lives. They shared posts on social media, highlighting that terrorism deserves a united fight beyond borders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-family-wedding-sneha-arha-new-look-2713806-2025-04-24",
      "headline": "Allu Arjun attends family wedding with wife Sneha and daughter Arha. Pics, videoAllu Arjun sported his latest look at a family wedding in Hyderabad on Thursday. He was accompanied by wife Sneha Reddy and daughter, Allu Arha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rohit-shetty-confirms-ranveer-singh-simmba-akshay-kumar-sooryavanshi-sequels-2713795-2025-04-24",
      "headline": "Rohit Shetty confirms Simmba, Sooryavanshi sequelsFilmmaker Rohit Shetty recently confirmed that both Ranveer Singh's 'Simmba' and Akshay Kumar's 'Sooryavanshi' will have sequels. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-imtiaz-ali-daughters-aaliya-kashyap-ida-ali-were-in-pahalgam-before-terror-attack-2713776-2025-04-24",
      "headline": "Anurag Kashyap, Imtiaz Ali's daughters were in Pahalgam before terror attackAnurag Kashyap and Imtiaz Ali's daughters, Aaliyah and Ida were in Pahalgam, two days before the terror attack that took the lives of 26 people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-6-detailed-report-akshay-kumar-film-nears-rs-50-crore-before-2nd-weekend-2713774-2025-04-24",
      "headline": "Kesari 2 box office Day 6: Akshay Kumar's film nears Rs 50 crore before 2nd weekendWhile Akshay Kumar's 'Kesari Chapter 2' has kept a decent face at the box office so far, it will be challenged by new releases in theatres from this weekend. There's also 'Jaat', which has not gone out of the race yet. Will 'Kesari 2' be able to rise amid chaos at the ticket window and find its way ahead?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ridhi-dogra-abir-gulaal-actor-pahalgam-attack-good-muslims-rejected-attack-2713768-2025-04-24",
      "headline": "Terror coming from one place, ruining faith: Actor Ridhi Dogra on Pahalgam attackActor Ridhi Dogra, whose film 'Abir Gulaal' has been halted due to collaboration with Pakistani actor Fawad Khan, reacted to the Pahalgam terror attack. She wrote that terror is coming from one place, ruining faith and humanity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fawad-khan-condemns-pahalgam-terror-attack-abir-gulaal-ban-by-film-federation-2713749-2025-04-24",
      "headline": "Fawad Khan condemns Pahalgam attack amid Abir Gulaal ban by film federationActor Fawad Khan condemned the Pahalgam terror attack after the Federation of Western India Cine Employees (FWICE) announced a blanket ban on Pakistani artists. His film, 'Abir Gulaal', which was slated for release on May 9, has now been banned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shawn-mendes-spotted-with-portuguese-singer-maro-romance-or-music-collab-glbs-2713742-2025-04-24",
      "headline": "Shawn Mendes spotted with Portuguese singer MARO — Romance or music collab?Shawn Mendes and Portuguese artist MARO were seen enjoying a relaxed coffee date in Los Angeles, sparking rumors of romance or a possible collaboration as fans speculate about their easy chemistry and shared vibe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meet-the-new-haymitch-zada-and-peak-join-hunger-games-prequel-cast-glbs-2713739-2025-04-24",
      "headline": "Meet the New Haymitch: Zada and Peak join Hunger Games prequel castJoseph Zada and Whitney Peak will star in Hunger Games: Sunrise on the Reaping, a 2026 prequel exploring young Haymitch Abernathy's past during the 50th Games, directed by franchise veteran Francis Lawrence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/harvey-weinstein-back-in-court-for-rape-retrial-faces-new-charges-from-former-model-glbs-2713733-2025-04-24",
      "headline": "Harvey Weinstein back in court for rape retrial, faces new charges from former modelHarvey Weinstein's retrial began in New York with new and existing sexual assault allegations, including claims from Kaja Sokola. Prosecutors say Weinstein exploited power; his defense argues encounters were consensual.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/2025-american-music-awards-full-list-of-nominees-host-and-how-to-watch-glbs-2713714-2025-04-24",
      "headline": "2025 American Music Awards: Full List of nominees, host, and how to watchKendrick Lamar leads the 2025 American Music Awards with 10 nominations. Jennifer Lopez returns as host for the May 26 Las Vegas event, with Billie Eilish and Chappell Roan earning seven nods each.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/carlos-santana-postpones-san-antonio-concert-after-health-scare-tour-continues-glbs-2713713-2025-04-24",
      "headline": "Carlos Santana Postpones San Antonio Concert After Health Scare, Tour ContinuesCarlos Santana postponed his San Antonio concert after suffering dehydration before the show. The 76-year-old is recovering, with tour dates continuing as scheduled and a rescheduled date for San Antonio to be announced.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/film-federation-to-not-allow-fawad-khan-abir-gulaal-india-release-2713673-2025-04-23",
      "headline": "Will ensure Fawad Khan's Abir Gulaal isn't released in India: Film FederationIn response to the Pahalgam terror attack, FWICE has imposed a ban on Pakistani artistes, and is working to block the release of Abir Gulaal, a film featuring Fawad Khan in India."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-visuals-capture-moment-terrorists-fired-ak-47s-at-tourists-2713848-2025-04-24",
      "headline": "Disturbing video of Pahalgam horror, terrorists round up tourists, shoot themIn the video, an individual can be seen capturing the exact moment when the terrorists surrounded the unsuspecting tourists and began firing at them. While the sounds of gunshots and the screams of tourists can be heard in the background, alarming shots of bodies lying around can also be seen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udhampur-gunfight-encounter-jammu-and-kashmir-security-forces-contact-hiding-terrorists-pahalgam-terror-attack-2713810-2025-04-24",
      "headline": "Soldier killed in gunfight with terrorists in Udhampur 2 days after Pahalgam attackA soldier was killed on Thursday after security forces established contact with terrorists hiding in Jammu and Kashmir's Udhampur district, following which a gunfight broke out, according to the Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-indus-waters-treaty-pakistan-impact-what-it-means-pahalgam-terror-attack-2713827-2025-04-24",
      "headline": "Can India turn off Indus tap and leave Pakistan high and dry?The suspension of the Indus Waters Treaty by India is more of a pressure tactic on Pakistan to force it to rein in terror groups and stop infiltration. Here is why India can't stop Indus waters to Pakistan overnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/naxals-india-biggest-anti-naxal-operation-three-states-chhattisgarh-maharashtra-telangana-killed-surrounded-2713840-2025-04-24",
      "headline": "20,000 troops surround 1,000 Naxals in major op in Chhattisgarh: SourcesThe massive crackdown comes as Union Home Minister Amit Shah set a deadline of March 31, 2026, to eliminate naxalism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pahalgam-terror-attack-normalcy-and-cross-border-terror-cannot-co-exist-2713826-2025-04-24",
      "headline": "The message of Pahalgam: 'Normalcy' and cross-border terror cannot co-existDespite talk of 'normalcy', Kashmir remains trapped in cycles of terror and fear. A fresh civilian massacre reminds us that true peace in the Valley still feels painfully out of reach. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-pakistani-leaves-india-after-attari-border-closure-says-this-is-wrong-had-45-day-visa-2713825-2025-04-24",
      "headline": "This is wrong, had 45-day visa: Pakistani leaves India after Attari border closureWhen asked about the suspected Pakistani involvement in the Pahalgam attack, the man declined to draw conclusions. \"Nobody can tell who orchestrated the attack,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-professor-recounts-terror-attack-moment-terrorist-encounter-pahalgam-exclusive-2713720-2025-04-24",
      "headline": "I began reciting Kalma: Assam man recalls encounter with terrorist in PahalgamDebasish Bhattacharyya, who was in Pahalgam with his family when a group of tourists were attacked on April 22, said a terrorist approached him during the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pauses-indus-waters-treaty-what-next-for-pakistan-pahalgam-jammu-kashmir-terrorist-attack-2713762-2025-04-24",
      "headline": "India pauses Indus Waters Treaty: What next for Pakistan?From creating storage on the western rivers - Indus, Jhelum, and Chenab - to stopping the sharing of water flow data, the implications could be disastrous for Pakistan, which is heavily dependent on the Indus River System. Under such circumstances, what options do Pakistan really have? Find out"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-stars-hania-amir-mawra-hocane-break-silence-on-pahalgam-attack-echo-united-stand-against-terrorism-2713798-2025-04-24",
      "headline": "Fawad Khan, other Pakistani actors condemn Pahalgam attack, unite against terrorismPopular Pakistani actors like Mawra Hocane, Hania Amir and Fawad Khan, among others, expressed their anger and frustration at the Pahalgam attack, which claimed 26 innocent Indian lives. They shared posts on social media, highlighting that terrorism deserves a united fight beyond borders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-victims-funeral-centre-to-hold-all-party-meet-brief-leaders-pm-modi-rajnath-singh-amit-shah-2713787-2025-04-24",
      "headline": "Live: Congress to raise J&K security lapse in all-party meet today, say sourcesTerror Attack In Pahalgam Live Updates: The Centre will hold an all-party meeting today and will brief leaders on the Pahalgam terror attack and hear their views. The move comes two days after the Pahalgam attack where terrorists killed at least 26 people, mostly tourists, on Tuesday. Defence Minister Rajnath Singh and Home Minister Amit Shah are expected to brief the leaders, official sources said. Targeting Pakistan following the attack in Pahalgam, India on Wednesday downgraded diplomatic ties with it and announced a raft of measures, including expulsion of Pakistani military attaches, suspension of the Indus Water Treaty of 1960 and immediate shutting down of the Attari land-transit post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-family-escapes-pahalgam-terror-attack-due-to-salty-muton-rogan-josh-delayed-lunch-2713882-2025-04-24",
      "headline": "Kerala family escapes Pahalgam terror attack, thanks to salty mutton rogan joshA Kerala family vacationing in Jammu and Kashmir narrowly avoided a deadly terror attack in Pahalgam after a delayed lunch—prompted by a salty mutton rogan josh—pushed back their travel plans. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-army-identifies-key-terror-launch-pads-across-pok-2713778-2025-04-24",
      "headline": "Army identifies 42 terrorist launch pads across PoK after Pahalgam attack: SourcesAccording to intelligence inputs, 42 terrorist launch pads are active in Pakistan-occupied Kashmir near the LoC. Around 130 terrorists are suspected to be present in these launch pads. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jd-vance-shares-candid-family-moment-at-taj-mahal-best-photo-we-got-2713791-2025-04-24",
      "headline": "Best photo we got: JD Vance shares candid family moment at Taj MahalThe Vances dressed for the sweltering summer weather with effortless charm. JD Vance sported a navy blue blazer over a pale blue shirt and beige trousers, while Usha Vance opted for her signature simple elegance in a striped midi dress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-top-diplomat-saad-ahmad-warraich-summoned-india-pahalgam-terror-attack-persona-non-grata-note-military-leave-2713746-2025-04-24",
      "headline": "India's 'persona non grata' move against Pakistan diplomats after J&K attackIndia's strong diplomatic retaliation following the brutal terrorist attack in Pahalgam, which left 26 people dead, including 25 Indians and one Nepali national, has triggered a political and strategic crisis in Pakistan, exposing its deepening isolation on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-government-official-x-account-blocked-in-india-after-pahalgam-attack-2713819-2025-04-24",
      "headline": "Pakistan government's official X account blocked in India after Pahalgam attackPakistan government's official X account was blocked in India two days after 26 people were killed in a deadly terror attack in Jammu and Kashmir's Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-terrorist-attack-tears-silence-heartbreak-as-bodies-of-26-pahalgam-victims-return-home-2713792-2025-04-24",
      "headline": "Tears, silence, heartbreak as bodies of 26 Pahalgam victims return homeAt least 26 tourists were killed in Kashmir's Pahalgam on Tuesday after the terrorists confirmed their religious identities. Heartbreaking images of tourists' bodies being received by friends and families across India have now emerged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gautam-gambhir-team-india-head-coach-death-threat-via-email-police-cyber-team-efforts-on-track-sender-investigation-kill-you-2713779-2025-04-24",
      "headline": "I kill you: Team India coach Gautam Gambhir receives threat mail from 'ISIS'India head coach and ex-BJP MP Gautam Gambhir received a death threat via email. He has filed a police complaint, and the cyber cell is investigating to trace the sender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saarc-visa-exemption-scheme-suspended-pakistani-nationals-to-depart-48-hours-2713681-2025-04-24",
      "headline": "India suspends visa exemption for Pakistani nationals: What is the scheme?The SAARC Visa Exemption Scheme (SVES) has been suspended by India following the Pahalgam terrorist attack in Jammu and Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-how-horse-ride-delay-saved-17-maharashtra-travellers-from-pahalgam-attack-2713862-2025-04-24",
      "headline": "How horse ride delay saved 17 Maharashtra travellers from Pahalgam terror attackThe group of 17 travellers, which included two families on a sightseeing trip to Kashmir, was just about 1.5 kilometres from the site where terrorists opened fire two days ago, killing 26 people, including 25 Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indus-waters-treaty-on-hold-india-pakistan-diplomatic-offensive-pahalgam-terror-attack-2713676-2025-04-23",
      "headline": "India puts Indus Waters Treaty on hold: What it signifiesIndia has suspended the Indus Waters Treaty following the Pahalgam terror attack, halting the supply of 39 billion cubic meters of water annually from rivers such as the Indus, Jhelum, and Chenab originating from Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-breaks-silence-on-trolling-after-split-with-saira-banu-2713870-2025-04-24",
      "headline": "AR Rahman breaks silence on trolling after split: Even God gets reviewed, who am I?Singer and music composer AR Rahman finally broke his silence surrounding the online trolling following his separation announcement with wife Saira Banu. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fitjee-enforcement-directorate-raids-delhi-noida-gurugram-closure-shut-down-centres-owner-fraud-dk-goel-goyal-ncr-2713777-2025-04-24",
      "headline": "ED raids 8 locations linked to FIITJEE in Delhi-NCR over closure of centresThe shutdown of hundreds of FIITJEE centres affected the academic future of nearly 12,000 students. Meanwhile, the institute's owners allegedly made a profit of around Rs 12 crore, sparking outrage among parents and students alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-will-reduce-tariffs-donald-trump-on-trade-talks-glbs-2713730-2025-04-24",
      "headline": "India will reduce tariffs, says Donald Trump amid ongoing trade talksDonald Trump, ahead of the upcoming trade talks, said he has received confirmation that India plans to reduce tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-plea-family-telephonic-interaction-nia-court-2713741-2025-04-24",
      "headline": "NIA opposes Tahawwur Rana's plea to speak to family, court to decide todayDelhi's Patiala House Court heard arguments from both the National Investigation Agency (NIA) and Tahawwur Rana's legal aid counsel on Wednesday and is expected to pronounce its order on the matter today."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-devdutt-padikkal-key-to-rcbs-comeback-at-home-anil-kumble-2713881-2025-04-24",
      "headline": "Kohli, Padikkal key to RCB's comeback at home: Anil KumbleVirat Kohli and Devdutt Padikkal are key for RCB to make a comeback at their home, said former cricketer Anil Kumble. RCB have played three matches at home and have lost all of them so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-home-form-rajasthan-royals-anil-kumble-2713876-2025-04-24",
      "headline": "RCB need to assess Chinnaswamy pitch to fix home form: KumbleRoyal Challengers Bengaluru need to assess their pitch better if they want to win at their home ground, said former cricketer Anil Kumble. All of RCB's losses this season have come at the M Chinnaswamy Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-piyush-chawla-in-awe-of-mumbai-indians-remarkable-comeback-2713863-2025-04-24",
      "headline": "Mumbai Indians know how to make comeback: Chawla praises MI's sensational runFormer India cricketer turned commentator Piyush Chawla praised Mumbai Indians' for their remarkable comeback in the ongoing Indian Premier League 2025 (IPL 2025). MI have won four matches on the trot after winning just one out of their first five matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-srh-vs-mi-matthew-hayden-on-sunrisers-hyderabad-form-2713836-2025-04-24",
      "headline": "SRH need to stop overthinking and focus on their own game: Matthew Hayden on MI lossIPL 2025, SRH vs MI: After SRH suffered a seven-wicket loss to Mumbai Indians, Matthew Hayden said SunRisers Hyderabad need to stop overthinking and focus on their own game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-rcb-vs-rr-team-news-bengaluru-conditions-2713823-2025-04-24",
      "headline": "RCB vs RR: Bengaluru take on battered Rajasthan in search of first home winRoyal Challengers Bengaluru (RCB) will lock horns with Rajasthan Royals (RR) as they look to win their first home fixture of the Indian Premier League 2025 (IPL 2025) and rise higher on the points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-close-in-on-20th-league-title-after-arsenal-draw-vs-palace-2713814-2025-04-24",
      "headline": "Liverpool close in on 20th league title after Arsenal draw vs PalaceLiverpool are just one point away from winning a record-equalling 20th Premier League title after Mikel Arteta's Arsenal were held to a 2-2 draw by Crystal Palace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-sachin-tendulkar-52-wishes-raina-harbhajan-2713797-2025-04-24",
      "headline": "Sachin Tendulkar turns 52: Yuvraj, Raina lead birthday wishes for India greatHappy Birthday, Sachin Tendulkar: The cricket fraternity took to social media on Thursday to extend birthday wishes to batting great Sachin Tendulkar on his 52nd birthday, April 24, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gautam-gambhir-team-india-head-coach-death-threat-via-email-police-cyber-team-efforts-on-track-sender-investigation-kill-you-2713779-2025-04-24",
      "headline": "I kill you: Team India coach Gautam Gambhir receives threat mail from 'ISIS'India head coach and ex-BJP MP Gautam Gambhir received a death threat via email. He has filed a police complaint, and the cyber cell is investigating to trace the sender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-mumbai-indians-pacer-trent-boult-press-conference-2713775-2025-04-24",
      "headline": "Four consecutive wins were crucial for MI to build some momentum: Trent BoultAfter Mumbai Indians hammered SunRisers Hyderabad by seven wickets for a fourth straight win in IPL 2025, senior pacer Trent Boult was pleased with his team's performance and acknowledged their growing confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajat-patidar-on-chinnaswamy-pitches-and-rcbs-poor-home-run-2713771-2025-04-24",
      "headline": "Tricky Chinnaswamy pitches no excuse for RCB's poor home run: Rajat PatidarRCB skipper Rajat Patidar has claimed that his side won't use the tricky Chinnaswamy pitches as an excuse for their poor home form in IPL 2025. RCB are yet to win a home game this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-on-rohit-sharma-srh-vs-mi-2713767-2025-04-24",
      "headline": "Rohit Sharma makes cricket look easy: Sehwag praises MI star's fiery 70 vs SRHVirender Sehwag praised Rohit Sharma's knock against SRH, saying the way he batted with calm and control made the game look easy. He felt Rohit's form lifts the entire team and helps others perform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/happy-birthday-sachin-tendulkar-52-wishes-raina-harbhajan-2713797-2025-04-24",
      "headline": "Sachin Tendulkar turns 52: Yuvraj, Raina lead birthday wishes for India greatHappy Birthday, Sachin Tendulkar: The cricket fraternity took to social media on Thursday to extend birthday wishes to batting great Sachin Tendulkar on his 52nd birthday, April 24, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gautam-gambhir-team-india-head-coach-death-threat-via-email-police-cyber-team-efforts-on-track-sender-investigation-kill-you-2713779-2025-04-24",
      "headline": "I kill you: Team India coach Gautam Gambhir receives threat mail from 'ISIS'India head coach and ex-BJP MP Gautam Gambhir received a death threat via email. He has filed a police complaint, and the cyber cell is investigating to trace the sender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-mumbai-indians-pacer-trent-boult-press-conference-2713775-2025-04-24",
      "headline": "Four consecutive wins were crucial for MI to build some momentum: Trent BoultAfter Mumbai Indians hammered SunRisers Hyderabad by seven wickets for a fourth straight win in IPL 2025, senior pacer Trent Boult was pleased with his team's performance and acknowledged their growing confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajat-patidar-on-chinnaswamy-pitches-and-rcbs-poor-home-run-2713771-2025-04-24",
      "headline": "Tricky Chinnaswamy pitches no excuse for RCB's poor home run: Rajat PatidarRCB skipper Rajat Patidar has claimed that his side won't use the tricky Chinnaswamy pitches as an excuse for their poor home form in IPL 2025. RCB are yet to win a home game this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-on-rohit-sharma-srh-vs-mi-2713767-2025-04-24",
      "headline": "Rohit Sharma makes cricket look easy: Sehwag praises MI star's fiery 70 vs SRHVirender Sehwag praised Rohit Sharma's knock against SRH, saying the way he batted with calm and control made the game look easy. He felt Rohit's form lifts the entire team and helps others perform."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}