{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-bank-share-price-down-marginally-q2-results-good-time-to-buy-brokerage-target-price-2620335-2024-10-21",
      "headline": "Axis Bank shares dip slightly today after strong Q2 gains. Good time to buy? Despite a strong Q2, analysts are divided on Axis Bank's future prospects. Many brokerages have adjusted their target prices, reflecting a cautious outlook on the bank's near-term growth trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-opens-for-bidding-should-you-subscribe-skip-review-analyst-view-2620334-2024-10-21",
      "headline": "Waaree Energies IPO opens for bidding: Should you subscribe or skip?The Waaree Energies IPO consists of a fresh issue of 2.4 crore shares, amounting to Rs 3,600 crore, along with an offer for sale of 0.48 crore shares, totalling Rs 721.44 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-gains-early-trade-q2-results-what-investors-need-to-know-2620322-2024-10-21",
      "headline": "Wipro shares gain 1% in early trade. What investors need to knowThe stock's rise comes after Wipro posted better-than-expected Q2 results, including a 21.3% year-on-year (YoY) increase in net profit to Rs 3,209 crore and the announcement of a 1:1 bonus issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-serene-production-acquires-50-percent-stake-in-karan-johar-dharma-productions-rs-1000-crore-2620307-2024-10-21",
      "headline": "Adar Poonawalla acquires 50% stake in Karan Johar's Dharma ProductionsThe deal, valued at Rs 1,000 crore, will see Poonawalla's Serene Production acquire a 50% stake in the renowned production house, with Johar retaining the remaining 50%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-lower-dragged-by-fmcg-stocks-hdfc-bank-2620301-2024-10-21",
      "headline": "Sensex, Nifty open marginally lower dragged by FMCG stocks; HDFC Bank up 3%The S&P BSE Sensex was down 70.87 points to 81,153.88, while the NSE Nifty50 lost 58.90 points to 24,795.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/domestic-mutual-funds-boost-paytm-stake-by-1-this-quarter-total-holdings-now-at-8-2620108-2024-10-20",
      "headline": "Domestic mutual funds boost Paytm stake by 1% this quarter, total holdings now at 8%The latest shareholding pattern filed by the company shows a 1% increase in stake by mutual funds as the trust grows on the brand and its ability to bounce back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-betrayal-murder-greed-tore-apart-house-of-gucci-maurizio-tom-ford-2619906-2024-10-20",
      "headline": "Succession Wars: How betrayal, murder and greed tore apart 'House of Gucci'Maurizio Gucci's quest to perfect the family empire ended in four gunshots on March 27, 1995, on the steps of his Milan office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/isha-ambani-is-harpers-bazaar-icon-of-the-year-dedicates-award-to-mother-daughter-2619809-2024-10-19",
      "headline": "Isha Ambani is Harper's Bazaar Icon of the Year, dedicates award to mother, daughterIsha Ambani dedicated the award to her mother, Nita Ambani, the Chairperson of Reliance Foundation. Isha said her mother is her role model who has \"paved the way for me\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-packaged-water-and-bicycles-senior-citizens-health-insurance-2619791-2024-10-19",
      "headline": "Centre recommends reducing GST on packaged water and bicycles below Rs 10,000The Group of Ministers (GoM) to decide on GST on health and life insurance premiums in its meeting on Saturday decided to exempt GST on premiums paid by individuals, other than senior citizens, for health insurance with coverage of up to Rs 5 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vasundhra-oswal-detailed-uganda-india-businessman-oswal-group-2619747-2024-10-19",
      "headline": "Who is Vasundhara Oswal, daughter of Indian billionaire, detained in Uganda?Vasundhara Oswal was reportedly seized by a group of 20 armed men at the family's extra neutral alcohol (ENA) plant. Local officials have connected her arrest to an ongoing investigation into the case of a missing person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-financial-results-net-profit-rises-5-percent-to-rs-16820-crore-2619683-2024-10-19",
      "headline": "HDFC Bank Q2 results: Net profit rises 5% to Rs 16,820 croreHDFC Bank's net interest income (NII), a key measure of profitability, came in at Rs 30,114 crore, reflecting a 10% year-on-year increase, although slightly below the market expectation of Rs 30,306 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-impose-cess-zomato-swiggy-uber-oia-payments-support-gig-workers-bill-passed-december-2619633-2024-10-19",
      "headline": "Karnataka to impose cess on Zomato, Uber, payments to support gig workersKarnataka Labour Minister Santosh Lad said that the charge would be levied only on transport and not on the purchase of products. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/disney-reliance-joint-venture-to-stream-live-sports-ipl-pkl-exclusively-on-hotstar-report-2619309-2024-10-18",
      "headline": "Disney-Reliance venture to stream live sports exclusively on Hotstar: ReportWhile Reliance's JioCinema currently streams IPL cricket, Hotstar holds rights to other prestigious events like the International Cricket Council (ICC) tournaments, the English Premier League, and the Pro Kabaddi League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-withdraws-mismanagement-plea-against-bharatpe-from-nclt-2619292-2024-10-18",
      "headline": "Ashneer Grover withdraws mismanagement plea against BharatPe from NCLTThe plea alleged mismanagement and oppressive conduct by the fintech company's board. The withdrawal of the plea follows a settlement reached between Grover and BharatPe on September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-impose-laptop-import-restrictions-to-boost-local-manufacturing-report-2619238-2024-10-18",
      "headline": "India to impose laptop import restrictions to boost local manufacturing: ReportThe planned restrictions, if enforced, could impact the country's IT hardware market, which is currently valued at between $8 billion and $10 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-close-in-green-as-banking-metal-stocks-lift-market-2619201-2024-10-18",
      "headline": "Sensex, Nifty close in green as banking, metal stocks lift marketThe S&P BSE Sensex added 218.14 points to close at, while the NSE Nifty50 gained 104.20 points to end at 24,854.05."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-3-percent-check-new-salary-arrear-calculations-for-central-govt-employees-pensioners-2619195-2024-10-18",
      "headline": "DA hike by 3%: Check new salary, arrear calculations for employees, pensionersThe DA hike increase is effective from July 1, 2024, and was confirmed during a Cabinet meeting chaired by Prime Minister Narendra Modi on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-rate-shines-bright-in-global-economy-says-ajay-banga-world-bank-president-2619181-2024-10-18",
      "headline": "India's growth rate shines bright in global economy, says Ajay Banga A lot of that growth is in India, is driven by the domestic market as well, which actually is a healthy sign, in some ways, said Ajay Banga, World Bank president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/igl-mgl-shares-plunge-up-to-15-percent-today-heres-why-new-guidelines-ministry-of-petroleum-and-natural-gas-2619141-2024-10-18",
      "headline": "IGL, MGL shares plunge up to 15% today. Here's why MGL's stock plummeted 11%, reaching a low of Rs 1,568.30, while IGL experienced a 10% drop, closing at Rs 453.70 on the Bombay Stock Exchange as of latest update. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/khalistani-terrorist-gurpatwant-pannun-fresh-warning-international-passengers-dont-fly-air-india-2620288-2024-10-21",
      "headline": "Don't fly Air India from November 1-19: Khalistani terrorist Pannun's new threatKhalistani terrorist Gurpatwant Singh Pannun warned of an attack on Air India between November 1 and 19, citing the 40th anniversary of the anti-Sikh riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ganderbal-terror-attack-jammu-and-kashmir-pakistan-trf-lashkar-offshoot-migrants-doctor-killed-2620245-2024-10-21",
      "headline": "Pak-based Lashkar front claims J&K attack that killed doctor, 6 others: SourcesPakistan-based The Resistance Front, LeT's offshoot, carried out the attack in Ganderbal, killing seven people, thereby targeting both Kashmiris and non-Kashmiris for the first time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-on-shooting-bigg-boss-18-amid-death-threats-2620310-2024-10-21",
      "headline": "Salman Khan on shooting Bigg Boss amid death threats: What I'm going through…Salman Khan talked about hosting Bigg Boss 18 amid death threats from gangster Lawrence Bishnoi. He responded seriously to contestants and even received a marriage proposal from Chaahat Pandey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-school-blast-crpf-school-police-fir-explosives-nature-investigation-wall-hole-2620276-2024-10-21",
      "headline": "Blast created hole in Delhi school wall, nature of explosives under probe: ReportThe explosion outside a CRPF school in Delhi on Sunday created a large hole in the school wall due to its impact and the nature of explosives used in the blast was under investigation, as per an FIR filed over the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-says-spacex-was-forced-to-kindnap-seals-experiment-on-them-2620325-2024-10-21",
      "headline": "SpaceX was forced to kidnap seals, experiment on them: Elon MuskThe experiment, which Musk insists actually took place, was reportedly conducted to address concerns about the effect of sonic booms from rocket launches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australian-senator-lidia-thorpe-king-charles-parliament-great-hall-canberra-visit-anti-colonial-slogans-2620338-2024-10-21",
      "headline": "Not my king: Australian senator heckles King Charles at parliament, escorted outKing Charles, on a visit to Australia, was heckled by Indigenous Australian senator Lidia Thorpe, who shouted anti-colonial slogans in the parliament. Thorpe is known to be a fierce opponent of monarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-serene-production-acquires-50-percent-stake-in-karan-johar-dharma-productions-rs-1000-crore-2620307-2024-10-21",
      "headline": "Adar Poonawalla acquires 50% stake in Karan Johar's Dharma ProductionsThe deal, valued at Rs 1,000 crore, will see Poonawalla's Serene Production acquire a 50% stake in the renowned production house, with Johar retaining the remaining 50%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-zealand-dunedin-airport-south-island-hugging-three-minute-rule-2620331-2024-10-21",
      "headline": "Inhumane: New Zealand airport slammed over 3-minute time limit for farewell hugsHugging your loved ones could get you in trouble at a New Zealand airport, where a time limit has been imposed on emotional farewells."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/will-starliner-the-boeing-spacecraft-that-took-sunita-williams-to-space-fly-again-2620337-2024-10-21",
      "headline": "Will the Sunita Williams piloted Starliner ever fly again?Nasa has confirmed that it will continue with SpaceX's Dragon spacecraft to ferry astronauts and cargo to space through 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-abdul-samad-twin-hundreds-jammu-and-kashmir-vs-odisha-2620328-2024-10-21",
      "headline": "Abdul Samad scripts history for Jammu & Kashmir with twin hundredsRanji Trophy 2024-25: 22-year-old Abdul Samad became the first Jammu and Kashmir batter to hit two hundreds in the same Ranji Trophy match. Samad's heroics has put J & K in a strong position against Odisha in their second-round match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-daughter-slams-people-trying-to-make-reel-at-grandmother-funeral-2620321-2024-10-21",
      "headline": "Kichcha Sudeep's daughter slams people trying to make reel at grandmother's funeralKannada actor Kichcha Sudeep lost his mother on Sunday, October 20, due to age-related issues. Later, his daughter shared a note, criticising people for not letting the family give a proper funeral to her beloved grandmother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-police-telegram-app-pro-khalistan-group-claim-crpf-school-blast-rohini-2620244-2024-10-21",
      "headline": "Delhi Police writes to Telegram app after pro-Khalistan group claims school blastDelhi Bomb Blast: A loud explosion occurred near a CRPF school in New Delhi's Rohini on Sunday, prompting an intense security exercise and investigation by multiple teams, including the National Investigation Agency and National Security Guards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yahya-israel-sinwar-house-video-footage-tunnel-hamas-leader-killed-gaza-israel-palestine-attack-2620239-2024-10-21",
      "headline": "Cash, personal shower, UN ration supplies: Inside Yahya Sinwar's bunker in GazaAccording to a video released by Israel, the bunker where Yahya Sinwar stayed was fully stocked with UN food supplies, substantial amounts of cash, perfume, and various personal facilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-cheteshwar-pujara-overtakes-brian-lara-most-first-class-hundreds-2620324-2024-10-21",
      "headline": "Pujara overtakes Brian Lara in list of First Class hundredsVeteran India batter Cheteshwar Pujara has overtaken Brian Lara in the list of most first class hundreds. Pujara, while batting in the Ranji Trophy, hit his 66th FC hundred on Monday, 21 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/after-ratan-tata-in-noel-the-tatas-trust-2620114-2024-10-20",
      "headline": "After Ratan Tata, in Noel the Tatas trustObservers say Noel Tata's unanimous appointment as chairman of Tata Trusts signals continuity at the country's oldest philanthropic institution"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-weather-update-schools-anganwadis-closed-more-rain-predicted-over-next-two-days-2620249-2024-10-21",
      "headline": "Bengaluru rain: Weather body issues orange alert, schools closed Schools in Bengaluru are shut today and private offices have asked its employees to work from home after the weather department issued an orange alert amid intermittent rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-kumar-verma-high-commissioner-canada-india-ties-justin-trudeau-hardeep-nijjar-khalistan-2620158-2024-10-20",
      "headline": "Justin Trudeau made sure ties with India go downward: Outgoing Indian envoyIn an interview with Canada's private broadcaster CTV, Sanjay Kumar Verma, the outgoing Indian High Commissioner to Ottawa, said Justin Trudeau has made sure that the bilateral relations with India \"only go downwards, spiralling down\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-on-guitar-new-zealand-womens-t20-world-cup-win-maori-song-2620257-2024-10-21",
      "headline": "Watch: Amelia Kerr on guitar, NZ stars celebrate World Cup win with songAmelia Kerr and the entire New Zealand women's cricket team came together to celebrate their maiden T20 World Cup victory with a stunning Maori song. ICC posted the video of the 'pitch perfect' tribute where player of the match Kerr was seen on the guitar.pitch-perfect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-nails-classic-surf-rock-tune-in-viral-video-internet-says-auntiji-rocks-2620340-2024-10-21",
      "headline": "Woman nails classic surf rock tune in viral video. Internet says 'Auntiji rocks'A video of a woman, dressed in a traditional salwar suit with a pallu, playing a classic surf rock tune on a guitar has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-naim-qassem-flees-lebanon-beirut-iran-tehran-israel-attack-2620275-2024-10-21",
      "headline": "Hezbollah deputy Naim Qassem flees to Iran fearing assassination bid: ReportA report in UAE-based Erem News quoted an Iranian source as saying that Naim Qassem left Beirut on October 5 in an aircraft used by Iran's Foreign Minister Abbas Araghchi for a state visit to Lebanon and Syria."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-stevie-wonder-happy-birthday-rendition-georgia-black-churches-campaign-trail-donald-trump-2620226-2024-10-21",
      "headline": "Kamala Harris celebrates 60th birthday, grooves to singer Stevie Wonder's tunesLegendary singer Stevie Wonder sang a few lines of Bob Marley's 'Redemption Song' and then led a crowd of churchgoers in Georgia singing 'Happy Birthday' to Vice President Kamala Harris on her 60th birthday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-smog-fog-aqi-very-poor-stubble-burning-diwali-2620255-2024-10-21",
      "headline": "Delhi's air quality worsens to 'very poor', thick layer of fog engulfs cityDelhi Air Pollution: The Air Quality Index of Delhi worsened to 'very poor' category, as an AQI of 307 was recorded on Monday morning, just a week ahead of Diwali. One of the major factors for the declining air quality in Delhi is stubble burning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/prince-narula-and-wife-yuvika-chaudhary-welcome-baby-girl-2620352-2024-10-21",
      "headline": "Prince Narula, wife Yuvika Chaudhary welcome baby girlIndian television's beloved couple, Prince Narula and Yuvika Chaudhary, were recently blessed with a baby girl. The pair welcomed the baby on Saturday evening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bagheera-trailer-prashanth-neels-take-on-a-vigilante-superhero-is-promising-sriimurali-2620344-2024-10-21",
      "headline": "Bagheera trailer: Prashanth Neel's take on a vigilante superhero is promising The trailer of the upcoming Kannada film, Bagheera, has arrived. It promises a gritty, action-packed spectacle, showcasing Sriimurali in a vigilante superhero avatar, crafted by the mastermind behind KGF and Salaar, Prashanth Neel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/riddhima-kapoor-sahni-on-her-bollywood-debut-plans-we-will-see-exclusive-2620356-2024-10-21",
      "headline": "Riddhima Kapoor on her Bollywood debut plans: We'll see | ExclusiveRanbir Kapoor's sister Riddhima Kapoor Sahni discussed her Netflix debut in Fabulous Lives Vs Bollywood Wives and hinted at a potential Bollywood career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/director-vasan-bala-says-jigra-box-office-was-his-responsibility-alia-bhatt-trusted-me-2620345-2024-10-21",
      "headline": "Director Vasan Bala says Jigra box office was his responsibility: Alia trusted meJigra director Vasan Bala opened up on the box office failure of Jigra once again. In an interview, he said the box office performance of the film was \"his responsibility\". "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-us-grand-prix-results-charles-leclerc-carlos-sainz-ferrari-one-two-austin-texas-2620357-2024-10-21",
      "headline": "Charles Leclerc wins US GP as Ferrari complete fantastic 1-2Charles Leclerc and Carlos Sainz secured a commanding 1-2 finish for Ferrari at the U.S. Grand Prix, while a tense battle between Max Verstappen and Lando Norris was decided by a contentious penalty on October 20, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-abdul-samad-twin-hundreds-jammu-and-kashmir-vs-odisha-2620328-2024-10-21",
      "headline": "Abdul Samad scripts history for Jammu & Kashmir with twin hundredsRanji Trophy 2024-25: 22-year-old Abdul Samad became the first Jammu and Kashmir batter to hit two hundreds in the same Ranji Trophy match. Samad's heroics has put J & K in a strong position against Odisha in their second-round match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-cheteshwar-pujara-overtakes-brian-lara-most-first-class-hundreds-2620324-2024-10-21",
      "headline": "Pujara overtakes Brian Lara in list of First Class hundredsVeteran India batter Cheteshwar Pujara has overtaken Brian Lara in the list of most first class hundreds. Pujara, while batting in the Ranji Trophy, hit his 66th FC hundred on Monday, 21 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-need-to-get-out-of-their-slump-gary-neville-explains-2620311-2024-10-21",
      "headline": "What do Man United need to get out of their slump? Gary Neville explainsFormer Manchester United defender Gary Neville believes that the current team can come out of its slump only if it stays together. Neville believes that the October break will help the side regroup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-300-test-wickets-fastest-south-africa-bangladesh-tour-2620306-2024-10-21",
      "headline": "Kagiso Rabada becomes 3rd fastest South African to take 300 Test wicketsBangladesh vs South Africa: Kagiso Rabada became the third-fastest South African bowler to take 300 wickets in Test cricket. He achieved the milestone on Day 1 of their first Test in Dhaka on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-amelia-kerr-primary-school-writing-new-zealand-suzie-bates-sophie-devine-2620282-2024-10-21",
      "headline": "Amelia Kerr recalls primary school essay after New Zealand's World Cup triumphT20 World Cup 2024: All-rounder Amelia Kerr said it was a dream for her to win the World Cup with legendary Suzie Bates and Sophie Devine. The 24-year-old star won the Player of the Tournament award for her all-round efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-south-africa-final-sophie-devine-suzie-bates-grandmas-2620201-2024-10-21",
      "headline": "'Grandmas' show the way for New Zealand in epic underdog storyWomen's T20 World Cup: New Zealand went into the tournament with 10 losses on the trot, but Sophie Devine and Co. raised their game just when it mattered the most. In the final, the White Ferns beat South Africa by 32 runs at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-vs-akash-deep-should-india-rest-hyderabad-pacer-in-pune-test-2620261-2024-10-21",
      "headline": "Siraj vs Akash Deep: Should India rest Hyderabad pacer in Pune TestMohammed Siraj failed to impress with the new ball against New Zealand in the Bengaluru Test. The pacer was not able to pick a single wicket with the new ball on Day 5 of the Test match. Should the pacer be dropped for the Pune Test match to draft in Akash Deep?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-on-guitar-new-zealand-womens-t20-world-cup-win-maori-song-2620257-2024-10-21",
      "headline": "Watch: Amelia Kerr on guitar, NZ stars celebrate World Cup win with songAmelia Kerr and the entire New Zealand women's cricket team came together to celebrate their maiden T20 World Cup victory with a stunning Maori song. ICC posted the video of the 'pitch perfect' tribute where player of the match Kerr was seen on the guitar.pitch-perfect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-players-in-tears-as-nations-heartbreak-womens-t20-world-cup-final-2620241-2024-10-21",
      "headline": "Players in tears as South Africa's heartbreak continues in World Cup FinalSouth Africa women's team were in tears as they lost their second straight Women's T20 World Cup final. The Laura Wolvaardt team was not able to chase down 159 runs in the final against NZ on Sunday, October 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-south-africa-final-sophie-devine-suzie-bates-grandmas-2620201-2024-10-21",
      "headline": "'Grandmas' show the way for New Zealand in epic underdog storyWomen's T20 World Cup: New Zealand went into the tournament with 10 losses on the trot, but Sophie Devine and Co. raised their game just when it mattered the most. In the final, the White Ferns beat South Africa by 32 runs at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-vs-akash-deep-should-india-rest-hyderabad-pacer-in-pune-test-2620261-2024-10-21",
      "headline": "Siraj vs Akash Deep: Should India rest Hyderabad pacer in Pune TestMohammed Siraj failed to impress with the new ball against New Zealand in the Bengaluru Test. The pacer was not able to pick a single wicket with the new ball on Day 5 of the Test match. Should the pacer be dropped for the Pune Test match to draft in Akash Deep?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-on-guitar-new-zealand-womens-t20-world-cup-win-maori-song-2620257-2024-10-21",
      "headline": "Watch: Amelia Kerr on guitar, NZ stars celebrate World Cup win with songAmelia Kerr and the entire New Zealand women's cricket team came together to celebrate their maiden T20 World Cup victory with a stunning Maori song. ICC posted the video of the 'pitch perfect' tribute where player of the match Kerr was seen on the guitar.pitch-perfect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-players-in-tears-as-nations-heartbreak-womens-t20-world-cup-final-2620241-2024-10-21",
      "headline": "Players in tears as South Africa's heartbreak continues in World Cup FinalSouth Africa women's team were in tears as they lost their second straight Women's T20 World Cup final. The Laura Wolvaardt team was not able to chase down 159 runs in the final against NZ on Sunday, October 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lewandowski-pablo-torre-help-barcelona-thrash-sevilla-5-1-in-on-gavis-return-2620225-2024-10-21",
      "headline": "LaLiga: Barcelona thrash Sevilla 5-1 in on Gavi's returnFC Barcelona thrashed Sevilla 5-1 in the LaLiga restart. The team would take a lot of confidence from the win going into a tough week where they face Bayern Munich and Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-amelia-kerr-greatness-feature-final-2620209-2024-10-21",
      "headline": "Spunky and audacious, Amelia Kerr is destined for greatness. Period Women's T20 World Cup: Amelia Kerr played a massive role for New Zealand in claiming the title for the first time. The 24-year-old picked up 15 wickets and scored 135 runs from six games to torment oppositions in the multi-nation event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-jasprit-bumrah-mohammed-siraj-akash-deep-mohammed-shami-2620171-2024-10-21",
      "headline": "IND vs NZ: How Bengaluru Test loss has hampered India's Jasprit Bumrah planThe loss in the first Test against India in Bengaluru has put India in a precarious position as they're now in a dilemma whether to rest pace spearhead Jasprit Bumrah or not."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-west-indies-first-odi-charith-asalanka-half-century-sherfane-rutherford-pallekele-2620203-2024-10-21",
      "headline": "Asalanka's 77 guides Sri Lanka to 5 wickets win over West IndiesSri Lanka captain Charith Asalanka's 77-run knock and a 137-run partnership with debutant Nishan Madushka powered Sri Lanka to a 5-wicket win over West Indies in the first ODI, chasing a DLS-adjusted target of 232 at Pallekele."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-win-bengaluru-womens-t20-world-cup-win-special-sunday-2620195-2024-10-20",
      "headline": "Historic Test win, T20 World Cup win: New Zealand's special SundayNew Zealand cricket fans enjoyed a historic Sunday on October 20, as both the men's and women's teams clinched major victories. The men's side defeated India in Bengaluru, while the women's team lifted their maiden T20 World Cup trophy in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-vs-chelsea-mohammed-salah-goal-assist-nicholash-jackson-anfield-2620190-2024-10-20",
      "headline": "Salah stars as Liverpool thump Chelsea for a 2-1 win at AnfieldLiverpool regained the Premier League top spot with a solid 2-1 win over Chelsea at Anfield, thanks to a composed penalty from Mohamed Salah and a brilliant Curtis Jones finish, securing yet another home victory for the in-form Reds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ind-vs-nz-bengaluru-pune-rohit-sharma-2620183-2024-10-20",
      "headline": "Watch: Masked Virat Kohli leaves Bengaluru in disguise after first Test Star India batter Virat Kohli was seen leaving Bengaluru in disguise after India's loss in the first Test against New Zealand by eight wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-champions-south-africa-final-dubai-report-2620180-2024-10-20",
      "headline": "Kerr heroics power New Zealand to maiden Women's T20 World Cup title Women's T20 World Cup 2024: Sophie Devine's New Zealand clinched their maiden Women's T20 World Cup after beating South Africa by 32 runs in the final. Amelia Kerr was the star for them in the summit with 43 runs and three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-win-bengaluru-womens-t20-world-cup-win-special-sunday-2620195-2024-10-20",
      "headline": "Historic Test win, T20 World Cup win: New Zealand's special SundayNew Zealand cricket fans enjoyed a historic Sunday on October 20, as both the men's and women's teams clinched major victories. The men's side defeated India in Bengaluru, while the women's team lifted their maiden T20 World Cup trophy in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-vs-chelsea-mohammed-salah-goal-assist-nicholash-jackson-anfield-2620190-2024-10-20",
      "headline": "Salah stars as Liverpool thump Chelsea for a 2-1 win at AnfieldLiverpool regained the Premier League top spot with a solid 2-1 win over Chelsea at Anfield, thanks to a composed penalty from Mohamed Salah and a brilliant Curtis Jones finish, securing yet another home victory for the in-form Reds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ind-vs-nz-bengaluru-pune-rohit-sharma-2620183-2024-10-20",
      "headline": "Watch: Masked Virat Kohli leaves Bengaluru in disguise after first Test Star India batter Virat Kohli was seen leaving Bengaluru in disguise after India's loss in the first Test against New Zealand by eight wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-champions-south-africa-final-dubai-report-2620180-2024-10-20",
      "headline": "Kerr heroics power New Zealand to maiden Women's T20 World Cup title Women's T20 World Cup 2024: Sophie Devine's New Zealand clinched their maiden Women's T20 World Cup after beating South Africa by 32 runs in the final. Amelia Kerr was the star for them in the summit with 43 runs and three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-cryptic-instagram-story-bengaluru-test-loss-god-show-people-2620169-2024-10-20",
      "headline": "Pant's cryptic post after Bengaluru Test defeat: Let God show peopleRishabh Pant shared a cryptic Instagram post following India's defeat in the Bengaluru Test, hinting at a focused mindset and determination to help the team bounce back in the upcoming second Test against New Zealand in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-2620164-2024-10-20",
      "headline": "Aiden Markram ready for Bangladesh 'spin challenge' in Mirpur TestBAN vs SA: Aiden Markram said that South Africa have the resources to counter Bangladesh's spin attack in the opening Test, starting October 21 at the Sher-e-Bangla National Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-wolverhampton-wanderers-vs-manchester-city-john-stones-josko-gvardiol-comeback-2620156-2024-10-20",
      "headline": "John Stones gives stoppage-time 2-1 win to Manchester City over WolvesManchester City snatched a thrilling 2-1 victory over Wolverhampton Wanderers, thanks to John Stones' stoppage-time header. The comeback, led by Stones and Josko Gvardiol, secured City's temporary return to the top of the Premier League table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-1st-test-mirpur-live-streaming-2620151-2024-10-20",
      "headline": "Bangladesh vs South Africa: When and where to watch 1st Test? BAN vs SA: Najmul Hossain Shanto's Bangladesh will lock horns with South Africa in the opening Test, starting October 21 at the Sher-e-Bangla National Stadium in Mirpur. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}