{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-deal-done-to-acquire-iphone-plant-tamil-nadu-pegatron-2635175-2024-11-18",
      "headline": "Tata seals deal to acquire 60% of Pegatron's Tamil Nadu iPhone plant: ReportUnder the agreement, Tata will hold a 60% stake in the plant and oversee daily operations, while Pegatron will retain the remaining 40% and provide technical support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/telangana-government-announces-100-percent-tax-exemption-for-electric-vehicles-ev-2635158-2024-11-18",
      "headline": "Telangana government announces 100% tax exemption for electric vehiclesThe Telangana government's initiative is a part of its broader electric vehicle policy aimed at creating an eco-friendly transport system while reducing pollution levels in Hyderabad and other urban centres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-india-to-move-bengaluru-headquarters-new-office-near-airport-to-cut-costs-report-2635151-2024-11-18",
      "headline": "Amazon India to move Bengaluru headquarters to cut costs: ReportThe relocation is aimed at reducing costs and will involve vacating 500,000 square feet of office space across 18 floors at the WTC, which is owned by Brigade Enterprises Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-tells-india-recruiters-not-to-ask-for-marital-status-in-iphone-job-ads-2635148-2024-11-18",
      "headline": "Foxconn tells India recruiters not to ask for marital status in iPhone job adsFoxconn, which employs thousands of women at the iPhone factory at Sriperumbudur, near Chennai, outsources recruitment of assembly-line workers to third-party vendors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-correction-selloff-smallcap-and-midcap-shares-brokerages-fpi-selling-impact-2635116-2024-11-18",
      "headline": "Stock market correction: How bad is the selloff in smallcap and midcap space?Stock Market Correction: Despite aggressive selling by foreign portfolio investors (FPIs) in Indian equities, ICICI Securities recently noted that small-cap and mid-cap indices have shown relative resilience compared to the Nifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-are-falling-in-india-but-rising-globally-explained-3-reasons-why-2635081-2024-11-18",
      "headline": "Gold prices are falling in India but rising globally. 3 reasons whyGold prices have seen a decline, bringing prices closer to lows recorded in September. Globally, however, gold prices have edged higher due to geopolitical and economic factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-bloodbath-on-dalal-street-four-things-to-know-2635058-2024-11-18",
      "headline": "Sensex, Nifty fall as market bloodbath continues. 4 things investors should knowStock market correction: Sensex and Nifty have entered a correction zone, marked by a drop of more than 10% from their recent highs. The sell-off has rattled retail investors, many of whom are now asking a pressing question: Has the market bottomed out, or is there more pain ahead?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/honasa-consumer-share-price-mamaearth-crashes-20-percent-today-brokerage-downgrades-2635034-2024-11-18",
      "headline": "Explained: Why Honasa Consumer share price crashed 20% todayHonasa Consumer share price: The sharp drop came after Mamaearth's parent company released its Q2FY25 earnings report, which revealed weaker-than-expected performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-fall-further-as-demand-weakens-check-latest-rates-2635027-2024-11-18",
      "headline": "Gold prices fall further as demand weakens. Check latest rates Gold prices in India have fallen as the precious metal has seen a decline in November as demand for gold weakens globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-18-2024-precious-metals-record-hike-on-mcx-2635019-2024-11-18",
      "headline": "Gold, silver price today, November 18, 2024: Precious metals record hike on MCXGold Price Today November 18, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-down-400-points-nifty-in-red-dragged-by-decline-in-it-energy-stocks-2635000-2024-11-18",
      "headline": "Sensex, Nifty open in red dragged by decline in IT stocks; RIL shares down 1%The S&P BSE Sensex was down 420.71 points to 77,159.60, while the NSE Nifty50 lost 132.50 points to 23,400.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mrf-shares-last-chance-final-day-buy-dividend-eligibility-ahead-of-ex-dividend-date-2634996-2024-11-18",
      "headline": "Final day to buy MRF shares for dividend eligibility ahead of ex-dividend dateThe board of MRF, in its recent meeting, announced the interim dividend while also releasing its financial results for the second quarter that ended on September 30, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trading-setup-for-today-what-to-expect-from-stock-markets-expert-review-sensex-nifty-2634975-2024-11-18",
      "headline": "Trading setup for today: What to expect from the stock markets? Last week marked the second consecutive week of losses, as both the Sensex and Nifty declined by nearly 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-ola-electric-adani-green-hero-motocorp-stocks-to-watch-today-sensex-nifty-2634965-2024-11-18",
      "headline": "RIL, Ola Electric, Adani Green, Hero Motocorp: Stocks to watch today Several key stocks, including Hero MotoCorp, Grasim Industries, Adani Green Energy, and Ola Electric, are expected to remain in focus due to second-quarter earnings reports and other updates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-gold-price-has-become-cheaper-in-india-than-in-gulf-uae-qatar-oman-singapore-2634724-2024-11-17",
      "headline": "Explained: Why Gold has become cheaper in India than in Gulf and SingaporeGold prices in India have become cheaper than in some traditional gold-buying destinations, like the United Arab Emirates, Qatar, Oman, and Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fpis-stock-market-selloff-q2-earnings-downgrade-trump-trade-high-valuations-ipos-2634365-2024-11-16",
      "headline": "Why are foreign investors exiting India? 3 reasons behind stock market selloffExperts suggest that the trajectory of future FPI flows will largely depend on how India maintains macroeconomic stability and improves corporate earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-gmp-price-band-key-dates-other-details-2634349-2024-11-16",
      "headline": "NTPC Green Energy IPO: Check key dates, price band, and latest GMPNTPC Green Energy IPO: The IPO is positioned as one of the largest in India this year, alongside Hyundai Motor India Ltd. and Swiggy Ltd. The anchor book will open for subscription on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-biggest-weekly-drop-in-3-years-should-you-buy-sell-expert-views-2634341-2024-11-16",
      "headline": "Gold rates see biggest weekly drop in 3 years. Good time to buy?Despite the fall in prices, analysts remain bullish about the yellow metal's long-term potential. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-listings-fall-flat-is-ipo-market-losing-its-charm-hyundai-swiggy-ntpc-green-energy-2633955-2024-11-15",
      "headline": "Is the IPO craze over? Stock market correction hits public listingsSubscription figures for IPOs have dropped in recent months. Global economic uncertainty, rising interest rates, and tighter liquidity have made investors cautious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-details-10-things-to-know-before-subscribing-review-price-gmp-2633922-2024-11-15",
      "headline": "NTPC Green Energy IPO: 10 things to know before subscribingNTPC Green Energy is a wholly-owned subsidiary of NTPC Ltd, focusing on renewable energy projects through both organic growth and acquisitions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-on-kailash-gahlot-join-bjp-aap-delhi-elections-2025-video-2635106-2024-11-18",
      "headline": "Kailash Gahlot can go wherever he wants: Arvind Kejriwal as ex-Minister joins BJPIn his resignation letter addressed to Arvind Kejriwal, ex-Delhi minister Kailash Gahlot cited unfulfilled promises and recent controversies as the reason for quitting the party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-air-quality-pollution-supreme-court-severe-plus-aqi-level-restriction-grap-2634971-2024-11-18",
      "headline": "GRAP-IV anti-pollution curbs to stay until further orders: Supreme Court to DelhiDelhi Air Quality: The Supreme Court directed the Delhi government to maintain Stage 4 anti-pollution measures until further orders. It also criticised the central commission for delaying the invocation of the curbs despite pollution levels soaring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-mocks-ek-hai-to-safe-hai-gautam-adani-pm-modi-dharavi-redevelopment-project-maharashtra-elections-2635060-2024-11-18",
      "headline": "Rahul Gandhi mocks 'ek hai to safe hai' with jab at Adani's Dharavi slum projectThe Congress leader presented two posters, one featuring a picture of industrialist Gautam Adani and PM Modi with the caption \"Ek hai toh Safe hai,\" and another showing a map of the Adani Group's Dharavi redevelopment project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-ali-khamenei-health-crisis-succession-battle-second-son-mojtaba-khamenei-to-lead-shia-islamic-2635188-2024-11-18",
      "headline": "Khamenei unwell, Iran might have secretly elected its next supreme leaderIran's supreme leader Ali Khamenei is reported to be seriously unwell. Amid concerns over his health, reports emerged of a succession battle. It is being said now that his second son, Mojtaba Khamenei, has been chosen to lead the Shia Islamic nation amid a confrontation with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/onion-price-hike-increase-reason-why-maharashtra-nashik-low-harvest-acreage-agriculture-ministry-2635037-2024-11-18",
      "headline": "Tears of farmers have set onions on fire. When will prices cool down?Onion prices touched Rs 100 a kilogram in several cities in India. Though some onion shortages, which drive up prices, are usually seen during this time of the year, the crisis this year is far worse, and has tears of farmers fuelling it. When will onion prices come down?  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-praises-the-sabarmati-report-film-exposes-truth-powerful-ecosystem-pm-modi-godhra-train-burning-2635153-2024-11-18",
      "headline": "After PM, Amit Shah praises 'The Sabarmati Report' film: Unparalleled courageUnion Minister Amit Shah's endorsement came a day after PM Modi commended 'The Sabarmati Report', which has since seen a notable surge in box office collections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-origin-ceo-daksh-gupta-death-threats-company-84-hour-workweek-policy-2635065-2024-11-18",
      "headline": "Indian-origin CEO claims he got death threats over 84-hour workweek policyDaksh Gupta, CEO of Greptile, sparked controversy after detailing the company's intense work culture in a viral post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-muslim-reservation-assembly-election-revanth-reddy-congress-amit-shah-bjp-2635172-2024-11-18",
      "headline": "Maharashtra Muslim quota talks after new government forms: Revanth ReddyTelangana Chief Minister Revanth Reddy said it is Congress' 'responsibility to do justice to them (Muslims)', by providing reservations.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bb-18-day-41-ashneer-grover-apologises-to-salman-khan-over-misleading-claims-2635135-2024-11-18",
      "headline": "BB 18 Day 41: Ashneer Grover apologises to Salman Khan over misleading claimsBigg Boss 18 Day 41: In the recent episode, Salman Khan addressed comments made by Ashneer Grover, clarifying misunderstandings about their association. This led to Ashneer apologising to the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-tells-india-recruiters-not-to-ask-for-marital-status-in-iphone-job-ads-2635148-2024-11-18",
      "headline": "Foxconn tells India recruiters not to ask for marital status in iPhone job adsFoxconn, which employs thousands of women at the iPhone factory at Sriperumbudur, near Chennai, outsources recruitment of assembly-line workers to third-party vendors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kangana-ranaut-emergency-censor-board-clearance-theatrical-release-date-2635093-2024-11-18",
      "headline": "Kangana Ranaut's Emergency finally gets theatrical release dateEmergency, Kangana Ranaut's political drama set during the 1970s, has been cleared by the censor board and will be released in theatres on January 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/if-all-states-ban-liquor-diljit-dosanjh-bold-declaration-at-ahmedabad-concert-2635085-2024-11-18",
      "headline": "If all states ban liquor...: Diljit Dosanjh's bold declaration at Ahmedabad concertSinger Diljit Dosanjh, during his Ahmedabad concert, boldly asked the authorities not to 'poke' him. His outburst came after the Telangana government sent him a notice about avoiding mention of alcohol in songs during his performance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-medical-student-dies-after-being-made-to-stand-3-hours-during-ragging-2635054-2024-11-18",
      "headline": "Gujarat medical student dies after being made to stand 3 hours during ragging Gujarat Ragging Case: A first-year MBBS student at Gujarat's Dharpur Medical College died after allegedly being forced to stand for hours during a ragging session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pollution-air-quality-index-delhi-mumbai-bengaluru-guhwati-chandigarh-aqi-cpcb-stubble-burning-2635169-2024-11-18",
      "headline": "Delhi chokes in smog; Guwahati, Thiruvananthapuram among least polluted citiesAs of Monday afternoon, three major cities recorded \"poor\" air quality, ten fell into the \"moderate\" category, and only two were rated \"satisfactory.\" \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/manipur/story/manipur-violence-jiribam-one-dead-one-injured-security-forces-clashes-mob-ransacks-bjp-congress-offices-2635029-2024-11-18",
      "headline": "1 protester dead in fresh Manipur violence; mob ransacks BJP, Congress officesManipur Violence: A mob ransacked and set fire to furniture and other property taken from the local offices of the Bharatiya Janata Party (BJP) and the Congress in the same area. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-pilot-surprises-wife-flight-cute-announcement-dedicated-to-her-adorable-video-2635165-2024-11-18",
      "headline": "IndiGo pilot surprises wife on flight with cute announcement dedicated to her. VideoAn IndiGo pilot surprised his wife on a flight with a cute announcement dedicated to her. The video has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ex-aap-leader-kailash-gehlot-likely-to-join-bjp-a-day-after-resignation-sources-2635030-2024-11-18",
      "headline": "Kailash Gahlot joins BJP, counters AAP: Didn't take decision in one dayIn his resignation letter addressed to AAP's National Convenor Arvind Kejriwal and Delhi Chief Minister Atishi, Gahlot cited unfulfilled promises and recent controversies as reasons for stepping down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/expedite-decision-supreme-court-presidents-office-beant-singh-killer-mercy-plea-2635040-2024-11-18",
      "headline": "Expedite Beant Singh's killer's mercy plea: Supreme Court to President's OfficeBalwant Singh Rajoana was convicted in the 1995 assassination of then Punjab chief minister Beant Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-do-astronauts-need-to-have-a-high-3500-calorie-diet-in-space-2635163-2024-11-18",
      "headline": "Why do astronauts have a 3,500-calorie diet in space?Sunita Williams's health in space has highlighted the complexities of calorie management in microgravity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/dune-prophecy-review-episode-1-emily-watson-olivia-williams-2635020-2024-11-18",
      "headline": "Dune Prophecy review: A compelling start burdened by franchise expectationsReleased-Mon Nov 18, 2024Dune: Prophecy, a prequel series to the 2021 film Dune, explores the origins of the Bene Gesserit and key players, set 10,000 years before Paul Atreides' saga. The first episode is now streaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-man-driving-licence-revoked-fined-rs-25-lakh-for-blocking-ambulance-in-thrissur-chalakudy-2635046-2024-11-18",
      "headline": "Kerala man's driving licence revoked for blocking ambulance, fined A man in Kerala's Thrissur faced severe penalties, including licence revocation and a fine, after video showed him not letting through an ambulance carrying a patient to Thrissur Medical College.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/moons-far-side-once-used-to-vibrate-with-erupting-volcanoes-2635159-2024-11-18",
      "headline": "Confirmed! Moon's far side once had erupting volcanoesWhile scientists have long known about active volcanoes on the near side of the moon dating back to a similar time frame, the far side's volcanic history has remained largely a mystery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fareed-zakaria-interview-pm-modi-exception-global-anti-incumbency-trend-third-term-popularity-assembly-elections-2634998-2024-11-18",
      "headline": "Narendra Modi the exception amid global anti-incumbency wave: Fareed ZakariaVeteran journalist and geopolitical analyst Fareed Zakaria credited PM Modi's enduring popularity and strategic political approach for defying the anti-incumbency trend sweeping democracies worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/dilip-joshi-asit-modi-get-into-big-fight-over-leaves-on-taarak-mehta-sets-report-2635180-2024-11-18",
      "headline": "Dilip Joshi-Asit Modi get into big fight over leaves on Taarak Mehta sets: ReportTaarak Mehta Ka Ooltah Chashmah actor Dilip Joshi and producer Asit Modi had a big showdown on the sets of the show, claimed a media report. The incident happened when the actor felt insulted and neglected by the producer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-makes-rare-red-carpet-appearance-with-son-knox-2635145-2024-11-18",
      "headline": "Pics: Angelina Jolie makes rare red carpet appearance with son KnoxHollywood star Angelina Jolie recently made a rare red carpet appearance with her son Knox. The mother-son duo dazzled at the Governor's Awards in Los Angeles. Take a look. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-rare-pic-raha-kapoor-pure-gem-2635152-2024-11-18",
      "headline": "See: Ranbir Kapoor's rare pic with Raha is pure gemRanbir Kapoor's rare photo with his daughter, Raha, is winning hearts. Seen yet? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bb-18-day-41-ashneer-grover-apologises-to-salman-khan-over-misleading-claims-2635135-2024-11-18",
      "headline": "BB 18 Day 41: Ashneer Grover apologises to Salman Khan over misleading claimsBigg Boss 18 Day 41: In the recent episode, Salman Khan addressed comments made by Ashneer Grover, clarifying misunderstandings about their association. This led to Ashneer apologising to the actor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sunil-gavaskar-trophy-australia-vs-india-perth-test-rohit-sharma-2635150-2024-11-18",
      "headline": "Virat Kohli will be very very hungry in Australia Test series: Sunil GavaskarFormer India cricketer Sunil Gavaskar feels star India batter Virat Kohli will be really hungry to score in the upcoming Test series against Australia after his poor outings in the ongoing year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fans-throw-bottle-at-lionel-messi-paraguay-footballer-apologises-2635136-2024-11-18",
      "headline": "Fans throw bottle at Lionel Messi: Paraguay footballer apologisesParaguayan footballer Omar Alderete apologised to Lionel Messi after fans threw a bottles at the Argentina captain during their recent World Cup Qualifier match. Argentina were left frustrated by the hosts, who won the match 2-1.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-perth-test-debut-dodda-ganesh-australia-vs-india-2635129-2024-11-18",
      "headline": "Fast-tracking Nitish Reddy makes no sense: Ex-India pacer on Perth Test rumoursAustralia vs India, Perth Test: Nitish Kumar Reddy, according to reports, is in line to make a debut in the series opener, starting November 22. India face selection headache as they are likely to be without Rohit Sharma and Shubman Gill in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sourav-ganguly-gautam-gambhir-remark-ricky-ponting-2635121-2024-11-18",
      "headline": "Sourav Ganguly issues verdict on Gautam Gambhir's Ricky Ponting remarksFormer India captain Sourav Ganguly has defended Gautam Gambhir after the head coach faced backlash for his blunt responses at press conferences. India's recent 0-3 loss to New Zealand at home has intensified scrutiny on Gambhir, whose coaching tenure has seen a mixed start ahead of the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mitchell-marsh-bowls-nets-ahead-perth-test-2635076-2024-11-18",
      "headline": "Australia's Mitchell Marsh bowls in nets ahead of Perth Test vs India: ReportMitchell Marsh was seen preparing for a crucial bowling role as Australia trained for the Border-Gavaskar Trophy against India. The all-rounder's return to bowling adds depth to the Australian squad, gearing up to face India's formidable lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-prediction-which-players-can-delhi-capitals-target-shreyas-iyer-purse-rs-73-crore-purse-2635089-2024-11-18",
      "headline": "IPL auction: Will DC look to reunite with Shreyas Iyer with Rs 73 crore purse?IPL 2025 Auction: Delhi Capitals are set for a fresh after saying goodbye to captain Rishabh Pant ahead of the mega auction. With spin maestros Axar Patel and Kuldeep Yadav, South African Tristan Stubbs and rising star Abishek Porel, DC retained a young core. Armed with Rs 73 crore and two RTM cards, DC may look to resign ex-captain Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-3rd-t20i-playing-11-hobart-mohammad-rizwan-naseem-shah-2635080-2024-11-18",
      "headline": "AUS vs PAK: T20I series lost, Pakistan announce new captain for series finaleAustralia vs Pakistan: Visitors Pakistan made two changes to their XI for the final match of the T20I series. Having already lost the series 0-2, they have rested captain Mohammad Rizwan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-rohit-sharma-set-to-miss-perth-test-might-join-team-directly-in-adelaide-2635048-2024-11-18",
      "headline": "Rohit Sharma set to miss Perth Test, might join team directly in AdelaideBorder-Gavaskar Trophy: India captain Rohit Sharma is set to miss the opening Test match in Perth, sources have confirmed to India Today. Sharma is likely to join the team in Adelaide ahead of the 2nd Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-doug-bracewell-tests-positive-for-cocaine-handed-one-month-ban-2635028-2024-11-18",
      "headline": "Bracewell tests positive for cocaine, handed one-month ban from cricketFormer New Zealand cricketer Doug Bracewell has been banned for one month after testing positive for cocaine. The 34-year-old was found to have used the banned substance following a stellar performance in a domestic T20 match for Central Districts against Wellington in January 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-recap-when-maxwell-mocked-kohlis-shoulder-injury-only-to-receive-fiery-sendoff-2634887-2024-11-18",
      "headline": "BGT Recap: When Maxwell mocked Kohli's shoulder injury only to receive fiery sendoffBorder-Gavaskar Trophy: Mocked by Glenn Maxwell for his shoulder injury during the 2017 Ranchi Test, Virat Kohli hit back with a fiery gesture of his own. The intense rivalry fuelled India's spirit, leading them to a memorable 2-1 series victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-prediction-which-players-can-delhi-capitals-target-shreyas-iyer-purse-rs-73-crore-purse-2635089-2024-11-18",
      "headline": "IPL auction: Will DC look to reunite with Shreyas Iyer with Rs 73 crore purse?IPL 2025 Auction: Delhi Capitals are set for a fresh after saying goodbye to captain Rishabh Pant ahead of the mega auction. With spin maestros Axar Patel and Kuldeep Yadav, South African Tristan Stubbs and rising star Abishek Porel, DC retained a young core. Armed with Rs 73 crore and two RTM cards, DC may look to resign ex-captain Shreyas Iyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-3rd-t20i-playing-11-hobart-mohammad-rizwan-naseem-shah-2635080-2024-11-18",
      "headline": "AUS vs PAK: T20I series lost, Pakistan announce new captain for series finaleAustralia vs Pakistan: Visitors Pakistan made two changes to their XI for the final match of the T20I series. Having already lost the series 0-2, they have rested captain Mohammad Rizwan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-rohit-sharma-set-to-miss-perth-test-might-join-team-directly-in-adelaide-2635048-2024-11-18",
      "headline": "Rohit Sharma set to miss Perth Test, might join team directly in AdelaideBorder-Gavaskar Trophy: India captain Rohit Sharma is set to miss the opening Test match in Perth, sources have confirmed to India Today. Sharma is likely to join the team in Adelaide ahead of the 2nd Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-doug-bracewell-tests-positive-for-cocaine-handed-one-month-ban-2635028-2024-11-18",
      "headline": "Bracewell tests positive for cocaine, handed one-month ban from cricketFormer New Zealand cricketer Doug Bracewell has been banned for one month after testing positive for cocaine. The 34-year-old was found to have used the banned substance following a stellar performance in a domestic T20 match for Central Districts against Wellington in January 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-recap-when-maxwell-mocked-kohlis-shoulder-injury-only-to-receive-fiery-sendoff-2634887-2024-11-18",
      "headline": "BGT Recap: When Maxwell mocked Kohli's shoulder injury only to receive fiery sendoffBorder-Gavaskar Trophy: Mocked by Glenn Maxwell for his shoulder injury during the 2017 Ranchi Test, Virat Kohli hit back with a fiery gesture of his own. The intense rivalry fuelled India's spirit, leading them to a memorable 2-1 series victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-nations-league-france-grab-top-spot-after-italy-win-england-earn-promotion-2635010-2024-11-18",
      "headline": "France grab top spot after Italy win, England earn promotionUEFA Nations League: Adrien Rabiot scored a brace to help France beat Italy 3-1 and finish top of their group above Italy, while England defeated the Republic of Ireland 5-0 to secure their return to League A."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-first-test-match-vaughan-shocked-intra-squad-match-2635006-2024-11-18",
      "headline": "Vaughan shocked over India's reluctance to play intra-squad game before PerthFormer England cricketer Michael Vaughan is surprised that India did not play a single intra-squad game before the opening Test match in Perth. Vaughan is worried about the Indian team's competitive mindset ahead of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-virat-kohli-form-warner-warning-perth-test-2635004-2024-11-18",
      "headline": "Virat Kohli always steps up in Australia: Warner 'worried' ahead of Perth TestBorder-Gavaskar Trophy: Former Australian opener David Warner has warned the Pat Cummins-led side about the threat posed by Virat Kohli, despite his recent slump in form. Warner believes Kohli's history of excelling in Australia could be pivotal in the upcoming five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-nathan-lyon-teacher-ashwin-perth-test-2634984-2024-11-18",
      "headline": "R Ashwin has taught me a lot: Nathan Lyon praises 'incredible' India spinnerBorder-Gavaskar Trophy: Australian veteran Nathan Lyon has revealed his admiration for long-time Indian rival, Ravichandran Ashwin, ahead of their eighth Test match encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-beats-taylor-fritz-to-win-atp-finals-2634967-2024-11-18",
      "headline": "Jannik Sinner caps golden year by beating Taylor Fritz to ATP Finals gloryWorld number one and home favourite Jannik Sinner made history on Sunday, becoming the first Italian to win the ATP Finals title with a commanding 6-4, 6-4 victory over American Taylor Fritz.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-bgt-ravi-shastri-wants-dhruv-jurel-to-play-as-specialist-batter-in-perth-test-2634968-2024-11-18",
      "headline": "Ravi Shastri wants Dhruv Jurel to play as specialist batter in PerthBorder-Gavaskar Trophy: Former India head coach Ravi Shastri wants Dhruv Jurel as a specialist batter in the opening Test match vs Australia. Jurel looked a class above in India A's tour match in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-selection-issue-perth-test-rohit-bumrah-kl-dhruv-2634955-2024-11-18",
      "headline": "Rohit and Gill out, Bumrah to lead? India face selection headache for Perth TestBorder-Gavaskar Trophy: Jasprit Bumrah is likely to lead India in the first Test with Rohit Sharma set to miss the Perth opener, which starts on November 22 at the Optus Stadium. India are now set to begin the Test series without two members of their first-choice top three, with No. 3 Shubman Gill also out due to a thumb injury.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-india-vs-australia-gautam-gambhir-anger-harbhajan-singh-2634951-2024-11-18",
      "headline": "Border-Gavaskar Trophy will test Gambhir's anger and patience: HarbhajanBorder-Gavaskar Trophy will Test head coach Gautam Gambhir's patience and anger, feels Harbhajan Singh. Coach Gambhir was put under the pump by the Indian media after he lost home series against New Zealand at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-beats-taylor-fritz-to-win-atp-finals-2634967-2024-11-18",
      "headline": "Jannik Sinner caps golden year by beating Taylor Fritz to ATP Finals gloryWorld number one and home favourite Jannik Sinner made history on Sunday, becoming the first Italian to win the ATP Finals title with a commanding 6-4, 6-4 victory over American Taylor Fritz.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-bgt-ravi-shastri-wants-dhruv-jurel-to-play-as-specialist-batter-in-perth-test-2634968-2024-11-18",
      "headline": "Ravi Shastri wants Dhruv Jurel to play as specialist batter in PerthBorder-Gavaskar Trophy: Former India head coach Ravi Shastri wants Dhruv Jurel as a specialist batter in the opening Test match vs Australia. Jurel looked a class above in India A's tour match in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-selection-issue-perth-test-rohit-bumrah-kl-dhruv-2634955-2024-11-18",
      "headline": "Rohit and Gill out, Bumrah to lead? India face selection headache for Perth TestBorder-Gavaskar Trophy: Jasprit Bumrah is likely to lead India in the first Test with Rohit Sharma set to miss the Perth opener, which starts on November 22 at the Optus Stadium. India are now set to begin the Test series without two members of their first-choice top three, with No. 3 Shubman Gill also out due to a thumb injury.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-india-vs-australia-gautam-gambhir-anger-harbhajan-singh-2634951-2024-11-18",
      "headline": "Border-Gavaskar Trophy will test Gambhir's anger and patience: HarbhajanBorder-Gavaskar Trophy will Test head coach Gautam Gambhir's patience and anger, feels Harbhajan Singh. Coach Gambhir was put under the pump by the Indian media after he lost home series against New Zealand at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/billie-jean-king-cup-slovakia-australia-viktoria-hruncakova-2634933-2024-11-17",
      "headline": "Slovakia reach Billie Jean King Cup semis after knocking out AustraliaSlovakia secured a spot in the Billie Jean King Cup semi-finals for the first time in over two decades, clinching a decisive 2-0 victory against Australia on Sunday. This marks Slovakia's first semi-final appearance since 2002."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-devisha-birthday-wish-support-system-2634927-2024-11-17",
      "headline": "My biggest support system: Suryakumar wishes wife Devisha on birthdaySuryakumar Yadav wished his wife Devisha Shetty on her birthday. Suryakumar recently had a great time in South Africa after winning the four-match T20I series 3-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kusal-mendis-stars-with-74-as-sri-lanka-clinch-odi-series-vs-new-zealand-2634925-2024-11-17",
      "headline": "Kusal Mendis stars with 74* as Sri Lanka clinch ODI series vs New ZealandSri Lanka beat New Zealand by 3 wickets to clinch the ODI series 2-0 vs New Zealand with one match remaining. Kusal Mendis starred with the bat with an unbeaten 74 in Pallekele. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kapil-devs-message-to-indian-team-before-australia-tests-dont-listen-much-2634914-2024-11-17",
      "headline": "Kapil Dev's message to India ahead of Australia Tests: Just shut out the noise Kapil Dev extended his best wishes to the Indian team ahead of the Border Gavaskar Trophy series. The 1st Test match will take place on November 22 in Perth. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}