{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-not-met-what-astronomer-said-on-ceo-andy-byron-kristine-cabot-coldplay-kiss-cam-scandal-2758498-2025-07-20",
      "headline": "Standard not met: What Astronomer said on CEO Andy Byron's Coldplay kiss cam rowAstronomer responded to the viral video by placing CEO Andy Byron on leave, later confirming his resignation after stating that leadership standards had not been met. The company emphasised its commitment to accountability and the core values it was founded on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/between-kapil-sharma-and-gong-yoo-vir-das-fool-volume-debuts-strong-on-netflix-2758539-2025-07-20",
      "headline": "Between Kapil Sharma and Gong Yoo: Vir Das's Fool Volume debuts strong on NetflixVir Das humourously celebrated his Netflix special 'Fool Volume', debuting at Number 3 in India, sandwiched between popular shows 'The Great Indian Kapil Show' and 'Squid Game: Season 3'. He shared a fun AI image caught between Kapil Sharma and Gong Yoo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-wife-rama-watch-brad-pitt-f1-hyderabad-prasads-theatre-2758519-2025-07-20",
      "headline": "Rajamouli, wife Rama enjoy Brad Pitt's F1 at Hyderabad's Prasads theatre. WatchFilmmaker SS Rajamouli was captured watching actor Brad Pitt's 'F1 The Movie'. Videos of him leaving the theatres went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamata-banerjee-wishes-speedy-recovery-to-shah-rukh-khan-after-injury-2758513-2025-07-20",
      "headline": "Mamata Banerjee wishes speedy recovery to brother Shah Rukh Khan after injuryWest Bengal Chief Minister Mamata Banerjee expressed concern for Shah Rukh Khan's injury during 'King' shoot. He is currently in the UK recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-celebrates-priyanka-chopra-43-birthday-new-post-2758500-2025-07-20",
      "headline": "Nothing brings Nick Jonas more joy than celebrating Priyanka, his new post has it allPop star Nick Jonas penned a heartfelt birthday tribute for his wife, Priyanka Chopra, accompanied by a romantic photo. The couple, who have been married since 2018, continue to serve major relationship goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-director-chandra-barot-dies-of-pulmonary-disease-at-86-2758494-2025-07-20",
      "headline": "Don director Chandra Barot dies at 86, Farhan Akhtar pays tributeVeteran filmmaker Chandra Barot died at the age of 86. He was best known for his work in Amitabh Bachchan's 'Don'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charli-xcx-marries-the-1975-george-daniel-london-town-hall-ceremony-2758485-2025-07-20",
      "headline": "Charli XCX marries The 1975's George Daniel in London town hall ceremonyPop sensation Charli XCX married George Daniel of The 1975 in an intimate ceremony held in London. The bride turned heads in a stylish white mini dress paired with her trademark sunglasses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-namrata-shirodkar-wish-daughter-sitara-ghattamaneni-on-birthday-just-like-that-shes-a-teenager-2758483-2025-07-20",
      "headline": "Just like that she's a teen: Mahesh Babu, Namrata wish daughter Sitara on birthdaySitara Ghattamaneni, daughter of Telugu superstar Mahesh Babu and Namrata Shirodkar, celebrated her 13th birthday surrounded by heartfelt wishes from family and fans. The teenager, already popular on social media, continues to charm the Telugu film fraternity with her growing presence and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagis-emotional-post-remembers-wife-shefali-jariwala-as-beloved-maasi-2758469-2025-07-20",
      "headline": "Parag Tyagi calls Shefali Jariwala a beloved maasi in emotional postParag Tyagi continues to honour his late wife Shefali Jariwala with touching posts celebrating her loving nature and their cherished memories together. On Sunday, he shared a post remembering the best aunt that she was to her nephew and niece."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/paul-wesley-engaged-to-model-natalie-kuckenburg-after-romantic-italy-trip-2758452-2025-07-20",
      "headline": "Vampire Diaries's Paul Wesley engaged to model-girlfriend Natalie KuckenburgPaul Wesley, known for his role in 'The Vampire Diaries', is engaged to model Natalie Kuckenburg. The couple shared the news privately on Instagram during a trip to Italy, where they have reportedly been visiting since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 45 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-ahaaan-panday-saiyaara-character-casting-story-2758424-2025-07-20",
      "headline": "Exclusive: How a bar night helped Ahaan Panday land Saiyaara, reveals Mohit SuriIn an exclusive conversation with India Today, filmmaker Mohit Suri shared the story behind casting Ahaan Panday in 'Saiyaara'. He said that an unusual test revealed the actor's true character and energy, shaping the film's lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-gushes-over-saiyaara-stars-ahaan-panday-aneet-padda-calls-film-full-of-soul-2758419-2025-07-20",
      "headline": "Alia Bhatt gushes over Saiyaara stars Ahaan and Aneet, calls film full of soulAlia Bhatt showered heartfelt praise on the film 'Saiyaara' and its lead actors, calling them magical stars and applauding the emotional depth of the story. The film, directed by Mohit Suri and produced by Yash Raj Films, has made a record-breaking debut at the box office, marking a significant success for newcomers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-fans-turn-theatres-into-concert-watch-viral-video-2758336-2025-07-19",
      "headline": "Saiyaara fans turn theatres into concert halls. Videos go viralPlanning to watch Mohit Suri's 'Saiyaara' this weekend? Here's how audiences are reacting to Ahaan Panday and Aneet Padda's big-screen debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-teaser-mohanlal-sathyan-anthikad-reunite-feel-good-film-2758324-2025-07-19",
      "headline": "Hridayapoorvam teaser: Mohanlal, Sathyan Anthikad reunite for feel-good filmMohanlal and Sathyan Anthikad reunite to deliver what looks like a heartwarming slice-of-life drama. Take a look at the 'Hridayapoorvam' teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-television-academy-marks-25-years-launch-ita-anthem-2758316-2025-07-19",
      "headline": "Indian Television Academy Awards celebrates 25 years with launch of ITA anthemThe Indian Television Academy completed 25 years in 2025. The academy released an ITA anthem that captures the evolution of Indian television.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-mimics-coldplay-cheating-couple-goes-viral-watch-2758285-2025-07-19",
      "headline": "BTS Jin's funny mimic of Coldplay's cheating couple goes viral. WatchAstronomer CEO Andy Byron and Chief Public Officer Kristin Cabot got caught cheating during a Coldplay concert. BTS member Jin recreated the viral moment on his tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-son-of-sardaar-2-release-postponed-makes-announce-new-date-2758273-2025-07-19",
      "headline": "Son of Sardaar 2 release postponed, makes announce new dateAjay Devn's 'Son of Sardaar 2' has been postponed. The film was set for a July 25 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-experiences-mid-air-scare-as-stage-prop-fails-during-show-2758256-2025-07-19",
      "headline": "Katy Perry experiences mid-air scare as stage prop fails during showPop star Katy Perry faced an unexpected glitch during her Lifetimes Tour stop in San Francisco. While performing her hit track 'Roar', the singer was perched on a giant butterfly prop that appeared to malfunction mid-act."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-ready-for-discussion-on-op-sindoor-in-parliament-wont-shy-away-kiren-rijiju-after-all-party-meet-2758511-2025-07-20",
      "headline": "Centre ready for Op Sindoor discussion in Parliament, won't shy away: Kiren RijijuThe Centre will respond appropriately in Parliament, Rijiju said when asked about the opposition, raising the issue of Operation Sindoor, the Pahalgam terror attack and US President Trump's ceasefire claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/army-to-get-1st-batch-of-apache-choppers-on-july-22-after-15-month-delay-say-sources-2758505-2025-07-20",
      "headline": "Army to get 1st batch of Apache choppers on July 22 after 15-month delay: SourcesAccording to sources aware of the delivery schedule, the first three Apache helicopters are likely to be handed over to the Indian Army's Aviation Corps on July 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-local-train-seat-dispute-marathi-hindi-language-clash-viral-video-2758538-2025-07-20",
      "headline": "Speak Marathi or get out: Woman abused in Mumbai local as seat dispute escalatesThe incident took place on Friday evening in a crowded ladies' coach of the train running on the Central line."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/african-british-man-eats-chicken-inside-iskcon-govinda-restaurant-london-viral-video-2758541-2025-07-20",
      "headline": "Viral video: Man eats chicken inside ISKCON restaurant in London, sparks outrageA video of a man eating fried chicken inside ISKCON's Govinda restaurant in London has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sunday-special/story/hit-and-run-fauja-singh-road-accident-death-india-capital-ncrb-police-investigation-corruption-delhi-safety-2758365-2025-07-20",
      "headline": "The dead cry for justice in the land of hit-and-runLegendary marathoner Fauja Singh, 114, was killed in a hit-and-run accident. Over 30,400 people were killed in such accidents in India in 2022. But why do people flee accident spots leaving behind the victim? Fear of being lynched, a sense of impunity, and little value for lives play a role. Police also categorise accidents as hit-and-run to avoid probing them. Can India, where corruption rules, bring down hit-and-run cases?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-shashi-tharoors-nation-first-message-sometimes-parties-feel-youre-being-disloyal-2758426-2025-07-20",
      "headline": "Sometimes parties feel you're being disloyal: Shashi Tharoor's nation first messageSpeaking at an event in Kochi on 'Peace, Harmony and National Development', Shashi Tharoor said that the nation must come first, and parties are merely vehicles to build a better country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minister-manikrao-kokate-caught-playing-rummy-in-house-sharad-pawars-ncp-shares-video-2758545-2025-07-20",
      "headline": "Maharashtra minister caught playing rummy in House? Sharad Pawar's NCP shares videoThe video, widely circulated on social media, was shared by Nationalist Congress Party (Sharadchandra Pawar) leader Rohit Pawar, who launched a sharp attack on the minister and the government over the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-congresss-haryana-revamp-serve-as-its-template-for-other-states-2757214-2025-07-17",
      "headline": "Can Congress's Haryana revamp serve as its template for other states?The partly democratic, partly high command-driven selection of district chiefs will determine if the party can build real grassroots strength and a future in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-brothers-marry-one-bride-himachal-hatti-jodidara-marriage-legal-2758493-2025-07-20",
      "headline": "Why two brothers married one bride in Himachal and is it legal?In a rare instance of polyandry, two brothers from Himachal Pradesh's Hatti tribe married the same woman in a traditional ceremony known as Jodidara. The practice, rooted in preserving ancestral land and family unity, is still legally recognised in parts of the state despite its gradual decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/two-powerful-earthquakes-off-pacific-coast-trigger-tsunami-warning-in-russia-2758497-2025-07-20",
      "headline": "Tsunami alert issued for Russia after five powerful earthquakes hit in an hourA tsunami alert has been issued for Russia after five powerful earthquakes struck within an hour in the Pacific Ocean near the city of Petropavlovsk-Kamchatsky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-will-bring-impeachment-motion-against-judge-in-parliament-session-100-mps-already-signed-kiren-rijiju-2758522-2025-07-20",
      "headline": "Centre to bring motion to impeach judge in cash row; 100 MPs signed: Kiren RijijuThe controversy surrounding Justice Varma dates back to March 2025, when a fire broke out at Yashwant Varma's official residence in Delhi. Following the incident, a large quantity of burnt or partially burnt cash was allegedly recovered from the premises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabias-sleeping-prince-al-waleed-bin-khaled-dies-after-20-years-in-coma-2758458-2025-07-20",
      "headline": "Saudi Arabia's 'Sleeping Prince' Al Waleed bin Khaled dies after 20 years in comaBorn in April 1990, Prince Al Waleed was the eldest son of Prince Khaled bin Talal Al Saud, a prominent Saudi royal and nephew of billionaire Prince Al Waleed bin Talal. At the age of 15, while studying at a military college in the UK, the young royal suffered a tragic road accident that left him with severe brain injuries and internal bleeding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-launching-raunchy-ai-companions-elon-musk-announces-baby-grok-for-kid-friendly-content-2758460-2025-07-20",
      "headline": "Elon Musk announces 'Baby Grok' for kid-friendly contentElon Musk recently announced that xAI, his AI company and the parent of Grok AI, will bring a new app called Baby Grok. It aims to offer kid-friendly content only. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-harrierev-review-first-drive-loaded-to-the-gills-with-awd-and-tech-2758449-2025-07-20",
      "headline": "Tata Harrier.ev review, first drive: Loaded to the gills with AWD and techTata has launched the electric version of the Harrier, and this time, it comes with an all-wheel-drive (AWD) option as well. So, is this the electric SUV that enthusiasts have been waiting for? We find out.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-akash-deeps-injury-adds-to-indias-woes-ahead-of-manchester-test-2758484-2025-07-20",
      "headline": "ENG vs IND: Akash Deep's injury adds to India's woes ahead of 4th TestIndia have been dealt with another major blow ahead of the fourth Test against England as fast bowler Akash Deep is dealing with a groin niggle, which puts his participation in the upcoming fixture in doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-director-chandra-barot-dies-of-pulmonary-disease-at-86-2758494-2025-07-20",
      "headline": "Don director Chandra Barot dies at 86, Farhan Akhtar pays tributeVeteran filmmaker Chandra Barot died at the age of 86. He was best known for his work in Amitabh Bachchan's 'Don'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-begins-construction-of-167-billion-mega-dam-over-brahmaputra-in-tibet-2758406-2025-07-20",
      "headline": "China begins construction of $167 billion mega dam over Brahmaputra in TibetThe hydropower project, regarded as the biggest infrastructure project in the world, raised concerns in the lower riparian countries, India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/beneath-the-hill-a-lost-world-4000-year-old-settlement-found-in-karnatakas-maski-2758479-2025-07-20",
      "headline": "Beneath the hill, a lost world: 4000-year-old settlement found in Karnataka's MaskiArchaeologists have discovered 4000-year-old artefacts during an excavation near Mallikarjuna Hill and the Anjaneya Swamy Temple in Maski, Raichur district. The findings suggest the presence of an ancient human settlement, highlighting Maski's historical significance once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/well-realise-dream-of-maharashtra-uddhav-thackeray-on-reuniting-with-cousin-raj-2758481-2025-07-20",
      "headline": "We'll realise dream of Maharashtra: Uddhav Thackeray on reuniting with cousin RajWhen asked whether this show of unity would extend into political coordination, Uddhav Thackeray  said, \"We have come together after 20 years. This is not even a little - this is very big. Our appearance together is more important than our speech today.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamata-banerjee-wishes-speedy-recovery-to-shah-rukh-khan-after-injury-2758513-2025-07-20",
      "headline": "Mamata Banerjee wishes speedy recovery to brother Shah Rukh Khan after injuryWest Bengal Chief Minister Mamata Banerjee expressed concern for Shah Rukh Khan's injury during 'King' shoot. He is currently in the UK recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-wife-rama-watch-brad-pitt-f1-hyderabad-prasads-theatre-2758519-2025-07-20",
      "headline": "Rajamouli, wife Rama enjoy Brad Pitt's F1 at Hyderabad's Prasads theatre. WatchFilmmaker SS Rajamouli was captured watching actor Brad Pitt's 'F1 The Movie'. Videos of him leaving the theatres went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamata-banerjee-wishes-speedy-recovery-to-shah-rukh-khan-after-injury-2758513-2025-07-20",
      "headline": "Mamata Banerjee wishes speedy recovery to brother Shah Rukh Khan after injuryWest Bengal Chief Minister Mamata Banerjee expressed concern for Shah Rukh Khan's injury during 'King' shoot. He is currently in the UK recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-celebrates-priyanka-chopra-43-birthday-new-post-2758500-2025-07-20",
      "headline": "Nothing brings Nick Jonas more joy than celebrating Priyanka, his new post has it allPop star Nick Jonas penned a heartfelt birthday tribute for his wife, Priyanka Chopra, accompanied by a romantic photo. The couple, who have been married since 2018, continue to serve major relationship goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-director-chandra-barot-dies-of-pulmonary-disease-at-86-2758494-2025-07-20",
      "headline": "Don director Chandra Barot dies at 86, Farhan Akhtar pays tributeVeteran filmmaker Chandra Barot died at the age of 86. He was best known for his work in Amitabh Bachchan's 'Don'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-west-indies-vs-australia-1st-t20i-batter-2758559-2025-07-20",
      "headline": "Mitchell Marsh to play as specialist batter, bowling remains 'offline'WI vs AUS: Mitchell Marsh said that he would play in the T20I series against the West Indies as a specialist batter. Marsh has bowled only once in limited-overs internationals since March 2024. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/zheng-qinwen-wta-tour-elbow-surgery-short-break-2758544-2025-07-20",
      "headline": "Zheng Qinwen takes short break from WTA Tour after elbow surgeryWorld No.6 Qinwen Zheng has taken a short break from tennis to focus on his rehab after undergoing arthroscopic surgery. She last played in the Wimbledon where she crashed out in the opening round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-on-verge-of-breaking-virender-sehwags-record-2758517-2025-07-20",
      "headline": "ENG vs IND: Rishabh Pant on verge of breaking Virender Sehwag's major recordIndia wicketkeeper batter Rishabh Pant is on the verge of breaking Virender Sehwag's record during the fourth Test against England at Old Trafford, Manchester set to be played from July 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-england-vs-india-manchester-test-2758521-2025-07-20",
      "headline": "KL Rahul eyes 9000 runs for India, aims for career-best Test seriesENG vs IND: KL Rahul will be looking to achieve two major landmarks in his career when India cross swords with England in the fourth Test, starting July 20 at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-manchester-test-england-vs-india-4th-test-2758487-2025-07-20",
      "headline": "Shubman Gill eyes 19-year-old Asian record in Manchester TestENG vs IND: Indian captain Shubman Gill has a chance to break Mohammad Yousuf's record for the most runs by an Asian batter in a bilateral Test series on English soil. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-akash-deeps-injury-adds-to-indias-woes-ahead-of-manchester-test-2758484-2025-07-20",
      "headline": "ENG vs IND: Akash Deep's injury adds to India's woes ahead of 4th TestIndia have been dealt with another major blow ahead of the fourth Test against England as fast bowler Akash Deep is dealing with a groin niggle, which puts his participation in the upcoming fixture in doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-on-sharing-trophy-name-with-sachin-tendulkar-i-feel-out-of-place-2758475-2025-07-20",
      "headline": "James Anderson on sharing trophy name with Sachin Tendulkar: I feel out of placeLegendary England fast bowler James Anderson has said that he feels out of place while sharing his name with Sachin Tendulkar for the England vs India Test series trophy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-squads-schedule-mitchell-marsh-2758471-2025-07-20",
      "headline": "West Indies vs Australia T20I series: Squads and all you need to knowWI vs AUS: After winning the Test series, Mitchell Marsh's Australia will look to put their best foot forward when they face the Shai Hope-led West Indies in the five-match T20I series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tammy-beaumont-deepti-sharma-obstructing-the-field-law-lords-odi-2758457-2025-07-20",
      "headline": "Why was Tammy Beaumont not given out Obstructing the Field at Lord's: ExplainedENG-W vs IND-W: Tammy Beaumont was at the centre of controversy after India appealed for an Obstructing the Field dismissal against her in the second ODI at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-ravichandran-ashwin-address-jealousy-rumours-2758446-2025-07-20",
      "headline": "Was Harbhajan Singh jealous of Ravichandran Ashwin? Spinners address popular beliefFormer India spinners Ravichandran Ashwin and Harbhajan Singh recently addressed the age-old rumour of the latter being jealous of the former during an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-west-indies-vs-australia-1st-t20i-playing-xi-2758437-2025-07-20",
      "headline": "Mitchell Owen to debut as Australia name XI for 1st T20I vs West IndiesWI vs AUS: After a stellar performance in the BBL 2024-25 and representing Punjab Kings in the IPL, Mitchell Owen will make his debut for Australia in the first T20I against the West Indies in Jamaica. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-on-sharing-trophy-name-with-sachin-tendulkar-i-feel-out-of-place-2758475-2025-07-20",
      "headline": "James Anderson on sharing trophy name with Sachin Tendulkar: I feel out of placeLegendary England fast bowler James Anderson has said that he feels out of place while sharing his name with Sachin Tendulkar for the England vs India Test series trophy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-squads-schedule-mitchell-marsh-2758471-2025-07-20",
      "headline": "West Indies vs Australia T20I series: Squads and all you need to knowWI vs AUS: After winning the Test series, Mitchell Marsh's Australia will look to put their best foot forward when they face the Shai Hope-led West Indies in the five-match T20I series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tammy-beaumont-deepti-sharma-obstructing-the-field-law-lords-odi-2758457-2025-07-20",
      "headline": "Why was Tammy Beaumont not given out Obstructing the Field at Lord's: ExplainedENG-W vs IND-W: Tammy Beaumont was at the centre of controversy after India appealed for an Obstructing the Field dismissal against her in the second ODI at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-ravichandran-ashwin-address-jealousy-rumours-2758446-2025-07-20",
      "headline": "Was Harbhajan Singh jealous of Ravichandran Ashwin? Spinners address popular beliefFormer India spinners Ravichandran Ashwin and Harbhajan Singh recently addressed the age-old rumour of the latter being jealous of the former during an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-owen-west-indies-vs-australia-1st-t20i-playing-xi-2758437-2025-07-20",
      "headline": "Mitchell Owen to debut as Australia name XI for 1st T20I vs West IndiesWI vs AUS: After a stellar performance in the BBL 2024-25 and representing Punjab Kings in the IPL, Mitchell Owen will make his debut for Australia in the first T20I against the West Indies in Jamaica. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}