{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-declares-interim-dividend-q2fy25-results-net-profit-revenue-2618510-2024-10-17",
      "headline": "Infosys declares interim dividend of Rs 21 for shareholders. Check key details Infosys interim dividend: The Bengaluru-based IT giant has set October 29, 2024, as the record date, with the payout scheduled for November 8, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q2-results-net-profit-jumps-21-percent-to-rs-3209-crore-consolidated-revenue-falls-2618501-2024-10-17",
      "headline": "Wipro Q2 results: Net profit jumps 21% to Rs 3,209 croreWipro's consolidated revenue for the July-September quarter decreased by 1%, amounting to Rs 22,302 crore, down from Rs 22,543 crore in the same quarter the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q2fy25-results-net-profit-5-percent-rs-6505-crore-interim-dividend-21-2618495-2024-10-17",
      "headline": "Infosys Q2 results: Net profit up 5% to Rs 6,506 crore; Rs 21 dividend declaredInfosys Q2FY25 results: Revenue from operations for India's second-largest software services company also grew by 5% year-on-year, amounting to Rs 40,986 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-auto-stocks-drive-market-correction-2618492-2024-10-17",
      "headline": "Sensex, Nifty end lower as auto stocks drive market correctionThe S&P BSE Sensex was down 494.75 points to close at 81,006.61, while the NSE Nifty50 lost 221.45 points to end at 24,749.85.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-plunges-over-500-points-nifty-below-25000-amid-market-sell-off-2618434-2024-10-17",
      "headline": "Sensex plunges over 500 points, Nifty below 25,000 amid market sell-offThe Sensex fell by 525.34 points, or 0.64%, at 80,976.02. Similarly, the Nifty dropped 222 points, or 0.89%, below the 25,000 mark at 24,749.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/impact-of-bomb-threats-on-airlines-ytvd-2618388-2024-10-17",
      "headline": "How bomb threats affect airlines financiallySanjay Lazar delves into the effects of bomb threats on the aviation industry, examining both financial and emotional impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-fully-subscribed-on-day-3-latest-subscription-gmp-allotment-dates-details-2618426-2024-10-17",
      "headline": "Hyundai IPO fully booked: Check latest subscription, GMP, allotment detailsHyundai Motor India IPO: The company's shares are set to be listed on both the BSE and NSE, with a tentative listing date of Tuesday, October 22, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/skipping-hyundai-ipo-over-low-gmp-3-strong-reasons-to-apply-anyway-expert-view-review-analysis-2618362-2024-10-17",
      "headline": "Skipping Hyundai IPO over low GMP? 3 strong reasons to apply anywayHyundai Motor India IPO: Unlike some recent IPOs that experienced high demand, Hyundai's offering has seen limited interest from investors over valuation concerns, with the expected listing gains also taking a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-job-cut-whatsapp-instagram-teams-as-tech-layoffs-drag-on-2618337-2024-10-17",
      "headline": "Meta job cuts hit WhatsApp, Instagram teams as tech layoffs drag onThe recent layoffs follow a pattern of restructuring that Meta has been pursuing for more than a year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bomb-hoaxes-on-flights-air-india-indigo-vistara-aviation-industrys-new-financial-headache-2618314-2024-10-17",
      "headline": "Hoax bomb threat on flights: Aviation industry's new financial headacheIn the past few days, Indian airlines have faced multiple hoaxes, forcing flight diversions and delays, piling up massive operational costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-latest-gmp-subscription-details-should-you-subscribe-2618291-2024-10-17",
      "headline": "Hyundai IPO: Big drop in GMP on day 3, should you subscribe?Hyundai Motor IPO: Despite concerns about short-term gains, some brokerages are optimistic about Hyundai's future. Read on to know whether you should subscribe to the public issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-acs-alone-will-consume-more-power-than-all-of-mexico-by-2035-energy-consumption-iea-report-2618282-2024-10-17",
      "headline": "'New' India's ACs alone will consume more power than all of Mexico by 2035India's growing demand for energy will soon outpace that of many nations, with air conditioners alone expected to consume more electricity than the entire power usage of Mexico by 2035."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/auto-stocks-see-share-decline-bajaj-auto-hero-motocorp-maruti-mahindra-eicher-motors-2618266-2024-10-17",
      "headline": "Bajaj Auto, Hero MotoCorp, Maruti: Why auto stocks are falling todayAuto stocks, including Bajaj Auto, Hero MotoCorp, Maruti, Eicher Motors, and M&M, saw significant declines in early Thursday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-shares-fall-10-percent-q2-results-explained-weak-sales-outlook-2618253-2024-10-17",
      "headline": "Explained: Why Bajaj Auto shares crashed 10% todayBajaj Auto shares dropped over 10% in early trade, following the company's Q2FY25 financial results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-early-trade-infosys-tcs-bajaj-auto-eicher-motors-rvnl-2618237-2024-10-17",
      "headline": "Sensex, Nifty decline in early trade; Infosys gains, Bajaj Auto sinks 9%The S&P BSE Sensex was down 315.93 points to 81,185.43 at 9:52 am, while the NSE Nifty50 fell 143.15 points to trade at 24,828.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-day-2-check-latest-subscription-gmp-expected-listing-gains-2617934-2024-10-16",
      "headline": "Hyundai IPO Day 2: Check latest subscription, GMPHyundai Motors India IPO: The bidding for the public issue will close on Thursday, with the allotment expected to be finalised by October 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sip-at-rs-100-does-it-make-sense-investment-tips-money-wealth-2617902-2024-10-16",
      "headline": "Mutual Fund SIPs at Rs 100: Does it make sense?A lower investment amount makes investing more accessible to a broader section of the population, particularly small-scale and first-time investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-partners-with-ey-india-to-address-post-sales-issues-report-2617851-2024-10-16",
      "headline": "Ola Electric partners with EY India to address post-sales issues: ReportEY India, one of the country's leading consultancy firms, has been engaged by Ola Electric to improve its after-sales services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-auto-it-stocks-technical-levels-indices-2617838-2024-10-16",
      "headline": "Sensex, Nifty end lower as auto and IT stocks drag; Trent down 4%The S&P BSE Sensex fell 318.76 points to 81,501.36, while the NSE Nifty50 ended 86.05 points lower to settle at 24,971.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-3-percent-basic-salary-impact-salary-of-central-government-employees-2617832-2024-10-16",
      "headline": "DA hiked by 3%: How will it impact salary of central government employeesThis decision to hike the DA was taken on Wednesday during a Cabinet meeting chaired by Prime Minister Narendra Modi, and was confirmed by Union Information & Broadcasting Minister Ashwini Vaishnaw."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-lawrence-bishnoi-gang-justin-trudeau-khalistan-2618516-2024-10-17",
      "headline": "Sought Lawrence Bishnoi gang members' extradition, Canada didn't respond: IndiaMEA spokesperson Randhir Jaiswal said that similar extradition requests of syndicates linked to the Bishnoi gang were made recently as well, but Canada has not responded yet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bahraich-murder-uttar-pradesh-durga-puja-procession-police-encounter-accused-killed-fleeing-to-nepal-2618461-2024-10-17",
      "headline": "2 Bahraich violence accused shot during encounter while trying to flee to NepalAccused, Sarfaraz alias Rinku and Taleem were shot at during the encounter that broke out near the Handa Basehri Canal near the international border when they were trying to flee to Nepal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/baba-siddique-murder-salman-khan-threat-lawrence-bishnoi-conspiracy-family-source-2618463-2024-10-17",
      "headline": "Deeper conspiracy behind Bishnoi gang's threats to Salman Khan: Family sourcesA sources in the family said that while the Lawrence Bishnoi gang has taken credit for Baba Siddique's killing, they believe the latest threats against Salman Khan could be a ploy to conceal a deeper and more elaborate conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shah-rukh-khan-among-most-handsome-actors-how-science-confirmed-2618391-2024-10-17",
      "headline": "How science confirmed SRK is genuinely a handsome actorA scientific study by cosmetic surgeon Dr Julian De Silva using face mapping software has placed Shah Rukh Khan in the 10th position among the world's most handsome men."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-46-all-out-lowest-total-tests-home-bengaluru-rohit-sharma-virat-kohli-2618371-2024-10-17",
      "headline": "46-all out: India bowled out for their lowest Test total at homeLowest Test Score, India vs New Zealand 1st Test: India were bowled out for 46, their third-lowest total in Test cricket history. There were as many as five ducks as Matt Henry and Will O'Rourke ran riot on an overcast day in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-jharkhand-assembly-election-congress-observers-coordinator-ashok-gehlot-charanjit-singh-channi-baghel-adhir-ranjan-2618386-2024-10-17",
      "headline": "Gehlot again! What's Congress's fascination with tired and retiredThe Congress, after humiliating setbacks in Haryana and Jammu and Kashmir, continues to rely on the same old leaders with questionable track records for upcoming elections in Maharashtra and Jharkhand. Despite promises to introspect, the party's fascination with the old guard is hard to fathom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-justin-trudeau-ministry-of-external-affairs-mea-hardeep-singh-nijjar-murder-probe-2618149-2024-10-17",
      "headline": "India calls out Trudeau's cavalier behaviour after he admits to no proof on NijjarThe Ministry of External Affairs slammed Trudeau's handling of the situation, stating that Canada had failed to provide any evidence to support its allegations against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-left-fuming-after-kl-rahuls-brain-fade-moment-at-slips-during-india-vs-new-zealand-in-bengaluru-2618438-2024-10-17",
      "headline": "Watch: Rohit Sharma left fuming after KL Rahul's brain-fade moment at slipsKL Rahul had a brain-fade moment during New Zealand's first innings as he let the ball go past him when Tom Latham edged towards the slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-israel-iron-dome-miss-missiles-protect-some-areas-arrow-3-shortage-netanyahu-iran-2618338-2024-10-17",
      "headline": "Why Israel might allow Iron Dome to miss some missilesLike doctors who had to make the cruel choice of letting some patients die during the Covid pandemic, Israel might have to pick which areas it wants to shield and which it doesn't from enemy missiles. With the cost of shooting down all missiles fired at residential areas taking a toll, Israel might have to make a cruel choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-ex-somy-ali-post-lawrence-bishnoi-zoom-call-rajsthan-temple-baba-siddique-2618379-2024-10-17",
      "headline": "Salman Khan's ex Somy Ali's message for Lawrence Bishnoi: Can we talk?Salman Khan's ex and actor, Somy Ali, has invited gangster Lawrence Bishnoi for a Zoom call. Based in the US, Somy reached out to Lawrence, who is currently incarcerated at Sabarmati Central Jail, through a social media post. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zakir-naik-radical-hate-preacher-pakistan-visit-journalist-mubasher-lucman-2618369-2024-10-17",
      "headline": "Zakir Naik India's worst export: Pakistani journalist on hate preacher's visitControversial Islamic preacher Zakir Naik, who is wanted in India on terror-linked charges, arrived in Pakistan on October 1 as a state guest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/military-couple-suicide-agra-delhi-flight-lieutenant-husband-captain-wife-delhi-cantt-guest-house-2618406-2024-10-17",
      "headline": "Couple, Army and IAF officers, die by suicide 240 km apart: 'Cremate us together'IAF Flight Lieutenant Deendayal Deep was posted to the Air Force Station in Agra, while his Army Captain wife, Renu Tanwar lived in a guest house at the Delhi Cantonment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-cabinet-ministers-caste-equations-obc-dalit-brahmin-jats-nayab-saini-2618404-2024-10-17",
      "headline": "How Nayab Saini balanced caste equations in new Haryana CabinetNayab Singh Saini was sworn in as the Haryana Chief Minister for the second consecutive time. Thirteen BJP MLAs took oath as Haryana ministers. Here is how the new Haryana Cabinet shapes up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zoho-ceo-sridhar-vembu-reacts-to-former-infosys-cfo-mohandas-pai-ignored-bengaluru-post-2618324-2024-10-17",
      "headline": "Zoho CEO on Mohandas Pai's 'Bengaluru ignored' post: Stop North-South politicsZoho CEO Sridhar Vembu reacted to former Infosys CFO Mohandas Pai's post in which he slammed the Centre for 'ignoring' Bengaluru while launching a major AI initiative in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-fox-news-interview-donald-trump-unfit-unstable-interruptions-talking-over-2618321-2024-10-17",
      "headline": "Kamala Harris rips 'unstable' Trump, spars with anchor in fiery Fox News interviewThroughout the interview, Kamala Harris called Donald Trump \"unfit\" and \"dangerous\", and cited assessments from his former advisers to make it clear that he would be a threat to democracy if re-elected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hemang-badani-named-delhi-capitals-head-coach-venugopal-rao-director-of-cricket-2618465-2024-10-17",
      "headline": "Hemang Badani named Delhi Capitals head coach, Venugopal Rao Director of CricketFormer India batter Hemang Badani will take over as the new head coach at Delhi Capitals (DC) for IPL 2025. Along with Badani, DC has also appointed former India batter Venugopal Rao as the director of cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-court-arrest-warrant-sheikh-hasina-student-deaths-protests-quota-government-jobs-2618444-2024-10-17",
      "headline": "Bangladesh court issues arrest warrant for Sheikh Hasina over student deathsBangladesh's International Crimes Tribunal directed the concerned authorities to produce Hasina before it after arresting her by November 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-school-teacher-dies-in-goa-wanted-to-meet-actor-in-his-last-days-2618436-2024-10-17",
      "headline": "Shah Rukh Khan's school teacher dies in Goa, wanted to meet actor in his last daysActor Shah Rukh Khan's teacher from his Delhi school, whom he called his 'guiding light', died in Goa on Sunday, October 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/skipping-hyundai-ipo-over-low-gmp-3-strong-reasons-to-apply-anyway-expert-view-review-analysis-2618362-2024-10-17",
      "headline": "Skipping Hyundai IPO over low GMP? 3 strong reasons to apply anywayHyundai Motor India IPO: Unlike some recent IPOs that experienced high demand, Hyundai's offering has seen limited interest from investors over valuation concerns, with the expected listing gains also taking a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-championship-powerlifting-gold-medal-mumbai-boy-down-syndrome-2618459-2024-10-17",
      "headline": "Mumbai boy with Down syndrome wins Asian powerlifting gold medal Seventeen-year-old Prithviraj Sengupta, a rising star in powerlifting, won gold at the Asian Powerlifting Championship. Despite his Down syndrome, he triumphed through sheer determination, mentorship, and support from his family, setting his sights on the Olympics while excelling in baking and dance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-slams-justin-trudeau-admission-khalistani-terrorist-hardeep-singh-nijjar-killing-2618290-2024-10-17",
      "headline": "Opposition in India slams Trudeau's 'hypocrisy' after admission on Nijjar killingJustin Trudeau on Wednesday admitted that his country only had intelligence and no proof against India in the killing of Khalistani terrorist Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-on-the-downside-of-devdas-started-drinking-after-the-film-sanjay-leela-bhansali-2618472-2024-10-17",
      "headline": "Shah Rukh Khan on the 'downside' of Devdas: Started drinking after the filmShah Rukh Khan shared insights on portraying Devdas in the 2002 film by Sanjay Leela Bhansali. He reflected on his approach, the challenges faced, and his motivations behind taking on the iconic role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-support-cancer-patients-new-initiative-indian-cancer-institute-2618477-2024-10-17",
      "headline": "Singer Mika Singh to support cancer patients through new initiative Singer Mika Singh recently inaugurated the Indian Cancer Institute in New Delhi. The singer, who partnered with ICI's founding member Dr Tarang Krishna, vowed to give free treatment to underprivileged people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fardeen-khan-on-welcoming-daughter-via-ivf-missing-children-amid-divorce-rumours-2618468-2024-10-17",
      "headline": "Fardeen Khan on welcoming daughter via IVF, missing children amid divorce rumoursActor Fardeen Khan opened up on taking a break to enjoy fatherhood. He also talked about welcoming his daughter through IVF, and how he misses his children who do not live with him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhotra-kiara-advani-in-talks-with-maddock-films-for-a-romantic-drama-2618460-2024-10-17",
      "headline": "Sidharth-Kiara Advani in talks with Maddock Films for a romantic dramaBollywood's celebrity couple, Sidharth Malhotra and Kiaran Advani, are currently in talks to star in a romantic film with fantastical elements. The project will most likely be produced by Maddock Films. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-angry-shouts-sarfaraz-khan-fielding-bengaluru-test-2618512-2024-10-17",
      "headline": "Watch: Angry Rohit Sharma scolds Sarfaraz Khan on field during Bengaluru TestIndia's horror show on Day 1 of the Bengaluru Test saw Rohit Sharma lash out at Sarfaraz Khan for being out of position while fielding. New Zealand bowlers, led by Tim Southee, wreaked havoc, bowling India out for their lowest home-Test total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uncertainty-looms-over-icc-champions-trophy-2025-amid-india-pakistan-tensions-2618506-2024-10-17",
      "headline": "Uncertainty looms over ICC Champions Trophy 2025 amid India-Pakistan tensionsChampions Trophy 2025: The future of the ICC tournament is increasingly uncertain as discussions surrounding India's potential participation in Pakistan continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-compares-indian-and-new-zealand-batters-approach-on-bengaluru-pitch-2618498-2024-10-17",
      "headline": "Anil Kumble compares Indian and New Zealand batters' approach on Bengaluru pitchAnil Kumble drew comparisons between the Indian and New Zealand batters' approach on the Bengaluru pitch, which had both pace and swing to offer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-schedule-political-tensions-2618494-2024-10-17",
      "headline": "When India vs Pakistan schedule had to be altered due to political tensions Schedule of matches between India and Pakistan have been changed several times due to political tensions between the two nations. The arch-rivals haven't played in a bilateral series since January 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hemang-badani-named-delhi-capitals-head-coach-venugopal-rao-director-of-cricket-2618465-2024-10-17",
      "headline": "Hemang Badani named Delhi Capitals head coach, Venugopal Rao Director of CricketFormer India batter Hemang Badani will take over as the new head coach at Delhi Capitals (DC) for IPL 2025. Along with Badani, DC has also appointed former India batter Venugopal Rao as the director of cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-championship-powerlifting-gold-medal-mumbai-boy-down-syndrome-2618459-2024-10-17",
      "headline": "Mumbai boy with Down syndrome wins Asian powerlifting gold medal Seventeen-year-old Prithviraj Sengupta, a rising star in powerlifting, won gold at the Asian Powerlifting Championship. Despite his Down syndrome, he triumphed through sheer determination, mentorship, and support from his family, setting his sights on the Olympics while excelling in baking and dance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-director-of-cricket-jsw-sports-delhi-capitals-ipl-wpl-2618449-2024-10-17",
      "headline": "After operational change at Delhi Capitals, Sourav Ganguly gets new role at JSWHours after Delhi Capitals' owners JSW Group and GMR Group announced an operational restructuring, Sourav Ganguly was appointed as the Director of Cricket of the JSW Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-left-fuming-after-kl-rahuls-brain-fade-moment-at-slips-during-india-vs-new-zealand-in-bengaluru-2618438-2024-10-17",
      "headline": "Watch: Rohit Sharma left fuming after KL Rahul's brain-fade moment at slipsKL Rahul had a brain-fade moment during New Zealand's first innings as he let the ball go past him when Tom Latham edged towards the slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-gautam-gambhir-400-in-a-day-troll-46-all-out-bengaluru-test-2618439-2024-10-17",
      "headline": "Gambhir's '400 in day' comment gets trolled after India's 46 all-outIndian fans trolled head coach Gautam Gambhir after India's shocking collapse for 46 runs in the first Test against New Zealand, reminding him of his bold pre-match claim that the team could score 400 runs in a single day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-46-all-out-cricket-australia-tweet-bengaluru-2618416-2024-10-17",
      "headline": "46 all-out new 36 all-out? Cricket Australia trolls India's Bengaluru collapseCricket Australia decided to troll India after they were bundled out for 46 runs in the first innings of the first Test against New Zealand on October 17, Thursday. This was India's 3rd lowest total in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-46-all-out-meme-fest-rcb-49-2618408-2024-10-17",
      "headline": "RCB 49, India 46: Bengaluru Test horror show sparks meme-fest on social mediaLowest Test Score, India vs New Zealand 1st Test: Meme makers had a field day after India were bundled out for 46, the lowest Test total in India. A section of fans referred to RCB's lowest total in the IPL -- 49 while cheekily lauding Mohammed Siraj for remaining unbeaten. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-director-of-cricket-jsw-sports-delhi-capitals-ipl-wpl-2618449-2024-10-17",
      "headline": "After operational change at Delhi Capitals, Sourav Ganguly gets new role at JSWHours after Delhi Capitals' owners JSW Group and GMR Group announced an operational restructuring, Sourav Ganguly was appointed as the Director of Cricket of the JSW Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-left-fuming-after-kl-rahuls-brain-fade-moment-at-slips-during-india-vs-new-zealand-in-bengaluru-2618438-2024-10-17",
      "headline": "Watch: Rohit Sharma left fuming after KL Rahul's brain-fade moment at slipsKL Rahul had a brain-fade moment during New Zealand's first innings as he let the ball go past him when Tom Latham edged towards the slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-gautam-gambhir-400-in-a-day-troll-46-all-out-bengaluru-test-2618439-2024-10-17",
      "headline": "Gambhir's '400 in day' comment gets trolled after India's 46 all-outIndian fans trolled head coach Gautam Gambhir after India's shocking collapse for 46 runs in the first Test against New Zealand, reminding him of his bold pre-match claim that the team could score 400 runs in a single day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-46-all-out-cricket-australia-tweet-bengaluru-2618416-2024-10-17",
      "headline": "46 all-out new 36 all-out? Cricket Australia trolls India's Bengaluru collapseCricket Australia decided to troll India after they were bundled out for 46 runs in the first innings of the first Test against New Zealand on October 17, Thursday. This was India's 3rd lowest total in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-46-all-out-meme-fest-rcb-49-2618408-2024-10-17",
      "headline": "RCB 49, India 46: Bengaluru Test horror show sparks meme-fest on social mediaLowest Test Score, India vs New Zealand 1st Test: Meme makers had a field day after India were bundled out for 46, the lowest Test total in India. A section of fans referred to RCB's lowest total in the IPL -- 49 while cheekily lauding Mohammed Siraj for remaining unbeaten. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/five-star-matt-henry-celebrates-100-wicket-milestone-decimates-india-in-bengaluru-india-vs-new-zealand-2618405-2024-10-17",
      "headline": "5-star Matt Henry celebrates 100-wicket milestone, decimates India in 1st TestMatt Henry picked up his fifth five-wicket haul in Tests for New Zealand as he also became the 2nd fastest for his country to complete a 100-wicket milestone in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-46-all-out-lowest-total-tests-home-bengaluru-rohit-sharma-virat-kohli-2618371-2024-10-17",
      "headline": "46-all out: India bowled out for their lowest Test total at homeLowest Test Score, India vs New Zealand 1st Test: India were bowled out for 46, their third-lowest total in Test cricket history. There were as many as five ducks as Matt Henry and Will O'Rourke ran riot on an overcast day in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-up-yoddhas-swot-analysis-surender-gill-2618366-2024-10-17",
      "headline": "Pro Kabaddi League: UP Yoddhas aim for playoffs in season 11After a lacklustre season 10 of the Pro Kabaddi League, UP Yoddhas will be hoping to get back into the playoffs during the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-missed-cheteshwar-pujaras-approach-vs-new-zealand-anil-kumble-2618358-2024-10-17",
      "headline": "India missed Cheteshwar Pujara's approach vs New Zealand: Anil KumbleAnil Kumble felt that an 'attacking' India missed Cheteshwar Pujara-like approach in their collapse in the 1st Test against New Zealand. In Shubman Gill's absence, Virat Kohli batted at No. 3 and fell for a duck. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-operational-changes-gmr-jsw-auction-decisions-2618352-2024-10-17",
      "headline": "Delhi Capitals announce major operational changes before IPL 2025The Delhi Capitals have announced major operational changes ahead of the IPL 2025 auction on Thursday, October 17. GMR and JSW groups will be alternating the operations of Delhi Capitals men and women's team after a 2-year cycle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-emotional-celebration-for-pakistan-as-sajid-khan-takes-7-wicket-haul-vs-england-in-multan-in-2nd-test-2618307-2024-10-17",
      "headline": "Watch: Sajid Khan's emotional celebration after 7-wicket haul on Test returnSajid Khan took 7 wickets against England as he recorded his 2nd five-wicket haul in Test cricket for Pakistan. The team shared an emotional moment as the players gathered to hig Sajid as he completed the milestone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wr-chess-masters-praggnanandhaa-beats-anand-loses-arjun-erigaisi-2618301-2024-10-17",
      "headline": "Pragg beats mentor Viswanathan Anand, loses to Arjun in WR Chess MastersWR Chess Masters 2024: Rameshbabu Praggnanandhaa beat Viswanathan Anand in the quarterfinal, outclassing his mentor in Armageddon. However, he lost to Arjun Erigaisi in the semi-final in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-operational-changes-gmr-jsw-auction-decisions-2618352-2024-10-17",
      "headline": "Delhi Capitals announce major operational changes before IPL 2025The Delhi Capitals have announced major operational changes ahead of the IPL 2025 auction on Thursday, October 17. GMR and JSW groups will be alternating the operations of Delhi Capitals men and women's team after a 2-year cycle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-emotional-celebration-for-pakistan-as-sajid-khan-takes-7-wicket-haul-vs-england-in-multan-in-2nd-test-2618307-2024-10-17",
      "headline": "Watch: Sajid Khan's emotional celebration after 7-wicket haul on Test returnSajid Khan took 7 wickets against England as he recorded his 2nd five-wicket haul in Test cricket for Pakistan. The team shared an emotional moment as the players gathered to hig Sajid as he completed the milestone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wr-chess-masters-praggnanandhaa-beats-anand-loses-arjun-erigaisi-2618301-2024-10-17",
      "headline": "Pragg beats mentor Viswanathan Anand, loses to Arjun in WR Chess MastersWR Chess Masters 2024: Rameshbabu Praggnanandhaa beat Viswanathan Anand in the quarterfinal, outclassing his mentor in Armageddon. However, he lost to Arjun Erigaisi in the semi-final in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-two-rohit-sharma-gautam-gambhir-tactics-bengaluru-2618284-2024-10-17",
      "headline": "Overconfidence? Fans slam India tactics in difficult Bengaluru conditionsThe fans have slammed the Indian team for their tactics as the hosts were wrecked in the first hour of play after electing to bat first on Day 2 of the Bengaluru Test on October 17, Thursday. India lost 3 wickets for just 13 runs in the first hour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-sarfaraz-khan-scores-duck-as-devon-conway-takes-a-diving-catch-in-ind-vs-nz-2618267-2024-10-17",
      "headline": "Watch: Sarfaraz Khan scores duck as Devon Conway takes a diving catch in IND vs NZSarfaraz Khan scored his very first duck in Test cricket for India as Devon Conway took his diving catch on Day 2 of the 1st Test between India and New Zealand at M Chinnaswamy Stadium in Bengaluru on October 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-virat-kohli-duck-number-three-bengaluru-2618242-2024-10-17",
      "headline": "IND vs NZ: Virat Kohli out for 0 on return to No. 3 after 8 yearsVirat Kohli's return to the number three spot ended in disaster as the star batter was dismissed for a 9-ball duck against New Zealand in the Bengaluru Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/diana-edulji-welcomes-neetu-david-in-icc-hall-of-fame-cant-think-of-anyone-more-deserving-2618229-2024-10-17",
      "headline": "Edulji welcomes David in ICC Hall of Fame: Can't think of anyone more deservingDiana Edulji welcomed Neetu David in the ICC Hall of Fame as she became only the 2nd Indian woman to be inducted. She penned a heartfelt note and said that she couldn't think of anyone better than her join the Hall of Fame. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}