{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-agm-2025-gautam-adani-unveils-big-investment-plans-2745344-2025-06-24",
      "headline": "Adani AGM 2025: Gautam Adani announces $15–20 billion yearly capex for 5 yearsAhead of its AGM, Adani Airports Holdings Limited (AAHL) on Tuesday confirmed securing $1 billion in project finance for Mumbai International Airport Ltd (MIAL), which operates the Chhatrapati Shivaji Maharaj International Airport (CSMIA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/your-ctc-is-lying-to-you-ca-on-salary-illusions-most-people-miss-2745338-2025-06-24",
      "headline": "Your CTC is lying to you: CA points out salary details most people overlookThe post is part caution and part financial literacy reminder. It challenges employees to take ownership of their earnings and not just celebrate the illusion of a big CTC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-prices-dip-after-iran-israel-ceasefire-indian-stocks-mixed-gains-rbi-rate-cut-2745313-2025-06-24",
      "headline": "Explained: Why are oil sector stocks rising today?The ceasefire announcement made by US President Donald Trump triggered a decline in oil prices, which had experienced a prior surge due to geopolitical tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-enviro-infra-engineers-share-price-jumped-11-in-early-trade-2745296-2025-06-24",
      "headline": "Explained: Why Enviro Infra Engineers share price jumped 11% in early tradeAt around 9:48 am, the company's stock was trading at Rs 233.50 apiece on the Bombay Stock Exchange (BSE), up 10.43% from the previous close."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-900-points-why-is-the-stock-market-rising-today-2745287-2025-06-24",
      "headline": "Sensex jumps 900 points: Why is the stock market rising today?At around 9:22 am, the S&P BSE Sensex was up 869.86 points at 82,766.65, while the NSE Nifty50 jumped 262.75 points to 25,234.65. Broader markets also mirrored the upbeat sentiment, with volatility declining across the board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-rally-sensex-jumps-800-points-nifty-goes-past-25200-adani-ports-up-4-percent-2745277-2025-06-24",
      "headline": "Sensex jumps 800 points. Nifty goes past 25,200; Adani Ports up 4%The S&P BSE Sensex was up 576.42 points to 82,473.21, while the NSE Nifty50 gained 194.05 points to 25,165.95 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-higher-iran-israel-ceasefire-oil-prices-indian-markets-2745257-2025-06-24",
      "headline": "Sensex and Nifty to open higher as Iran-Israel ceasefire eases oil pricesThe Gift Nifty futures were trading at 25,297.50 as of 8:10 a.m., indicating that the Nifty50 will open above its previous close of 24,971.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-iran-israel-ceasefire-sensex-nifty-dixon-tech-enviro-infra-tata-motors-adani-energy-2745255-2025-06-24",
      "headline": "Stocks to watch today: Dixon Tech, Enviro Infra, Tata Motors, Adani EnergyThe benchmark indices fell over half a percent on Monday. However, reports suggesting a possible ceasefire between Iran and Israel could help bring some stability to the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/israel-iran-conflict-will-irans-threat-to-close-the-hormuz-strait-affect-india-2745114-2025-06-23",
      "headline": "Israel-Iran conflict: Will Iran's threat to close the Hormuz Strait affect India?This episode of the Super 6 programme discusses the potential impact on India if Iran closes the Strait of Hormuz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-rs-1-crore-to-rs-25-lakh-in-20-years-how-inflation-quietly-shrinks-your-wealth-2745051-2025-06-23",
      "headline": "From Rs 1 crore to Rs 25 lakh: How inflation quietly shrinks your wealthUnderstanding the impact of inflation on wealth and the necessity of strategic investing to preserve financial security over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-lose-in-indian-real-estate-expert-explains-what-the-top-1-percent-do-instead-2745007-2025-06-23",
      "headline": "90% lose in real estate, expert explains what the top 1% do insteadA real estate advisor explains why the majority of buyers in India are not profiting from real estate, while a select few succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-511-points-lower-nifty-below-25000-it-stocks-down-hcl-infosys-2744997-2025-06-23",
      "headline": "Sensex ends 511 points lower, Nifty settles below 25,000; HCLTech down 2%The S&P BSE Sensex fell by 511.38 points to close at 81,896.79, while the NSE Nifty50 lost 140.50 points to end at 24,971.90. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-stands-by-punjab-95-amid-sardaar-ji-3-backlash-shares-damning-note-titled-censored-before-release-2745352-2025-06-24",
      "headline": "Censored before release: Diljit stands by Punjab 95 amid Sardaar Ji 3 backlashDiljit Dosanjh has refused to agree to the 127 cuts suggested by the censor board to his film 'Punjab 95', which is based on the real-life human rights activist Jaswant Singh Khalra. The actor now shared a strong note criticising the board for stifling the voice asking an uncomfortable question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-paris-fashion-week-debut-heres-all-you-need-to-know-2745347-2025-06-24",
      "headline": "Badshah gears up for Paris Fashion Week debut, here's all you need to knowIndian rapper Badshah is all set to make history as he debuts at Paris Fashion Week 2026. Invited by luxury designer Mike Amiri, he will be the only Indian artist at the exclusive event, marking a significant milestone for Indian representation in global fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-crushology-101-cast-roh-jeong-eui-lee-chae-min-call-india-warm-hearted-and-beautiful-2745307-2025-06-24",
      "headline": "Exclusive: Crushology 101 cast thinks India is warm hearted and beautifulCrushology 101 is a heartfelt university romance drama now streaming on Channel K in India, capturing the essence of youthful emotions and campus chaos. The cast Roh Jeong-eui, Lee Chae-min and Cho Jun-young spoke to India Today about the drama and described India the best way they could. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-brad-pitt-bromance-light-up-f1-london-premiere-pics-2745293-2025-06-24",
      "headline": "Tom Cruise and Brad Pitt's bromance light up F1 London premiere. PicsActor Tom Cruise recently reunited with his 'Interview with the Vampire' (1994) co-star Brad Pitt in London. Cruise and Pitt hugged at the London premiere of the latter's upcoming film, 'F1'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-breaks-silence-on-what-went-wrong-with-dhoom-3-aditya-chopra-2745303-2025-06-24",
      "headline": "Aamir Khan breaks silence on what went wrong with Dhoom 3Aamir Khan recently shared his views on what went wrong with 'Dhoom 3'. The actor explained what could have been done to the script to make it more relatable to fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-4-detailed-report-aamir-khan-film-smashes-taare-zameen-par-laal-singh-eyes-ghajini-2745301-2025-06-24",
      "headline": "Sitaare Zameen Par box office Day 4: Aamir's film past TZP, Laal Singh, eyes Ghajini'Sitaare Zameen Par' has already surpassed its predecessor, 'Taare Zameen Par', in just four days at the box office. The film is now eyeing the benchmark of Rs 100 crore to beat 'Ghajini' next. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-lucky-have-priyanka-chopra-actor-sweet-comment-wins-hearts-broadway-show-party-the-last-five-years-2745284-2025-06-24",
      "headline": "Nick Jonas feels lucky to have Priyanka Chopra, actor's sweet comment wins heartsNick Jonas's recent picture with wife Priyanka Chopra has left fans swooning over the two. Take a look at the photo here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-ramoji-film-city-haunted-remark-backlash-calls-it-safe-2745283-2025-06-24",
      "headline": "Kajol calls Ramoji Film City safe after facing backlash for haunted remarkBollywood actor Kajol, during the promotions of 'Maa', called Hyderabad's Ramoji Film City 'haunted'. Days after facing severe backlash, she clarified her remark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-collection-day-3-dhanush-nagarjuna-film-crosses-rs-50-crore-in-india-2745269-2025-06-24",
      "headline": "Kuberaa box office Day 4: Dhanush's film sees dip, crosses Rs 50 crore in IndiaDhanush and Nagarjuna-starrer 'Kuberaa' crossed Rs 50 crore nett in India in four days. While the Telugu version is minting numbers, the Tamil version seems to be struggling at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vineet-kumar-singh-returns-mumbai-stranded-dubai-airport-amid-middle-east-tensions-iran-missile-2745264-2025-06-24",
      "headline": "Actor Vineet Kumar back home after being stuck in Dubai amid Middle East crisisActor Vineet Kumar Singh safely returned to Mumbai after being stranded at Dubai airport. This came amid emergency airspace closure in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-makers-banned-sever-ties-pakistani-actor-hania-aamir-casting-row-2745253-2025-06-24",
      "headline": "Sever ties with Diljit, Sardaar Ji 3 makers: Film body over Pak actor casting rowThe Federation of Western Indian Cine Employees (FWICE) issued a directive against Diljit Dosanjh and the makers of 'Sardaar Ji 3' for hiring Pakistani actor Hania Aamir. Calling it an anti-national act, the film body demanded an industry blacklist and cancellation of their passport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-review-election-drama-underwhelms-scattered-plots-faded-charm-2745111-2025-06-24",
      "headline": "Panchayat Season 4 review: Election drama overshadows emotional warmthReleased-Tue Jun 24, 2025'Panchayat Season 4' review: The TVF series returns with a focus on village elections but lacks the emotional depth of earlier seasons. Fans may find the plot scattered and unconvincing arcs despite strong performances from some actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-gives-12-inches-of-hair-to-charity-thanks-her-dad-anil-kapoor-for-genes-2745133-2025-06-23",
      "headline": "Sonam Kapoor donates 12 inches of hair to charity, thanks her father for good genesActor Sonam Kapoor underwent a hair makeover on Monday as she decided to chop off 12 inches of her hair and give it to charity. She also thanked her father Anil Kapoor for good genes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-sister-mandhira-didnt-speak-for-last-four-years-due-to-ego-2745003-2025-06-23",
      "headline": "Sunjay Kapur's sister shares emotional post: We didn't speak for 4 years due to egoLate businessman Sunjay Kapur's sister Mandhira shared an emotional note on Instagram on Sunday. She said that they hadn't spoken to each other for the last four years, and that she regretted not mending their relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-in-talks-to-play-meena-kumari-in-upcoming-biopic-2745130-2025-06-23",
      "headline": "Kiara Advani in talks to play Meena Kumari in upcoming biopicActor Kiara Advani has been approached to play Meena Kumari in an upcoming biopic backed by Sidharth P Malhotra, Saregama, and the Amrohi family. If she signs on, it could be her first film post-pregnancy and one of the most emotionally intense roles of her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-praises-nagarjuna-for-picking-bold-roles-like-in-kuberaa-2745128-2025-06-23",
      "headline": "Chiranjeevi praises Nagarjuna for taking on bold roles like KuberaaAt the grand success meet of 'Kuberaa', Chiranjeevi praised Nagarjuna's career choices, calling him an inspiration for embracing bold and character-driven roles in an era dominated by star-centric films.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-and-zaheer-iqbal-celebrate-1st-wedding-anniversary-see-pics-2745105-2025-06-23",
      "headline": "Sonakshi Sinha and Zaheer Iqbal celebrate 1st wedding anniversary. See picsActor Sonakshi Sinha shared photos from her first wedding anniversary celebrations with actor-husband Zaheer Iqbal on Monday. She shared the photos on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-cheers-nick-jonas-with-a-sweet-note-as-he-takes-final-bow-2745100-2025-06-23",
      "headline": "Priyanka Chopra gives a shoutout to Nick Jonas after closing show of his Broadway playPriyanka Chopra cheered for husband Nick Jonas during his final Broadway performance of 'The Last Five Years'. Despite a packed schedule promoting 'Heads of State', she made time to support him and shared a heartfelt message on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-team-faces-plagiarism-charges-as-madras-high-court-issues-legal-notice-2744892-2025-06-23",
      "headline": "Nani's HIT 3 team faces plagiarism charges as Madras High court issues legal noticeAfter a successful theatrical run, 'HIT: The third case' lands in legal trouble as writer Vimalavelan files a plagiarism case, prompting the Madras High Court to issue a notice to the film's team."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-accepts-us-ceasefire-proposal-netanyahu-thanks-trump-for-helping-end-iranian-nuclear-threat-2745359-2025-06-24",
      "headline": "Iranian nuke threat removed: Israel accepts truce deal, Netanyahu thanks TrumpIsrael has officially accepted the ceasefire proposal brokered by the US, with Prime Minister Benjamin Netanyahu saying that the country was able to successfully end the Iranian nuclear threat. He also thanked US President Donald Trump for his help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-donald-trump-brokered-israel-iran-ceasefire-agreement-nuclear-program-2745306-2025-06-24",
      "headline": "Get me Bibi, we are going to make peace: How Trump brokered Israel-Iran truceIsrael-Iran ceasefire: The eccentric US President took it upon himself to convince Netanyahu to agree to a ceasefire as the conflict was showing signs of engulfing the whole Middle East region. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-agm-2025-gautam-adani-unveils-big-investment-plans-2745344-2025-06-24",
      "headline": "Adani AGM 2025: Gautam Adani denies US bribery charges, asserts group's clean recordAhead of its AGM, Adani Airports Holdings Limited (AAHL) on Tuesday confirmed securing $1 billion in project finance for Mumbai International Airport Ltd (MIAL), which operates the Chhatrapati Shivaji Maharaj International Airport (CSMIA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-redemption-test-opener-leeds-2745299-2025-06-24",
      "headline": "KL Rahul takes the lead: A Headingley statement years in the makingYears of silence, shifting roles, and unanswered questions found their reckoning at Headingley. KL Rahul, India's quiet constant, didn't just score a century - he reaffirmed himself as the pillar of a Test team rediscovering its rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-stands-by-punjab-95-amid-sardaar-ji-3-backlash-shares-damning-note-titled-censored-before-release-2745352-2025-06-24",
      "headline": "Censored before release: Diljit stands by Punjab 95 amid Sardaar Ji 3 backlashDiljit Dosanjh has refused to agree to the 127 cuts suggested by the censor board to his film 'Punjab 95', which is based on the real-life human rights activist Jaswant Singh Khalra. The actor now shared a strong note criticising the board for stifling the voice asking an uncomfortable question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-and-iran-have-agreed-to-a-total-ceasefire-says-donald-trump-glbs-2745228-2025-06-24",
      "headline": "Trump says Israel-Iran ceasefire now in effect, please do not violateIranian state-run media announced that the ceasefire had begun following 'four waves of Iranian attacks on Israeli-occupied territories.' Trump then took to his Truth Social platform to urge both sides not to violate the ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/never-said-govt-has-no-money-clarifies-parameshwara-after-we-have-no-money-comment-at-badami-bagalkot-2745353-2025-06-24",
      "headline": "Who said it? Karnataka Home Minister's U-turn after 'we have no money' remarkContradicting his earlier statement, Karnataka Home Minister G Parameshwara insisted he never claimed the state lacked funds. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-mossad-covert-spy-operation-on-iran-drone-strikes-nuclear-targets-drone-weapon-smuggle-2744958-2025-06-24",
      "headline": "How Israeli spies sneaked in weapons, hit Iranian missiles from inside IranIsrael had for years prepared for this day. Just as Israel's jets hit Iran's nuclear facilities on June 13, armed drones and precision weapons smuggled into the Islamic Republic by Mossad operatives crippled Tehran's ability to detect Israeli planes and shot down missiles aimed at them from within its borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-review-election-drama-underwhelms-scattered-plots-faded-charm-2745111-2025-06-24",
      "headline": "Panchayat Season 4 review: Election drama overshadows emotional warmthReleased-Tue Jun 24, 2025'Panchayat Season 4' review: The TVF series returns with a focus on village elections but lacks the emotional depth of earlier seasons. Fans may find the plot scattered and unconvincing arcs despite strong performances from some actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) System for Treatment of Severe Mitral RegurgitationThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Live: Netanyahu says Israel has achieved goal of removing Iranian nuke threatIsrael has claimed that Iran has launched continuous missile attacks despite US President Donald Trump announcing that the two countries had reached a ceasefire agreement early on Tuesday. Trump's announced that after nearly two weeks of military hostilities, Israel and Iran reached an agreement to stop an exchange of fire after what should be called a \"12-day war \". \r\n\r\nHowever, Iran rejected Trump's claim, saying that no such agreement had been reached, saying Tehran will only stop fire if Israel first does so. Later, Iran's Foreign Minister Seyed Abbas Araghchi hinted at a ceasefire as he thanked his armed forces for \"punishing Israel till the very last minute\" till 4 am on Tuesday. Follow IndiaToday.in for latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/doha-mall-viral-video-iran-targets-us-base-in-qatar-clip-shows-shoppers-fleeing-2745300-2025-06-24",
      "headline": "Panic grips Doha mall as Iran targets US base in Qatar. Video shows shoppers fleeingA missile strike by Iran on a US base in Qatar triggered chaos in Doha. A now-viral video shows shoppers fleeing a mall in panic. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/former-bjp-mp-anantkumar-hegde-booked-for-assaulting-muslim-family-in-tumakuru-road-rage-case-karnataka-2745339-2025-06-24",
      "headline": "Former BJP MP accused of attacking Muslim family in road rage case in KarnatakaA case was filed against former BJP MP from Karnataka, Anantkumar Hegde, for assault, hurling casteist abuse, and issuing death threats to a Muslim family, in a road rage incident near Tumakuru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/congress-clinches-nilambur-in-high-stakes-by-election-left-front-faces-setback-2745297-2025-06-24",
      "headline": "Congress's win in high-stakes Kerala bypoll warning for Pinarayi Vijayan?The Congress-led UDF's win in Nilambur by-election delivers a strong message ahead of Kerala's 2026 Assembly polls, exposing cracks within the ruling LDF and reaffirming growing anti-incumbency against the Pinarayi Vijayan government. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-axiom-4-mission-launch-june-25-nasa-2745236-2025-06-24",
      "headline": "Astronaut Shubhanshu Shukla's Axiom-4 launch likely tomorrow, says NasaThe launch of the Ax-4 mission, which was initially scheduled to take off on May 29, has been repeatedly delayed due to technical issues, weather conditions and leaks on the International Space Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/is-coffee-adulteration-for-real-2745115-2025-06-24",
      "headline": "Is coffee adulteration for real?A video about coffee adulteration raised numerous questions in our minds. We did what we do best - investigate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-rishabh-pant-kl-rahul-headingley-leeds-2745217-2025-06-24",
      "headline": "A Song of Ice and Fire: Pant's bravado meets Rahul's composure in LeedsIndia batters Rishabh Pant and KL Rahul stitched together a marvellous partnership on Day 4 of the first Test against England at Headingley, Leeds. The duo recreated a 'song of Ice and Fire' at the crease, complementing each other beautifully as they navigated different phases of the innings with their contrasting styles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-does-not-use-computer-his-lawyer-claims-2745281-2025-06-24",
      "headline": "Elon Musk does not use computer, his lawyer claimsElon Musk's lawyer says he does not use a computer. But screenshots and posts shared by Musk himself tell a different story, with multiple public references to laptops and gaming setups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/oic-india-unwanted-remarks-on-indian-muslims-two-day-foreign-ministerial-conclave-istanbul-2745272-2025-06-24",
      "headline": "Unwarranted: New Delhi slams Islamic bloc's remarks on Indian MuslimsIndia's strong reactions came after a two-day foreign ministerial conclave of the OIC in Turkey criticised New Delhi on a range of issues including what it said is \"social marginalisation\" of Indian Muslims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-brad-pitt-bromance-light-up-f1-london-premiere-pics-2745293-2025-06-24",
      "headline": "Tom Cruise and Brad Pitt's bromance light up F1 London premiere. PicsActor Tom Cruise recently reunited with his 'Interview with the Vampire' (1994) co-star Brad Pitt in London. Cruise and Pitt hugged at the London premiere of the latter's upcoming film, 'F1'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/your-ctc-is-lying-to-you-ca-on-salary-illusions-most-people-miss-2745338-2025-06-24",
      "headline": "Your CTC is lying to you: CA points out salary details most people overlookThe post is part caution and part financial literacy reminder. It challenges employees to take ownership of their earnings and not just celebrate the illusion of a big CTC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/wildfires-contaminate-water-quality-for-nearly-a-decade-after-the-blaze-2745110-2025-06-24",
      "headline": "Wildfires contaminate water quality for nearly a decade after the blazeThe results showed contaminants like organic carbon, phosphorus, nitrogen, and sediment can degrade water quality for up to eight years after a fire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gangster-romil-vohra-killed-encounter-delhi-haryana-border-kala-rana-noni-rana-gang-2745294-2025-06-24",
      "headline": "Gangster, wanted for liquor baron's murder, killed in encounter at Delhi borderRomil Vohra was a sharpshooter associated with the dreaded Kala Rana-Noni Rana gang. Two personnel of the Delhi Police Special Cell also sustained injuries during the encounter."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-on-rishabh-pant-batting-mantra-leeds-test-2745342-2025-06-24",
      "headline": "Let Pant be Pant: Rahul explains India keeper's method after twin centuriesIndia batter KL Rahul admitted on Monday that trying to understand Rishabh Pant's mindset is nearly impossible - and perhaps unnecessary. Pant became only the second wicketkeeper to hit two centuries in one Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-headingley-test-india-england-final-day-2745333-2025-06-24",
      "headline": "Leeds weather report: Rain set to play big part in thrilling final dayLeeds weather forecast: Rain is expected to impact the final day of the 1st Test between India and England at Headingley. Both teams aim to force a result despite tricky weather and pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-wanted-backstand-rishabh-pant-hundred-leeds-2745317-2025-06-24",
      "headline": "Sunil Gavaskar reveals he wanted to do backstand after Rishabh Pant's hundredEngland vs India, Leeds Test: Former India captain Sunil Gavaskar revealed that he was planning to do a backstand following Rishabh Pant's century against England in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-redemption-test-opener-leeds-2745299-2025-06-24",
      "headline": "KL Rahul takes the lead: A Headingley statement years in the makingYears of silence, shifting roles, and unanswered questions found their reckoning at Headingley. KL Rahul, India's quiet constant, didn't just score a century - he reaffirmed himself as the pillar of a Test team rediscovering its rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-day-5-test-match-stuart-broad-jasprit-bumrah-2745285-2025-06-24",
      "headline": "India clear favourite going into Day 5: Stuart BroadIndia are favourites to win the first Test at Headingley after setting a 371-run target. The match's outcome hinges on India's ability to grab their catches in challenging conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-miami-progress-atletico-madrid-exit-palmeiras-draw-psg-top-group-2745286-2025-06-24",
      "headline": "Atletico Madrid crash out, Messi misfires in Inter Miami's drawInter Miami progressed to the knockout stages despite a late Palmeiras comeback. Atletico Madrid were eliminated early, marking a surprising exit for the European club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-rishabh-pant-kl-rahul-headingley-leeds-2745217-2025-06-24",
      "headline": "A Song of Ice and Fire: Pant's bravado meets Rahul's composure in LeedsIndia batters Rishabh Pant and KL Rahul stitched together a marvellous partnership on Day 4 of the first Test against England at Headingley, Leeds. The duo recreated a 'song of Ice and Fire' at the crease, complementing each other beautifully as they navigated different phases of the innings with their contrasting styles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-on-test-average-england-vs-india-leeds-137-2745258-2025-06-24",
      "headline": "My Test average hurts but not chasing numbers now: Rahul after Leeds 137England vs India, Leeds Test: After scoring a majestic 137 against England, KL Rahul admitted that his low Test average still 'hurts' him, but stressed that he no longer plays with the burden of numbers on his mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-leeds-test-kl-rahul-reaction-josh-tongue-bazball-remark-day-5-2745252-2025-06-24",
      "headline": "KL Rahul promises blockbuster finish after England's bold Day 5 predictionIndia opener KL Rahul is confident his team can claim all ten wickets needed on Day 5. England pacer Josh Tongue has declared the hosts will go for a win chasing 371 runs, setting up a thrilling final day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kl-rahul-press-conference-leeds-test-day-4-2745239-2025-06-24",
      "headline": "KL Rahul savours hundred as Test opener vs England: Had forgotten my positionENG vs IND: KL Rahul said he was happy to return to opening for India in Tests after floating around the batting order over the past few years. His hundred helped India set a 371-run target for England in the Leeds Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-miami-progress-atletico-madrid-exit-palmeiras-draw-psg-top-group-2745286-2025-06-24",
      "headline": "Atletico Madrid crash out, Messi misfires in Inter Miami's drawInter Miami progressed to the knockout stages despite a late Palmeiras comeback. Atletico Madrid were eliminated early, marking a surprising exit for the European club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-rishabh-pant-kl-rahul-headingley-leeds-2745217-2025-06-24",
      "headline": "A Song of Ice and Fire: Pant's bravado meets Rahul's composure in LeedsIndia batters Rishabh Pant and KL Rahul stitched together a marvellous partnership on Day 4 of the first Test against England at Headingley, Leeds. The duo recreated a 'song of Ice and Fire' at the crease, complementing each other beautifully as they navigated different phases of the innings with their contrasting styles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-on-test-average-england-vs-india-leeds-137-2745258-2025-06-24",
      "headline": "My Test average hurts but not chasing numbers now: Rahul after Leeds 137England vs India, Leeds Test: After scoring a majestic 137 against England, KL Rahul admitted that his low Test average still 'hurts' him, but stressed that he no longer plays with the burden of numbers on his mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-leeds-test-kl-rahul-reaction-josh-tongue-bazball-remark-day-5-2745252-2025-06-24",
      "headline": "KL Rahul promises blockbuster finish after England's bold Day 5 predictionIndia opener KL Rahul is confident his team can claim all ten wickets needed on Day 5. England pacer Josh Tongue has declared the hosts will go for a win chasing 371 runs, setting up a thrilling final day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kl-rahul-press-conference-leeds-test-day-4-2745239-2025-06-24",
      "headline": "KL Rahul savours hundred as Test opener vs England: Had forgotten my positionENG vs IND: KL Rahul said he was happy to return to opening for India in Tests after floating around the batting order over the past few years. His hundred helped India set a 371-run target for England in the Leeds Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-josh-tongue-warning-371-chase-leeds-test-2745214-2025-06-24",
      "headline": "England can chase 371: Josh Tongue warns India ahead of Day 5Fast bowler Josh Tongue said England will push for victory on the final day of the Leeds Test against India. Set a daunting target of 371 in the fourth innings, the hosts made a confident start, with their openers chipping away 21 runs in the six overs before stumps on Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-india-spinner-dilip-doshi-dies-at-the-age-of-77-2745216-2025-06-24",
      "headline": "Former India spinner Dilip Doshi dies at the age of 77Former India spinner Dilip Doshi has passed away at the age of 77 on Monday, June 23 in London. Doshi played 33 Tests and 15 ODIs for India and was a stalwart in the domestic circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-kl-rahul-talks-in-tamil-kannada-hindi-leeds-2745198-2025-06-23",
      "headline": "Watch: Rahul shows off his multilingual skills during 2nd innings hundredKL Rahul showed that he is not just versatile with the bat and displayed his multilingual skills during the course of his hundred in Leeds. Rahul's hundred helped India put a target of 371 against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-rishabh-pant-day-4-match-report-late-collapse-leeds-test-2745194-2025-06-23",
      "headline": "Rahul-Pant show lights up Day 4, but collapse keeps Leeds Test poisedIND vs ENG: KL Rahul's elegance and Rishabh Pant's flair lit up Day 4 in Leeds, but India's lower-order collapse handed England a lifeline, setting up a thrilling finish to the Headingley Test on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-ostrava-golden-spike-neeraj-chopra-tokyo-world-championship-2745185-2025-06-23",
      "headline": "Neeraj Chopra reveals main goal of 2025 season before Ostrava Golden SpikeNeeraj Chopra said that his main goal of the 2025 season will be the World Championships in Tokyo. Neeraj is all set to take part in the Ostrava Golden Spike meet on Tuesday, June 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-hundred-ravi-shastri-headingley-2745165-2025-06-23",
      "headline": "Rishabh Pant's batting may defy logic, but it's backed by a sharp cricket brain: ShastriRavi Shastri has said that while Rishabh Pant's batting may defy logic, it's backed by a sharp cricket brain. Pant scored his second hundred of the game on Day 4 of the first Test against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-athiya-shetty-message-leeds-2745159-2025-06-23",
      "headline": "Athiya Shetty shares special message for KL Rahul after Leeds hundredAthiya Shetty had a special message for her husband and Indian opener KL Rahul after his brilliant hundred against England on Day 4 of the first Test. Rahul's knock put India on top of proceedings in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-rishabh-pant-summersault-celebration-twin-centuries-2745141-2025-06-23",
      "headline": "Sunil Gavaskar urges twin centurion Rishabh Pant for somersault celebrationENG vs IND: Rishabh Pant made history at Headingley with twin centuries against England, prompting Sunil Gavaskar to ask for his trademark celebratory flip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-ostrava-golden-spike-neeraj-chopra-tokyo-world-championship-2745185-2025-06-23",
      "headline": "Neeraj Chopra reveals main goal of 2025 season before Ostrava Golden SpikeNeeraj Chopra said that his main goal of the 2025 season will be the World Championships in Tokyo. Neeraj is all set to take part in the Ostrava Golden Spike meet on Tuesday, June 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-hundred-ravi-shastri-headingley-2745165-2025-06-23",
      "headline": "Rishabh Pant's batting may defy logic, but it's backed by a sharp cricket brain: ShastriRavi Shastri has said that while Rishabh Pant's batting may defy logic, it's backed by a sharp cricket brain. Pant scored his second hundred of the game on Day 4 of the first Test against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-athiya-shetty-message-leeds-2745159-2025-06-23",
      "headline": "Athiya Shetty shares special message for KL Rahul after Leeds hundredAthiya Shetty had a special message for her husband and Indian opener KL Rahul after his brilliant hundred against England on Day 4 of the first Test. Rahul's knock put India on top of proceedings in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-rishabh-pant-summersault-celebration-twin-centuries-2745141-2025-06-23",
      "headline": "Sunil Gavaskar urges twin centurion Rishabh Pant for somersault celebrationENG vs IND: Rishabh Pant made history at Headingley with twin centuries against England, prompting Sunil Gavaskar to ask for his trademark celebratory flip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-becomes-2nd-wicketkeeper-to-score-twin-centuries-in-a-test-2745134-2025-06-23",
      "headline": "Rishabh Pant becomes 2nd wicketkeeper to score twin centuries in a TestIndia's Rishabh Pant etched his name in the record books as he became just the second wicketkeeper to score twin centuries in a Test match during Day 4 of the first Test against England in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-kl-rahul-century-headingley-test-sunil-gavaskar-rahul-dravid-behind-2745122-2025-06-23",
      "headline": "KL Rahul leaves Dravid, Gavaskar behind with 4th Test 100 vs EnglandENG vs IND: KL Rahul delivered a masterclass at Headingley, scoring a composed century that not only steadied India's innings but also made him the Indian opener with the most Test hundreds on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-can-also-bat-like-cheteshwar-pujara-sanjay-manjrekar-2745118-2025-06-23",
      "headline": "Rishabh Pant can also bat like Cheteshwar Pujara: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar is impressed with Rishabh Pant's defensive technique in the ongoing first Test against England, saying that he can even bat like Cheteshwar Pujara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-critics-sanjana-ganesan-only-on-the-field-2745108-2025-06-23",
      "headline": "They only know Bumrah on the field: Sanjana Ganesan shuts down criticsWhile Jasprit Bumrah roared back with a five-wicket haul in the Headingley Test, his wife Sanjana Ganesan shared a graceful response to critics, reminding fans that there's more to athletes than what meets the eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-was-reluctant-to-become-test-captain-after-virat-kohli-sourav-ganguly-2745080-2025-06-23",
      "headline": "Rohit Sharma was reluctant to become Test captain after Virat Kohli: Sourav GangulyFormer India captain and BCCI President Sourav Ganguly has revealed that Rohit Sharma was reluctant to become the Test captain after Virat Kohli and had to be convinced by the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-reason-mumbai-cricket-association-noc-2745043-2025-06-23",
      "headline": "Prithvi Shaw reveals reason why he decided to leave Mumbai and ask for releasePrithvi Shaw has revealed the reason why he decided to leave Mumbai and asked for the No Objection Certificate from the Mumbai Cricket Association. Shaw was dropped from Mumbai's squad for the Ranji Trophy last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-praises-sai-sudharsan-potential-india-batting-targets-370-runs-england-test-2745030-2025-06-23",
      "headline": "Promising Sai Sudharsan will not have leg stump weakness for long: ManjrekarFormer cricketer Sanjay Manjrekar praises Sai Sudharsan's promising potential despite an ordinary Test debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-scolds-himself-after-playing-rash-shots-on-day-4-in-leeds-2745035-2025-06-23",
      "headline": "Rishabh Pant berates himself after playing rash shots on Day 4 in LeedsIndia wicketkeeper batter Rishabh Pant was seen scolding himself after playing a few rash shots on Day 4 of the first Test against England at Headingley, Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-4-leeds-updates-2744934-2025-06-23",
      "headline": "Day 4 Highlights: England finish on a high after Pant, Rahul's centuriesEngland (ENG) vs India (IND), 1st Test Day Highlights: England finished Day 4 on 21/0, chasing a target of 371 runs in the fourth innings. Earlier, India were bundled out for 364 in the second innings as the lower order once again capitulated against the England bowling.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-seeks-noc-from-mumbai-cricket-association-to-switch-state-team-2744920-2025-06-23",
      "headline": "Prithvi Shaw seeks NOC from Mumbai Cricket Association to switch state teamsPrithvi Shaw has approached the Mumbai Cricket Association (MCA) for a No Objection Certificate (NOC) to switch state teams ahead of the upcoming domestic season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-emotional-varun-chakravarthy-dindigul-dragons-last-ball-win-tnpl-2744900-2025-06-23",
      "headline": "R Ashwin emotional after Varun Chakravarthy seals last-ball win in TNPLTNPL 2025: Dindigul Dragons captain R. Ashwin was emotional in the dugout as Varun Chakravarthy smashed a six and a four off the final two balls to seal a thrilling win over Salem Spartans."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}