{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-600-ton-airlift-india-to-us-amid-trump-tariff-china-import-why-reason-explained-2707997-2025-04-12",
      "headline": "Why is Apple in a race against time to fly iPhones back to the US?Apple's long-term goal is to reduce its dependence on Chinese factories and shift more production to other countries, with India playing a big part in that plan.  However, it relies heavily on a network of suppliers and trained workers that only exists at the required scale in parts of Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-whatsapp-channel-qr-code-number-heres-how-to-access-banking-digital-safety-2707973-2025-04-12",
      "headline": "RBI launches WhatsApp Channel: Here's how to access it via QR codeThe RBI said that the goal of the WhatsApp channel is to provide verified and timely information about banking, digital safety, and other important topics directly to users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-bounces-back-after-wild-week-fueled-by-tariff-war-2707818-2025-04-12",
      "headline": "Wall Street bounces back after wild week fueled by tariff warAll three major US indexes ended the session sharply higher after assurances from Boston Federal Reserve President Susan Collins that the Fed is prepared to keep financial markets functioning should the need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-pushing-trade-deals-with-us-eu-with-high-urgency-s-jaishankar-trump-tariffs-2707776-2025-04-11",
      "headline": "India pushing for trade deals with US, EU with high urgency: JaishankarOn Wednesday, Trump announced a 90-day pause on his sweeping tariffs on all countries, except China as countries around the world wilted under the impact of the seismic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-trump-tariffs-could-make-iphones-cars-and-clothes-in-the-us-2707519-2025-04-11",
      "headline": "How Trump tariffs could make iPhones, cars, and clothes costlier in the USTrump's latest plan includes a massive 145% tax on goods coming from China. Experts say this could end the long run of cheap, imported goods that Americans have enjoyed for decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-1300-points-higher-nifty-above-22500-tata-steel-up-5-percent-metal-stocks-gain-2707506-2025-04-11",
      "headline": "Sensex ends 1,300 points higher, Nifty above 22,500; Tata Steel up 5%The S&P BSE Sensex jumped 1,310.11 points to close at 75,157.26, while the NSE Nifty50 added 429.40 points to end at 22,828.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-sip-vs-ppf-what-rs-1-lakh-a-year-can-earn-in-15-years-2707471-2025-04-11",
      "headline": "Mutual fund SIP vs PPF: What Rs 1 lakh a year can earn in 15 yearsPPF is a government scheme with a current interest rate of around 7.1% per annum. On the other hand, SIPs typically offer higher interest when invested over the long term, especially in equity mutual funds. But they carry some risk, as returns depend on the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muthoot-finance-share-price-fall-over-8-percent-today-manappuram-finance-iifl-finance-stock-low-rbi-rules-2707451-2025-04-11",
      "headline": "Explained: Why Muthoot Finance shares fell over 8% todayMuthoot Finance stock price: Muthoot Finance, one of India's largest gold loan companies, has seen its share price decline by 14% in the past five trading sessions. The stock is also down 7% over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-amfi-data-march-2025-sips-decrease-reason-trump-tariff-global-uncertainty-2707415-2025-04-11",
      "headline": "Mutual fund inflows hit in March. Trump tariffs to blame?The largest outflows were seen in debt mutual funds, where investors pulled out Rs 2.02 lakh crore, possibly due to end-of-year financial needs by institutions and ongoing global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-money-advice-no-shortcuts-to-getting-rich-it-takes-good-habits-and-patience-2707411-2025-04-11",
      "headline": "Zerodha CEO Nithin Kamath's money advice: 'No shortcuts to getting rich'Nithin Kamath shared a video with a powerful message—earning more doesn't mean you're saving more. In fact, higher income often leads to more spending on gadgets, clothes, dining out, or things meant just to impress others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-china-trade-war-lower-loan-emis-repo-rate-rbi-explained-2707412-2025-04-11",
      "headline": "Trump tariffs, trade war fears could bring your loan EMIs down further this yearBorrowers could emerge as the unexpected winners if global headwinds linger and domestic growth slows further, with the RBI likely to step in again to lower the key interest rates. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-daughter-enter-showbiz-at-young-age-singer-reacts-2708087-2025-04-12",
      "headline": "Priyanka-Nick's daughter to enter showbiz at young age? Singer reactsNick Jonas recently opened up about his daughter, Malti Marie, entering showbiz. The singer revealed that he has had this conversation with his wife-actor, Priyanka Chopra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhanush-kriti-sanon-tere-ishk-mein-in-leh-aanand-l-rai-pic-viral-2708080-2025-04-12",
      "headline": "Dhanush, Kriti Sanon begin Tere Ishk Mein in Leh? Aanand L Rai's pic goes viralDhanush and Kriti Sanon are expected to begin 'Tere Ishk Mein' shooting in Leh. Director Aanand L Rai shared a picture from the picturesque location. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-vangas-spirit-to-go-on-floors-in-october-prabhas-to-do-own-stunts-report-2708069-2025-04-12",
      "headline": "Prabhas to sport lean physique in Sandeep Vanga's Spirit, shoot in October: ReportDirector Sandeep Reddy Vanga's upcoming film, Spirit, is one of the highly anticipated films of the year. As per reports, the makers are expected to begin shooting in October this year. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-dhruv-vikram-dating-rumours-kissing-pic-spotify-playlist-2708071-2025-04-12",
      "headline": "Anupama Parameswaran, Dhruv Vikram dating? Leaked Spotify playlist sparks buzzActor Anupama Parameswaran and Dhruv Vikram are rumoured to be dating. Their joint Spotify playlist reportedly featured a photo of them kissing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-on-pakistani-actors-in-bollywood-there-should-be-no-boundaries-2708043-2025-04-12",
      "headline": "Sushmita Sen on Pakistani actors in Bollywood: There should be no boundariesSushmita Sen reacted to Pakistani actors in Indian cinema. The actor stated that there should be no boundaries when it comes to 'talent and creativity.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coachella-2025-blackpinks-lisa-sets-stage-ablaze-as-rose-cheers-her-on-2708040-2025-04-12",
      "headline": "Coachella 2025: BLACKPINK's Lisa sets stage ablaze as Rose cheers her onBLACKPINK's Lisa captivated the audience at Coachella 2025 with her solo act, performing hits from her album 'ALTER EGO'. Her stage presence and energy left a lasting impression on fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bella-thorne-accuses-mickey-rourke-injure-genital-on-girl-sets-2708029-2025-04-12",
      "headline": "Actor Bella Thorne says Mickey Rourke injured her genitals on 'Girl' setsActor Bella Thorne has accused co-star Mickey Rourke of injuring her during the filming of 'Girl'. Thorne claims Rourke's actions were humiliating and among the worst in her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-dance-moves-jewel-thief-song-jadu-fans-go-tauba-tauba-vicky-kaushal-2708011-2025-04-12",
      "headline": "Jaideep Ahlawat's dance moves in Jewel Thief song make fans go 'Tauba Tauba'Jaideep Ahlawat's dance moves in the 'Jewel Thief' song, 'Jadu', have surprised fans. The Netflix film will premiere on April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-kennedy-release-india-2708004-2025-04-12",
      "headline": "Anurag Kashyap teases Kennedy's India releaseFilmmaker Anurag Kashyap hinted at the release of his film 'Kennedy' in India. Despite the film's Cannes premiere in 2023, it failed to get a release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-sons-immerse-ashes-in-ganga-at-haridwar-family-members-attend-2707987-2025-04-12",
      "headline": "Manoj Kumar's sons immerse ashes in Ganga at Haridwar, family members attendManoj Kumar's sons Kunal Goswami and Vishal Goswami, along with other relatives, immersed the veteran actor's ashes in Haridwar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priya-prakash-varrier-viral-wink-thottu-thottu-pesum-sultana-good-bad-ugly-2707983-2025-04-12",
      "headline": "Beyond the wink: Priya Prakash Varrier's second viral wave with Good Bad UglyPriya Prakash Varrier is hogging all the limelight after the re-creation of the evergreen Tamil song, 'Thottu Thottu Pesum' in Ajith Kumar's 'Good Bad Ugly'. In an exclusive chat with India Today Digital, she talked about going viral in 2018 and again in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-wants-british-government-king-charles-watch-kesari-chapter-2-they-should-say-sorry-2707962-2025-04-12",
      "headline": "Akshay Kumar wants King Charles to watch Kesari Chapter 2: They should say sorryAkshay Kumar shared that he wants the British government and King Charles to watch Kesari Chapter 2. The actor said, 'they should say sorry.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-dharamendra-is-happy-with-jaat-success-esha-deol-praises-sunny-deol-2707946-2025-04-12",
      "headline": "Hema Malini says Dharamendra is happy with Jaat's success, Esha praises Sunny DeolHema Malini and Esha Deol praised Sunny Deol's 'Jaat'. The veteran actor stated that 'Dharam ji is very happy' over the film's bumper opening. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/phule-director-anant-mahadevan-controversy-caste-representation-2707928-2025-04-12",
      "headline": "Phule director calls controversy over film 'unnecessary', reveals why it was delayed'Phule' director Anant Mahadevan called the controversy around the film 'exaggerated' and 'unnecessary'. He said that the censor board was not the reason for postponing the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-slams-reports-of-wedding-with-tejasswi-sick-of-you-marrying-me-off-2707918-2025-04-12",
      "headline": "Karan Kundrra slams reports of wedding with Tejasswi: Sick of you marrying me offKaran Kundrra lost cool on reports of his wedding with Tejasswi Prakash. The actor shared a post and urged the media to verify information before publishing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-2-sunny-deol-gopichand-malineni-2707907-2025-04-12",
      "headline": "Jaat box office Day 2: Sunny Deol's film struggles to take off, mints Rs 16 croreDirector Gopichand Malineni's 'Jaat', starring Sunny Deol', seems to be struggling for a boost at the box office. In two days, the film has raked in Rs 16 crore nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-lung-cancer-2023-no-chemotherapy-soha-ali-khan-2707884-2025-04-12",
      "headline": "Sharmila Tagore didn't require chemotherapy: Soha on mother's lung cancer battleActor Soha Ali Khan, in a recent interview, revealed that her mother, Sharmila Tagore, battled 'stage zero' lung cancer in 2023. She underwent surgery to remove the tumour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-2-ajith-kumar-film-dip-big-numbers-over-first-weekend-2707861-2025-04-12",
      "headline": "Good Bad Ugly box office Day 2: Ajith's film dips, eyes big numbers over weekendAjith Kumar's 'Good Bad Ugly' saw a drop in numbers on Day 2. However, trade experts suggest that the film will make the most of the extended weekend due to Tamil New Year holiday on April 14."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-missile-struck-indian-pharma-warehouse-in-kyiv-claims-ukraine-2708149-2025-04-12",
      "headline": "Russian missile struck Indian pharma warehouse in Kyiv, claims UkraineUkraine's Embassy in India claimed that a Russian missile hit the warehouse of an Indian pharma firm, Kusum, in Kyiv. India and Russia are yet to comment on the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-caste-census-panel-recommendations-raise-obc-quota-to-51-per-cent-horizontal-job-reservation-2708159-2025-04-12",
      "headline": "Karnataka caste census panel bats for 51% OBC quota, horizontal job reservationThe Karnataka caste census commission has recommended raising the OBC reservation quota from 32 per cent to 51 per cent, which would push total reservation in the state to 85 per cent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/smartphones-laptops-chips-exempted-trump-reciprocal-tariffs-2708114-2025-04-12",
      "headline": "Smartphones, laptops, chips exempted from Trump's reciprocal tariffsIn a major move likely to shape the ongoing trade war, Donald Trump exempted smartphones, laptops, and other tech products from his newly imposed reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-sharma-travis-head-shreyas-iyer-srh-vs-pbks-2708177-2025-04-12",
      "headline": "Abhishek Sharma's 141 bludgeons PBKS as SRH chase 246 to revive campaignSunrisers Hyderabad (SRH) pulled off the second-highest successful chase in IPL history against Punjab Kings (PBKS) as Abhishek Sharma's whirlwind knock of 141 (55) helped them end their four-match losing streak."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-illegal-immigrants-registration-rule-indian-h1b-visa-green-card-holders-documentation-2707985-2025-04-12",
      "headline": "Indian H-1B, green card holders need to carry ID 24x7? What new US rule saysThe rule came into effect on April 11. A US court allowed the Trump administration to enforce the contentious rule requiring illegal immigrants to register with the government and carry documentation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murshidabad-violence-waqf-protest-west-bengal-case-arrest-latest-news-mamata-banerjee-2708023-2025-04-12",
      "headline": "Father, son hacked to death in Bengal as Waqf protest turns violent; 110 arrestedA father and son were hacked to death by a mob in Murshidabad on Saturday amid violence over the Waqf Amendment Act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-sonia-gandhi-enforcement-directorate-national-herald-property-seized-ed-2708008-2025-04-12",
      "headline": "National Herald case: ED begins possession of assets linked to Sonia, Rahul GandhiThe National Herald case, stemming from a 2014 complaint by BJP leader Subramanian Swamy, alleges that Young Indian fraudulently acquired AJL's properties worth over Rs 2,000 crore for just Rs 50 lakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-govt-notifies-10-pending-acts-without-governor-or-presidents-assent-only-sc-order-public-2707950-2025-04-12",
      "headline": "In a first, Tamil Nadu notifies 10 Acts without Governor, President assentThe Tamil Nadu government notified 10 Acts without receiving assent from either the Governor or the President. This move was enabled by a recent Supreme Court verdict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-marvel-tv-brought-the-mcu-back-to-life-after-endgames-uncertain-future-2707617-2025-04-12",
      "headline": "How Marvel TV brought the MCU back to life after Endgame's uncertain futureAfter 'Avengers: Endgame', Marvel fans were uncertain about the future. However, shows like 'Agatha All Along' and 'Daredevil: Born Again' have reignited excitement and faith in the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-hussain-rana-mumbai-terror-attack-interrogation-david-coleman-headley-nia-visa-immigration-2708111-2025-04-12",
      "headline": "Tahawwur Rana to be confronted with 'employee B' over 26/11 plot: NIA sourcesThe National Investigation Agency is conducting an extensive interrogation of 26/11 mastermind Tahawwur Rana to uncover deeper layers of the conspiracy behind the 2008 Mumbai terror attacks, following his extradition from the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-mk-stalin-on-nda-aiadmk-bjp-alliance-for-tn-2026-polls-surrendered-itself-like-old-bonded-slave-vijay-ttv-dhinakaran-react-2708041-2025-04-12",
      "headline": "Surrendered like old bonded slave: MK Stalin slams AIADMK for reuniting with BJPTamil Nadu Chief Minister MK Stalin launched a scathing attack on the AIADMK-BJP alliance announced for Tamil Nadu's 2026 polls. Among other criticisms, he described it as an alliance driven by hunger for power. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-final-mohun-bagan-vs-bengaluru-fc-report-jamie-maclaren-sunil-chhetri-2708182-2025-04-12",
      "headline": "ISL Final: Mohun Bagan complete comeback win against Bengaluru FC to claim doubleJamie Maclaren was the star of the show as Mohun Bagan came back from a goal down to win the ISL 2024-25 final;; by beating Bengaluru FC 2-1 on Saturday, April 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/jindal-university-student-sneaks-girl-hidden-in-suitcase-into-boys-hostel-viral-video-2707969-2025-04-12",
      "headline": "Student caught sneaking girl hidden in suitcase into boys' hostel. Video goes viralA student at Jindal University in Haryana tried to sneak a girl into the boys' hostel by hiding her in a suitcase, but was caught red-handed by the hostel guards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jharkhand-ranchi-half-burnt-body-girl-found-murder-2708073-2025-04-12",
      "headline": "Half-burnt body of girl found in field in JharkhandA girl was allegedly raped and murdered near Ranchi, with her body found in a field, her throat slit and partially burnt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/calcutta-high-court-orders-central-forces-deployment-violence-waqf-protest-bengal-murshidabad-suvendu-adhikari-plea-2708094-2025-04-12",
      "headline": "Court orders central forces' deployment in Murshidabad over Waqf-related violenceCentral forces will be deployed in West Bengal's Murshidabad district, which is witnessing large-scale violence during protests against the Waqf Act, the Calcutta High Court ruled."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-man-beheads-uncle-axe-police-station-surrendered-severed-head-keonjhar-2708144-2025-04-12",
      "headline": "Odisha man beheads uncle with axe, walks into police station with severed headA man in Odisha was arrested for allegedly beheading his uncle with an axe and then bringing his severed head to the police station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-aiadmk-alliance-looks-good-math-will-it-score-in-chemistry-tamil-nadu-assembly-election-2026-experts-explain-2707701-2025-04-12",
      "headline": "BJP-AIADMK alliance is good maths, but will it score in chemistry?The BJP and the AIADMK have confirmed an alliance for the 2026 Assembly polls. Post-Jayalalithaa, the AIADMK has become a fractured force, and the BJP is still trying to find its feet in Tamil Nadu. Here's a look at the maths and chemistry of the alliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-472-11-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-registers-most-expensive-bowling-figures-by-indian-in-ipl-history-2708151-2025-04-12",
      "headline": "Shami registers most expensive bowling figures by an Indian in IPL historyIndia and Sunrisers Hyderabad (SRH) fast bowler Mohammed Shami registered the most expensive bowling figures by an Indian in IPL history during Match 27 against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-deadline-3-months-president-bills-referred-by-governors-2707895-2025-04-12",
      "headline": "In a first, Supreme Court sets deadline for President to decide on billsThe Supreme Court's ruling came as it set aside the Tamil Nadu Governor's decision to withhold assent to pending bills. The order was made public on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/if-netflixs-adolescence-was-made-in-india-would-the-plot-take-a-darker-turn-2707733-2025-04-12",
      "headline": "If Netflix's Adolescence was made in India, would the plot take a darker turn?Adolescence left many contemplating several things - upbringing, peer influence, the challenges of being a teenager in the social media era. But for me, the biggest question was this: if a series like this were made in India, would the narrative have been any different?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/noida-woman-grabs-another-by-hair-pins-her-down-viral-video-2708026-2025-04-12",
      "headline": "Noida woman grabs another by hair, pins her down. Police react as video goes viralA personal dispute between two women in a Noida society intensified into violence, and a video of the incident went viral on social media.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/devotees-reach-tirumala-tirupati-temple-entrance-slippers-on-spark-outrage-ysrcp-ttd-2708077-2025-04-12",
      "headline": "Video: Devotees reach Tirupati temple entrance with slippers on, spark outrageThe three men managed to go unnoticed at three checkpoints of the Tirupati temple in Andhra Pradesh, while devotees are supposed to remove their footwear at the very first entrance of the shrine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sukma-animal-cruelty-villagers-chhattisgarh-torture-bear-to-death-nails-plucked-mouth-broken-2708025-2025-04-12",
      "headline": "Nails plucked, mouth broken: Villagers torture bear to death in ChhattisgarhA video of the incident has gone viral on social media, prompting the forest department to order an inquiry into the matter."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-rcb-rajat-patidar-impact-player-retire-out-press-conference-2708201-2025-04-13",
      "headline": "Rajat Patidar bats for Impact Player, retire out tactic in IPLIPL 2025, RR vs RCB: In the press conference before Royal Challengers Bengaluru's match against Rajasthan Royals, Rajat Patidar said that new rules surrounding Impact Players and others make the game more interesting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-dc-press-conference-ashutosh-sharma-2708198-2025-04-13",
      "headline": "I always believe in my ability, don't think much about results: Ashutosh SharmaIPL 2025, MI vs DC: In the press conference before the match against Mumbai Indians, Delhi Capitals' batter Ashutosh Sharma opened up on his batting and also had words of praise for skipper Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-parthiv-patek-comments-on-gujarat-titans-fielding-lsg-vs-gt-2708197-2025-04-13",
      "headline": "GT batting coach stresses on importance of fielding after loss against LucknowGujarat Titans batting coach Parthiv Patel has stressed the importance of improving the team's fielding following a six-wicket loss against Lucknow Super Giants (LSG) at Ekana Stadium. Gujarat succumbed to their second loss of the ongoing season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-rcb-match-preview-precited-xi-weather-forecast-jaipur-2708078-2025-04-13",
      "headline": "RR vs RCB Preview: Royals aim for consistency against away kings BengaluruIPL 2025, RR vs RCB Match Preview: Rajasthan Royals will be aiming for consistency as they take on Royal Challengers Bengaluru, who have been in stunning away form in IPL 2025. The Royals will hope to produce a top performance in their first game in Jaipur this season as Bengaluru will look for another win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-nicholas-pooran-parthiv-patel-lucknow-2708196-2025-04-13",
      "headline": "Sometimes you have to tell Pooran, well played: Parthiv Patel after LSG vs GTGT coach Parthiv Patel said that sometimes you can only tip your hat to Nicholas Pooran after the LSG batter starred for his side in their win on Saturday, April 12. Pooran continued his fine form with another fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-shardul-thakur-lsg-vs-gt-press-conference-2708195-2025-04-13",
      "headline": "Didn't dwell much on India snub, going unsold in IPL auction: Shardul ThakurIPL 2025, LSG vs GT: In the post-match press conference after the Lucknow Super Giants beat the Gujarat Titans by six wickets, Shardul Thakur lashed out at commentators for their constant criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/youngsters-will-get-chance-in-their-due-time-as-per-the-teams-needs-sanju-samson-2708194-2025-04-13",
      "headline": "Youngsters will get chance in their due time as per the team's needs: Sanju SamsonRajasthan Royals (RR) captain Sanju Samson has addressed the criticism of not giving chances to youngsters sitting on bench and said that they will get their chances in due time whenever they fit in the team's combination. Rajasthan are set to take on Royal Challengers Bengaluru (RCB) on Sunday, April 13 in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-confirms-wanindu-hasarangas-availability-for-rr-vs-rcb-2708193-2025-04-13",
      "headline": "Sanju Samson confirms Wanindu Hasaranga's availability ahead of RCB clashRajasthan Royals (RR) captain Sanju Samson has confirmed the availability of their wrist spinner Wanindu Hasaranga for the next clash against Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-shardul-thakur-commentators-press-conference-2708192-2025-04-13",
      "headline": "Look at your own stats before criticising: Shardul hits out at commentatorsIPL 2025, LSG vs GT: Shardul Thakur lashed out at critics, saying that commentators criticise players without proper understanding of what the players go through in the middle. Shardul took two wickets in Lucknow's six-wicket win over Gujarat on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-family-yuvraj-singh-suryakumar-yadav-2708191-2025-04-13",
      "headline": "Abhishek Sharma happy to hit 141 vs PBKS in front of family, thanks Yuvraj, SuryakumarAbhishek Sharma was elated to score his maiden IPL hundred in front of his family and thanked Yuvraj Singh and Suryakumar Yadav after SRH's win over PBKS. Abhishek scored 141 runs to pummel PBKS and secure the win for his side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-press-conference-srh-vs-pbks-2708190-2025-04-13",
      "headline": "Made me laugh: Shreyas Iyer jokes about SRH's mammoth run chaseIPL 2025, SRH vs PBKS: Shreyas Iyer was awestruck after Sunrisers Hyderabad chased down the target of 246 against the Punjab Kings on Saturday with nine balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/youngsters-will-get-chance-in-their-due-time-as-per-the-teams-needs-sanju-samson-2708194-2025-04-13",
      "headline": "Youngsters will get chance in their due time as per the team's needs: Sanju SamsonRajasthan Royals (RR) captain Sanju Samson has addressed the criticism of not giving chances to youngsters sitting on bench and said that they will get their chances in due time whenever they fit in the team's combination. Rajasthan are set to take on Royal Challengers Bengaluru (RCB) on Sunday, April 13 in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-confirms-wanindu-hasarangas-availability-for-rr-vs-rcb-2708193-2025-04-13",
      "headline": "Sanju Samson confirms Wanindu Hasaranga's availability ahead of RCB clashRajasthan Royals (RR) captain Sanju Samson has confirmed the availability of their wrist spinner Wanindu Hasaranga for the next clash against Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-shardul-thakur-commentators-press-conference-2708192-2025-04-13",
      "headline": "Look at your own stats before criticising: Shardul hits out at commentatorsIPL 2025, LSG vs GT: Shardul Thakur lashed out at critics, saying that commentators criticise players without proper understanding of what the players go through in the middle. Shardul took two wickets in Lucknow's six-wicket win over Gujarat on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-family-yuvraj-singh-suryakumar-yadav-2708191-2025-04-13",
      "headline": "Abhishek Sharma happy to hit 141 vs PBKS in front of family, thanks Yuvraj, SuryakumarAbhishek Sharma was elated to score his maiden IPL hundred in front of his family and thanked Yuvraj Singh and Suryakumar Yadav after SRH's win over PBKS. Abhishek scored 141 runs to pummel PBKS and secure the win for his side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-press-conference-srh-vs-pbks-2708190-2025-04-13",
      "headline": "Made me laugh: Shreyas Iyer jokes about SRH's mammoth run chaseIPL 2025, SRH vs PBKS: Shreyas Iyer was awestruck after Sunrisers Hyderabad chased down the target of 246 against the Punjab Kings on Saturday with nine balls to spare. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}