{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-airbus-boeing-new-narrow-body-jet-order-supply-chain-issues-aviation-2734155-2025-06-02",
      "headline": "Air India in talks for another mega aircraft deal with Airbus, Boeing: SourcesThe plane orders come at a time when aircraft manufacturers are scrambling with supply chain issues leading to severe delays in aircraft delivery and a looming jet shortage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-to-move-jet-maintenance-work-from-turkey-firm-amid-diplomatic-tensions-2734134-2025-06-01",
      "headline": "Air India to move jet maintenance work from Turkey firm amid diplomatic tensionsAgainst the backdrop of Turkiye backing Pakistan and condemning India's strikes on terror camps in the neighbouring country in May, aviation security watchdog BCAS, on May 15, revoked the security clearance for Turkish company Celebi Airport Services India Pvt Ltd in the \"interest of national security\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zeptos-dharavi-licence-suspended-over-lapses-fungus-on-food-expired-goods-2734114-2025-06-01",
      "headline": "Fungus on food, expired goods: Zepto's Dharavi licence suspended over lapsesThe action against Zepto was taken after an inspection revealed fungal growth on food items, expired products, and unhygienic storage conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-delta-air-lines-air-france-klm-virgin-atlantic-air-connectivity-india-europe-north-america-2734012-2025-06-01",
      "headline": "IndiGo, Air France-KLM, Virgin Atlantic join hands to enhance travel to US, EuropeTo enhance air connectivity from India to Europe and North America, IndiGo, Delta Air Lines, Air France-KLM and Virgin Atlantic announced a partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-orders-indigo-to-end-agreement-with-turkish-airlines-amid-diplomatic-tensions-2733472-2025-05-31",
      "headline": "India orders IndiGo to end agreement with Turkish Airlines amid diplomatic tensionsThe Indian government has ordered IndiGo Airlines to terminate its damp lease agreement with Turkish Airlines by August 31. This decision comes in response to Turkey's continued support for Pakistan against India. The aviation regulator DGCA has granted a final three-month extension to the current lease, which was set to expire on May 31. IndiGo is currently operating two Boeing aircraft on damp lease from Turkish Airlines. The move is part of India's broader response to Turkey's actions, including supplying arms to Pakistan and condemning India's Operation Sindhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/assams-9-year-old-binita-chetry-bags-third-place-on-britains-got-talent-2734107-2025-06-01",
      "headline": "Assam's 9-year-old Binita Chetry bags third place on Britain's Got TalentAssam's Binita Chetry secured third position on 'Britain's Got Talent' 2025 final. Chief Minister Himanta Biswa Sarma congratulated the nine-year-old on her achievement on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-gaurav-guptas-banter-with-pak-fan-at-us-show-chalo-hanuman-chalisa-padho-2734082-2025-06-01",
      "headline": "Comedian Gaurav Gupta's banter with Pak fan at US show: Chalo Hanuman chalisa padhoComedian Gaurav Gupta recently took a jibe at a Pakistani fan during a stand-up show as part of his US-Canada comedy tour, which led to mixed reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-unexpected-romance-with-gauri-spratt-we-met-by-mistake-and-connected-2734063-2025-06-01",
      "headline": "Aamir Khan on unexpected romance with Gauri Spratt: We met by mistake and connectedActor Aamir Khan opened up on his bond with his partner Gauri Spratt. He recalled meeting her unexpectedly as he had not expected to find love again at this age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-ripped-tattoo-avatar-leaves-fans-amazed-2734052-2025-06-01",
      "headline": "Shah Rukh Khan's ripped and tattooed avatar leaves fans amazedShah Rukh Khan recently stunned fans with a new avatar, showcasing a muscular physique and flaunting his tattoos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bohot-sharafat-se-actor-mumtaz-recalls-yash-chopras-marriage-proposal-2734000-2025-06-01",
      "headline": "Bohot sharafat se... Actor Mumtaz recalls Yash Chopra's marriage proposalVeteran actor Mumtaz recalled once being proposed by the late filmmaker Yash Chopra. The 77-year-old spoke about her priorities at that time as an aspirational young actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-calls-marriage-to-reena-dutta-jawani-ka-josh-timing-was-a-mistake-2734016-2025-06-01",
      "headline": "Aamir Khan calls marriage to Reena Dutta jawani ka josh: Timing was a mistakeActor Aamir Khan reflected upon 16 years of marriage to Reena Dutta. The actor shared that he doesn't regret marrying Reena, because in her, he found a friend for life, but the timing of the marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-kicks-off-2025-festa-with-laughter-legacy-and-bangtan-vibes-2734014-2025-06-01",
      "headline": "BTS kicks off 2025 FESTA with laughter, legacy, and Bangtan vibesBTS has launched the '2025 BTS FESTA' to celebrate their 12th debut anniversary, marking a heartfelt and playful reunion stage for the group post military service. The event sets the tone for an eagerly awaited full-group comeback later this year or early next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sreeleela-sits-in-basket-shares-intimate-family-moments-before-birthday-see-pics-2733979-2025-06-01",
      "headline": "Actor Sreeleela sits in basket, shares family celebration before birthday. PicsActor Sreeleela shared a nostalgic pre-birthday post on social media with her family. In the pictures, she is seen dressed traditionally, sitting in a basket as her family members shower her with blessings and love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/time-exposes-says-director-raj-nidimoru-wife-amid-rumours-of-him-dating-samantha-2733986-2025-06-01",
      "headline": "Time exposes, says director Raj Nidimoru's wife amid rumours of him dating SamanthaAs the rumours of Samantha dating director Raj Nidimoru spread on social media, his wife, Shyyamali De, shared a cryptic note on Instagram, mentioning 'karma' and 'time'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-says-mahabharat-could-be-his-last-spectacle-hope-i-die-with-my-shoes-on-2733949-2025-06-01",
      "headline": "Hope I die with my shoes on: Aamir Khan says Mahabharat could be his last spectacleAamir Khan recently spoke about the possibility of his ambitious project based on the epic Mahabharat. He also hinted at it being the final film project of his career after 'Sitaare Zameen Par'. The actor reflected on the reason why he felt so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-to-have-3-parts-plot-cast-release-date-all-you-need-to-know-2733910-2025-06-01",
      "headline": "Stranger Things 5 to have 3 parts: Plot, cast, release date - all you need to know'Stranger Things Season 5' finale will release on New Year's Eve. Netflix has split the last season into three parts. Here's all you need to know about one of the most celebrated fantasy thrillers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-tv-was-better-in-the-90s-not-just-nostalgia-2732359-2025-06-01",
      "headline": "Indian TV was better in the 90s - and it's not just nostalgiaWhen television was a reflection of life, not a cacophony of drama and excess, the golden era of Indian TV in the 90s brought stories that resonated with the soul and characters that felt like family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-nakuul-mehta-jankee-announce-second-pregnancy-write-accepting-blessings-again-2733939-2025-06-01",
      "headline": "Accepting blessings again: Actor Nakuul Mehta, Jankee announce second pregnancy'Ishqbaaz' star Nakuul Mehta is going to welcome his second child with wife Jankee soon. The couple announced good news with a few pictures on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bees-saal-baad-timeless-mystery-of-an-english-babu-village-belle-and-desi-ghost-2733907-2025-06-01",
      "headline": "Bees Saal Baad: Timeless mystery of an English babu, village belle, and desi ghostDecades may have passed, but the eerie echoes of 'Bees Saal Baad' still send a chill down the spine - proof that true horror never fades, it lingers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/himesh-reshammiya-viral-video-praising-paresh-rawal-for-hera-pheri-mid-concert-in-mumbai-watch-2733899-2025-06-01",
      "headline": "Himesh Reshammiya praises Paresh Rawal for Hera Pheri mid-concertDurig his concert in Mumbai, singer Himesh Reshammiya, before breaking into the 'Jumme Raat' song, started praising actor Paresh Rawal for his performances in the 'Hera Pheri' movies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-trailer-equal-parts-chilling-and-exciting-2733887-2025-06-01",
      "headline": "Squid Game 3 trailer: Equal parts chilling and excitingSeveral characters who were not given enough screen time in Season 2, reappear in Season 3 with more. The trailer of 'Squid Game Season 3' features deadlier games and an iconic face-off. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-effigies-burnt-as-protest-intensifies-by-pro-kannada-groups-amid-language-row-2733862-2025-06-01",
      "headline": "Won't allow Thug Life's release: Protests against Kamal Haasan intensifyActor Kamal Haasan's effigies were burnt across Karnataka as protests against the actor intensified amid the language row. His film, 'Thug Life', is scheduled to release on June 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khaleja-re-release-box-office-collection-day-2-detailed-report-mahesh-babu-film-hunts-records-globally-2733859-2025-06-01",
      "headline": "Khaleja re-release box office Day 2: Mahesh Babu's film hunts records globallyMahesh Babu's 'Khaleja' re-released in theatres on May 30, and the film has already started setting fresh records at the box office. It has emerged as the biggest Indian re-release opener in North America. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-box-office-collection-day-9-detailed-report-rajkummar-rao-film-smashes-rs-50-crore-mark-2733855-2025-06-01",
      "headline": "Bhool Chuk Maaf box office Day 9: Rajkummar Rao's film smashes Rs 50 crore mark'Bhool Chuk Maaf' has entered its second weekend at the box office. The film has seen fantastic growth in its second Saturday collection, moving past the benchmark of Rs 50 crore."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/inside-details-of-ukraines-spiders-web-op-that-targeted-41-russian-warplanes-2734119-2025-06-01",
      "headline": "Ukrainian drones hidden inside sheds, transported on trucks to Russian basesAccording to a Ukrainian security official, who spoke to Reuters, the operation - code-named 'Spider's Web' - targeted four Russian airbases and marked the deepest drone assault Ukraine has launched to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-dust-storm-forces-indigo-pilot-to-abort-landing-video-captures-turbulence-2734099-2025-06-01",
      "headline": "Caught on camera: Flight turbulence due to Delhi dust storm, pilot aborts landingA video recorded by an IndiGo passenger inside the Raipur-Delhi flight surfaced on social media, capturing the moment of turbulence as the plane shook mid-air due to a dust storm in the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-qualifier-2-shreyas-iyer-final-rcb-2734168-2025-06-02",
      "headline": "Sensational Shreyas Iyer floors MI, fires Punjab into IPL final after 11 yearsIPL 2025 Qualifier 1: Shreyas Iyer smashed 87 off 41 balls in one of his greatest knocks as Punjab Kings chased 204 successfully against Mumbai Indians. PBKS will face Royal Challengers Bengaluru on Tuesday, June 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shehbaz-sharif-begging-bowl-pakistan-allies-cross-border-terrorism-support-tensions-india-2734040-2025-06-01",
      "headline": "Allies no longer expect us to go around with begging bowl: Pak PM's big admissionAdmitting that his country had turned to allies with a \"begging bowl\" to shore up its financial reserves, Pakistani Prime Minister Shehbaz Sharif said the partner countries no longer expected Islamabad to do so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-law-student-sharmistha-panoli-video-operation-sindoor-controversy-arrest-explained-2733906-2025-06-01",
      "headline": "Viral post, arrest and political slugfest: What's the Sharmistha Panoli controversyA political slugfest erupted after the arrest of 22-year-old social media influencer Sharmistha Panoli over a controversial video on Operation Sindoor. The 22-year-old law student was booked after she used abusive and communally-charged language in her video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-truth-social-post-claims-joe-biden-executed-five-years-ago-replaced-by-clones-2734149-2025-06-01",
      "headline": "Biden killed, replaced by clone in 2020: Trump's bizarre conspiracy theoryUS President's Truth Social post claims Joe Biden was executed five years ago and was replaced with 'soulless, mindless entities'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-shares-clip-accusing-gunmen-of-shooting-at-gaza-aid-site-blames-hamas-2734151-2025-06-01",
      "headline": "Israel shares clip accusing gunmen of shooting at Gaza aid site, blames HamasThe Israel Defence Forces (IDF) released drone footage purportedly showing Hamas gunmen firing at the crowds, asserting that the incident was a deliberate effort to sabotage humanitarian efforts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-to-move-jet-maintenance-work-from-turkey-firm-amid-diplomatic-tensions-2734134-2025-06-01",
      "headline": "Air India to move jet maintenance work from Turkey firm amid diplomatic tensionsAgainst the backdrop of Turkiye backing Pakistan and condemning India's strikes on terror camps in the neighbouring country in May, aviation security watchdog BCAS, on May 15, revoked the security clearance for Turkish company Celebi Airport Services India Pvt Ltd in the \"interest of national security\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-new-banknotes-sheikh-mujibur-rahman-portrait-sheikh-hasina-ouster-circulation-2734078-2025-06-01",
      "headline": "Mujib dropped from new Bangladesh banknotes, replaced with temples, landmarksBangladesh's new banknotes replaced the portrait of the nation's founding father, Sheikh Mujibur Rahman, with images of Hindu and Buddhist temples, natural landscape and traditional landmarks. The new notes will be in circulation along with those having Mujib's portrait and coins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistan-fired-pl-15e-missiles-debris-in-india-is-chinas-worry-2733900-2025-06-01",
      "headline": "Why Pakistan-fired PL-15E missile's debris in India is China's worryThe remnants, while proving China's role in the India-Pakistan conflict, open up reverse-engineering potential for New Delhi to bolster its own missile programmes"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bar-council-of-india-chairman-manan-kumar-mishra-seeks-release-fair-trial-for-sharmishta-panoli-2734163-2025-06-02",
      "headline": "Assault on free speech: Bar Council of India seeks release of Sharmishta PanoliMishra accused the West Bengal government and Kolkata Police of selective and politically driven action, targeting certain communities while ignoring or shielding worse offenses by others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-swiatek-sabalenka-alcaraz-bopanna-paolini-2733990-2025-06-01",
      "headline": "French Open Day 8 LIVE: Alcaraz downs Shelton to reach quarters, Sabalenka advancesFrench Open 2025, Day 8 Live Updates: Carlos Alcaraz has beaten Ben Shelton in four sets in an entertaining match. Aryna Sabalenka decimdated Anisimova to reach the quarters. Iga Swiatek bounced back from the brink to reach the quarterfinals. She beat Elena Rybakina 1-6, 6-3, 7-5. Meanwhile, Tommy Paul reached the quarter-final of men's singles while Elina Svitolina dumped out third seed Jasmine Paolini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/tiger-attack-human-wildlife-conflict-swachh-bharat-ujjwala-yojana-are-lifesavers-tadoba-andhari-corbett-2733771-2025-06-01",
      "headline": "In tiger territory, LPG and toilet emerge as big lifesaversIn tiger territories across India, a humble toilet and LPG connection at home are saving precious lives. This success story of the Swachh Bharat Yojana and the Ujjwala scheme is unfolding in faraway forests even as overall deaths from tiger attacks rise in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-loses-to-d-gukesh-punches-table-in-frustration-2734165-2025-06-02",
      "headline": "Magnus Carlsen loses to D Gukesh, punches table in frustrationMagnus Carlsen stormed off after punching the table in frustration as world champion D Gukesh registered his first-ever over-the-board classical win against the Norwegian stalwart on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hafiz-saeed-jud-pakistan-sheikh-hasina-ouster-bangladesh-india-pakistan-tensions-2734103-2025-06-01",
      "headline": "Revenge of 1971: Hafiz Saeed's outfit claims role in Hasina's Bangladesh ousterThe Jamaat-ud-Dawa (JuD), a banned terror outfit led by Hafiz Saeed, has claimed its role in the ouster of Bangladesh Prime Minister Sheikh Hasina during the massive anti-government protests against her in her country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/explosions-ukraine-massive-drone-attack-russia-air-base-moscow-aircraft-downed-2734024-2025-06-01",
      "headline": "41 Russian aircraft hit by Ukrainian drones, Moscow confirms strike on airfieldsUkrainian drones attacked a military unit in the Sredny settlement in Russia's Irkutsk region, local authorities claimed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-calls-marriage-to-reena-dutta-jawani-ka-josh-timing-was-a-mistake-2734016-2025-06-01",
      "headline": "Aamir Khan calls marriage to Reena Dutta jawani ka josh: Timing was a mistakeActor Aamir Khan reflected upon 16 years of marriage to Reena Dutta. The actor shared that he doesn't regret marrying Reena, because in her, he found a friend for life, but the timing of the marriage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-492-30-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-reaction-mumbai-indians-out-punjab-kings-reach-ipl-2025-final-2734169-2025-06-02",
      "headline": "Hardik Pandya sinks to ground, takes the blame after Mumbai lose Qualifier 2Mumbai Indians captain Hardik Pandya sank into his haunches after Shreyas Iyer struck the winning runs, helping Punjab Kings knock Mumbai Indians out of IPL 2025 and set up the title clash against Royal Challengers Bangalore in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madrasi-camp-demolition-jangpura-delhi-high-court-order-2733987-2025-06-01",
      "headline": "Delhi slums razed, employers ask domestic helps, 'why didn't you come to work?'The Madrasi Camp in Delhi's Jangpura has existed for over 60 years. Its shift to Narela, miles away from South Delhi, has stirred anxiety—not just over housing, but livelihoods. For women working as domestic help in nearby Jangpura homes, the move means losing access to employers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bees-saal-baad-timeless-mystery-of-an-english-babu-village-belle-and-desi-ghost-2733907-2025-06-01",
      "headline": "Bees Saal Baad: Timeless mystery of an English babu, village belle, and desi ghostDecades may have passed, but the eerie echoes of 'Bees Saal Baad' still send a chill down the spine - proof that true horror never fades, it lingers.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sharmishtha-panoli-arrest-operation-sindoor-post-bjp-tmc-kolkata-police-defend-post-abusive-words-freedom-of-speech-2734096-2025-06-01",
      "headline": "Abusive words not freedom of speech: Kolkata cops defend Sharmistha Panoli arrestRejecting allegations that Sharmishtha Panoli was arrested for expressing patriotism or opposing Pakistan, the police said the case against her was based on serious charges of promoting enmity and inciting communal hatred through a now-deleted video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-muslim-to-be-allowed-in-gym-bhopal-sub-inspector-remarks-goes-viral-2734021-2025-06-01",
      "headline": "No Muslim to be allowed in gym: Bhopal sub-inspector's remark goes viralA video showing a sub-inspector instructing a gym owner to bar Muslim trainers and customers has gone viral on social media. Adding to the controversy, a BJP MP has come out in support of the officer's statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-operation-sindoor-special-parliament-session-pakistan-mallikarjun-kharge-2734064-2025-06-01",
      "headline": "Even Pak did it: Congress reiterates demand for Parliament session on Op SindoorAddressing reporters, Congress President Mallikarjun Kharge said that the Centre should take a cue from Pakistan, which has convened its Parliament and held deliberations on the developments, and show similar seriousness in addressing the matter."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-reaction-mumbai-indians-out-punjab-kings-reach-ipl-2025-final-2734169-2025-06-02",
      "headline": "Hardik Pandya sinks to ground, takes the blame after Mumbai lose Qualifier 2Mumbai Indians captain Hardik Pandya sank into his haunches after Shreyas Iyer struck the winning runs, helping Punjab Kings knock Mumbai Indians out of IPL 2025 and set up the title clash against Royal Challengers Bangalore in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-qualifier-2-shreyas-iyer-final-rcb-2734168-2025-06-02",
      "headline": "Sensational Shreyas Iyer floors MI, fires Punjab into IPL final after 11 yearsIPL 2025 Qualifier 1: Shreyas Iyer smashed 87 off 41 balls in one of his greatest knocks as Punjab Kings chased 204 successfully against Mumbai Indians. PBKS will face Royal Challengers Bengaluru on Tuesday, June 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-loses-to-d-gukesh-punches-table-in-frustration-2734165-2025-06-02",
      "headline": "Magnus Carlsen loses to D Gukesh, punches table in frustrationMagnus Carlsen stormed off after punching the table in frustration as world champion D Gukesh registered his first-ever over-the-board classical win against the Norwegian stalwart on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-reach-quarterfinal-beat-shelton-2nd-fastest-100-wins-clay-2734161-2025-06-02",
      "headline": "Carlos Alcaraz outlasts Ben Shelton, becomes 2nd fastest to 100 wins on clayDefending champion Carlos Alcaraz secured his 100th tour-level victory on clay by defeating American Ben Shelton in a thrilling fourth-round battle to reach the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-first-unofficial-test-day-3-mukesh-kumar-canterbury-2734160-2025-06-02",
      "headline": "India A bowlers made to toil as England Lions reach 527 for 7 at end of Day 3The India A bowlers were made to toil on Day 3 of the first unofficial Test as England Lions batters made merry on a flat deck in Canterbury on Sunday, June 1. Mukesh Kumar was the only Indian bowler who got some success on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-wi-2nd-odi-report-joe-root-166-england-2-0-series-lead-west-indies-2734150-2025-06-01",
      "headline": "Root unbeaten 166 helps England script 3-wicket win, take 2-0 series lead vs WIEngland vs West Indies, 2nd ODI: Joe Root played a sensational unbeaten 166-run knock to help England chase down the 309-run target in the second ODI and take a 2-0 lead against West Indies at Sophia Gardens on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-suryakumar-yadav-700-ab-de-villiers-record-2734146-2025-06-01",
      "headline": "Suiryakumar Yadav breaks AB de Villiers's IPL record with 700 runs in 2025IPL 2025: Suryakumar Yadav became the first non-opening batter to score over 700 runs in an IPL season. He hit a quickfire 44 against Punjab Kings in Qualifier 2 in Ahmedabad on Sunday, June 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-t20-comeback-three-wickets-lancashire-vitality-blast-2734133-2025-06-01",
      "headline": "James Anderson impresses with 3-wicket haul in comeback T20 after 11 yearsJames Anderson marked his return to T20 cricket in style, taking three wickets in a sharp four-over spell for Lancashire in their Vitality T20 Blast clash against Durham at Chester-le-Street on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-8-results-aryna-sabalenka-amanda-anisimova-roland-garros-2734137-2025-06-01",
      "headline": "Aryna Sabalenka reaches 3rd straight French Open quarterfinal, to face Qinwen ZhengAryna Sabalenka overcame a stiff test from Amanda Aminisova to make it to the French Open quarter-finals for the third consecutive time. Sabalenka will face Olympic champion Qinwen Zheng in the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dismissed-early-stoinis-strikes-ipl-2025-qualifier-2-2734125-2025-06-01",
      "headline": "Marcus Stoinis roars after Rohit Sharma's wicket as Iyer's gamble worksRohit Sharma's luck ran out in IPL 2025 Qualifier 2 as Marcus Stoinis took his wicket early. The tactical bowling change by Punjab Kings captain Shreyas Iyer proved decisive in the rain-delayed match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-coach-pratima-barwa-mentor-to-many-international-players-dies-in-ranchi-2734123-2025-06-01",
      "headline": "Hockey coach Pratima Barwa, mentor to many international players, dies in RanchiPratima Barwa, the distinguished hockey coach from Jharkhand, died in Ranchi after suffering a paralytic stroke. She had been admitted to the ICU of a private hospital and was on ventilator support, but despite intensive medical efforts, she could not be revived."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-2-suryakumar-yadav-700-ab-de-villiers-record-2734146-2025-06-01",
      "headline": "Suiryakumar Yadav breaks AB de Villiers's IPL record with 700 runs in 2025IPL 2025: Suryakumar Yadav became the first non-opening batter to score over 700 runs in an IPL season. He hit a quickfire 44 against Punjab Kings in Qualifier 2 in Ahmedabad on Sunday, June 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-t20-comeback-three-wickets-lancashire-vitality-blast-2734133-2025-06-01",
      "headline": "James Anderson impresses with 3-wicket haul in comeback T20 after 11 yearsJames Anderson marked his return to T20 cricket in style, taking three wickets in a sharp four-over spell for Lancashire in their Vitality T20 Blast clash against Durham at Chester-le-Street on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-8-results-aryna-sabalenka-amanda-anisimova-roland-garros-2734137-2025-06-01",
      "headline": "Aryna Sabalenka reaches 3rd straight French Open quarterfinal, to face Qinwen ZhengAryna Sabalenka overcame a stiff test from Amanda Aminisova to make it to the French Open quarter-finals for the third consecutive time. Sabalenka will face Olympic champion Qinwen Zheng in the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dismissed-early-stoinis-strikes-ipl-2025-qualifier-2-2734125-2025-06-01",
      "headline": "Marcus Stoinis roars after Rohit Sharma's wicket as Iyer's gamble worksRohit Sharma's luck ran out in IPL 2025 Qualifier 2 as Marcus Stoinis took his wicket early. The tactical bowling change by Punjab Kings captain Shreyas Iyer proved decisive in the rain-delayed match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-coach-pratima-barwa-mentor-to-many-international-players-dies-in-ranchi-2734123-2025-06-01",
      "headline": "Hockey coach Pratima Barwa, mentor to many international players, dies in RanchiPratima Barwa, the distinguished hockey coach from Jharkhand, died in Ranchi after suffering a paralytic stroke. She had been admitted to the ICU of a private hospital and was on ventilator support, but despite intensive medical efforts, she could not be revived."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}