{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-flat-as-markets-await-cpi-data-banking-stocks-see-decline-2648275-2024-12-11",
      "headline": "Sensex, Nifty end flat as markets await CPI data; banking stocks see declineThe S&P BSE Sensex added 16.09 points to close at 81,526.14, while the NSE Nift50 gained 31.75 points to end at 24,641.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-malhotra-takes-charge-new-rbi-governor-challenges-for-him-inflation-growth-gdp-weak-rupee-2648260-2024-12-11",
      "headline": "What challenges await Sanjay Malhotra as he takes charge as RBI Governor?Sanjay Malhotra takes over at a challenging time, with India's economic growth slowing to 5.4% in the July-September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-vishal-mega-mart-ipo-which-is-better-should-you-subscribe-to-latest-gmp-details-2648217-2024-12-11",
      "headline": "Mobikwik vs Vishal Mega Mart IPO: Which public issue should you subscribe to? The IPO of Vishal Mega Mart aims to raise Rs 8,000 crore via an offer for sale of 102.56 crore shares, while that of Mobikwik is looking to raise Rs 572 crore through an entirely fresh issue of 2.05 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-using-digilocker-for-reducing-unclaimed-assets-3-things-to-know-2648203-2024-12-11",
      "headline": "Sebi proposes using DigiLocker to help heirs claim mutual fundsSebi has proposed using DigiLocker to simplify asset management, reduce unclaimed assets, and enable faster paperless services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-fully-subscribed-on-day-1-key-reasons-behind-strong-demand-2648136-2024-12-11",
      "headline": "Mobikwik IPO fully subscribed on Day 1. What's behind the strong demand?Mobikwik's IPO was subscribed over 3.5 times as of 1 pm. According to data, Mobikwik's IPO received bids for 3,96,80,623 shares against the 1,18,71,696 shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-bima-sakhi-yojana-explained-eligibility-stipend-and-application-details-2648124-2024-12-11",
      "headline": "LIC Bima Sakhi Yojana explained: Check eligibility, and stipendThe LIC Bima Sakhi Yojana empowers women aged 18-70 with training, stipends, and LIC agent roles, promoting financial inclusion and independence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnc-infratech-share-price-jumps-12-percent-early-completion-highway-project-2648110-2024-12-11",
      "headline": "Explained: Why PNC Infratech share price jumped 12% todayAt around 12:08 pm, shares of PNC Infratech were trading 9.81% higher at Rs 341.25. The strong performance came after the civil construction firm announced the early completion of a key highway project, boosting investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-opt-out-of-553-million-us-loan-dfc-sri-lanka-colombo-terminal-reason-apsez-share-price-2648101-2024-12-11",
      "headline": "Why Adani Ports decided to opt out of $553 million US loan for Sri Lanka projectAdani Ports and Special Economic Zone Ltd (APSEZ) said it would instead use its own resources to fund the project, citing alignment with its capital management plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-tesla-resumes-hunt-for-new-delhi-showroom-with-dlf-says-report-2648089-2024-12-11",
      "headline": "Elon Musk's Tesla resumes hunt for New Delhi showroom with DLF: ReportTesla has resumed showroom space searches in New Delhi, exploring options with DLF, as it reconsiders entering India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/railway-stocks-rise-today-reason-why-share-price-of-irctc-rvnl-titagarh-irfc-jupiter-wagons-2648087-2024-12-11",
      "headline": "RVNL, Titagarh, Jupiter Wagons: Why railway stocks are rallying todayRailway stocks: Share price of stocks from the railway sector such as IRCTC, RVNL, Titagarh, IRFC, Jupiter Wagons, witnessed a rise in early trade on Wedesday after major announcements from the government "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-surges-over-4-check-key-factors-behind-todays-rally-2648064-2024-12-11",
      "headline": "Vedanta share price surges over 4%. Check key factors behind today's rallyVedanta share price today: The rally can be attributed to several factors, including operational enhancements, bullish market sentiment, and positive brokerage ratings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sai-life-sciences-ipo-opens-for-subscription-should-you-apply-check-all-details-latest-gmp-2648058-2024-12-11",
      "headline": "Sai Life Sciences IPO opens: Should you apply? Check all details, latest GMPSai Life Sciences IPO: The public offering includes a fresh share issue worth Rs 950 crore, while promoters and existing shareholders will offload 3.81 crore shares amounting to Rs 2,092.62 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-open-details-latest-gmp-price-band-lot-size-subscribe-skip-review-2648055-2024-12-11",
      "headline": "Mobikwik IPO open for bidding: Subscribe or skip? Check latest GMPMobikwik IPO for bidding: The Mobikwik IPO aims to raise Rs 572 crore and will close for subscription on December 13, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-inflation-data-keeps-market-on-edge-adani-stocks-2648032-2024-12-11",
      "headline": "Sensex, Nifty open flat as inflation data keeps market on edgeThe S&P BSE Sensex was up 1.44 points to 81,511.49, while the NSE Nifty50 gained 13.85 points to 24,623.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-open-for-bidding-latest-gmp-price-band-lot-size-details-should-you-subscribe-2648027-2024-12-11",
      "headline": "Vishal Mega Mart IPO: Should you subscribe? Check latest GMPVishal Mega Mart IPO: The public offering is entirely an offer for sale of 102.56 crore shares, which means the company will receive no capital from the listing and all proceeds will go to the selling shareholders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-share-price-to-be-in-spotlight-today-reason-loan-deal-us-dfc-cancel-self-fund-2648001-2024-12-11",
      "headline": "Adani Ports shares to be in spotlight today. Here's why Adani group stocks: Shares of Adani Ports are expected to be in focus today after the firm shared a crucial announcement to the stock exchanges for one of its projects in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-0-a-step-by-step-guide-to-apply-for-a-reprint-with-qr-code-2647779-2024-12-11",
      "headline": "PAN 2.0: A step-by-step guide to applying for a reprint with QR codeIndian PAN cardholders can now reprint their PAN card with a QR code for just Rs 50 through Protean or UTIITSL portals, the process of which is simple and user-friendly. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-ports-enterprises-ambuja-cements-bajaj-auto-ntpc-green-energy-2647995-2024-12-11",
      "headline": "Stocks to watch today: Adani Ports, Bajaj Auto, NTPC Green EnergySeveral stocks are likely to be in focus due to recent news and developments, such as Adani Ports, Adani Green Energy, Bajaj Auto, Star Health, Awfis Space, NTPC Green, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-ports-group-us-funding-colombo-port-project-indictment-controversy-2647976-2024-12-11",
      "headline": "Will use own resources: Adani Ports opts out of US funding for Colombo Port projectAdani Ports said the Colombo Port project was on track for commissioning by early next year and that it will fund the project through \"internal accruals\", aligning with its capital management strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldirams-attracts-bids-from-alpha-wave-2-others-for-15-20-percent-stake-2647746-2024-12-10",
      "headline": "Haldiram's attracts bids from Alpha Wave, 2 others for 15-20% stake: ReportThe bids, which could mark one of India's largest private-equity deals, peg the company's valuation at Rs 75,000-80,000 crore ($8.8-9.4 billion)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-amit-shah-meeting-delhi-jp-nadda-bjp-portfolio-allocation-mahayuti-government-2648572-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis, Amit Shah hold late-night meet in Delhi amid portfolio suspenseMaharashtra Chief Minister Devendra Fadnavis met Union Home Minister Amit Shah at his Delhi home amid speculation over the allocation of portfolios, over a week after Fadnavis took oath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/whatsapp-instagram-facebook-down-globally-2648567-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "WhatsApp, Instagram, Facebook nearly back after global outage; Meta doing last checksWhatsApp, Instagram and Facebook experienced global outages on Wednesday. Meta said it was working to restore the popular social media applications soon as several users reported that they were able to access the social media platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/atul-subhashs-mother-says-my-son-was-tortured-faints-during-media-interaction-2648364-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "My son was tortured: Techie Atul Subhash's grieving mother faints\"My son was tortured,\" a heartbroken mother said, as she spoke to the media about her son Atul Subhash, a Bengaluru techie who died by suicide on December 9."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-boy-fell-borewell-rescued-hospital-unconscious-state-dausa-ndrf-personnel-2648574-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan boy, 5, dies after being trapped in 150-foot-deep borewell for 56 hoursA five-year-old boy in Rajasthan's Dausa, who fell in a 150-foot-deep borewell while playing, died after he remained trapped inside it for 56 hours. The child was pulled out and rushed to a hospital but was declared dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tourism-illegal-immigration-us-indian-population-experts-impact-tom-homan-border-2648399-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Thousands of Indians might be hit as Trump vows to end birthright citizenshipUS President-elect Donald Trump has announced the decision to abolish birthright citizenship on his first day in office. This constitutional right, in place for over 150 years, grants American citizenship to anyone born in the United States. This is how it will impact Indians in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saudi-arabia-host-2034-fifa-world-cup-spain-portugal-morocco-co-host-2030-wc-2648481-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saudi Arabia to host 2034 FIFA World CupFIFA has confirmed Saudi Arabia as the official host of the 2034 World Cup in men's football. Spain, Portugal and Morocco will co-host a six-nation project, with Argentina, Paraguay and Uruguay each getting one of the 104 games.\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-rape-and-murder-victims-lawyer-vrinda-grover-withdraws-from-in-all-courts-2648474-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RG Kar victim's lawyer withdraws from rape-murder case in all courtsSenior advocate Vrinda Grover has withdrawn from representing the family of the victim in the RG Kar rape and murder case, ending her pro bono legal assistance across multiple courts after significant progress in the trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-message-opposition-leaders-who-backed-her-as-india-bloc-head-2648466-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mamata Banerjee 'indebted' to leaders who backed her as INDIA bloc headSeveral prominent opposition leaders, including RJD supremo Lalu Prasad Yadav, Samajwadi Party leader Udaiveer Singh, and YSRCP Rajya Sabha MP Vijayasai Reddy, have voiced support for Banerjee's leadership within the INDIA bloc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/prime-minister-narendra-modi-says-cut-leaves-kapoors-in-splits-2648469-2024-12-11?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: PM Modi says 'cut', leaves Kapoors in splitsPrime Minister Narendra Modi recently met the Kapoor family in the capital. The Kapoors were in New Delhi to invite the PM for the 100-year anniversary of the iconic actor and filmmaker Raj Kapoor. The PM was at his candid best as he met the Kapoor family. During the meeting, Raj Kapoor's daughter, Reema Jain, addressed the PM, \"Aadarniya Pradhan Mantri Shri Narendra Modiji.\" The PM then interrupted her and said, \"cut,\" leaving everyone in splits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-brian-thompson-murder-suspect-luigi-mangione-pennsylvania-court-cops-push-him-2648575-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UnitedHealthcare CEO murder suspect's outburst as cops push him inside courtLuigi Mangione, a suspect in UnitedHealthcare CEO Brian Thompson's murder, turned towards a group of reporters outside a Pennsylvania court and shouted in parts, \"completely out of touch\" and \"an insult to the intelligence of the American people\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-man-bail-minor-rape-case-kills-her-dismembers-victim-2648472-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Odisha man, out on bail in minor's rape case, kills and dismembers victimThe accused had been released on bail in a rape case involving the same girl. Police claim he conspired to kill her to avoid conviction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/justice-is-due-the-tragic-story-of-atul-subhash-and-indias-male-suicide-crisis-2648516-2024-12-11?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Justice is due: The tragic story of Atul Subhash and India's male suicide crisisIn Bengaluru, 34-year-old tech professional Atul Subhash left behind a haunting video and a 24-page suicide note detailing allegations of harassment, false legal cases, and systemic failure in his fight for justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/agastya-abhishek-bachchan-suhana-khan-at-aaliyah-kashyap-shane-gregoire-reception-bash-2648539-2024-12-11?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Agastya-Abhishek, Suhana Khan and others at Aaliyah-Shane reception bashMultiple celebrities graced the reception bash of director Anurag Kashyap's daughter, Aaliyah, as she married longtime partner, Shane Gregoire in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-find-the-right-mental-health-therapist-2648233-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to find the right mental health therapistMental health is critical to quality of life and yet, we are often reluctant to seek professional support. Kanika Agarwal, founder of Mindpeers, explains how to go about it\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/telangana-high-court-allu-arjun-fir-womans-death-pushpa-2-screening-sandhya-theatre-hyderabad-2648557-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Allu Arjun seeks to cancel case over woman's death during Pushpa 2 screeningActor Allu Arjun has approached the Telangana High Court to cancel an FIR filed against him following the death of a woman during the premiere of Pushpa 2 in Hyderabad on December 4. The woman died due to asphyxiation in a crowd at a theatre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/taliban-minister-part-of-powerful-haqqani-family-killed-in-kabul-bombing-report-2648383-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Taliban minister, part of powerful Haqqani family, killed in Kabul bombingKhalil Rahman Haqqani, a senior member of the influential Haqqani Network and the uncle of Taliban's Interior Minister Sirajuddin Haqqani, had been managing Afghanistan's refugee crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/no-more-ear-ritation-heres-how-to-deal-with-airplane-ear-2648173-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No more ear-ritation! Here's how to deal with airplane ear If you feel a strange sensation in your ear as soon as your flight takes off, you might be dealing with airplane ear. While it can be uncomfortable, it can be relieved with some simple tricks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-parbhani-clashes-constitution-replica-damaged-dead-injured-2648226-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Violence rocks Maharashtra's Parbhani over damage to Constitution replicaAt least one person was detained by the police in Maharashtra's Parbhani after violence erupted when an unidentified man damaged a replica of the Constitution held by the statue of BR Ambedkar outside Parbhani railway station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kalyan-banerjee-objectionable-remarks-against-jyotiraditya-scindia-lok-sabha-uproar-2648398-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Row over Trinamool MP's remarks on Jyotiraditya Scindia, Minister rejects apologyTrinamool Congress leader Kalyan Banerjee made personal remarks against Jyotiraditya Scindia on Wednesday. The remarks were expunged by the Lok Sabha Speaker and Banerjee apologised for them, but Scindia refused to accept his apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-telangana-talli-the-unifying-symbol-of-states-pride-is-caught-in-a-political-divide-2648224-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Telangana Talli, the unifying symbol of state's pride, is caught in a political divideCM Revanth Reddy calls the mystical mother's new statue at the secretariat a turning point in the state's history, but the BRS charges the Congress with disrespecting Telangana identity\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-on-two-timing-wife-poonam-2648512-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shatrughan Sinha on two-timing wife Poonam: Not just women, the man also suffersActor-MP Shatrughan Sinha recently admitted that he has been in relationships with women outside his marriage. Sinha is married to former actor Poonam Sinha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/four-visakhapatnam-students-run-from-hostel-to-earn-money-after-being-inspired-by-lucky-bhaskar-movie-plot-2648386-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4 Andhra students flee hostel, were 'influenced' by plot of film Lucky BhaskarFour ninth-grade students from Visakhapatnam went missing after reportedly being inspired by actor Dulquer Salmaan's film Lucky Bhaskar. The children reportedly fled with the goal of earning enough money to buy cars, similar to the film's protagonist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-congress-bjp-adani-soros-debate-deadlock-taxpayer-money-2648262-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In battle of two billionaires, Indian taxpayer bleeding Rs 2.5 lakh per minuteParliament's winter session has almost been a washout because of disruptions. The BJP and the Congress are locked in a battle over billionaires Gautam Adani and George Soros. The lack of House business is resulting in waste of taxpayer money and ignoring of issues of public priority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-cinema-theatre-pushpa-2-screening-earning-stolen-police-probe-2648438-2024-12-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cinema hall loses Rs 1.3 lakh in robbery, entire earnings from Pushpa 2 showsTwo robbers stole Rs 1.34 lakh and a DVD of the CCTV from the Mukta Art-2 cinema hall in Bhilai, Chhattisgarh, after attacking the security guard and looting lockers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/telangana-high-court-allu-arjun-fir-womans-death-pushpa-2-screening-sandhya-theatre-hyderabad-2648557-2024-12-12",
      "headline": "Actor Allu Arjun seeks to cancel case over woman's death during Pushpa 2 screeningActor Allu Arjun has approached the Telangana High Court to cancel an FIR filed against him following the death of a woman during the premiere of Pushpa 2 in Hyderabad on December 4. The woman died due to asphyxiation in a crowd at a theatre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/newlyweds-sobhita-dhulipala-naga-chaitanya-attend-aaliyah-shanes-wedding-bash-2648568-2024-12-11",
      "headline": "Watch: Newlyweds Sobhita Dhulipala-Naga Chaitanya attend Aaliyah-Shane's wedding bashSobhita Dhulipala and Naga Chaitanya,  who got married on December 4, made their first appearance at a public event as a married couple.  They were clicked at Anurag Kashyap's daughter Aaliyah and Shane Gregoire's wedding reception. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/agastya-abhishek-bachchan-suhana-khan-at-aaliyah-kashyap-shane-gregoire-reception-bash-2648539-2024-12-11",
      "headline": "Pics: Agastya-Abhishek, Suhana Khan and others at Aaliyah-Shane reception bashMultiple celebrities graced the reception bash of director Anurag Kashyap's daughter, Aaliyah, as she married longtime partner, Shane Gregoire in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-on-two-timing-wife-poonam-2648512-2024-12-11",
      "headline": "Shatrughan Sinha on two-timing wife Poonam: Not just women, the man also suffersActor-MP Shatrughan Sinha recently admitted that he has been in relationships with women outside his marriage. Sinha is married to former actor Poonam Sinha. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/britain-lawn-tennis-association-ban-transgender-women-from-female-events-2648565-2024-12-11",
      "headline": "Britain's Tennis Association to ban transgender women from some female eventsBritain's Lawn Tennis Association (LTA) has updated its rules to prevent transgender women from competing in national and inter-club female competitions, the governing body announced on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-afghanistan-naveen-ul-haq-1st-t20i-2648559-2024-12-11",
      "headline": "Watch: Naveen ul-Haq's horror 13-ball over costs Afghanistan in 1st T20I ZIM vs AFG: Naveen-ul-Haq picked up three wickets, but it was his 13-ball over against Zimbabwe that led to Afghanistan's defeat on Wednesday at the Harare Sports Club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-outplayed-india-women-smriti-mandhana-0-3-series-whitewash-2648556-2024-12-11",
      "headline": "India got outplayed by Australia: Smriti Mandhana after 0-3 series whitewashAUSW vs INDW: Star batter Smriti Mandhana was disappointed after India suffered a 0-3 loss in the three-match ODI series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-to-tour-new-zealand-white-ball-series-december-january-2648544-2024-12-11",
      "headline": "Sri Lanka to tour New Zealand for white-ball series in December and JanuarySri Lanka Cricket (SLC) announced that the Sri Lanka Men's National Team will tour New Zealand in December 2024 and January 2025 to play a series of T20Is and ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-afghanistan-rashid-khan-1st-t20i-2648545-2024-12-11",
      "headline": "Hard to come back: Rashid Khan rues early wickets after defeat ZIM vs AFG: Rashid Khan said that Afghanistan need to put in better performances both in the batting and bowling departments. On Sunday, the Afghans lost by four wickets in the first T20I against Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mitchell-starc-brisbane-test-2648518-2024-12-11",
      "headline": "After Adelaide heroics, Mitchell Starc eyes another major recordAUS vs IND: Mitchell Starc has a chance of becoming only the fourth bowler to pick up 50 or more wickets in Tests at The Gabba in Brisbane. Starc recently took a six-wicket haul in the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saudi-arabia-host-2034-fifa-world-cup-spain-portugal-morocco-co-host-2030-wc-2648481-2024-12-11",
      "headline": "Saudi Arabia to host 2034 FIFA World CupFIFA has confirmed Saudi Arabia as the official host of the 2034 World Cup in men's football. Spain, Portugal and Morocco will co-host a six-nation project, with Argentina, Paraguay and Uruguay each getting one of the 104 games.\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-beat-afghanistan-1st-t20i-report-ngarava-bennett-last-over-thriller-2648479-2024-12-11",
      "headline": "Ngarava, Bennett set up Zimbabwe's thrilling last-over win vs AfghanistanZimbabwe batters kept their nerves to secure a last-ball victory over Afghanistan in the opening T20I of their three-match series at the Harare Sports Club, chasing down a 145-run target for a 1-0 series lead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-ding-liren-final-2648478-2024-12-11",
      "headline": "Gukesh braces for 'fitting' last game vs Ding in World Championship finalWorld Chess Championship: D Gukesh said that he is excited to face Ding Liren in the 14th game, having played entertaining chess thus far. On Wednesday, the scorecard read 6.5-6.5 after the 13th game ended in a draw. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-rana-ayush-badoni-syed-mushtaq-ali-trophy-delhi-vs-uttar-pradesh-quarter-final-2648457-2024-12-11",
      "headline": "Watch: Ayush Badoni, Nitish Rana engage in heated exchange during SMAT quartersIndian cricketers Nitish Rana and Ayush Badoni got involved in a heated exchange during the Syed Mushtaq Ali Trophy 2024-25 quarter-finals between Delhi and Uttar Pradesh and had to be separated by on-field umpire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-andre-agassi-rafael-nadal-roger-federer-retirement-2648462-2024-12-11",
      "headline": "Agassi explains how Nadal, Federer retirement will affect DjokovicAndre Agassi said that it could be challenging for Novak Djokovic to stay motivated after the retirement of both Rafael Nadal and Roger Federer. But he also said that one should not write off Djokovic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saudi-arabia-host-2034-fifa-world-cup-spain-portugal-morocco-co-host-2030-wc-2648481-2024-12-11",
      "headline": "Saudi Arabia to host 2034 FIFA World CupFIFA has confirmed Saudi Arabia as the official host of the 2034 World Cup in men's football. Spain, Portugal and Morocco will co-host a six-nation project, with Argentina, Paraguay and Uruguay each getting one of the 104 games.\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-beat-afghanistan-1st-t20i-report-ngarava-bennett-last-over-thriller-2648479-2024-12-11",
      "headline": "Ngarava, Bennett set up Zimbabwe's thrilling last-over win vs AfghanistanZimbabwe batters kept their nerves to secure a last-ball victory over Afghanistan in the opening T20I of their three-match series at the Harare Sports Club, chasing down a 145-run target for a 1-0 series lead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-ding-liren-final-2648478-2024-12-11",
      "headline": "Gukesh braces for 'fitting' last game vs Ding in World Championship finalWorld Chess Championship: D Gukesh said that he is excited to face Ding Liren in the 14th game, having played entertaining chess thus far. On Wednesday, the scorecard read 6.5-6.5 after the 13th game ended in a draw. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-rana-ayush-badoni-syed-mushtaq-ali-trophy-delhi-vs-uttar-pradesh-quarter-final-2648457-2024-12-11",
      "headline": "Watch: Ayush Badoni, Nitish Rana engage in heated exchange during SMAT quartersIndian cricketers Nitish Rana and Ayush Badoni got involved in a heated exchange during the Syed Mushtaq Ali Trophy 2024-25 quarter-finals between Delhi and Uttar Pradesh and had to be separated by on-field umpire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-andre-agassi-rafael-nadal-roger-federer-retirement-2648462-2024-12-11",
      "headline": "Agassi explains how Nadal, Federer retirement will affect DjokovicAndre Agassi said that it could be challenging for Novak Djokovic to stay motivated after the retirement of both Rafael Nadal and Roger Federer. But he also said that one should not write off Djokovic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-brisbane-weather-report-rain-rohit-sharma-pat-cummins-virat-kohli-2648444-2024-12-11",
      "headline": "AUS vs IND Brisbane Weather report: Will rain hinder India's comeback?The third Test between India and Australia set to be played at the Gabba in Brisbane, is likely to be affected by rain across five days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-ding-liren-gukesh-draw-game-13-report-2648439-2024-12-11",
      "headline": "Ding Liren holds D Gukesh to draw in Game 13, retains advantageWorld Chess Championship: Defending champion Ding Liren battled from behind to secure a thrilling draw against young Indian challenger D. Gukesh in Game 13 of the World Chess Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-kirti-azad-border-gavaskar-trophy-australia-vs-india-2648418-2024-12-11",
      "headline": "Rohit Sharma gets support from 1983 World Cup winner after Adelaide lossFormer India cricketer and 1983 World Cup winner Kirti Azad has come out in support of India captain Rohit Sharma amid his widespread criticism after India's loss in the second Test in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-matthew-hayden-crucial-gabba-advice-to-indian-pacers-2648409-2024-12-11",
      "headline": "Matthew Hayden gives crucial 'Gabba advice' to Indian pacersFormer Australia opener Matthew Hayden has advised Indian bowlers to target the \"fourth, fifth stump line\" and use the Gabba's natural bounce in the third Test of the Border-Gavaskar Trophy, starting Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-whitewash-perth-report-2648410-2024-12-11",
      "headline": "Mandhana's 105 in vain as Australia complete 3-0 whitewash vs India AUS-W vs IND-W: Australia beat India by 83 runs at the WACA in Perth after Annabel Sutherland and Ash Gardner put their best foot forward. Smriti Mandhana scored 105, but her knock went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-prithvi-shaw-mumbai-vs-vidarbha-syed-mushtaq-ali-trophy-rapid-49-2648358-2024-12-11",
      "headline": "Prithvi Shaw smashes rapid 49 days after going unsold in IPL auctionSyed Mushtaq Ali Trophy: Days after going unsold in the IPL mega auction, Prithvi Shaw showed glimpses of his vintage best. The 25-year-old starred with a 26-ball 49 in Mumbai's win over Vidarbha in the quarter-final on Wednesday in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-kasprovicz-rohit-sharma-jasprit-bumrah-australia-vs-india-border-gavaskar-trophy-2648351-2024-12-11",
      "headline": "Jasprit Bumrah's use of bowlers was far better than Rohit Sharma: Simon KatichFormer Australia bowler Michael Kasprovicz feels Jasprit Bumrah was better in using his bowlers in Perth than Rohit Sharma in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-nathan-mcsweeney-jasprit-bumrah-gabba-test-2648346-2024-12-11",
      "headline": "Hope I can throw a few more punches at Jasprit Bumrah at Gabba: Nathan McSweeneyDespite being dismissed by Jasprit Bumrah three times across four innings, Nathan McSweeney is determined to \"throw a few more punches\" at his Indian nemesis in what promises to be an intense encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-whitewash-perth-report-2648410-2024-12-11",
      "headline": "Mandhana's 105 in vain as Australia complete 3-0 whitewash vs India AUS-W vs IND-W: Australia beat India by 83 runs at the WACA in Perth after Annabel Sutherland and Ash Gardner put their best foot forward. Smriti Mandhana scored 105, but her knock went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-prithvi-shaw-mumbai-vs-vidarbha-syed-mushtaq-ali-trophy-rapid-49-2648358-2024-12-11",
      "headline": "Prithvi Shaw smashes rapid 49 days after going unsold in IPL auctionSyed Mushtaq Ali Trophy: Days after going unsold in the IPL mega auction, Prithvi Shaw showed glimpses of his vintage best. The 25-year-old starred with a 26-ball 49 in Mumbai's win over Vidarbha in the quarter-final on Wednesday in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-kasprovicz-rohit-sharma-jasprit-bumrah-australia-vs-india-border-gavaskar-trophy-2648351-2024-12-11",
      "headline": "Jasprit Bumrah's use of bowlers was far better than Rohit Sharma: Simon KatichFormer Australia bowler Michael Kasprovicz feels Jasprit Bumrah was better in using his bowlers in Perth than Rohit Sharma in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-nathan-mcsweeney-jasprit-bumrah-gabba-test-2648346-2024-12-11",
      "headline": "Hope I can throw a few more punches at Jasprit Bumrah at Gabba: Nathan McSweeneyDespite being dismissed by Jasprit Bumrah three times across four innings, Nathan McSweeney is determined to \"throw a few more punches\" at his Indian nemesis in what promises to be an intense encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-smriti-mandhana-perth-record-2648343-2024-12-11",
      "headline": "Mandhana scripts Women's ODI history with spectacular hundred in PerthAUS-W vs IND-W: Smriti Mandhana scored 105 runs off 109 balls with 14 fours and a six when India faced Australia in the third Women's ODI on Wednesday at the WACA in Perth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-late-team-hotel-departure-adelaide-airport-rohit-sharma-2648336-2024-12-11",
      "headline": "Yashasvi Jaiswal delays departure to airport, team bus leaves without himAustralia vs India: Yashasvi Jaiswal missed the team bus to the Adelaide airport on Wednesday after arriving unusually late for the scheduled departure from the hotel. Team India players reached Brisbane in the afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-smat-report-card-audition-for-australia-tests-2648313-2024-12-11",
      "headline": "Mohammed Shami's SMAT report card: 35.3 ov, 11 wickets in audition for Australia TestsBorder-Gavaskar Trophy: Mohammed Shami's auditions for the Australia Tests ended with a two-wicket, expensive spell in Bengal's 41-run defeat in the quarterfinals. The Indian pacer took 11 wickets in nine matches at an economy of 7.8."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}