{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/highway-infrastructure-ipo-opening-date-august-7-gmp-trend-50-percent-listing-gain-details-review-2767294-2025-08-06",
      "headline": "Should you subscribe to this IPO with over 50% listing gains? Check detailsThe public issue is worth Rs 130 crore, made up of a fresh issue of 1.39 crore shares amounting to Rs 97.52 crore, and an offer for sale of 46 lakh shares worth Rs 32.48 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-25-percent-import-duty-imports-phdcci-report-impact-india-economy-minimal-trump-2767228-2025-08-06",
      "headline": "US tariffs won't shake India's economy, says reportThe PHD Chamber of Commerce and Industry (PHDCCI) white paper finds only 1.87% impact on exports and 0.19% on GDP from the new US trade barrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-usd-64-billion-us-trade-at-risk-as-tensions-with-washington-escalate-after-trump-tariff-threat-2767209-2025-08-06",
      "headline": "India's $64 billion US trade at risk as tensions with Washington escalateIndia faces its most serious diplomatic crisis with the US in years after Trump imposed the highest tariffs among Asian peers on goods imported from India, even before any penalty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-rbi-rate-cut-it-stocks-us-tariff-concern-2767203-2025-08-06",
      "headline": "Sensex, Nifty end lower as US trade tension; RBI rate pause hit sentimentThe S&P BSE Sensex ended 166.26 points lower to end at 80,543.99, while the NSE Nifty50 lost 75.35 points to end at 24,574.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-radhika-gupta-on-why-large-cap-is-the-new-debt-2767168-2025-08-06",
      "headline": "Edelweiss' Radhika Gupta on why large cap is the new debtTraditionally, people invested in debt, like fixed deposits or bonds, when they wanted safety. They turned to equity, like stocks, when they were willing to take more risk for higher returns. But that line is getting blurry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-gen-z-is-trusting-instagram-influencers-over-financial-advisors-for-investment-advice-2767166-2025-08-06",
      "headline": "Is social media ruining investing for Gen Z?Social media is reshaping how young Indians invest. With financial influencer or 'finfluencer' on the rise, traditional financial literacy is being replaced by reels and short YouTube videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-stock-market-debut-hold-or-book-profit-2766980-2025-08-06",
      "headline": "Should you hold or sell NSDL shares after stock market listing? Details hereWhile NSDL may not offer sharp near-term upside post listing, many analysts see it as a core holding in India's market infrastructure play, particularly as digital finance expands and retail participation deepens."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-jagga-not-entering-salman-khan-bigg-boss-19-amid-reports-comeback-2767288-2025-08-06",
      "headline": "Priyanka Jagga not entering Bigg Boss 19 amid reports of her comeback: SourcePriyanka Jagga Muise is not entering 'Bigg Boss 19'. After being thrown out of the show, a source close to the show told IndiaToday,in that she had not been approached for the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-faces-backlash-for-snapping-at-hindi-speaking-request-2767289-2025-08-06",
      "headline": "Kajol faces backlash for snapping at Hindi-speaking request. WatchKajol faced backlash after a video of her reacting angrily to a request to speak in Hindi during an interview went viral. Many social media users criticised her, questioning her attitude towards the language despite working in Hindi films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/all-about-hrithik-roshan-vs-jr-ntrs-dance-face-off-in-war-2s-jaanabe-aali-2767255-2025-08-06",
      "headline": "All about Hrithik Roshan vs Jr NTR's dance face-off in War 2's Jaanabe AaliThe much-awaited dance face-off between Jr NTR and Hrithik Roshan in 'War 2' is finally getting a glimpse release on August 7, while the full version of the song 'Janaabe Aali' will be reserved exclusively for the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jason-mamoa-chief-of-war-stepping-stone-towards-indigenous-storytelling-2766597-2025-08-06",
      "headline": "How Jason Mamoa's Chief of War is stepping-stone towards indigenous storytellingJason Mamoa's 'Chief of War' has been entirely shot in Maori language while depicting the 18th century Hawaiian kingdom. Can more diverse, indigenous stories also be turned into cinematic spectacles irrespective of language and cultural barriers? Has the audience become more accepting of local, regional cultures being explored in mainstream cinema? IndiaToday.in shares insights on the future of diverse storytelling in cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-2-in-works-but-theres-a-catch-2767192-2025-08-06",
      "headline": "The Raja Saab 2 in works, but there's a catchWith 'The Raja Saab' heading toward its December 5 release, producer TG Vishwa Prasad has revealed plans to turn the horror-comedy into a multiverse-style franchise, where each instalment will feature a new story set in a different universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-varun-badola-says-no-one-expected-saiyaara-to-be-this-big-2767195-2025-08-06",
      "headline": "Exclusive: Actor Varun Badola says no one expected Saiyaara to be this bigActor Varun Badola's brief but powerful role in 'Saiyaara' has captivated audiences. His upcoming TV show features a similar role, highlighting his versatile acting career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-vatsal-sheth-celebrate-joint-birthday-at-ishita-duttas-home-2767221-2025-08-06",
      "headline": "Kajol, Vatsal Sheth celebrate joint birthday at Ishita Dutta's home. PicsKajol and Vatsal Sheth celebrated their shared birthday with an intimate party hosted by Ishita Dutta at her Mumbai home, joined by close friends and family, including Yug Devgn. The duo cut five cakes together, while Ajay Devgn posted fun birthday wishes for both."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/geeta-chandran-disciple-anvita-jain-bharatanatyam-arangetram-delhi-2767112-2025-08-06",
      "headline": "Bharatnatyam legend Geeta Chandran's disciple Anvita Jain's Arangetram in DelhiBharatnatyam legend Geeta Chandran's disciple Anvita Jain's Arangetram ceremony is scheduled at the Chinmaya Mission Auditorium in New Delhi. The event highlights tradition and artistic discipline under the guidance of a cultural icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-daughter-aishwarya-hyderabad-airport-viral-video-2767172-2025-08-06",
      "headline": "Rajinikanth arrives in Hyderabad with daughter Aishwarya. Viral videoRajinikanth was seen at the Hyderabad airport along with his daughter, Aishwarya, on Wednesday. A video of the two is now going viral on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-adivi-sesh-raghav-juyal-express-grief-over-uttarkashi-tragedy-2767051-2025-08-06",
      "headline": "Adivi Sesh, Sonu Sood and Raghav Juyal express grief over Uttarkashi tragedyIn the aftermath of the Uttarkashi cloudburst tragedy, several celebrities, including Sonu Sood, Adivi Sesh and Raghav Juyal, shared their concern. They expressed their condolences and extended support on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kl-rahul-adorable-photos-baby-evaarah-athiya-shetty-family-england-trip-2767028-2025-08-06",
      "headline": "KL Rahul shares adorable photos with baby Evaarah and family from England tripKL Rahul shared heartwarming pictures from his family time in England, including a moment with his daughter Evaarah and bonding with brother-in-law Ahan Shetty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-jagga-muise-thrown-out-salman-khan-make-bigg-boss-19-comeback-2767170-2025-08-06",
      "headline": "After being thrown out by Salman Khan, Priyanka Jagga to make BB 19 comebackPriyanka Jagga shared photos from her Bigg Boss 10 journey on Facebook and claimed that she will be appearing in Bigg Boss 19, which will be hosted by Salman Khan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raanjhanaa-and-the-ai-controversy-explained-who-owns-creative-freedom-2767144-2025-08-06",
      "headline": "Raanjhanaa and the AI controversy explained: Who owns creative freedom?What happens when technology rewrites emotion? 'Raanjhanaa's' AI-altered re-release sparks a fierce debate on creative ownership, artistic consent, and the future of storytelling in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andhera-surveen-chawla-and-prajakta-kolis-supernatural-series-to-premiere-in-august-2767121-2025-08-06",
      "headline": "Andhera: Surveen Chawla and Prajakta Koli's supernatural series to premiere in AugustSurveen Chawla, Prajakta Koli's upcoming series 'Andhera' is slated to premiere on August 14. The Prime Video supernatural show is directed by Raaghav Dar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-runtime-revealed-producer-eyes-december-release-2767115-2025-08-06",
      "headline": "Prabhas's The Raja Saab runtime revealed, producer eyes December releaseProducer TG Vishwa Prasad has revealed that the initial cut of Prabhas's 'The Raja Saab' runs over four-and-a-half hours. With the film currently in its final stages, the team is now targeting a December 5 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-makers-vijay-deverakonda-disrespecting-sri-lankan-tamils-2767146-2025-08-06",
      "headline": "Kingdom makers deny disrespecting Sri Lankan Tamils: No such scenes in filmVijay Deverakonda's 'Kingdom', directed by Gowtam Tinnanuri, was criticised for demeaning Sri Lankan Tamils in the film. Sithara Entertainments, the production house, issued a statement denying the claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-khanna-backs-shah-rukh-khan-amid-national-award-row-for-jawan-2767114-2025-08-06",
      "headline": "Mukesh Khanna backs SRK amid National Award row: Award for Jawan is justifiedShah Rukh Khan's National Award win for 'Jawan' received mixed reactions, with some people questioning it. Veteran actor Mukesh Khanna supported SRK, saying he has worked hard for 40 years and truly deserves the award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-hypnotist-jim-curtis-dinner-date-jason-bateman-2767111-2025-08-06",
      "headline": "Jennifer Aniston, hypnotist Jim Curtis enjoy dinner date with Jason BatemanHollywood actor Jennifer Aniston is reportedly in a relationship with hypnotherapist Jim Curtis. The pair were spotted holidaying together in Mallorca in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/viveck-vaswani-backs-shah-rukh-khan-national-award-win-defends-ashutosh-gowariker-2767081-2025-08-06",
      "headline": "Exclusive | Viveck Vaswani backs SRK's National Award win, Gowariker's integrityViveck Vaswani supports Shah Rukh Khan's National Award win for Jawan. He also defends Ashutosh Gowariker's integrity amid controversy over the jury's decision."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-china-for-shanghai-cooperation-organisation-summit-1st-trip-to-beijing-since-2019-2767204-2025-08-06",
      "headline": "PM Modi to visit China for SCO summit, first trip since 2019PM Modi's visit comes at a time when Donald Trump has targeted the Brics nations for buying oil from Russia and for what the US President claims is a grouping that challenges the hegemony of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-oil-secretly-funding-russia-war-machine-ukraine-trump-here-is-the-truth-2767147-2025-08-06",
      "headline": "India secretly funding Russia war machine? 9 facts Trump is not telling youThe narrative that India's growing oil imports from Russia are fuelling the Kremlin's actions in Ukraine exposes not only media misrepresentation but also a pattern of global double standards. We answer your questions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-tragedy-dharali-flash-flood-leaves-meteorologists-scrambling-for-answers-2767122-2025-08-06",
      "headline": "Uttarkashi tragedy has meteorologists scrambling for answersInitial reports from the Uttarakhand government attributed the disaster to a cloudburst, a phenomenon characterised by extremely heavy rainfall over a short period, typically exceeding 100 mm in an hour. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/semi-conscious-woman-patient-molested-by-staff-at-ekbalpore-nursing-home-in-kolkata-2767240-2025-08-06",
      "headline": "Kolkata: Semi-conscious patient molested by staff at private nursing homeThe accused, identified as Abdul Subhan (33), is a Group D employee at Ekbalpore Nursing Home, located in the Ekbalpur area of Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dharavi-revamp-can-gautam-adani-transform-asias-largest-slum-2767186-2025-08-06",
      "headline": "Dharavi revamp: Can Gautam Adani transform Asia's largest slum?How the Adani Group's Rs 2.5 lakh crore redevelopment and rehabilitation plan promises to play out for Dharavi's 1.2 million residents\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-minister-sanjay-nishad-flood-inspection-ganga-kanpur-dehat-river-blessings-woman-savage-reply-uttarakhand-flash-2767148-2025-08-06",
      "headline": "UP minister calls floods Ganga Ma blessings, gets amma's savage replyUP Minister Sanjay Nishad, during a visit to a flood-hit village in Kanpur Dehat, called the rising waters a \"blessing\" from Ganga Ma. But an elderly woman's sharp quick retort turned the minister's remark into a public embarrassment. Opposition parties, including the Congress and the SP, slammed the minister for insensitivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/illegal-betting-apps-case-hyderabad-ed-actor-vijay-deverakonda-prakash-raj-2767190-2025-08-06",
      "headline": "ED only asked me to clarify: Vijay after questioning in illegal betting apps caseAfter appearing before the ED on August 6, Vijay Deverakonda said he was called for clarification over promoting gaming apps. He clarified that there was a probe into the alleged illegal promotion of betting platforms. Several other celebrities have also been summoned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-kartavya-bhavan-spread-over-15-lakh-sq-metres-it-will-house-key-ministries-2767064-2025-08-06",
      "headline": "PM inaugurates Kartavya Bhavan. Ministries get a swanky new addressKartavya Bhavan-3, which was inaugurated by the Prime Minister, is part of the government's ambitious project to bring central ministries and departments under one roof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/scapegoated-and-silenced-america-turns-on-indian-workers-2767175-2025-08-06",
      "headline": "Scapegoated and Silenced: America Turns on Indian WorkersAs US-India trade tensions have exploded amid disputes over tariffs, currency policy, and geopolitical positioning, Indian professionals in America suddenly find themselves caught in the crossfire. Social media is flooded with posts blaming Indian engineers for everything from unemployment to inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarkashi-landslides-uttarakhand-disaster-himalayas-wayanad-himachal-hills-tourism-riverbed-factor-explain-2767165-2025-08-06",
      "headline": "How hollowed-out hills have become dangerousFrom Uttarkashi to Wayanad, landslides are no longer rare. They are the new normal in India's hills and mountains. It's a lethal mix of unchecked construction, both private and public, ecological erosion, and climate change, which has turned mountains into death zones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-belagavi-maulvi-arrested-for-raping-5-year-old-girl-inside-mosque-after-cctv-video-goes-viral-2767254-2025-08-06",
      "headline": "Cleric arrested in two-year-old case for raping 5-year-old girl in Karnataka mosqueA 5-year-old girl was allegedly raped by a Maulvi inside a mosque in Belagavi, Karnataka in 2023. The incident surfaced only recently after a CCTV video went viral. Police arrested the accused and registered a POCSO case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/gut-health-personalised-probiotics-india-wellness-market-growth-2767183-2025-08-06",
      "headline": "Why everyone's talking about gut health: The rise of personalised probioticsGut health has become a major focus in India's booming wellness industry, driven by personalised probiotic plans and microbiome testing. Supermarket stores and pharmacies are packed with probiotic drinks, capsules with multi-strain bacteria, enzyme-rich supplements, and even botanicals - all promising digestive bliss. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-rain-uttarkashi-dharali-flash-flood-cloudburst-deaths-missing-army-ndrf-rescue-cm-dhami-2766918-2025-08-06",
      "headline": "Deadly Uttarakhand flash flood cuts off key roads, dozens missing Live UpdatesRescue operations in Uttarkashi have been severely hampered by continuous rain. The Meteorological Department has issued a red alert for heavy rain today in several districts of the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-claims-pakistani-mercenaries-in-ukraine-russia-war-as-moscow-islamabad-ties-warm-multi-vector-dipomacy-2766944-2025-08-06",
      "headline": "Pakistani mercenaries fighting in Ukraine war amid closer Russia-Pak ties?Amid the economic distress in Pakistan, mercenaries from the country are fighting for Moscow in the Ukraine-Russia war, says Ukrainian President Volodymyr Zelenskyy. Pakistan has denied the allegations, but the reports fuel doubts about Islamabad's agenda as it develops closer ties with Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/hiroshima-at-80-when-japan-burned-but-the-soviets-got-the-message-2767158-2025-08-06",
      "headline": "80 years of Hiroshima: When Japan burned, but the Soviets got the messageOn August 6, 1945, the US dropped the first atomic bomb on Hiroshima. But it wasn't about Japan alone. It was the fear of German nukes, overlooked warnings, and Cold War power plays that drove the US decision, one that Einstein regretted playing a part in later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-mohammed-siraj-england-vs-india-series-2767109-2025-08-06",
      "headline": "Mohammed Siraj storms to career-best ICC Test ranking after Oval heroicsMohammed Siraj has risen to 15th in the ICC Test bowling rankings after a remarkable series in England. His performance signals a strong bowling future for India amid the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-40-percent-tariffs-backfire-made-in-china-manufacturing-magnet-southeast-asia-vietnam-thailand-india-2766566-2025-08-06",
      "headline": "Trump is Making China Cheaper AgainTrump's tariff of up to 40% on transshipped goods and levies across Southeast Asia has left China a winner. Manufacturers and exporters are asking why they should move out of China. Ironically, Trump's trade war might be doing the unthinkable — making Chinese factories and products cheaper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/police-investigate-indian-origin-us-professor-nisarg-shah-accused-of-being-child-predator-university-of-california-san-diego-crime-2767079-2025-08-06",
      "headline": "Indian-origin professor caught in child-sex sting in San DiegoAn Indian-origin associate professor at UC San Diego is under investigation after a viral video surfaced showing him being confronted in a vigilante sting operation for allegedly trying to meet a minor for sexual activity. Police have not filed charges but confiscated Nisarg Shah's phone. The varsity and the police said the probe is on, but Shah has denied the allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/move-over-fake-weddings-ticketed-shaadis-are-the-next-big-thing-2767099-2025-08-06",
      "headline": "Move over fake weddings, ticketed shaadis are the next big thingForget dancing at fake weddings, now you can actually buy a ticket and be part of a real one. The trend is catching on in France, and guess what? It's happening in India too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/great-barrier-reef-underground-graveyard-climate-change-coral-reefs-2767116-2025-08-06",
      "headline": "Great Barrier Reef turning into a graveyard from biggest bleaching eventThe fifth mass extension of the Great Barrier Reef in Australia is signalling an urgent need for global climate action and reef protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mira-murati-said-no-to-mark-zuckerberg-proposal-so-he-launched-15-billion-war-to-hire-her-top-engineer-2767063-2025-08-06",
      "headline": "Mira Murati said no to Zuckerberg, he launched $1.5B war to hire her top engineerNever bet against Mark Zuckerberg, or so goes the saying in Silicon Valley. After spurned by Mira Murati, Zuckerberg has now launched a war with over a billion-dollar chest to try to break and lure engineers away from Mira's Thinking Machines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-faces-backlash-for-snapping-at-hindi-speaking-request-2767289-2025-08-06",
      "headline": "Kajol faces backlash for snapping at Hindi-speaking request. WatchKajol faced backlash after a video of her reacting angrily to a request to speak in Hindi during an interview went viral. Many social media users criticised her, questioning her attitude towards the language despite working in Hindi films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/allu-arjun-enjoys-lunch-outing-with-family-during-mumbai-visit-2767287-2025-08-06",
      "headline": "Allu Arjun enjoys lunch outing with family during Mumbai visitActor Allu Arjun was spotted in Mumbai today enjoying a family outing with wife Sneha Reddy and their kids. The actor was seen stepping out after a cosy lunch with his family, keeping it casual and stylish during the Mumbai visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/all-about-hrithik-roshan-vs-jr-ntrs-dance-face-off-in-war-2s-jaanabe-aali-2767255-2025-08-06",
      "headline": "All about Hrithik Roshan vs Jr NTR's dance face-off in War 2's Jaanabe AaliThe much-awaited dance face-off between Jr NTR and Hrithik Roshan in 'War 2' is finally getting a glimpse release on August 7, while the full version of the song 'Janaabe Aali' will be reserved exclusively for the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jason-mamoa-chief-of-war-stepping-stone-towards-indigenous-storytelling-2766597-2025-08-06",
      "headline": "How Jason Mamoa's Chief of War is stepping-stone towards indigenous storytellingJason Mamoa's 'Chief of War' has been entirely shot in Maori language while depicting the 18th century Hawaiian kingdom. Can more diverse, indigenous stories also be turned into cinematic spectacles irrespective of language and cultural barriers? Has the audience become more accepting of local, regional cultures being explored in mainstream cinema? IndiaToday.in shares insights on the future of diverse storytelling in cinema. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-clara-tauson-madison-keys-grandfather-2767285-2025-08-06",
      "headline": "In tears, Clara Tauson dedicates shock win in Montreal to late grandfatherMontreal Open 2025: Clara Tauson broke down after beating reigning Australian Open champion Madison Keys in straight sets, dedicating the win to her late grandfather. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-salary-hike-central-contract-2767241-2025-08-06",
      "headline": "Pakistan Women rewarded with massive salary hike in central contractThe Pakistan Cricket Board has given a 50 per cent salary raise to the 20 women's cricketers in the central contracts for the 2025-26 season. Left-arm spinner Sadia Iqbal has been promoted to Category A. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-head-coach-dinesh-karthik-2767237-2025-08-06",
      "headline": "Should Gautam Gambhir stay on as Test coach? Ex-India wicketkeeper weighs in=India vs England: Former wicketkeeper Dinesh karthik said Gautam Gambhir should be proud of the heroic draw in England, but urged the head coach to prioritise bowling firepower over batting depth in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-scripts-history-becomes-1st-bowler-to-complete-650-wickets-2767239-2025-08-06",
      "headline": "Rashid Khan scripts history, becomes 1st bowler to complete 650 wickets in T20sAfghanistan wrist spinner Rashid Khan became the first bowler to complete 650 wickets in T20 cricket during the opening game of the The Hundred 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-ravindra-jadeja-playing-xi-2767227-2025-08-06",
      "headline": "No Gill, Jadeja in Stuart Broad's combined XI: Pacer clarifiesEngland legend Stuart Broad has got everyone talking with his chosen combined XI for the five match Test series, leaving out India's top performers Shubman Gill and Ravindra Jadeja after an exciting series that ended 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-icc-player-of-the-month-nomination-mulder-stokes-2767198-2025-08-06",
      "headline": "Shubman Gill nominated for ICC's Player of the Month award after England heroicsIndia captain Shubman Gill has been nominated for the ICC Men's Player of the Month award for July following his stellar performances in the Anderson-Tendulkar Trophy, which ended in a dramatic 2-2 draw between India and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lee-fortis-oval-pitch-india-vs-england-mohammed-siraj-2767188-2025-08-06",
      "headline": "How Oval curator Lee Fortis turned hero from villain in five daysJust days after a heated exchange with India coach Gautam Gambhir saw him painted as a villain, Oval curator Lee Fortis was back in the spotlight — this time clinking glasses with his ground staff after a Test match for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-sachin-tendulkar-england-vs-india-2767182-2025-08-06",
      "headline": "Shubman looked composed against the most attacking Test team: TendulkarENG vs IND: The legendary Sachin Tendulkar heaped praise on Shubman Gill after India won the Oval Test by six runs to draw the five-match Test series 2-2 against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-record-series-aakash-chopra-virat-kohli-2767169-2025-08-06",
      "headline": "Shubman Gill leaves behind Kohli comparisons: Aakash Chopra hails star batterAakash Chopra heaped praise on Shubman Gill for his incredible run during the England tour and also said that the Indian captain left behind Virat Kohli comparisons with his performances at No.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-grand-welcome-in-hyderabad-felicitation-planned-by-hca-2767137-2025-08-06",
      "headline": "Siraj gets rousing welcome in Hyderabad; grand felicitation planned for Oval heroIndia fast bowler Mohammed Siraj was given a rousing reception upon his arrival back in his hometown Hyderabad after a match-winning performance in the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-benjamin-sesko-transfer-newcastle-snub-2767125-2025-08-06",
      "headline": "Sesko picks Manchester United as Newcastle United miss out again: ReportRB Leipzig striker Benjamin Sesko is set to join Manchester United after snubbing Newcastle United in the transfer battle, according to the latest media reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lee-fortis-oval-pitch-india-vs-england-mohammed-siraj-2767188-2025-08-06",
      "headline": "How Oval curator Lee Fortis turned hero from villain in five daysJust days after a heated exchange with India coach Gautam Gambhir saw him painted as a villain, Oval curator Lee Fortis was back in the spotlight — this time clinking glasses with his ground staff after a Test match for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-sachin-tendulkar-england-vs-india-2767182-2025-08-06",
      "headline": "Shubman looked composed against the most attacking Test team: TendulkarENG vs IND: The legendary Sachin Tendulkar heaped praise on Shubman Gill after India won the Oval Test by six runs to draw the five-match Test series 2-2 against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-record-series-aakash-chopra-virat-kohli-2767169-2025-08-06",
      "headline": "Shubman Gill leaves behind Kohli comparisons: Aakash Chopra hails star batterAakash Chopra heaped praise on Shubman Gill for his incredible run during the England tour and also said that the Indian captain left behind Virat Kohli comparisons with his performances at No.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-grand-welcome-in-hyderabad-felicitation-planned-by-hca-2767137-2025-08-06",
      "headline": "Siraj gets rousing welcome in Hyderabad; grand felicitation planned for Oval heroIndia fast bowler Mohammed Siraj was given a rousing reception upon his arrival back in his hometown Hyderabad after a match-winning performance in the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-benjamin-sesko-transfer-newcastle-snub-2767125-2025-08-06",
      "headline": "Sesko picks Manchester United as Newcastle United miss out again: ReportRB Leipzig striker Benjamin Sesko is set to join Manchester United after snubbing Newcastle United in the transfer battle, according to the latest media reports. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}