{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/totalenergies-pauses-business-with-adani-group-amid-us-bribery-corruption-charges-2639807-2024-11-25",
      "headline": "TotalEnergies pauses business with Adani Group amid bribery rowTotalEnergies has paused new financial investments in the Adani Group amid corruption allegations against Adani Green Energy executives, emphasising its zero-tolerance policy on misconduct. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-shares-tank-11-percent-today-totalenergies-halts-investments-2639749-2024-11-25",
      "headline": "Adani Green Energy shares tank 11% today. Here's why Adani Green Energy share price: Adani Green Energy shares dropped 11% after TotalEnergies made a crucial announcement during late trading hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-higher-amid-bull-run-adani-green-shares-down-9-percent-2639732-2024-11-25",
      "headline": "Sensex, Nifty close higher amid market rally, Adani Green shares down 9% The S&P BSE Sensex added 992.84 points to end at 80,109.85, while the NSE Nfity50 gained 314.65 points to close at 24,221.90. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cng-price-hiked-by-rs-2-in-mumbai-other-cities-election-bound-delhi-spared-2639723-2024-11-25",
      "headline": "CNG prices hiked by Rs 2 in Mumbai, other cities; election bound-Delhi sparedPrices were hiked in Noida, Greater Noida, Ghaziabad, Gurugram and other cities but Delhi, which goes to polls in a few weeks from now, was spared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-listing-date-share-price-strong-market-debut-or-muted-listing-expert-view-2639668-2024-11-25",
      "headline": "NTPC Green Energy IPO share price: Strong debut on D-Street or muted listing? NTPC Green Energy IPO listing: Shares of NTPC Green Energy Limited are expected to make its debut on the stock exchanges on Wednesday after having been subscribed over 200%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-rise-energy-solutions-enterprises-port-sez-gautam-adani-bribery-market-rally-2639576-2024-11-25",
      "headline": "Adani Group shares rise for 2nd straight session: 2 reasons behind bull runAdani group stocks: Adani stocks continued their upward movement, with Adani Energy Solutions being among the top performers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-jump-why-explained-bse-inclusion-replaces-jsw-steel-2639543-2024-11-25",
      "headline": "Zomato shares jump 7%, inclusion on BSE replacing JSW Steel soonZomato share price: Zomato stocks surged in early trade on Monday, mirroring the stock market rally following a major announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-explained-3-reasons-why-dalal-street-saw-bull-run-today-adani-bjp-mahayuti-win-maharashtra-2639522-2024-11-25",
      "headline": "Sensex surges 1200 points: 3 factors behind stock market rallyStock market rally: Sensex shot past the 80,000 mark, while the broader NSE Nifty climbed above 24,300, increasing investors' wealth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-1000-points-early-trade-nifty-over-24000-stock-markets-adani-2639510-2024-11-25",
      "headline": "Sensex jumps over 1,000 points in early trade, Nifty over 24,000Stock market rally: The S&P BSE Sensex was up 1192.49 points to 80,309.60, while the NSE Nifty50 was up 411.85 points to 24,319.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-day-2-latest-gmp-subscription-subscribe-skip-review-details-price-band-2639507-2024-11-25",
      "headline": "Enviro Infra Engineers IPO Day 2: Shoud you subscribe based on latest GMP?Enviro Infra Engineers IPO: Enviro Infra Engineers Limited is looking to raise Rs 650.43 crore through a book-building process and will close for bidding on November 26, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-tez-quick-commerce-service-code-name-challenge-blinkit-zepto-swiggy-flipkart-minutes-2639500-2024-11-25",
      "headline": "Amazon's quick commerce service code named Tez to challenge Blinkit, ZeptoThe move will mark Amazon's entry into the fast-growing quick commerce space in India, where competitors like Blinkit, Zepto, and Swiggy Instamart currently dominate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-allotment-date-step-by-step-online-guide-check-status-latest-gmp-listing-2639485-2024-11-25",
      "headline": "NTPC Green Energy IPO allotment: Step-by-step guide to check statusNTPC Green Energy IPO allotment: The allotment for NTPC Green Energy IPO is expected to be finalised on Monday and investors and check their status on the online portals of BSE and Kfin Technologies Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-rvnl-zee-hdfc-hcl-cochin-shipyard-stock-market-stocks-to-watch-today-2639467-2024-11-25",
      "headline": "Zomato, RVNL, Zee, HDFC, HCL, Cochin Shipyard: Stocks to watch today Experts suggest the election outcome will boost investor confidence, especially in sectors like infrastructure, manufacturing, and urban development, which align with BJP's pro-business policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-energy-solutions-downplays-kenya-scrapping-736-million-power-deal-no-material-impact-2639242-2024-11-24",
      "headline": "Adani firm downplays Kenya scrapping $736 million power deal: No material impactAdani Energy Solutions said there was \"no material impact\" on the company's operations after Kenya cancelled a $736 million transmission line project over Gautam Adani's indictment in a bribery case in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reaction-bjp-led-mahayuti-win-maharashtra-will-it-lead-to-maha-rally-on-dalal-street-expert-view-2639133-2024-11-24",
      "headline": "BJP-led Mahayuti win Maharashtra: Will it lead to 'maha' rally on Dalal Street?The results of the Maharashtra assembly election, announced on Saturday, are expected to have a notable impact on the stock markets when trading resumes on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-gets-richer-wealth-hits-all-time-high-tesla-shares-surge-spacex-xai-usd-70-billion-addition-2638737-2024-11-23",
      "headline": "Elon Musk gets even richer after wealth hits all-time high post Trump winThe jump in Elon Musk's fortune came after Tesla shares rose 3.8% on Friday, reaching a 3.5-year closing high of $352.56 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-jeff-bezos-tesla-stock-space-x-us-electiosn-donald-trump-2638708-2024-11-23",
      "headline": "Jeff Bezos denies Musk's claim on Tesla stock advice: '100% not true'Elon Musk said on social media platform X that Bezos had advised people to sell their Tesla and SpaceX shares, predicting Donald Trump's electoral defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-founder-told-us-ally-to-flee-the-us-to-avoid-testifying-report-2637906-2024-11-22",
      "headline": "Byju's founder told US ally to flee the US to avoid testifying: ReportThe businessman, William R. Hailer, testified before US Bankruptcy Judge John T. Dorsey, alleging that Byju Raveendran offered him a lucrative job and sent him a $10,700 plane ticket to Dubai just two days before he was scheduled to testify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-today-sensex-2000-points-nifty-above-23900-2637809-2024-11-22",
      "headline": "Sensex ends nearly 2,000 points higher, Nifty above 23,900A broad-based recovery in information technology (IT), financial, banking and energy stocks spearheaded the recovery. A sharp rebound in Adani Group stocks also added to the positive momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-2000-points-key-factors-adani-shares-2637775-2024-11-22",
      "headline": "Sensex surges 2,000 points, Rs 7 lakh crore added: 4 key factors behind rallyThe Sensex was up 2039.44 points to 79,195.23 at 2:57 pm, while the NSE Nifty50 gained 587.90  to 23,938.75."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-pollution-aqi-school-online-physical-classes-caqm-supreme-court-2639992-2024-11-25",
      "headline": "Air quality control panel allows Delhi-NCR schools to hold classes in hybrid modeThe Commission for Air Quality Management (CAQM) has eased certain anti-pollution measures following the Supreme Court's direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-mahayuti-alliance-chief-minister-chair-sparks-power-struggle-shiv-sena-eknath-shinde-bjp-devendra-fadnavis-ncp-ajit-pawar-2639686-2024-11-25",
      "headline": "Mahayuti secures Maharashtra, but chief minister's chair sparks power struggleThe Mahayuti alliance secured a landslide victory in the Maharashtra Assembly elections. However, a power tussle over the Chief Minister's post among alliance partners—BJP, Shiv Sena, and NCP—has clouded the post-poll celebrations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-full-squads-top-buys-costliest-playing-11-2640074-2024-11-25",
      "headline": "IPL 2025 mega auction: Full squads, top buys and predicted XIsThe IPL 2025 mega auction saw record-breaking deals and intense bidding wars, as teams strategically built their rosters for an exhilarating season, with Rishabh Pant and Shreyas Iyer grabbing the spotlight as the costliest players in IPL history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/union-cabinet-meeting-modi-30-government-pan-system-railway-projects-farming-hydro-plants-2639982-2024-11-25",
      "headline": "PAN 2.0, 3 multitracking Railway projects among major government schemes announcedThe Union Cabinet approved several initiatives, including the digitalisation of the PAN system, national mission on natural farming and Atal Innovation Mission 2.0 to boost entrepreneurship, among other projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-riot-up-court-plea-shahi-jama-masjid-kalki-temple-history-explained-asi-report-2639611-2024-11-25",
      "headline": "Was centuries-old Sambhal temple razed? What 1875 ASI report, historians sayThe town of Sambhal in Uttar Pradesh saw violent rioting over a court-mandated survey at the Shahi Jama Masjid. The violence has roots in a dispute over the Shahi Jama Masjid, which Hindus claim was built after Babur demolished a centuries-old Kalki temple. This is what an ASI report of 1879 and historians say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-israel-ceasefire-deal-hezbollah-lebanon-conflict-cnn-report-middle-east-tensions-2639875-2024-11-25",
      "headline": "Israel's Netanyahu approves 'in principle' truce deal with Hezbollah: ReportIsraeli Prime Minister Benjamin Netanyahu has approved \"in principle\" a ceasefire deal with Hezbollah, a source told CNN, amid constant fighting between the Israeli military and the Lebanon-based group in the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-masjid-mosque-survey-temple-notice-samajwadi-party-akhilesh-yadav-sp-2639707-2024-11-25",
      "headline": "What happened in Sambhal? Deadly clashes light political fireThe violent clashes in Sambhal have sparked a political blame game, with the BJP accusing Samajwadi Party leaders of incitement, and the SP chief Akhilesh Yadav alleging orchestration by the UP government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vaibhav-suryavanshi-ipl-2025-mega-auction-youngest-player-in-ipl-auction-rajasthan-royals-2639955-2024-11-25",
      "headline": "Who is Vaibhav Suryavanshi: 13-year-old lands Rs 1.1 crore deal in IPL auctionBihar batter Vaibhav Suryavanshi became the youngest player to be sold in the history of IPL auction on Monday, November 25 in Jeddah, Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-antalya-airport-russian-sukhoi-superjet-catches-fire-rescue-operation-2639827-2024-11-25",
      "headline": "Total chaos as Russian plane catches fire in Turkey, emergency slides deployedAll the 89 passengers onboard the plane and all six members of the cabin crew were safely evacuated from the plane after it caught fire after landing at Turkey's Antalya Airport on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-national-charged-with-molesting-four-women-singapore-airlines-us-2639906-2024-11-25",
      "headline": "Indian, 73, charged with molesting 4 women on Singapore Airlines flightA 73-year-old Indian national has been charged with molesting four women on a Singapore Airlines flight from the US to Singapore. The alleged incident occurred over a 14-hour period on November 18. He faces faces up to 21 years in jail and is set to plead guilty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/dusu-polls-result-2024-delhi-university-student-elections-result-split-victory-nsui-abvp-2639795-2024-11-25",
      "headline": "Congress-backed NSUI's big comeback in Delhi University polls, wins President postThe DUSU poll results are out and NSUI and ABVP each won two key seats in Delhi University's long-delayed student elections, reshaping the power dynamics in DUSU amid tight security and a fierce campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinmoy-prabhu-monk-protest-atrocities-on-hindus-in-bangladesh-dhaka-police-2639779-2024-11-25",
      "headline": "Monk leading protest against atrocities on Hindus in Bangladesh arrested in DhakaChinmoy Prabhu, a prominent monk leading protests against atrocities on Hindus in Bangladesh, was allegedly arrested by the Dhaka Police's Detective Branch on Monday (November 25). He was allegedly detained at Dhaka airport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-pm-jay-surgery-deaths-point-to-a-systemic-rot-in-gujarat-2639826-2024-11-25",
      "headline": "How PM-JAY surgery deaths point to a systemic rot in GujaratAn Ahmedabad hospital allegedly conducting unnecessary angioplasties on villagers to claim funds under the flagship central scheme points to a potentially wider scam that the state must probe deep\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sunil-gavaskar-jasprit-bumrah-captaincy-2639907-2024-11-25",
      "headline": "Gavaskar backs Bumrah for captaincy, dismisses 'Bakwas' misconceptionAUS vs IND: Sunil Gavaskar said that Jasprit Bumrah can go on to become an efficient captain for India in the future. On Monday, under Bumrah's captaincy, India won the Perth Test by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/icse-isc-board-exam-2025-datesheets-out-class-10-class-12-exam-schedule-2639935-2024-11-25",
      "headline": "CISCE datesheets out: ISC Class 12 exams from Feb 13, ICSE starts Feb 18CISCE has released the ICSE Class 10 and ISC Class 12 2025 board exam datesheets, starting February 13 and February 18 respectively, covering schools in India and multiple international locations. Check the full schedules here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-parvathy-on-why-she-stood-by-nayanthara-against-dhanush-with-salute-emoji-2639832-2024-11-25",
      "headline": "Actor Parvathy on why she stood by Nayanthara against Dhanush with 'salute' emojiActor Parvathy Thiruvothu supported Nayanthara by sharing her three-page open letter against Dhanush earlier this month. She now appreciated Nayanthara for being a self-made woman, and opened up on her decision to stand by her.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/navjot-singh-sidhu-reveals-wifes-doctor-approved-cancer-recovery-die-2639776-2024-11-25",
      "headline": "Navjot Sidhu shares Ayurveda-inspired diet that 'aided' wife's cancer recoveryNavjot Singh Sidhu recently announced that his wife is clinically cancer-free. She was diagnosed with stage 4 cancer, after which she underwent treatment and followed a strict diet plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mamata-rock-legend-kee-marcello-have-a-date-with-darjeeling-melo-tea-fest-2639879-2024-11-25",
      "headline": "Mamata, rock legend Kee Marcello have a date with Darjeeling Melo-Tea festThe festival's second edition will be grander and has caught the attention of the West Bengal CM, who will inaugurate it virtually on December 19\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/mumbai-local-gets-a-cool-upgrade-all-trains-to-go-fully-ac-soon-2639805-2024-11-25",
      "headline": "Mumbai local gets a cool upgrade: All trains to go fully AC soon!Say goodbye to sweaty rides and hello to breezy journeys! Mumbai's local trains are set to transform into the ultimate commuting experience. While this is exciting news, here are some interesting facts about Mumbai locals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/aashika-bhatia-father-dies-shares-post-saying-i-am-sorry-2639939-2024-11-25",
      "headline": "TV actor Aashika Bhatia writes 'I am sorry' in Instagram post after father's deathSocial media influencer and actor Aashika Bhatia shared the heartbreaking news of her father's death in an emotional post on Monday, November 25. Sharing a throwback picture with him, she wrote, \"I am sorry.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-returns-adani-groups-rs-100-crore-funding-for-state-university-amid-bribery-row-2639743-2024-11-25",
      "headline": "Telangana won't accept Rs 100-crore Adani funding: Revanth Reddy amid criticismTelangana Chief Minister Revanth Reddy said the state government did not take any funds or donations for the Young India Skill University from any organisation, including Adani Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-time-travelling-vampire-alien-x-profile-verified-since-3000-bce-2639922-2024-11-25",
      "headline": "Elon Musk calls himself a 'time-travelling vampire alien'. Here's how it all startedThis claim made by Elon Musk triggered social media users to examine his profile on X. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-khamenei-calls-for-death-sentence-for-israeli-prime-minister-benjamin-netanyahu-officials-hamas-hezbollah-conflict-2639820-2024-11-25",
      "headline": "Iran's Khamenei calls for death sentence for Netanyahu, Israeli officialsAyatollah Ali Khamenei was commenting on a decision by the International Criminal Court to issue arrest warrants on Thursday for Israeli Prime Minister Benjamin Netanyahu, his former defence chief and a Hamas leader, Ibrahim Al-Masri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charans-new-look-for-rc16-unveiled-by-director-buchi-babu-sana-2640080-2024-11-26",
      "headline": "Ram Charan's new look for RC16 unveiled by director Buchi Babu SanaActor Ram Charan has debuted a new look for his upcoming film RC16. A sneak-peek of his latest look was shared by director Buchi Babu Sana. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mallika-sherawat-confirms-breakup-says-difficult-to-find-a-worthy-man-2640037-2024-11-25",
      "headline": "Mallika Sherawat confirms breakup, says 'difficult to find a worthy man'Actor Mallika Sherawat recently confirmed that she is single. In a recent interview, she revealed her breakup with French boyfriend Cyrille Auxenfans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/vir-das-wears-delhi-designer-shubhangi-bajpai-2024-international-emmy-awards-2639986-2024-11-25",
      "headline": "Vir Das to wear Delhi designer at International Emmys: Happy to show her workVir Das is set to host the 52nd International Emmy Awards in New York. Ahead of the prestigious ceremony, he shared a post introducing a Delhi-based designer as his official stylist for the grand event.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-compares-animal-makers-to-perverts-shares-why-the-film-succeeded-2639956-2024-11-25",
      "headline": "Javed Akhtar compares Animal makers to 'perverts', shares why the film succeededLyricist and screenwriter Javed Akhtar recently clarified his comments on Sandeep Reddy Vanga's Animal. In an interview, he discussed the film's success and explained that he wasn't criticising the film itself, but rather the audience's reception of it."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-top-7-talking-points-rishabh-pant-rasikh-salam-dar-vaibhav-suryavanshi-david-warner-2640081-2024-11-26",
      "headline": "IPL 2025 mega auction: Top seven talking points of bidding eventThe Indian Premier League 2025 (IPL 2025) mega auction was successfully held on November 24 and 25 in Jeddah, Saudi Arabia as 182 players were sold in the bidding event. Here are the top talking points from the bidding event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-top-unsold-players-list-prithvi-shaw-david-warner-shardul-thakur-2640077-2024-11-25",
      "headline": "Top unsold players in IPL auction: Prithvi Shaw, Shardul Thakur find no buyers IPL mega auction: While the likes of Rishabh Pant and Shreyas Iyer earned massive deals, big names like David Warner and Jonny Bairstow went unsold. Surprisingly, Prithvi Shaw and Shardul Thakur found no takers in Jeddah on November 24 and 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-full-squads-top-buys-costliest-playing-11-2640074-2024-11-25",
      "headline": "IPL 2025 mega auction: Full squads, top buys and predicted XIsThe IPL 2025 mega auction saw record-breaking deals and intense bidding wars, as teams strategically built their rosters for an exhilarating season, with Rishabh Pant and Shreyas Iyer grabbing the spotlight as the costliest players in IPL history."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-david-warner-ipl-2025-mega-auction-delhi-capitals-sunrisers-hyderabad-2640050-2024-11-25",
      "headline": "David Warner's love-affair with IPL ends after opener goes unsold in auctionFormer Australia cricketer David Warner failed to find any buyers in the IPL 2025 mega auction as he got sold after having a base price of INR 2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-sunil-gavaskar-interview-jasprit-bumrah-comparison-perth-2640036-2024-11-25",
      "headline": "Jasprit Bumrah a great bowler, let's not compare him with anyone: Sunil GavaskarBorder-Gavaskar Trophy: Speaking to India Today, Sunil Gavaskar said he was not willing to compare Jasprit Bumrah with the greats of the previous generation and urged fans and pundits to enjoy the Indian fast bowler's success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-sunil-gavaskar-border-gavaskar-trophy-2024-25-australia-vs-india-perth-test-jasprit-bumrah-2639996-2024-11-25",
      "headline": "Didn't expect India to hammer Australia by 295 runs: Sunil GavaskarFormer India cricketer Sunil Gavaskar revealed that he didn't expect India to hammer Australia by a massive margin of 295 runs in the first Test of the five match series in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-auction-day-two-vaibhav-suryavanshi-sold-rajasthan-royals-meme-fest-ms-dhoni-jeddah-2639991-2024-11-25",
      "headline": "IPL auction meme fest: MS Dhoni's World Cup six older than Vaibhav SuryavanshiVaibhav Suryavanshi being sold to the Rajasthan Royals for 1.1 Crores on Day 2 of the IPL 2024 Auction has triggered a meme fest on social media on Monday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vaibhav-suryavanshi-ipl-2025-mega-auction-youngest-player-in-ipl-auction-rajasthan-royals-2639955-2024-11-25",
      "headline": "Who is Vaibhav Suryavanshi: 13-year-old lands Rs 1.1 crore deal in IPL auctionBihar batter Vaibhav Suryavanshi became the youngest player to be sold in the history of IPL auction on Monday, November 25 in Jeddah, Saudi Arabia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-musheer-khan-punjab-kings-brother-sarfaraz-khan-2639943-2024-11-25",
      "headline": "Sarfaraz Khan goes unsold, brother Musheer gets PunjabKings contractIPL mega auction: Musheer Khan will play in the Indian Premier League for the first time. The 19-year-old secured a Rs 30 lakh contract from Punjab Kings. His brother Sarfaraz did not find takers in the initial rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-aus-vs-ind-perth-test-sunil-gavaskar-reaction-jasprit-bumrah-virat-kohli-2639934-2024-11-25",
      "headline": "Sunil Gavaskar in awe of Jasprit Bumrah's captaincy, decodes Virat Kohli changeSpeaking to India Today, legendary Sunil Gavaskar praised Jasprit Bumrah's captaincy in the Perth Test. The former captain decoded Virat Kohli's turnaround for his hundred and backed India to continue their dominant run in the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-auction-day-two-vaibhav-suryavanshi-sold-rajasthan-royals-meme-fest-ms-dhoni-jeddah-2639991-2024-11-25",
      "headline": "IPL auction meme fest: MS Dhoni's World Cup six older than Vaibhav SuryavanshiVaibhav Suryavanshi being sold to the Rajasthan Royals for 1.1 Crores on Day 2 of the IPL 2024 Auction has triggered a meme fest on social media on Monday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vaibhav-suryavanshi-ipl-2025-mega-auction-youngest-player-in-ipl-auction-rajasthan-royals-2639955-2024-11-25",
      "headline": "Who is Vaibhav Suryavanshi: 13-year-old lands Rs 1.1 crore deal in IPL auctionBihar batter Vaibhav Suryavanshi became the youngest player to be sold in the history of IPL auction on Monday, November 25 in Jeddah, Saudi Arabia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-musheer-khan-punjab-kings-brother-sarfaraz-khan-2639943-2024-11-25",
      "headline": "Sarfaraz Khan goes unsold, brother Musheer gets PunjabKings contractIPL mega auction: Musheer Khan will play in the Indian Premier League for the first time. The 19-year-old secured a Rs 30 lakh contract from Punjab Kings. His brother Sarfaraz did not find takers in the initial rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-aus-vs-ind-perth-test-sunil-gavaskar-reaction-jasprit-bumrah-virat-kohli-2639934-2024-11-25",
      "headline": "Sunil Gavaskar in awe of Jasprit Bumrah's captaincy, decodes Virat Kohli changeSpeaking to India Today, legendary Sunil Gavaskar praised Jasprit Bumrah's captaincy in the Perth Test. The former captain decoded Virat Kohli's turnaround for his hundred and backed India to continue their dominant run in the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/who-is-priyansh-arya-sixer-king-triggers-bidding-war-in-ipl-2025-mega-auction-2639930-2024-11-25",
      "headline": "Who is Priyansh Arya? Sixer King triggers bidding war in IPL 2025 mega auctionIPL 2025 mega auction: Priyansh Arya triggered a bidding war between PBKS and RCB as he was eventually sold for Rs 3.80 crore to Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-chennai-super-kings-who-is-gurjapneet-singh-jeddah-2639923-2024-11-25",
      "headline": "IPL 2025 Auction: Who is Gurjapneet Singh? Chennai's new 'local player'Chennai Super Kings decided to break the bank and bring in their 'local player' Gurjapneet Singh into their squad during Day 2 of the IPL 2025 Auction. Gurjapneet, who plays for Tamil Nadu, has made a big impression on the domestic circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-akash-ambani-walks-to-rcbs-auction-table-to-shake-hands-after-will-jacks-deal-2639909-2024-11-25",
      "headline": "Akash Ambani walks to RCB's auction table to shake hands after Will Jacks dealIPL 2025 mega auction: Akash Ambani stood up and walked to the RCB auction table to shake hands with their management. This happened when RCB did not opt to RTM Will Jacks after he was sold to MI for RS 5.25 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sunil-gavaskar-jasprit-bumrah-captaincy-2639907-2024-11-25",
      "headline": "Gavaskar backs Bumrah for captaincy, dismisses 'Bakwas' misconceptionAUS vs IND: Sunil Gavaskar said that Jasprit Bumrah can go on to become an efficient captain for India in the future. On Monday, under Bumrah's captaincy, India won the Perth Test by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-loses-first-round-ding-liren-china-2639884-2024-11-25",
      "headline": "Chess World Championship: India's D Gukesh loses to Ding Liren in Game 1Indian Grandmaster D Gukesh lost to defending champion Ding Liren in opening game of World Chess Championship in Singapore on Monday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-will-jacks-sold-to-mumbai-indians-royal-challengers-refuse-rtm-jeddah-2639877-2024-11-25",
      "headline": "RCB refuses to use RTM for Will Jacks, England star heads to MI for Rs. 5.25 CrRoyal Challengers Bengaluru decided not to use their Right to Match Card to bring back Will Jacks back to their side as the England all-rounder ended up going to Mumbai Indians on November 25, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-deepak-chahar-mumbai-indians-wankhede-stadium-ipl-2025-mega-auction-2639872-2024-11-25",
      "headline": "Deepak Chahar eager to bowl in Wankhede after MI buys him for Rs 9.25 croreIndia all rounder Deepak Chahar revealed that he's eager to bowl in seam and swinging conditions of the Wankhede Stadium after being sold to Mumbai Indians for INR 9.25 crore in IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-rcb-virat-kohli-captaincy-mo-babar-feedback-perth-test-hundred-2639828-2024-11-25",
      "headline": "RCB yet to decide captain, Virat Kohli texted us IPL auction feedback: Team Director IPL 2025 auction: RCB Director of Cricket Mo Babat said the team is yet to decide their next captain. Babat revealed Virat Kohli sent them feedback about their auction buys after his Perth Test hundred on Sunday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-loses-first-round-ding-liren-china-2639884-2024-11-25",
      "headline": "Chess World Championship: India's D Gukesh loses to Ding Liren in Game 1Indian Grandmaster D Gukesh lost to defending champion Ding Liren in opening game of World Chess Championship in Singapore on Monday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-will-jacks-sold-to-mumbai-indians-royal-challengers-refuse-rtm-jeddah-2639877-2024-11-25",
      "headline": "RCB refuses to use RTM for Will Jacks, England star heads to MI for Rs. 5.25 CrRoyal Challengers Bengaluru decided not to use their Right to Match Card to bring back Will Jacks back to their side as the England all-rounder ended up going to Mumbai Indians on November 25, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-deepak-chahar-mumbai-indians-wankhede-stadium-ipl-2025-mega-auction-2639872-2024-11-25",
      "headline": "Deepak Chahar eager to bowl in Wankhede after MI buys him for Rs 9.25 croreIndia all rounder Deepak Chahar revealed that he's eager to bowl in seam and swinging conditions of the Wankhede Stadium after being sold to Mumbai Indians for INR 9.25 crore in IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-rcb-virat-kohli-captaincy-mo-babar-feedback-perth-test-hundred-2639828-2024-11-25",
      "headline": "RCB yet to decide captain, Virat Kohli texted us IPL auction feedback: Team Director IPL 2025 auction: RCB Director of Cricket Mo Babat said the team is yet to decide their next captain. Babat revealed Virat Kohli sent them feedback about their auction buys after his Perth Test hundred on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-use-their-1st-rtm-for-swapnil-singh-buy-him-for-rs-50-lakh-in-ipl-auction-2639846-2024-11-25",
      "headline": "RCB use their 1st RTM for Swapnil Singh, buy him for Rs 50 lakh in IPL auctionRCB finally exercised their Right to Match option  as they managed to buy back Swapnil SIngh at Rs 50 lakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-sourav-ganguly-australia-warning-indian-cricket-team-2639843-2024-11-25",
      "headline": "Sourav Ganguly warns Australia after Perth loss: Will be a long series for youSourav Ganguly has cautioned Australia following India's emphatic victory in the Perth Test. He praised the Indian team's talent and warned of a challenging series ahead for the hosts if they don't play well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anshul-kamboj-ipl-2025-mega-auction-chennai-super-kings-ranji-trophy-10-wicket-haul-2639825-2024-11-25",
      "headline": "Anshul Kamboj gets 3.40 crore deal after historic 10-wicket haul in Ranji TrophyHaryana pacer Anshul Kamboj was sold for INR 3.40 crore to Chennai Super Kings in the IPL 2025 mega auction. He recently became the third bowler to take all ten wickets to fall in an innings in Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-wtc-points-table-perth-test-2639822-2024-11-25",
      "headline": "India reclaim top spot in WTC 2023-25 points table after Perth Test winAUS vs IND: India went back to the top of the table in the WTC 2023-25 cyle after beating Pat Cummins' Australia by 295 runs at the Optus Stadium. The Aussies, meanwhile, fell to second. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}