{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-10-30-50-formula-edelweiss-mf-radhika-gupta-on-smart-money-habits-2776514-2025-08-25",
      "headline": "What is the 10-30-50 formula? Edelweiss MF's Radhika Gupta on smart money habitsRadhika Gupta explained that this tug of war between splurging and saving is not new. In fact, she advised a simple rule for different life stages, i.e., the 10-30-50 principle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-retains-its-rating-for-india-sees-growth-at-65-percent-2776462-2025-08-25",
      "headline": "Fitch retains its rating for India, sees growth at 6.5%Fitch's rating comes days after S&P Global Ratings lifted its sovereign credit rating on India, citing strong economic growth, marking its first upgrade in 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-329-points-higher-nifty-above-24950-infosys-gains-3-percent-2776450-2025-08-25",
      "headline": "Sensex ends 329 points higher, Nifty above 24.950; Infosys gains 3%The S&P BSE Sensex added 329.06 points to close at 81,635.91, while the NSE Nifty50 gained 97.65 points to end at 24,967.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-wedding-gifts-really-tax-free-here-is-the-answer-2776443-2025-08-25",
      "headline": "Are wedding gifts really tax-free? Here's the answerIn India, weddings are full of joy, rituals and generous gifts. But when the celebrations end, many couples wonder, do these gifts come with hidden tax bills? The answer may surprise you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pmo-to-convene-big-meeting-tomorrow-as-us-tariffs-set-to-come-into-force-sources-2776418-2025-08-25",
      "headline": "PMO to convene big meeting tomorrow as US tariffs set to come into force: SourcesThe Prime Minister's Office will hold a high-level review meeting on August 26 to assess support measures for Indian exporters hit by higher US tariffs. The session, chaired by the PM's Principal Secretary, comes as Washington doubles duties, with Indian goods now facing a steep 50% tariff, raising cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ahpi-bajaj-allianz-cashless-treatment-hospital-body-meeting-insurance-rejection-claims-girdhar-gyani-2776408-2025-08-25",
      "headline": "Why hospitals have barred cashless services from Bajaj Allianz policyholdersThe meeting between AHPI's (Association of Healthcare Providers India) will include core committee members and senior representatives from Bajaj Allianz, and is scheduled for August 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-on-the-one-skill-ai-can-not-replace-2776378-2025-08-25",
      "headline": "Zerodha's Nithin Kamath on the one skill AI can't replaceNithin Kamath explained that curiosity should not be confined to a person's own role but should extend to the larger environment around them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pmo-to-chair-key-meeting-on-50-us-tariffs-tomorrow-details-here-2776375-2025-08-25",
      "headline": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: SourcesStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/common-empanelment-explained-why-big-private-hospitals-and-insurers-are-at-odds-2776335-2025-08-25",
      "headline": "Common empanelment explained: Why big private hospitals and insurers are at oddsCommon empanelment aims to simplify cashless insurance in India, but hospitals resist over tariffs and operational issues, leaving policyholders' access dependent on achieving fair rates, efficient settlements, and system flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-itr-filing-deadline-be-extended-again-after-delayed-rollout-of-utilities-2776296-2025-08-25",
      "headline": "Will ITR filing deadline be extended again after delayed rollout of utilities?With the revised ITR utilities coming out much later than expected, taxpayers and professionals are now questioning whether the government will grant another extension to ease the compliance burden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/mangal-electrical-ipo-allotment-out-today-check-status-listing-gains-stock-market-debut-2776284-2025-08-25",
      "headline": "Mangal Electrical IPO allotment out: Check your status, possible listing gainsInvestors who applied for the Mangal Electrical IPO can check their allotment status through two official platforms, the BSE website and the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wallet-money-cash-winning-dream11-mpl-winzo-zupee-withdrawal-online-gaming-bill-2025-2776264-2025-08-25",
      "headline": "Online gaming law: Will users get Dream11, MPL, Winzo wallet cash?The Online Gaming Bill, cleared by both Lok Sabha and Rajya Sabha this week, bans all forms of online money games. These are defined as games where players deposit money, directly or indirectly, with the hope of winning cash rewards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-gain-infosys-tcs-wipro-why-are-they-rising-today-2776249-2025-08-25",
      "headline": "Infosys, TCS, Wipro rally: Why are IT stocks rising today?Analysts said the rally reflects expectations that lower US interest rates will make emerging markets, including India, more attractive to foreign investors, supporting inflows into the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-200-points-nifty-above-24900-it-stocks-lead-gains-2776241-2025-08-25",
      "headline": "Sensex rises over 200 points, Nifty above 24,900; IT stocks lead gainsAt 9:22 am, the BSE Sensex rose 203.14 points to 81,509.99, while the NSE Nifty50 advanced 53.20 points to 24,923.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-likely-by-dussehra-government-braces-for-big-revenue-shortfall-2776239-2025-08-25",
      "headline": "New GST rates likely by Dussehra, government braces for big revenue shortfallThe proposed GST revamp aims to simplify the tax system by introducing a two-tier rate structure of 5% and 18%, along with a 40% levy on sin goods. While the move promises greater simplicity, it is expected to significantly impact revenues for both central and state governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/this-is-how-new-income-tax-bill-2025-brings-relief-for-salaried-and-small-taxpayers-2775991-2025-08-24",
      "headline": "How new Income Tax Bill 2025 brings relief for salaried and small taxpayersEndless forms and confusing jargon may soon be history. The New Income Tax Bill 2025 could be the game-changer salaried and small taxpayers have been waiting for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2024-25-comparing-deductions-under-old-and-new-tax-regime-2775132-2025-08-22",
      "headline": "ITR filing 2024–25: Comparing deductions under old and new tax regimeFiling your Income Tax Return for FY 2024–25? Before you decide on old or new tax regime, it's important to know how deductions differ. The right choice could help reduce your taxable income and overall tax burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-middle-class-feels-stuck-between-taxes-and-emis-explains-ca-2775094-2025-08-22",
      "headline": "Why middle class feels stuck between taxes and EMIs, explains CAThe burden is not just about taxes. Price hikes on fuel, food, education, and healthcare hit the middle class the hardest. Unlike the rich, they cannot hedge against inflation with high-value assets. Unlike the poor, they don't receive government relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falling-sensex-nifty-down-why-reason-fed-speech-jackson-hole-it-banking-shares-down-2775089-2025-08-22",
      "headline": "Sensex down 600 points: Why is stock market falling today?At closing bell, indices opened marginally lower but kept sliding as the day went on. Sensex and Nifty declined over half a percent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-life-health-insurance-premiums-become-cheaper-with-zero-gst-proposal-2775076-2025-08-22",
      "headline": "Will life, health insurance premiums become cheaper with zero GST proposal?Will zero GST on life and health insurance truly make premiums cheaper or will input credit losses and policy design dilute the benefits for most customers? Read to know what experts have to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-90-points-nifty-above-25050-wipro-maruti-lead-gains-2775034-2025-08-22",
      "headline": "Sensex down 350 points, Nifty below 25,000; Wipro, HCLTech down 2%The S&P BSE Sensex was down by 380.59 points to 81,620.12, while the NSE Nifty50 declined 127.95 points to 24,956.25 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mpl-zupee-suspend-paid-games-after-online-gaming-bill-clears-parliament-2775021-2025-08-22",
      "headline": "Dream11, MPL suspend money-based games after Online Gaming Bill clears ParliamentReal-money gaming faces a knockout blow as Dream11, MPL, and Zupee halt money-based online games. Dream11 is also likely to follow suit after sweeping ban."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/less-than-40-percent-itrs-processed-as-government-pushes-deadline-to-september-15-2774766-2025-08-21",
      "headline": "Less than 40% ITRs processed as government pushes deadline to September 15The Finance Ministry has pushed the ITR deadline to 15 September citing extensive changes in forms and utilities. But three months in, processing is still crawling at under 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-143-points-higher-nifty-above-25000-pharma-stocks-gain-2774715-2025-08-21",
      "headline": "Sensex, Nifty gain for 6th straight session on GST reforms optimismThe S&P BSE Sensex was up 142.87 points to 82,000.71 at the closing bell, while the NSE Nifty50 rose 33.20 points to settle at 25,083.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/group-of-ministers-on-gst-approves-scrapping-of-12-28-slabs-2774697-2025-08-21",
      "headline": "Key panel okays scrapping of 12%, 28% GST slabs; 90% goods may get cheaperIn a key meeting held on Thursday, the panel of state ministers accepted the Centre's plan to reduce the four-rate system to two main slabs of 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-can-retirees-stay-safe-from-risky-too-good-to-be-true-schemes-safe-investments-for-retirees-2774609-2025-08-21",
      "headline": "How can retirees stay safe from risky 'too good to be true' schemes?Many retirees fall prey to schemes that seem too good to be true, chasing high returns without understanding the risks. Protecting your savings requires caution, awareness, and smart investment choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-zero-percent-insurance-premium-costly-cheap-input-tax-credit-policyholders-personal-finance-2774569-2025-08-21",
      "headline": "Why zero GST on insurance premiums doesn't mean cheaper policies for youOn the surface, removing GST on insurance premiums seems like a big relief, but experts caution that the outcome may not be what many are expecting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-claims-how-to-select-right-epfo-form-for-withdrawal-pension-or-transfer-2774560-2025-08-21",
      "headline": "EPFO withdrawal, pension or transfer: How to choose the right PF formEPFO members often get confused about which form to fill for withdrawals, transfers, or pension claims. Using the right form not only saves time but also avoids delays or rejection of your application."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/80-percent-of-emergency-funds-dont-work-when-needed-ca-explains-why-2774526-2025-08-21",
      "headline": "CA explains why 80% of emergency funds don't work when neededMost people believe they are financially prepared for tough times, but when a real crisis hits, their so-called emergency funds often fall short. A chartered accountant explains why this happens and how to fix it."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/avneet-kaur-reacts-to-virat-kohli-liking-her-insta-post-let-the-love-keep-coming-2776613-2025-08-25",
      "headline": "Avneet Kaur reacts to Virat Kohli liking her Insta post: Let the love keep comingAvneet Kaur addressed the social media controversy involving Virat Kohli. At the trailer launch of her film 'Love in Vietnam', she reacted to the incident, saying \"let the love come\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/all-about-armaan-malik-first-stadium-tour-bringing-global-pop-vision-home-2776618-2025-08-25",
      "headline": "All about Armaan Malik's first stadium tour bringing global pop vision homeArmaan Malik prepares for his first-ever stadium show in Mumbai, culminating a multi-city tour that celebrates his evolution from Bollywood playback singer to global pop artist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kumail-nanjiani-signed-6-mcu-films-turned-therapy-after-eternals-failed-marvel-2776596-2025-08-25",
      "headline": "Kumail Nanjiani says he signed 6 MCU films, turned to therapy after Eternals failedKumail Nanjiani reveals how the poor reception of Marvel's Eternals deeply affected him. He sought therapy to cope with the unexpected career and personal challenges that followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-calls-parineeta-her-dream-debut-as-it-returns-to-cinemas-after-20-years-2776586-2025-08-25",
      "headline": "Vidya Balan calls Parineeta her dream debut as it returns to cinemas after 20 yearsVidya Balan's debut film 'Parineeta' will be re-released on its 20th anniversary. Ahead of that, the actor called it her \"dream debut\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-returns-to-south-korea-to-host-manager-kim-taehyung-wedding-2776585-2025-08-25",
      "headline": "BTS' Jin returns to South Korea to host manager Kim Taehyung's weddingBTS member Jin is back in South Korea to host the wedding of a close manager. Just a day earlier, he was seen in the audience at his juniors' concert, TOMORROW X TOGETHER."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-wellness-podcast-womens-ageing-self-kindness-2776578-2025-08-25",
      "headline": "Soha Ali Khan launches podcast on women's wellness and ageingSoha Ali Khan has launched a wellness podcast called 'All About Her' focusing on women's insecurities and ageing. The show aims to create a safe, unfiltered space for conversations on wellness and self-kindness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-48-hour-shoot-marathon-after-london-vacation-2776526-2025-08-25",
      "headline": "Kartik Aaryan sets on a non-stop 48-hour shoot marathon after returning from LondonActor Kartik Aaryan returned to Mumbai after a relaxing London holiday. He updated about his intense 48-hour shoot marathon on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-malhotra-on-shahid-kapoor-ishq-vishk-mania-fans-scratched-us-i-still-bear-the-mark-2776559-2025-08-25",
      "headline": "Vishal Malhotra on Ishq Vishk mania: Fans scratched us, I still bear the markActor Vishal Malhotra fondly recalled the memorable release day of 'Ishq Vishk', highlighting both the film's success and the overwhelming fan frenzy that left him physically marked. The film hit theatres in 2003. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/demon-slayer-conquered-pop-culture-in-record-time-anime-animania-2776515-2025-08-25",
      "headline": "How Demon Slayer conquered pop culture in record timeIn this week's Animania we will discover how 'Demon Slayer' went from Japanese comic to global pop culture juggernaut, breaking sales and box office records with its story, art, and emotional pull.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shriya-pilgaonkar-joins-akshay-kumar-saif-ali-khan-haiwaan-thriller-oppam-remake-2776438-2025-08-25",
      "headline": "Shriya Pilgaonkar joins Akshay, Saif in Priyadarshan's thriller Haiwaan. ReportsActor Shriya Pilgaonkar has joined director Priyadarshan's upcoming thriller Haiwaan. The film is a Hindi remake of the Malayalam hit 'Oppam' and marks a major reunion of actors Akshay Kumar and Saif Ali Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/britney-spears-fans-concerned-after-she-shares-nude-photo-with-cryptic-post-2776400-2025-08-25",
      "headline": "Britney Spears' fans concerned after she shares nude photo with cryptic postPop star Britney Spears' latest nude Instagram post has set the internet abuzz. Fans are concerned about her well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-walking-dead-actor-norman-reedus-son-mingus-pleads-not-guilty-to-assault-charges-2776473-2025-08-25",
      "headline": "Walking Dead actor Norman Reedus' son Mingus pleads not guilty to assault chargesMingus Reedus, the son of 'The Walking Dead' actor Norman Reedus and supermodel Helena Christensen, has pleaded not guilty to a series of misdemeanour charges in Manhattan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/karan-aujla-recalls-surviving-six-gun-attacks-in-canada-calls-punjab-safest-2776536-2025-08-25",
      "headline": "Singer Karan Aujla recalls surviving six gun attacks in Canada, calls Punjab safestPunjabi singer-rapper Karan Aujla opened up about surviving multiple gunfire attacks in Canada and the criticism he faced for moving to Dubai. He explained why choosing his family's safety over public perception was the only decision he could make."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rise-and-fall-trailer-dhanashree-talks-broken-trust-ashneer-grover-show-mx-player-arjun-bijlani-kiku-sharda-2776483-2025-08-25",
      "headline": "Rise & Fall trailer: Dhanashree talks about broken trust on Ashneer Grover showHosted by entrepreneur Ashneer Grover, the trailer for 'Rise & Fall', was released on Monday. It gave a glimpse into the show, featuring 16 celebrity contestants, including Arjun Bijlani, Dhanashree Verma, Kiku Sharda and Kubbra Sait. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-vidyarthi-says-apoorva-mukhija-apologised-after-the-traitors-2776465-2025-08-25",
      "headline": "No grudges: Ashish Vidyarthi says Apoorva Mukhija apologised after The TraitorsActor Ashish Vidyarthi denied being on bad terms with influencer Apoorva Mukhija after 'The Traitors'. He said the Rebel Kid apologised for disrespectfully talking about him on the show. Vidyarthi also said that he advised Mukhija to carve her own path. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-shares-it-took-six-months-to-design-hrithik-roshan-iconic-krrish-mask-2776499-2025-08-25",
      "headline": "Rakesh Roshan shares it took six months to design Hrithik's iconic Krrish maskDirector Rakesh Roshan shared that it took six months to design actor Hrithik Roshan's iconic Krrish mask, which was made of wax and required special care as it melted within hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-attends-ganga-aarti-in-rishikesh-shares-video-from-her-spiritual-visit-2776313-2025-08-25",
      "headline": "Farah Khan attends Ganga Aarti in Rishikesh, shares video from her spiritual visitFarah Khan attended the Ganga Aarti in Rishikesh for the first time, calling it a beautiful and divine experience blessed with rain. She also announced YouTube FanFest 2025, which will feature over 20 creators and artists across comedy, music, dance, gaming, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sunny-deol-praises-aryan-khans-debut-bads-of-bollywood-says-shah-rukh-khan-will-be-proud-2776350-2025-08-25",
      "headline": "Sunny Deol praises Aryan Khan's debut Ba***ds of Bollywood, says SRK will be proudAryan Khan's directorial debut 'Ba***ds of Bollywood' received praise from Sunny Deol, who shared the show's preview and a heartfelt note calling it absolutely fantastic. The Netflix satire, featuring Bobby Deol and cameos by Salman Khan, Ranveer Singh, and Karan Johar, will stream from September 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ashnoor-kaur-bigg-boss-19-youngest-contestant-aims-first-young-winner-2776496-2025-08-25",
      "headline": "Who is Ashnoor Kaur, Bigg Boss 19's youngest contestant?Ashnoor Kaur is the youngest contestant on 'Bigg Boss 19' this year. Her entry has sparked curiosity about how she will face the show's intense drama and politics."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-matter-how-much-pressure-comes-well-find-a-way-out-says-pm-in-ahmedabad-ahead-of-50-us-tariff-deadline-2776588-2025-08-25",
      "headline": "We'll find way out despite pressure: PM stays firm ahead of 50% US tariff deadlinePrime Minister Narendra Modi, while addressing the public in Ahmedabad, said that India will stand firm no matter how much pressure comes. This was in response to the US tariff of 50% which is effective tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-university-doesnt-need-to-disclose-pm-modis-graduation-degree-high-court-overturns-panels-order-2776440-2025-08-25",
      "headline": "PM Modi's degree personal info: Court cancels panel's order to disclose detailsThe Delhi High Court set aside the Central Information Commissioner's 2016 order and ruled that Delhi University need not disclose details of Prime Minister Narendra Modi's 1978 graduation degree."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-vote-chori-amit-malviya-highest-vote-share-election-commission-bjp-parliament-election-2024-2776494-2025-08-25",
      "headline": "BJP shares Congress poll data to take on Rahul Gandhi's 'vote chori' chargeThe BJP countered Congress's 'vote chori' charge, with Amit Malviya stating that the Congress and its allies secured its highest vote share in 35 years in the 2024 elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pmo-to-chair-key-meeting-on-50-us-tariffs-tomorrow-details-here-2776375-2025-08-25",
      "headline": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: SourcesStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/astro-not-the-textual-orientation-is-so-wrong-bjp-mp-anurag-thakur-hanuman-neil-armstrong-himachal-school-2776546-2025-08-25",
      "headline": "Astro Not, Anurag Thakur! Lord Hanuman's Legendary Leap isn't LiteralBJP MP Anurag Thakur quizzed school kids about the first astronaut. He corrected their Neil Armstrong, not with Yuri Gagarin, but with a divine detour, \"Hanuman ji\". This common error happens because of a textual understanding of the scriptures. Lord Hanuman's legendary leap is a metaphor for devotion and strength, and not meant to be a manual for the moon mission."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-amit-shahs-remarks-aap-running-delhi-government-from-jail-2776560-2025-08-25",
      "headline": "Framed in false case, ran government from jail: Arvind Kejriwal jabs Amit ShahArvind Kejriwal hit back at Amit Shah's remarks on AAP running the Delhi government from jail, calling the case against him a political conspiracy and accusing the BJP of shielding criminals while targeting opponents with false charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-warns-pakistan-of-flood-situation-in-jammu-and-kashmir-in-the-tawi-river-on-humanitarian-grounds-2776476-2025-08-25",
      "headline": "India warns Pak over J&K floods in rare goodwill gesture amid Indus treaty freezeThe communication was made by the Indian High Commission in Islamabad on Sunday to the Pakistani Foreign Ministry on the matter. This is the first time that an information regarding such a matter has been sent via the High Commission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/voter-adhikar-yatra-bjps-vote-chori-dubious-double-engine-has-riled-bihar-2776517-2025-08-25",
      "headline": "Voter Adhikar Yatra: 'BJP's vote chori, dubious 'double engine' has riled Bihar'Q&A with CPI(ML) Liberation general secretary Dipankar Bhattacharya on the impact of Rahul Gandhi's Voter Adhikar Yatra and Prashant Kishor's prospects in the Bihar assembly polls"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/when-women-die-we-scroll-indias-outrage-gap-on-gendered-violence-2776322-2025-08-25",
      "headline": "When women die, we scroll: India's outrage gap on gendered violenceViolence against women is not accidental or spontaneous; it is structural, patterned, and legitimised through custom, silence, and legal delay. It is no longer perceived as a rupture but as routine, an unending cycle that reveals a society deeply invested in disciplining, diminishing, and discarding women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-new-dui-bill-deport-green-card-h1b-visa-holders-drink-and-drive-cases-trump-dui-indian-immigrants-2776387-2025-08-25",
      "headline": "Will US deport Green Card, visa holders using old drunk-driving cases?A new US bill could make a single drink and drive case, even from years ago, the grounds for deportation or entry denial for Green Card and visa holders. Immigrant communities and experts fear it could bypass due process and disproportionately affect legal residents. The bill could affect lakhs of Indians working or studying in the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/20-year-old-ktaka-woman-killed-by-lover-in-mysuru-lodge-using-explosive-powder-stick-2776454-2025-08-25",
      "headline": "Married woman, 20, killed by lover with explosive powder stick in Karnataka lodgeA 20-year-old married woman was murdered by her lover in a Mysuru lodge after a quarrel. The accused allegedly killed her using an explosive powder stick before being caught by locals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/will-india-have-trump-ear-through-sergio-gor-what-nomination-means-new-delhi-washington-whats-next-2776404-2025-08-25",
      "headline": "Will Sergio Gor open DC doors for Delhi or give India Trump's jolt?Donald Trump's nomination of Sergio Gor as ambassador to India offers New Delhi a rare direct line to the US President, given his access and proximity. Yet Gor's lack of diplomatic experience, unclear stance on tariffs and India-Pakistan ties, and overlapping role as Special Envoy create uncertainties. What does it mean for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/icse-schools-selective-board-strong-english-science-education-india-2776426-2025-08-25",
      "headline": "CBSE vs ICSE: Why are there fewer ICSE schools despite its strong reputation?ICSE schools remain fewer but are highly valued for their rigorous syllabus and strong English foundations. This exclusivity highlights quality education focused on holistic learning rather than mass expansion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-announces-meat-egg-ban-on-august-28-and-september-6-due-to-religious-festivals-2776572-2025-08-25",
      "headline": "Rajasthan bans meat and egg on August 28, September 6 due to religious festivalsIn a first, the sale of eggs has also been banned for two days throughout the state on these two days. According to sources, the decision to ban the sale of meat and eggs was taken due to the demands of religious organisations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ahpi-bajaj-allianz-cashless-treatment-hospital-body-meeting-insurance-rejection-claims-girdhar-gyani-2776408-2025-08-25",
      "headline": "Why hospitals have barred cashless services from Bajaj Allianz policyholdersThe meeting between AHPI's (Association of Healthcare Providers India) will include core committee members and senior representatives from Bajaj Allianz, and is scheduled for August 28. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-student-shot-dead-at-home-cops-suspect-she-was-killed-over-breakup-2776495-2025-08-25",
      "headline": "Bengal student shot dead at home, cops suspect she was killed over breakupA college student preparing for the NEET medical entrance exam was shot dead at her residence in Krishnanagar. Police suspect a former friend behind the crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-announce-pregnancy-blessed-beyond-measure-2776331-2025-08-25",
      "headline": "Parineeti Chopra, Raghav Chadha announce pregnancy: Blessed beyond measureParineeti Chopra and Raghav Chadha are going to welcome their first child soon. The couple announced the news on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/bjp-slams-kerala-government-says-inviting-tamil-nadu-chief-minister-mk-stalin-to-ayyappa-sangamam-event-like-hitler-celebrating-jews-2776312-2025-08-25",
      "headline": "Like Hitler celebrating Jews: BJP slams Kerala's invite to Stalin for Ayyappa eventThe BJP launched a blistering attack on the Kerala government for inviting Tamil Nadu Chief Minister MK Stalin to the Global Ayyappa Sangamam, calling it hypocrisy and likening it to \"Hitler celebrating Jews.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/scientists-confirm-strongest-ever-alien-signal-it-never-repeated-2776519-2025-08-25",
      "headline": "Scientists confirm strongest-ever alien signal. It never repeatedNicknamed RBFLOAT — Radio Brightest Flash Of All Time — this ultrabright burst lasted just milliseconds but outshone every other radio source in its host galaxy during that fleeting moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indias-forex-reserve-rebound-is-a-march-towards-stability-in-money-markets-2776535-2025-08-25",
      "headline": "How India's forex reserve rebound is a march towards stability in money marketsFrom record highs to sharp declines and a resilient rebound, India's foreign exchange reserves tell a story of strategic economic shifts and robust domestic drivers"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ahmedabad-school-stabbing-four-psychiatrists-psychologists-reveal-why-children-are-turning-violent-2776348-2025-08-25",
      "headline": "Ahmedabad school stabbing: Why are children turning violent?A Class 10 student was fatally stabbed by a junior during a school fight in Ahmedabad. The incident exposes growing youth aggression and urgent mental health challenges in Indian schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/sergio-gor-and-the-new-us-great-game-in-asia-2776414-2025-08-25",
      "headline": "Sergio Gor and the new US Great Game in AsiaDonald Trump's new envoy to New Delhi coincides with the return of the US to South and Central Asia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-police-files-chargesheet-against-cpm-leaders-for-instigating-mob-in-rg-kar-vandalism-2776512-2025-08-25",
      "headline": "CPM leaders instigated mob to vandalise RG Kar hospital: Kolkata Police chargesheetThe unruly mob completely vandalised the ground floor of the emergency ward of RG Kar hospital in the night of August 14. Several officials and police personnel were injured during the vandalism. A total of five cases were registered by Kolkata police in this matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/tailor-strangles-woman-over-money-dispute-dumps-her-body-in-delhi-drain-arrested-2776480-2025-08-25",
      "headline": "Tailor strangles woman over money dispute, dumps her body in Delhi drain, arrestedA man killed a woman and dumped her body in a drain allegedly over a money dispute in Delhi. He was arrested two days later by the police in Uttar Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kumail-nanjiani-signed-6-mcu-films-turned-therapy-after-eternals-failed-marvel-2776596-2025-08-25",
      "headline": "Kumail Nanjiani says he signed 6 MCU films, turned to therapy after Eternals failedKumail Nanjiani reveals how the poor reception of Marvel's Eternals deeply affected him. He sought therapy to cope with the unexpected career and personal challenges that followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-calls-parineeta-her-dream-debut-as-it-returns-to-cinemas-after-20-years-2776586-2025-08-25",
      "headline": "Vidya Balan calls Parineeta her dream debut as it returns to cinemas after 20 yearsVidya Balan's debut film 'Parineeta' will be re-released on its 20th anniversary. Ahead of that, the actor called it her \"dream debut\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-wellness-podcast-womens-ageing-self-kindness-2776578-2025-08-25",
      "headline": "Soha Ali Khan launches podcast on women's wellness and ageingSoha Ali Khan has launched a wellness podcast called 'All About Her' focusing on women's insecurities and ageing. The show aims to create a safe, unfiltered space for conversations on wellness and self-kindness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-48-hour-shoot-marathon-after-london-vacation-2776526-2025-08-25",
      "headline": "Kartik Aaryan sets on a non-stop 48-hour shoot marathon after returning from LondonActor Kartik Aaryan returned to Mumbai after a relaxing London holiday. He updated about his intense 48-hour shoot marathon on social media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-top-5-knocks-test-cricket-2776626-2025-08-25",
      "headline": "From Ahmedabad to Adelaide: Top 5 knocks of Pujara in Test cricketCheteshwar Pujara, India's resilient No. 3, retired from all forms of Indian cricket on August 24, bringing the curtain down on a 15-year career that saw him score 7,195 runs in 103 Tests with unmatched grit and patience.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hridaya-jain-slovenia-transfer-nk-brinje-grosuplje-i-league-delhi-fc-ranjit-bajaj-2776622-2025-08-25",
      "headline": "Who is Hridaya Jain? Karnataka boy who signed for Slovenia's 2nd division clubAt just 19, Hridaya Jain's move to Slovenia's NK Brinje Grosuplje offers Indian football fresh hope. From winning I-League Emerging Player honors with Delhi FC to chasing a European dream, the Karnataka teenager carries the promise of a new generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-2-live-updates-carlos-alcaraz-mirra-andreeva-2776620-2025-08-25",
      "headline": "Day 2 LIVE: Barbora Krejcikova, Madison Keys to begin proceedingsUS Open 2025 Day 2 Live Updates: Barbora Krejcikova will lock horns with Victoria Mboko in the first round. Later in the day, Madison Keys, Elena Rybakina, and Carlos Alcaraz will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexandra-eala-us-open-rafael-nadal-sister-2776608-2025-08-25",
      "headline": "Rafael Nadal's sister elated after Alexandra Eala's historic triumphRafael Nadal's sister Maribel congratulated Alexandra Eala, who scripted history at the US Open by becoming the first Filipino in the Open Era to win a Grand Slam main-draw match, defeating 14th seed Clara Tauson. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-lakshya-sen-first-round-exit-shi-yuqi-2776604-2025-08-25",
      "headline": "Valiant Lakshya Sen bows out in first round in heartbreaking return to ParisBWF World Championships 2025: Former bronze medallist Lakshya Sen fought hard in the opening round, but China's top seed Shi Yuqi proved too strong. It marked Lakshya's ninth first-round exit of the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/hockey-asia-cup-india-reclaiming-title-world-cup-berth-harmanpreet-singh-criag-fulton-2776580-2025-08-25",
      "headline": "India confident of clinching Asia Cup hockey crown and World Cup berthIndia, led by coach Craig Fulton and captain Harmanpreet Singh, exude confidence ahead of the Asia Cup. Yet, the team insists no opponent will be taken lightly as they chase their first title since 2017."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/yashavsi-jaiswal-will-get-his-chance-in-indian-t20i-team-soon-farveez-maharoof-2776561-2025-08-25",
      "headline": "Yashavsi Jaiswal will get his chance in Indian T20I team soon: Farveez MaharoofFormer Sri Lanka all-rounder Farveez Maharoof revealed his admiration for Yashasvi Jaiswal and said that it's just a matter of time before he makes it to the Indian T20I squad. He also explained the reasons behind Jasprit Bumrah's constant struggles with injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mirabai-chanu-wins-commonwealth-gold-breaks-48kg-weightlifting-records-2776551-2025-08-25",
      "headline": "Mirabai Chanu returns to action in style with gold in Commonwealth ChampionshipsMirabai Chanu made a strong comeback by winning gold at the Commonwealth Championships in Ahmedabad. Her record-breaking performance sets high expectations for upcoming World Championships and Asian Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-harshit-rana-sharpens-skills-in-delhi-premier-league-2776544-2025-08-25",
      "headline": "Asia Cup 2025: Harshit Rana sharpens skills in Delhi Premier leagueIndia fast bowler Harshit Rana is sharpening his skills in the Delhi Premier League 2025 (DPL 2025) ahead of the Asia Cup set to begin on September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexandra-eala-us-open-2025-rafael-nadal-academy-historic-win-2776518-2025-08-25",
      "headline": "Nadal Academy star rejoices historic win with unreal comeback vs Clara TausonAlexandra Eala made history at the 2025 US Open, becoming the first Filipino in the Open Era to win a Grand Slam main-draw match. The 19-year-old stunned 14th seed Clara Tauson with a thrilling 6-3, 2-6, 7-6 comeback victory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-cafa-cup-squad-khalid-jamal-first-no-mohun-bagan-players-2776488-2025-08-25",
      "headline": "Khalid Jamil unveils first India squad for CAFA Cup: No Mohun Bagan playersKhalid Jamil's first India squad for the CAFA Nations Cup omits Mohun Bagan Super Giant players after the club refused to release them. Gurpreet Singh Sandhu returns as East Bengal players headline the 23-man list."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/yashavsi-jaiswal-will-get-his-chance-in-indian-t20i-team-soon-farveez-maharoof-2776561-2025-08-25",
      "headline": "Yashavsi Jaiswal will get his chance in Indian T20I team soon: Farveez MaharoofFormer Sri Lanka all-rounder Farveez Maharoof revealed his admiration for Yashasvi Jaiswal and said that it's just a matter of time before he makes it to the Indian T20I squad. He also explained the reasons behind Jasprit Bumrah's constant struggles with injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mirabai-chanu-wins-commonwealth-gold-breaks-48kg-weightlifting-records-2776551-2025-08-25",
      "headline": "Mirabai Chanu returns to action in style with gold in Commonwealth ChampionshipsMirabai Chanu made a strong comeback by winning gold at the Commonwealth Championships in Ahmedabad. Her record-breaking performance sets high expectations for upcoming World Championships and Asian Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-harshit-rana-sharpens-skills-in-delhi-premier-league-2776544-2025-08-25",
      "headline": "Asia Cup 2025: Harshit Rana sharpens skills in Delhi Premier leagueIndia fast bowler Harshit Rana is sharpening his skills in the Delhi Premier League 2025 (DPL 2025) ahead of the Asia Cup set to begin on September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexandra-eala-us-open-2025-rafael-nadal-academy-historic-win-2776518-2025-08-25",
      "headline": "Nadal Academy star rejoices historic win with unreal comeback vs Clara TausonAlexandra Eala made history at the 2025 US Open, becoming the first Filipino in the Open Era to win a Grand Slam main-draw match. The 19-year-old stunned 14th seed Clara Tauson with a thrilling 6-3, 2-6, 7-6 comeback victory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-cafa-cup-squad-khalid-jamal-first-no-mohun-bagan-players-2776488-2025-08-25",
      "headline": "Khalid Jamil unveils first India squad for CAFA Cup: No Mohun Bagan playersKhalid Jamil's first India squad for the CAFA Nations Cup omits Mohun Bagan Super Giant players after the club refused to release them. Gurpreet Singh Sandhu returns as East Bengal players headline the 23-man list."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}