{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-flat-in-volatile-session-small-and-midcaps-gain-2682344-2025-02-19",
      "headline": "Sensex, Nifty end marginally lower in volatile session; small and midcaps gainThe S&P BSE Sensex ended 28.21 points lower at 75,939.18, while the NSE Nifty50 settled 12.40 points lower at 22,932.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-fpis-continue-to-dump-indian-stocks-what-it-means-for-your-investment-portfolio-2682292-2025-02-19",
      "headline": "FIIs continue to dump Indian stocks: What it means for your investment portfolioWith FIIs selling aggressively, smallcaps and midcaps bleeding, and China attracting inflows, here's what retail investors should do. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-likely-to-set-up-manufacturing-hub-india-maharashtra-gujarat-2682262-2025-02-19",
      "headline": "Tesla likely to set up shop in India, may invest $3-5 billion: Sources During their visit, Tesla executives are expected to hold meetings with officials from the Prime Minister's Office (PMO) and other key ministries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-sip-big-returns-investment-tip-check-how-rs-250-a-month-can-grow-to-rs-17-lakh-sbi-jannivesh-2682243-2025-02-19",
      "headline": "Small SIP, big returns: Check how Rs 250 a month can grow to Rs 17 lakhSBI Mutual Fund's new JanNivesh SIP is making investing more accessible, letting anyone start with as little as Rs 250 a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-is-indias-most-valuable-company-check-other-firms-in-top-10-2682232-2025-02-19",
      "headline": "Reliance is India's most valuable company. Check top 10 firms in Hurun India 500The 2024 Burgundy Private Hurun India 500 report values Reliance at Rs 17.5 lakh crore. TCS comes in second at Rs 16.1 lakh crore, and HDFC Bank takes third place with Rs 14.2 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-reddys-aurobindo-phrama-why-pharma-stocks-fell-in-early-trade-today-2682211-2025-02-19",
      "headline": "Dr Reddy's, Aurobindo Pharma: Why pharma stocks fell in early trade today?The Nifty Pharma index dropped as much as 2% in early trade. Sun Pharma fell nearly 2%, Dr Reddy's dropped as much as 4%, and Aurobindo Pharma sank almost 6%. Cipla shares also fell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-get-boost-after-clsa-upgrade-check-target-price-2682190-2025-02-19",
      "headline": "Tata Motors shares get boost after CLSA upgrade. Check target priceTata Motors share price: At around 11:04 am, shares of Tata Motors were trading 0.34% higher at Rs 683.90 on the Bombay Stock Exchange (BSE). It was up over 1% in early trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hexaware-technologies-shares-debut-at-5-premium-over-ipo-price-2682180-2025-02-19",
      "headline": "Hexaware Technologies shares debut at 5% premium over IPO priceHexaware Technologies IPO listing: The listing was largely in line with expectations, as the grey market premium (GMP) had disappeared ahead of the debut, indicating weak demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-it-pharma-stocks-drag-markets-2682149-2025-02-19",
      "headline": "Sensex, Nifty open lower as IT, pharma stocks drag marketsThe S&P BSE Sensex shed 291.20 points to 75,676.19, while the NSE Nifty50 lost 88.65 points to 22,856.65 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-allotment-status-online-guide-latest-gmp-listing-date-allotment-date-2682131-2025-02-19",
      "headline": "Quality Power IPO: Check allotment status, latest GMP and listing date Quality Power IPO allotment status: Investors who applied for the Quality Power IPO can check their allotment status through the BSE website or the registrar's website (Link Intime India Private Ltd)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-hunts-for-land-in-india-manufacturing-plant-maharashtra-leads-report-2682119-2025-02-19",
      "headline": "Elon Musk's Tesla hunts for land in India, Maharashtra leads: ReportWhile Maharashtra is leading the race, other states are also vying for the project. Tesla's plans could change depending on the incentives offered by different states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-trailer-bobby-deol-is-back-as-the-menacing-baba-nirala-2682511-2025-02-19",
      "headline": "Aashram 3 part 2 trailer: Bobby Deol is back as the menacing Baba NiralaThe much-awaited Aashram returns with Part 2 of Season 3, directed by Prakash Jha. The new season delves into themes of power, betrayal, and revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/melo-movie-review-slow-burn-netflix-drama-choi-wooshik-park-boyoung-kim-jaewook-2682347-2025-02-19",
      "headline": "Melo Movie review: A slow-burn, mature drama that will stay with youReleased-Fri Feb 14, 2025Melo Movie released in Netflix on February 14. Starring Choi Woo-shik and Park Bo-young, the 10-episode-show deals with love, loss, and grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-matthew-perry-documentary-promises-to-dig-deep-into-the-hollywood-tragedy-2682494-2025-02-19",
      "headline": "New Matthew Perry documentary promises to dig deep into the Hollywood tragedyA new Matthew Perry documentary called Matthew Perry: A Hollywood Tragedy will be out later this month, wherein the makers will investigate the untimely death of the Friends star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-first-frost-review-love-trauma-longing-new-chinese-drama-delivers-it-all-2682428-2025-02-19",
      "headline": "The First Frost review: Love, trauma, longing - new Chinese drama delivers it all Released-Thu Feb 20, 2025The First Frost review: This Chinese drama delves into the complexities of love, trauma, and longing, offering a poignant narrative that diverges from typical romance tropes. With its melancholic visuals and dual perspectives, it explores the tangled history between its protagonists, making it a compelling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-mother-on-her-bold-fashion-was-shocked-at-first-but-i-support-her-2682289-2025-02-19",
      "headline": "Uorfi Javed's mother on her bold fashion: Was shocked at first, but I support herUorfi Javed revealed her mother was the first in their family to try Botox. Her mother also recalled her reaction when she saw Uorfi's \"new style\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-trailer-kathir-takes-on-gripping-murder-mystery-with-aishwarya-rajesh-2682271-2025-02-19",
      "headline": "Suzhal 2 trailer: Kathir takes on gripping murder mystery with Aishwarya RajeshThe official trailer of the highly-anticipated second season of the Tamil crime thriller Suzhal - The Vortex was released on Wednesday. Starring Kathir and Aishwarya Rajesh in lead roles, the series will premiere on Prime Video on February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-thankful-humbled-after-aap-rocky-found-not-guilty-in-shooting-case-2682140-2025-02-19",
      "headline": "Rihanna 'thankful, humbled' after A$AP Rocky found not guilty in shooting caseA$AP Rocky was declared not guilty in a felony assault trial, leading to an emotional embrace with Rihanna in court. After the verdict, the singer issued her first statement, expressing relief. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-rekha-gupta-delhi-chief-minister-2682529-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rekha Gupta: BJP gives Delhi a She MRekha Gupta, first-time MLA from Shalimar Bagh, is the next Delhi Chief Minister. She will be Delhi's fourth woman chief minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-new-cm-who-is-rekha-gupta-chief-minister-why-bjp-chose-shalimar-bagh-mla-2682531-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Rekha Gupta, and why BJP chose her Delhi CMThe BJP has picked Rekha Gupta, a three-time councillor, as the Chief Minister of Delhi. In picking Gupta, who started her political career with the Delhi University Students Union elections, the BJP has tried to cement a legacy and convey a message to its women voter base. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/maha-kumbh-water-quality-sangam-river-faecal-bacteria-uttar-pradesh-green-tribunal-pollution-control-board-2682523-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wasting time? Tribunal slams UP body for Sangam report based on old samplesThe National Green Tribunal reprimanded Uttar Pradesh Pollution Control Board for submitting an affidavit on Sangam river water quality based on old samples. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-volodymyr-zelenskyy-ukraine-riyadh-talks-russia-dictator-without-elections-2682551-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Move fast or you won't have country left: Trump's message to 'dictator' ZelenskyyDonald Trump launched a scathing attack on Volodymyr Zelenskyy, calling him a \"dictator without elections\" and blaming him for the Russia-Ukraine war, amid raising tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-16e-launched-in-india-price-full-specs-2678409-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "iPhone 16e launched in India: Price, full specsApple has officially launched the iPhone 16e in India. The device comes with a starting price of Rs 59,900. Here are full specs, features, design and India price details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parvesh-verma-kapil-mishra-likely-cabinet-ministers-delhi-sources-2682562-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parvesh Verma, Kapil Mishra among 6 likely Delhi cabinet ministers: SourcesParvesh Verma and Kapil Mishra are likely to take oath as Delhi cabinet ministers tomorrow, alongside four other BJP leaders, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-senator-goes-after-musk-over-doge-internet-brings-up-tesla-ceos-paypal-role-2682500-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Senator goes after Musk over DOGE, internet hits back with PayPal referenceUS Senator John Fetterman shared a news report about DOGE allegedly trying to access private taxpayer data. Elon Musk and other people on the internet were quick to fire back at Fetterman and brought up the Tesla CEO's past role at PayPal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-new-zealand-beat-pakistan-champions-trophy-2025-2682547-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: Hapless Pakistan's title defence off to woeful start at homeNew Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025, as the hosts got their tournament off to a disastrous start. Will Young (107) and Tom Latham (118) starred with centuries for New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/usaid-usd-21-million-voter-turnout-india-irony-contrast-india-expenditure-lok-sabha-election-us-presidential-election-2682424-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The $21-million USAID joke, and it isn't on IndiaUSAID used $21 million of American taxpayer money to boost voter turnout in India, according to Elon Musk's DOGE. India has been spending more on elections than the US and sees a better voter turnout too. That's the $21-million joke. On a serious note, the money could have been used to interfere in India's electoral process."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/car-crash-injures-3-of-family-leads-to-discovery-of-3-bodies-at-home-in-kolkata-2682563-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Car crash injures 3 of family, leads to discovery of 3 bodies at home in KolkataThree members of a family were found dead at their home while three other members were involved in a road accident in Kolkata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-police-files-cases-photos-women-bathing-maha-kumbh-sold-online-telegram-2682584-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India Today Impact: UP cops crack down on objectionable Kumbh bath photosAn India Today expose revealed how photos and videos of women taking a ritual bath at Maha Kumbh were being shared online through social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-karachi-national-stadium-less-crowd-michael-vaughan-2682382-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where is the crowd? Vaughan, fans react to empty seats for Champions Trophy openerMichael Vaughan and fans were left stunned as the turnout for the first match of the Champions Trophy 2025 between Pakistan and New Zealand was poor. Empty seats have been visible during the match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/rajasthan/video/video-athlete-dies-after-270-kg-weight-falls-on-her-neck-during-training-at-gym-2682510-2025-02-19#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Athlete dies after 270-kg weight falls on her neck during training at gymNational-level powerlifter, Yashtika Acharya, died after 270-kg weight she was trying to lift fell on her neck during training at a gym in Rajasthan's Bikaner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/deepening-human-wildlife-crisis-killed-1783-indians-341-elephants-in-3-years-2682489-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deepening human-wildlife crisis killed 1,783 Indians, 341 elephants in 3 yearsTo address the challenge, the Union environment ministry has identified 150 elephant corridors in 15 states, with instructions to conserve them on priority"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-mohammed-shami-maha-kumbh-dip-akhilesh-yadav-jibe-2682378-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath says Mohammad Shami took dip at Kumbh, Akhilesh Yadav reactsYogi Adityanath said that people from all caste and religion were welcomed at Kumbh and claimed that even cricketer Mohammad Shami took the ritual bath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/politics-kept-sunita-williams-other-astronaut-stuck-space-elon-musk-wilmore-space-x-joe-biden-donald-trump-2682439-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Politics, not science, kept Sunita Williams, other astronaut stuck in space: MuskSpaceX and DOGE chief Elon Musk has accused former US President Joe Biden of leaving two astronauts, Sunita Williams and Butch Wilmore, stranded in space for \"political reasons\". In an interview with Fox News alongside former President Donald Trump, Musk said their return to earth had been postponed to a \"ridiculous degree\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-opens-new-office-ananta-in-bengaluru-here-is-your-first-look-at-it-2682337-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Google opens new office Ananta in Bengaluru, here is your first look at itGoogle has opened its latest and one of its biggest office spaces globally in Bengaluru, named Ananta. With space for 5,000 employees, the campus reflects India's growing role in Google's global operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-ec-is-in-the-dock-2682436-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the Election Commission is in the dockThe appointment of Gyanesh Kumar as the new chief election commissioner of India has invited controversy. Is the process flawed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-press-conference-india-vs-bangladesh-2682508-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "We only have 2 spinners: Rohit Sharma hits back at criticism over squad selectionIndia opting to carry 5 spinners in their Champions Trophy squad has attracted criticism. One day before their opener vs Bangladesh, captain Rohit Sharma has hit back at the critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-lokayukta-clean-chit-siddaramaiah-his-wife-muda-case-2682377-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka Lokayukta's clean chit to Siddaramaiah, his wife in Muda caseKarnataka Lokayukta cleared Chief Minister Siddaramaiah, his wife, and two others, in the Muda site allocation case, citing lack of criminal evidence in the probe.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-secondary-infertility-and-why-is-it-rising-in-india-2682432-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is secondary infertility, and why is it rising in IndiaSecondary infertility is on the rise in India but is seldom discussed. Lack of awareness is the reason why it is still a lesser-known term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-donald-trump-interview-bromance-key-takeaways-highlights-2682364-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'President Musk', Trump's 'tech support': Bromance shines in Musk-Trump interviewMusk-Trump interview: The interview shone light on the camaraderie and bromance between the duo, with Elon Musk labelling himself the President's 'tech support' and Trump calling the Tesla CEO a 'brilliant guy'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tesla-is-coming-to-india-here-is-how-anand-mahindra-plans-to-deal-with-competition-2682501-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla is coming to India. Here is how Anand Mahindra plans to deal with competitionTesla will reportedly commence sales operations in India in the next three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-toto-wolff-ferrari-mercedes-jack-whitehall-video-2682277-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Jack Whitehall trolls Mercedes boss Toto Wolff over Lewis HamiltonComedian Jack Whitehall decided to troll Mercedes boss Toto Wolff because of Lewis Hamilton's move to Ferrari ahead of the new F1 2025 season. Hamilton spent 12 years with Mercedes before his move to Ferrari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raj-and-dk-address-rumours-of-financial-fraud-rakt-brahmand-gulkanda-tales-2682588-2025-02-19",
      "headline": "Raj and DK address rumours of financial fraud: People will say what they want toFilmmakers Raj and DK have refuted rumours of financial fraud concerning their upcoming projects. They assured fans that Rakt Brahmand and Gulkanda Tales are still in active development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aadar-jain-expresses-love-for-wife-alekha-advani-passed-time-for-4-years-but-now-im-with-you-2682570-2025-02-19",
      "headline": "Aadar Jain expresses love for wife: Did time pass for 4 years, but always loved herAadar Jain and Alekha Advani celebrated their mehndi ceremony with close family and friends. During the event, Aadar openly declared his love for Alekha saying that he 'passed his time for 4 years' before being with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-academy-announces-third-slate-of-presenters-for-the-97th-oscars-2682545-2025-02-19",
      "headline": "Oscars 2025: Joe Alwyn, Ben Stiller, Selena Gomez among presentersThe Academy has unveiled the third set of presenters for the 97th Oscars happening on March 3, 2025 (IST). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-jaya-bachchan-aadar-jain-mehndi-2682538-2025-02-19",
      "headline": "Pics: Kareena Kapoor stuns at cousin Aadar Jain's mehndi, Jaya Bachchan smilesAadar Jain and Alekha Advani had their Mehndi ceremony today, which was attended by the Kapoors including Kareena-Karisma, Neetu Kapoor and Randhir Kapoor. Stars like Jaya Bachchan also attended the celebrations."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealand-champions-trophy-2025-mohammad-rizwan-2682574-2025-02-19",
      "headline": "Champions Trophy: Who said what as Pakistan capitulate against New Zealand in KarachiNew Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025 as the hosts got their title defence off to a disastrous start. Captain Mohammad Rizwan reflected on his team's performance after the massive loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-delhi-capitals-up-warriorz-lanning-2682571-2025-02-19",
      "headline": "Sutherland, Lanning star as Delhi Capitals beat UP Warriorz in thriller WPL 2025: Annabel Sutherland's all-round performance and Meg Lanning's 69-run knock guided Delhi Capitals through to a seven-wicket win over UP Warriorz on Wednesday at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-new-zealand-beat-pakistan-champions-trophy-2025-2682547-2025-02-19",
      "headline": "Champions Trophy: Hapless Pakistan's title defence off to woeful start at homeNew Zealand beat Pakistan by 60 runs in the opening game of the ICC Champions Trophy 2025, as the hosts got their tournament off to a disastrous start. Will Young (107) and Tom Latham (118) starred with centuries for New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-new-zealand-pakistan-reactions-2682543-2025-02-19",
      "headline": "Fans slam slow Babar Azam in Champions Trophy opener Champions Trophy: Babar Azam racked up an 81-ball fifty against New Zealand at the National Stadium in Karachi, but faced criticism for not being able to accelerate with Pakistan chasing 321."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-bangladesh-dubai-shanto-rohit-sharma-2682515-2025-02-19",
      "headline": "India vs Bangladesh: Champions Trophy clash complete guideChampions Trophy 2025: Rohit Sharma and India would be looking to get off to a winning start when they face Najmul Hossain Shanto's Bangladesh on Thursday at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-fakhar-zaman-open-law-explained-pakistan-2682535-2025-02-19",
      "headline": "Explained: Why Fakhar Zaman didn't open against New Zealand Champions Trophy: Fakhar Zaman came out to bat at No.4 in Pakistan's clash against New Zealand at the National Stadium in Karachi. The left-handed batter sustained an injury in the very first over of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-icc-champions-trophy-2025-indias-record-in-dubai-india-vs-bangladesh-2682518-2025-02-19",
      "headline": "Champions Trophy 2025: What is India's record in Dubai?India are all set to start their campaign in the ICC Champions Trophy 2025 against Bangladesh. Here's a look at their record while playing in Dubai ahead of the all-important tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-press-conference-india-vs-bangladesh-2682508-2025-02-19",
      "headline": "We only have 2 spinners: Rohit Sharma hits back at criticism over squad selectionIndia opting to carry 5 spinners in their Champions Trophy squad has attracted criticism. One day before their opener vs Bangladesh, captain Rohit Sharma has hit back at the critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-exclusive-fans-obstacles-babar-azam-virat-kohli-2682475-2025-02-19",
      "headline": "Pakistan fans happily welcome Champions Trophy after 'countless obstacles' In an exclusive chat with India Today Digital, Pakistan fans Kisa Zahra, Abdul Rahman Shahbaz and Talha Hayat spoke about the return of the Champions Trophy to Pakistan. They spoke about the challenges faced by Pakistan cricket after the bus attack on the Sri Lankan team in 2009 which had led to international cricket coming to a halt in the Asian country.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-will-young-scores-century-champions-trophy-2025-pakistan-vs-new-zealand-2682437-2025-02-19",
      "headline": "Will Young dazzles on Champions Trophy debut with remarkable hundred vs PakistanNew Zealand batter Will Young scored a magnificent century in the first match of the ICC Champions Trophy 2025 against Pakistan in Karachi to rescue his team from a precarious position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-icc-champions-trophy-2025-indias-record-in-dubai-india-vs-bangladesh-2682518-2025-02-19",
      "headline": "Champions Trophy 2025: What is India's record in Dubai?India are all set to start their campaign in the ICC Champions Trophy 2025 against Bangladesh. Here's a look at their record while playing in Dubai ahead of the all-important tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-press-conference-india-vs-bangladesh-2682508-2025-02-19",
      "headline": "We only have 2 spinners: Rohit Sharma hits back at criticism over squad selectionIndia opting to carry 5 spinners in their Champions Trophy squad has attracted criticism. One day before their opener vs Bangladesh, captain Rohit Sharma has hit back at the critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-exclusive-fans-obstacles-babar-azam-virat-kohli-2682475-2025-02-19",
      "headline": "Pakistan fans happily welcome Champions Trophy after 'countless obstacles' In an exclusive chat with India Today Digital, Pakistan fans Kisa Zahra, Abdul Rahman Shahbaz and Talha Hayat spoke about the return of the Champions Trophy to Pakistan. They spoke about the challenges faced by Pakistan cricket after the bus attack on the Sri Lankan team in 2009 which had led to international cricket coming to a halt in the Asian country.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-will-young-scores-century-champions-trophy-2025-pakistan-vs-new-zealand-2682437-2025-02-19",
      "headline": "Will Young dazzles on Champions Trophy debut with remarkable hundred vs PakistanNew Zealand batter Will Young scored a magnificent century in the first match of the ICC Champions Trophy 2025 against Pakistan in Karachi to rescue his team from a precarious position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-bangladesh-shanto-press-conference-india-2682434-2025-02-19",
      "headline": "Bangladesh can beat any team in the Champions Trophy: ShantoChampions Trophy 2025: In the press conference prior to the clash against Rohit Sharma's India, Najmul Hossain Shanto said that Bangladesh have the potential to get the better of any team in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/saqlain-mushtaq-bcci-comments-india-vs-pakistan-match-2682398-2025-02-19",
      "headline": "BCCI should be taught a lesson: Ex-spinner before India vs Pakistan matchFormer Pakistan spinner Saqlain Mushtaq has slammed the Indian Cricket Board ahead of the Champions Trophy. Speaking on a Pakistan TV channel, Mushtaq has complained about BCCI over multiple issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shakib-al-hasan-najmul-shanto-bangladesh-india-2682383-2025-02-19",
      "headline": "Will Shakib Al Hasan's absence affect Bangladesh? Shanto gives blunt responseChampions Trophy 2025: Skipper Najmul Hossain Shanto gave a one-word response after being asked if Shakib Al Hasan's absence would affect Bangladesh in the tournament. The Tigers will start their campaign on February 20 against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-karachi-national-stadium-less-crowd-michael-vaughan-2682382-2025-02-19",
      "headline": "Where is the crowd? Vaughan, fans react to empty seats for Champions Trophy openerMichael Vaughan and fans were left stunned as the turnout for the first match of the Champions Trophy 2025 between Pakistan and New Zealand was poor. Empty seats have been visible during the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-mumbai-captain-and-selector-milind-rege-dies-at-76-2682353-2025-02-19",
      "headline": "Former Mumbai captain and selector Milind Rege dies at 76Former Mumbai team captain and selector Milind Rege died at the age of 76 on Wednesday, February 19. Rege suffered a heart attack on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-indian-flag-karachi-pakistan-new-zealand-2682349-2025-02-19",
      "headline": "Indian flag spotted flying high at National Stadium in KarachiChampions Trophy 2025: The Indian flag was seen flying high during the opening game of the tournament on Wednesday, February 19 between New Zealand and Pakistan at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-fakhar-zaman-injury-fielding-karachi-2682324-2025-02-19",
      "headline": "Champions Trophy 2025: Pakistan dealt blow as Fakhar Zaman suffers injury in openerChampions Trophy: Pakistan have been dealt a big blow as opener Fakhar Zaman got injured while fielding in the opening match of the Champions Trophy 2025. Fakhar is a key player for Pakistan in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-mumbai-captain-and-selector-milind-rege-dies-at-76-2682353-2025-02-19",
      "headline": "Former Mumbai captain and selector Milind Rege dies at 76Former Mumbai team captain and selector Milind Rege died at the age of 76 on Wednesday, February 19. Rege suffered a heart attack on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-indian-flag-karachi-pakistan-new-zealand-2682349-2025-02-19",
      "headline": "Indian flag spotted flying high at National Stadium in KarachiChampions Trophy 2025: The Indian flag was seen flying high during the opening game of the tournament on Wednesday, February 19 between New Zealand and Pakistan at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-fakhar-zaman-injury-fielding-karachi-2682324-2025-02-19",
      "headline": "Champions Trophy 2025: Pakistan dealt blow as Fakhar Zaman suffers injury in openerChampions Trophy: Pakistan have been dealt a big blow as opener Fakhar Zaman got injured while fielding in the opening match of the Champions Trophy 2025. Fakhar is a key player for Pakistan in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-icc-odi-batter-rankings-babar-azam-2682287-2025-02-19",
      "headline": "ICC ODI Rankings: Shubman Gill overtakes Babar Azam to become No. 1 batterICC ODI Rankings: India batter Shubman Gill overtook Babar Azam to become the world No.1 batter in the ICC ODI rankings. Shubman became the top ranked batter after a sensational 3-match series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-toto-wolff-ferrari-mercedes-jack-whitehall-video-2682277-2025-02-19",
      "headline": "Watch: Jack Whitehall trolls Mercedes boss Toto Wolff over Lewis HamiltonComedian Jack Whitehall decided to troll Mercedes boss Toto Wolff because of Lewis Hamilton's move to Ferrari ahead of the new F1 2025 season. Hamilton spent 12 years with Mercedes before his move to Ferrari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-matt-kuhnemann-bowling-action-test-icc-decision-2682258-2025-02-19",
      "headline": "Australia's Matt Kuhnemann undergoes bowling action test, result next weekAustralia's Matt Kuhnemann has undergone the test by the ICC after being reported for a suspect bowling action during the tour of Sri Lanka. Kuhnemann underwent the test under the watchful eyes of ICC experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-live-score-updates-group-a-today-match-karachi-2682247-2025-02-19",
      "headline": "PAK vs NZ Highlights: New Zealand beat Pakistan by 60 runs in KarachiPakistan vs New Zealand, Champions Trophy Highlights: New Zealand beat Pakistan by 60 runs in Group A at the National Stadium in Karachi. Khushdil Shah scored 69, but Pakistan could only manage to score 260 in 47.2 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-babar-azam-opening-lahore-2682196-2025-02-19",
      "headline": "Pakistan has no pressure: Babar Azam ahead of Champions Trophy opener vs NZChampions Trophy: Star batter Babar Azam has claimed that Pakistan are under no pressure ahead of their Champions Trophy opening match against New Zealand on Wednesday, February 19. Babar was part of Pakistan's Champions Trophy winning squad in 2017. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-arshdeep-singh-over-harshit-rana-jasprit-bumrah-replacement-ricky-ponting-2682158-2025-02-19",
      "headline": "Arshdeep Singh over Harshit Rana to replace Jasprit Bumrah: Ricky PontingChampions Trophy: Ricky Ponting backed Arshdeep Singh over Harshit Rana as India's best replacement for injured Jasprit Bumrah in the Champions Trophy, citing Arshdeep's control and experience in white-ball cricket as key factors for India's bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-relevance-t20-dominance-pakistan-2682156-2025-02-19",
      "headline": "Is the Champions Trophy still relevant in the age of T20 cricket dominance?The Champions Trophy returns to the cricket calendar after an eight-year hiatus. Despite the dominance of T20 cricket, ODI cricket still holds significance through marquee tournaments like the Champions Trophy and World Cup. Multi-nation events could be key to reviving its relevance in a crowded cricketing calendar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-squad-depth-injuries-shane-bond-pakistan-2682128-2025-02-19",
      "headline": "New Zealand has squad depth for Champions Trophy despite injuries: BondDespite injury setbacks, Shane Bond believes New Zealand's squad depth remains strong, emphasising their all-rounders' impact and confidence from recent triumphs ahead of the Champions Trophy opener against Pakistan in Karachi on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-qatar-open-exit-matteo-berrettini-loss-hamstring-injury-2682112-2025-02-19",
      "headline": "Fully fit Novak Djokovic handed shock Qatar Open exit by Matteo BerrettiniNovak Djokovic's struggles in 2025 continued as he suffered a shocking Round of 32 defeat to Matteo Berrettini at the Qatar Open. The Italian dominated after a tiebreak first set to claim a 7-6 (4), 6-2 win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-ct-2025-faqs-complete-guide-teams-venues-format-schedule-2682109-2025-02-19",
      "headline": "Champions Trophy FAQs: Your complete guide to the returning mini World Cup Champions Trophy 2025 FAQs: In these 13 FAQs, we have covered everything you need to know about the ICC Champions Trophy 2025, from the schedule and venues to team line-ups and live streaming details. This comprehensive guide ensures you stay informed about all key aspects of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-new-zealand-babar-azam-rizwan-2681994-2025-02-19",
      "headline": "Defending champions Pakistan face big test vs in-form New Zealand todayChampions Trophy: Pakistan recently lost the tri-series final to New Zealand, but will be looking to make amends when the two teams face each other on February 19 at National Stadium in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-awais-ahmad-rohit-sharma-virat-kohli-2682077-2025-02-19",
      "headline": "Pakistani net bowler, viral after toe-crushers to Rohit Sharma, lives his dreamChampions Trophy 2025: In an interview with Sports Today, fast bowler Awais Ahmad talked about living his dream while bowling to Virat Kohli and Rohit Sharma during the Indian net session. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}