{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-900-points-nifty-gains-update-what-is-behind-stock-market-rally-icici-bank-shares-2624243-2024-10-28",
      "headline": "Sensex rises 900 points. What's behind the stock market rally?Stock market update: The BSE Sensex climbed 827.37 points to 80,229.53, adding over Rs 3 lakh crore in market capitalisation. On the other hand, the Nifty50 rose 225.30 points to 24,406.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-share-price-falls-3-percent-after-strong-stock-market-debut-2624230-2024-10-28",
      "headline": "Waaree Energies share price falls 3% after bumper debut. Here's whyWaaree Energies listing: Shares of Waaree Energies opened at Rs 2,550, at a premium of 69.66% over its issue price of Rs 1,503 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-share-price-declines-q2fy25-results-interglobe-aviation-buy-hold-sell-brokerage-recommendations-2624221-2024-10-28",
      "headline": "IndiGo share price tumbles over 10% after Q2 results. Buy, hold or sell? IndiGo share price: The shares crashed as much as 13% on Monday, reaching a low of Rs 3,778.50. At 10:54 am, shares of the company were trading 7.66% lower to Rs 4,030.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-listing-strong-debut-share-price-rs-2550-bse-bombay-stock-exchange-2624206-2024-10-28",
      "headline": "Waaree Energies shares make strong market debut with 70% premiumWaaree Energies share price: Shares of Waaree Energies opened at Rs 2,550, a premium of 69.66% over its issue price of Rs 1,503 on the Bombay Stock Exchange (BSE)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-shares-fell-10-percent-in-early-trade-today-reason-fall-in-q2-profit-2624204-2024-10-28",
      "headline": "Explained: Why IDFC First Bank shares fell 10% in early trade todayThe bank's stock has fallen by 25% year-to-date in 2024, with a current market capitalisation of Rs 49,034 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-ril-shares-down-50-percent-on-trading-apps-bonus-issue-reliance-stock-2624192-2024-10-28",
      "headline": "Reliance share price showing 50% fall on trading apps today. Here's whyRIL share price: Reliance shares opened at Rs 1,338, which appeared to be 49.61% lower than Friday's closing price of Rs 2,655.45 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-open-in-green-led-by-a-rally-in-financial-and-bank-stocks-2624179-2024-10-28",
      "headline": "Sensex, Nifty open in green led by a rally in financial and bank stocksThe S&P BSE Sensex was up 902.40 points to 80,304.76, whiile the Nifty50 was up 251.35 points to 24,432.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiohotstar-website-delhi-developer-sells-domain-uae-jainam-jeevika-dubai-kids-2623668-2024-10-26",
      "headline": "Twist in JioHotstar drama, Dubai siblings claim they bought domain from developerThe JioHotstar.com controversy has taken a new turn as the Delhi developer, who bought the domain much to the annoyance of Reliance Industries, seems to have sold it to two Dubai-based children -- Jainam and Jivika."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-corporate-taxpayers-extended-november-15-2623581-2024-10-26",
      "headline": "ITR filing deadline for corporate taxpayers extended till November 15ITR filing deadline: The extension applies to taxpayers covered under sub-Section (1) of Section 139 of the Income-tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-latest-gmp-dips-stock-market-debut-listing-expectations-investors-2623572-2024-10-26",
      "headline": "Waaree Energies IPO: GMP drops before listing; should investors worry?Waaree Energies listing expectations: With the company set to debut on October 28, Waaree Energies' GMP currently stands around Rs 1,320, reflecting a potential listing premium of 88% over the IPO issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rs-220-crore-bank-fraud-case-ed-raids-pharma-company-sharon-bio-medicine-limited-2623480-2024-10-26",
      "headline": "ED raids in Mumbai, Haryana against pharma company in Rs 220-crore fraud caseDuring the search operations in Mumbai and Haryana's Yamunanagar, movable assets including bank funds, Demat accounts valued at Rs 14.53 crore were seized or frozen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-1-check-latest-subscription-gmp-expected-listing-gains-2623281-2024-10-25",
      "headline": "Afcons Infrastructure IPO Day 1: Check latest subscription, GMP Afcons Infrastructure's IPO aims to raise Rs 5,430 crore and consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-dalal-street-losing-streak-foreign-investor-exodus-dull-q2-earnings-2623206-2024-10-25",
      "headline": "Sensex, Nifty continue losing streak amid ongoing FII exodus, dull Q2 earnings At the closing bell, the Sensex was down 662.87 points at 79,402.29, while the NSE Nifty50 settled 189.55 points lower at 24,209.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-view-will-it-double-your-money-gmp-here-what-experts-say-2623194-2024-10-25",
      "headline": "Waaree Energies IPO: Will it double your investment? Here's what experts sayWaaree Energies IPO attracted significant interest from investors and was subscribed 79.44 times by the end of the bidding process on October 23, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex falls 800 points: Should investors buy the dip or hold back?Stock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's estate worth Rs 10,000 crore: Who gets what in his will Ratan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dixon-technologies-shares-fall-over-9-percent-after-rally-short-lived-hit-record-high-should-you-buy-2623056-2024-10-25",
      "headline": "Explained: Why Dixon Technologies share price tumbled over 9% after early rallyThe company's stock reached a peak of Rs 15,999.95, rising by 6.21% after releasing impressive Q2 earnings on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-opens-for-bidding-subscribe-skip-good-bad-latest-gmp-review-2623022-2024-10-25",
      "headline": "Afcons Infrastructure IPO opens for bidding: Should you subscribe or skip? Afcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-check-latest-gmp-stock-market-debut-date-and-expected-listing-gains-2623028-2024-10-25",
      "headline": "Waaree Energies IPO: Check GMP, allotment details, listing date and expected gainsWaaree Energies IPO: With allotments finalised on October 24, the public issue is expected to have a bumper listing on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-border-disengagement-eastern-ladakh-depsang-demchok-final-phase-patrolling-2624223-2024-10-28",
      "headline": "India-China troop disengagement in final phase at 2 LAC points in Ladakh: SourcesDays after a breakthrough in border talks with China, defence sources have confirmed that disengagement at Eastern Ladakh's Depsang and Demchok is in its final phase, with the first patrols set to resume by month's end."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suspected-terrorists-fire-army-vehicle-jammu-and-kashmir-akhnoor-search-operations-2624174-2024-10-28",
      "headline": "Terrorist killed after attack on Army vehicle in J&K's Akhnoor, gunfight onSuspected terrorists fired at an Army vehicle in Jammu's Akhnoor sector, with no casualties reported. A search operation is underway, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spanish-pm-pedro-sanchez-vadodara-gujarat-india-visit-inaugurate-tata-airbus-plant-pm-modi-2624146-2024-10-28",
      "headline": "PM, Spanish counterpart launch Tata-Airbus aircraft plant in major defence boostSpanish Prime Minister Pedro Sanchez, who is in Gujarat's Vadodara on his maiden visit to India, and Prime Minister Narendra Modi jointly inaugurated the Tata Advanced Systems Limited (TASL) facility today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-justice-dy-chandrachud-defends-ganesh-puja-with-pm-modi-mature-enough-to-keep-judicial-matters-aside-2624203-2024-10-28",
      "headline": "Mature enough to keep judicial matters aside: Chief Justice on puja with PMChief Justice DY Chandrachud said such meetings, like the one he had with Prime Minister Narendra Modi, are important to address judicial infrastructure, including new court buildings and accommodation for judges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-sharad-pawar-ncp-mva-share-advantage-over-uddhav-thackeray-shiv-sena-ubt-congress-2623605-2024-10-28",
      "headline": "How Sharad Pawar's NCP became the monkey among two warring catsAmid tussle over seats between the Congress and Uddhav Thackeray's Shiv Sena (UBT), Sharad Pawar managed 85 seats for his Nationalist Congress Party. His NCP, which had a good strike rate in 2024 Lok Sabha polls, now stands a real chance of getting own chief minister if the Maha Vikas Aghadi (MVA) wins the Maharashtra election. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-900-points-nifty-gains-update-what-is-behind-stock-market-rally-icici-bank-shares-2624243-2024-10-28",
      "headline": "Sensex rises 900 points. What's behind the stock market rally?Stock market update: The BSE Sensex climbed 827.37 points to 80,229.53, adding over Rs 3 lakh crore in market capitalisation. On the other hand, the Nifty50 rose 225.30 points to 24,406.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/gaganyaan-mission/story/indias-gaganyaan-mission-chandrayaan-4-will-not-launch-in-2025-2624240-2024-10-28",
      "headline": "India's Gaganyaan Mission will not launch in 2025Indian Space Research Organisation (Isro) Chairman S. Somanath announced a revised timeline for the upcoming missions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-comedian-tony-hinchcliffe-puerto-rico-floating-garbage-jab-donald-trump-poll-rally-stirs-row-2624190-2024-10-28",
      "headline": "US comedian's 'Puerto Rico floating garbage' jab at Trump poll rally stirs rowJennifer Lopez, Bad Bunny and Ricky Martin shared a clip of Kamala Harris speaking in support of Puerto Rico and urged US citizens to vote for her. Kamala Harris accused Trump of withholding hurricane relief to the island. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-reacts-little-fan-calls-out-to-him-house-balcony-2624201-2024-10-28",
      "headline": "Diljit Dosanjh reacts after little fan calls out to him from house balconyDiljit Dosanjh, during his Dil-Luminati India Tour in Delhi, made a heartfelt gesture towards a little fan who watched the concert venue from her balcony. In the video, she was seen calling out to the singer, asking him to sing loudly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hoax-bomb-threats-anti-terror-agency-boosts-security-after-400-threats-2-weeks-2624229-2024-10-28",
      "headline": "Anti-terror agency boosts security at airports after 400 bomb threats in 2 weeksAs part of intensified security protocols, the NIA has deployed a Bomb Threat Assessment Committee (BTAC) team at major airports. This specialised unit is equipped and trained to respond quickly to any reported threats or emergencies, further bolstering the safety infrastructure in place at airports. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/census-indian-population-delimitation-lok-sabha-government-2025-2624188-2024-10-28",
      "headline": "Centre to begin census from 2025, Lok Sabha seats delimitation by 2028: SourcesThe government plans to begin the long-delayed Census in 2025, which will be followed by delimitation of Lok Sabha seats, sources said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mirzapur-the-film-announced-pankaj-tripathi-returns-as-kaleen-bhaiya-2624208-2024-10-28",
      "headline": "Mirzapur The Film announced, Pankaj Tripathi returns as Kaleen bhaiyaMirzapur, the popular series from Prime Video, is being adapted into a film. It will mark the return of fan-favourite Pankaj Tripathi as Kaleen Bhaiya, Ali Fazal as Guddu Pandit, and Divyenndu as Munna Tripathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-2024-bjp-eknath-shinde-shiv-sena-palghar-row-rajendra-gavit-shrinivas-vanga-2624193-2024-10-28",
      "headline": "BJP, Shinde Sena settle Palghar row, turncoat gets seat for Maharashtra pollsRajendra Gavit left Congress for the BJP in 2018 and won the Palghar bypoll. In 2019, he joined BJP ally Shiv Sena. After Shiv Sena split in 2022, Gavit shifted allegiance from Uddhav Thackeray's faction to the Eknath Shinde-led group.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/u23-world-championship-chirag-chikkara-2nd-indian-male-wrestler-win-gold-2624177-2024-10-28",
      "headline": "Chirag Chikkara wins gold in U23 World Wrestling ChampionshipsIndia's Chirag Chikkara became only the second Indian male wrestler to win Gold in the 57kg category at the U23 World Championships on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iranian-supreme-leader-ali-khamenei-x-profile-suspended-iran-israel-attack-retaliation-hebrew-2624163-2024-10-28",
      "headline": "Zionist regime made a mistake: Khamenei tweets in Hebrew, X suspends accountIranian Supreme Leader Ali Khamenei's newly opened Hebrew-language account on X was suspended just hours after he issued a warning of retaliation against Israel for a recent strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/the-problem-in-your-plate-why-an-indian-home-cooked-meal-is-not-always-healthy-2623289-2024-10-28",
      "headline": "The Problem in Your Plate: Why an Indian home-cooked meal is not always healthyJust because food is homemade doesn't mean it's automatically healthy. Contrary to popular belief, home-cooked meals aren't always nutritious and can work against your health goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/swiggy-instamart-launches-shopping-list-feature-after-users-feedback-on-x-2624194-2024-10-28",
      "headline": "After user's feedback on X, Swiggy Instamart launches 'Shopping List' featureSwiggy Instamart has launched a \"Shopping List\" feature after a user shared their feedback in a post on X. Read on to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-hint-csk-future-ipl-2025-retentions-chennai-2624161-2024-10-28",
      "headline": "MS Dhoni drops hint on CSK future ahead of IPL 2025 retentionsChennai Super Kings legend and former India captain MS Dhoni has given fans a strong hint about his future as the IPL 2025 retention deadline nears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-vijay-tamilaga-vettri-kazhagam-tvk-rally-villupuram-bjp-dmk-corruption-2624107-2024-10-28",
      "headline": "Actor Vijay calls out 'dynastic selfish family', DMK says no basis to remarksVijay, the 50-year-old actor-politician, said his party's ideological enemy is any party that promotes divisiveness, while its political enemy is any party that talks of a 'Dravidian model'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/vikrant-massey-sonakshi-sinha-zaheer-iqbal-celebs-ektaa-kapoor-diwali-party-2624224-2024-10-28",
      "headline": "Vikrant Massey, Sonakshi-Zaheer and celebs attend Ektaa Kapoor's Diwali party TV Czarina Ektaa Kapoor hosted a grand Diwali bash at her residence in Mumbai. The party was attended by her close friends from the industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/five-symptoms-pollution-is-affecting-your-health-2623727-2024-10-26",
      "headline": "Five symptoms pollution is affecting your healthWatch out for these early signs that indicate the body is struggling to cope with exposure to pollutants"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iskcon-temple-tirupati-andhra-pradesh-gets-bomb-threat-2624168-2024-10-28",
      "headline": "Tirupati Iskcon temple gets bomb threat 3 days after hoax mails sent to hotelsIskcon temple in Andhra Pradesh's Tirupati received a bomb threat on October 27, following which a search operation was launched. However, no explosives were found in the temple premises."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-remains-very-poor-2nd-straight-day-to-worsen-before-diwali-2624167-2024-10-28",
      "headline": "Delhi air quality remains 'very poor' for 2nd day, likely to worsen before Diwali The air pollution levels in Delhi and adjoining areas are expected to rise in the coming days ahead of Diwali, with stubble burning and firecrackers being major contributors, along with the absence of favourable wind conditions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-pallavi-tribute-major-mukund-varadarajan-amaran-promotions-2624213-2024-10-28",
      "headline": "Sai Pallavi pays tribute to Major Mukund Varadarajan ahead of Amaran promotionsSai Pallavi paid tribute to late Major Mukund Varadarajan by visiting National War Memorial ahead of Amaran promotions. She shared photos from her visit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/vikrant-massey-sonakshi-sinha-zaheer-iqbal-celebs-ektaa-kapoor-diwali-party-2624224-2024-10-28",
      "headline": "Vikrant Massey, Sonakshi-Zaheer and celebs attend Ektaa Kapoor's Diwali party TV Czarina Ektaa Kapoor hosted a grand Diwali bash at her residence in Mumbai. The party was attended by her close friends from the industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mirzapur-the-film-announced-pankaj-tripathi-returns-as-kaleen-bhaiya-2624208-2024-10-28",
      "headline": "Mirzapur The Film announced, Pankaj Tripathi returns as Kaleen bhaiyaMirzapur, the popular series from Prime Video, is being adapted into a film. It will mark the return of fan-favourite Pankaj Tripathi as Kaleen Bhaiya, Ali Fazal as Guddu Pandit, and Divyenndu as Munna Tripathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-reacts-little-fan-calls-out-to-him-house-balcony-2624201-2024-10-28",
      "headline": "Diljit Dosanjh reacts after little fan calls out to him from house balconyDiljit Dosanjh, during his Dil-Luminati India Tour in Delhi, made a heartfelt gesture towards a little fan who watched the concert venue from her balcony. In the video, she was seen calling out to the singer, asking him to sing loudly."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/formula-one/story/red-bull-boss-christian-horner-coy-on-sergio-perez-racing-beyond-brazilian-gp-2624241-2024-10-28",
      "headline": "Red Bull boss Christian Horner coy on Sergio Perez racing beyond Brazilian GPSergio Perez's future with Red Bull Racing is in question after a disappointing performance at the Mexican Grand Prix. Team Principal Christian Horner did not confirm if Perez will finish the season, amidst rumours of changes in the lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-interview-rohit-sharma-captaincy-india-vs-new-zealand-tests-2624219-2024-10-28",
      "headline": "Unfair to question Rohit Sharma after New Zealand series loss: Shikhar DhawanFormer opener Shikhar Dhawan, while speaking to IndiaToday.in has backed Rohit Sharma, saying that it is unfair to judge the Indian captain after just one Test series loss to New Zealand. Dhawan said that captaincy is not just about wins or losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-retentions-live-updates-mi-srh-kkr-csk-pbks-dc-lsg-gt-rcb-rr-ms-dhoni-shreyas-iyer-2624216-2024-10-28",
      "headline": "IPL Retention Buzz Live: Dhoni to play 2025 season, Shreyas to remain in KKR?IPL Retention Build-up Highlights: The retention date is fast approaching with all the 10 IPL teams set to make some big calls. MS Dhoni playing in the new season and Shreyas Iyer remaining at KKR are hot topics of discussion at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/motogp-championship-leader-jorge-martin-uses-ganesha-inspired-helmet-for-thai-gp-2624207-2024-10-28",
      "headline": "MotoGP championship leader Jorge Martin uses Ganesha-inspired helmet for Thai GPJorge Martin paid tribute to Lord Ganesha with a special helmet at the Thai GP, where he finished second after a fierce contest with Francesco Bagnaia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/formula-one-carlos-sainz-wins-mexico-gp-as-max-verstappen-gets-penalised-twice-2624197-2024-10-28",
      "headline": "Carlos Sainz wins Mexico GP as Max Verstappen gets penalised twiceCarlos Sainz secured a landmark victory at the Mexico City Grand Prix, delivering Ferrari's first win at the track since 1990. Max Verstappen faced penalties, reducing his championship lead as Lando Norris and Charles Leclerc completed the podium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/u23-world-championship-chirag-chikkara-2nd-indian-male-wrestler-win-gold-2624177-2024-10-28",
      "headline": "Chirag Chikkara wins gold in U23 World Wrestling ChampionshipsIndia's Chirag Chikkara became only the second Indian male wrestler to win Gold in the 57kg category at the U23 World Championships on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/love-how-teams-are-playing-test-cricket-now-ms-dhoni-2624170-2024-10-28",
      "headline": "Love how teams are playing Tests now: Dhoni backs result-oriented approachFormer India captain MS Dhoni said he was pleased with the positive and result-oriented, aggressive brand of Test cricket that is being played these days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-manager-mikel-arteta-more-injuries-liverpool-draw-2624165-2024-10-28",
      "headline": "Arsenal boss Mikel Arteta rues more injury additions after draw vs Liverpool Arsenal manager Mikel Arteta expressed pride in his team's resilient 2-2 draw against Liverpool on Sunday but lamented the expanding injury list that now includes two more key defenders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-hint-csk-future-ipl-2025-retentions-chennai-2624161-2024-10-28",
      "headline": "MS Dhoni drops hint on CSK future ahead of IPL 2025 retentionsChennai Super Kings legend and former India captain MS Dhoni has given fans a strong hint about his future as the IPL 2025 retention deadline nears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-rest-test-regulars-name-t20i-squad-for-pakistan-2624158-2024-10-28",
      "headline": "Australia rest Test regular for Pakistan T20Is ahead of Border-Gavaskar TrophyCricket Australia have rested their first-choice Test XI for the upcoming T20I series against Pakistan to prepare for the blockbuster battle for the Border-Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-junior-offers-support-to-lamine-yamal-after-racist-abuse-in-el-clasico-2624154-2024-10-28",
      "headline": "Vinicius Junior offers support to Lamine Yamal after racist abuse in El ClasicoReal Madrid forward Vinicius Junior has extended his support to FC Barcelona's Lamine Yamal after the young player faced racist abuse during the weekend's El Clasico match"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/love-how-teams-are-playing-test-cricket-now-ms-dhoni-2624170-2024-10-28",
      "headline": "Love how teams are playing Tests now: Dhoni backs result-oriented approachFormer India captain MS Dhoni said he was pleased with the positive and result-oriented, aggressive brand of Test cricket that is being played these days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-manager-mikel-arteta-more-injuries-liverpool-draw-2624165-2024-10-28",
      "headline": "Arsenal boss Mikel Arteta rues more injury additions after draw vs Liverpool Arsenal manager Mikel Arteta expressed pride in his team's resilient 2-2 draw against Liverpool on Sunday but lamented the expanding injury list that now includes two more key defenders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-hint-csk-future-ipl-2025-retentions-chennai-2624161-2024-10-28",
      "headline": "MS Dhoni drops hint on CSK future ahead of IPL 2025 retentionsChennai Super Kings legend and former India captain MS Dhoni has given fans a strong hint about his future as the IPL 2025 retention deadline nears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-rest-test-regulars-name-t20i-squad-for-pakistan-2624158-2024-10-28",
      "headline": "Australia rest Test regular for Pakistan T20Is ahead of Border-Gavaskar TrophyCricket Australia have rested their first-choice Test XI for the upcoming T20I series against Pakistan to prepare for the blockbuster battle for the Border-Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-junior-offers-support-to-lamine-yamal-after-racist-abuse-in-el-clasico-2624154-2024-10-28",
      "headline": "Vinicius Junior offers support to Lamine Yamal after racist abuse in El ClasicoReal Madrid forward Vinicius Junior has extended his support to FC Barcelona's Lamine Yamal after the young player faced racist abuse during the weekend's El Clasico match"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-mohamed-salah-equaliser-earns-liverpool-draw-vs-arsenal-2624133-2024-10-28",
      "headline": "Mohamed Salah equaliser earns Liverpool draw vs ArsenalMohamed Salah's late equaliser earned Liverpool a 2-2 draw with rivals Arsenal in an entertaining Premier League encounter. Playing at the Emirates Stadium on Sunday, Liverpool kept fighting back and eked out a draw after going twice behind in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/unfair-and-unjust-erik-ten-hag-fumes-over-controversial-var-call-vs-west-ham-2624123-2024-10-27",
      "headline": "Unfair and unjust: Erik ten Hag fumes over controversial VAR callManchester United manager Erik ten Hag was left fuming after his team's loss against West Ham United on Sunday, October 27. Manchester United lost the match due to a late penalty call in added time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-a-emerging-asia-cup-champions-beat-sri-lanka-a-final-bilal-sami-2624121-2024-10-27",
      "headline": "Afghanistan A win Emerging Asia Cup after beating Sri Lanka A in FinalAfghanistan A's bowling brilliance powered them to the Emerging Asia Cup title, defeating Sri Lanka A in a low-scoring final on October 27. Bilal Sami and Allah Ghanzanifar's crucial spells set the tone for Afghanistan's historic victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-suffer-2-3-defeat-vs-thailand-in-afc-u17-asian-cup-qualifiers-2624115-2024-10-27",
      "headline": "India suffer 2-3 defeat vs Thailand in AFC U17 Asian Cup qualifiersIndia gave a spirited fight but lost to Thailand 2-3 in a high-octane clash of the AFC U-17 Asian Cup 2025 Qualifiers. The loss means India will have to wait for the results of the other group-stage games before they know their fate regarding progression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-vs-newcastle-united-nicolas-jackson-cole-palmer-goal-premier-league-2624112-2024-10-27",
      "headline": "Premier League: Jackson and Cole Palmer guide Chelsea to 2-1 win over NewcastleChelsea's dynamic display under coach Enzo Maresca earned a 2-1 victory over Newcastle, with goals from Nicolas Jackson and Cole Palmer showcasing their renewed form and propelling them into fourth place in the Premier League standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-team-england-brainless-bazballers-boycott-2624111-2024-10-27",
      "headline": "England batters are 'brainless Bazballers': Boycott slams Ben Stokes' teamLegendary England cricketer Geoffrey Boycott has slammed Ben Stokes' team for being flat-track bullies. In a column, Boycott has called England batters brainless.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-west-ham-controversial-var-penalty-alejandro-garnacho-erik-ten-hag-2624109-2024-10-27",
      "headline": "West Ham beat Manchester United with help from controversial VAR callManchester United's slump continued with a controversial 2-1 loss to West Ham, after a dramatic VAR-awarded penalty in stoppage time left Erik ten Hag's side left them only 3 positions away from relegation zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-ballon-dor-deserving-or-not-real-madrid-vs-fc-barcelona-rodri-performance-2624099-2024-10-27",
      "headline": "Vinicius Jr for Ballon D'or or not?: Fans in splits after El ClasicoVinicius Jr.'s Ballon d'Or hopes were riding high after stellar performances, but Real Madrid's 4-0 El Clasico defeat left fans questioning his consistency on the big stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-vs-newcastle-united-nicolas-jackson-cole-palmer-goal-premier-league-2624112-2024-10-27",
      "headline": "Premier League: Jackson and Cole Palmer guide Chelsea to 2-1 win over NewcastleChelsea's dynamic display under coach Enzo Maresca earned a 2-1 victory over Newcastle, with goals from Nicolas Jackson and Cole Palmer showcasing their renewed form and propelling them into fourth place in the Premier League standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-team-england-brainless-bazballers-boycott-2624111-2024-10-27",
      "headline": "England batters are 'brainless Bazballers': Boycott slams Ben Stokes' teamLegendary England cricketer Geoffrey Boycott has slammed Ben Stokes' team for being flat-track bullies. In a column, Boycott has called England batters brainless.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-west-ham-controversial-var-penalty-alejandro-garnacho-erik-ten-hag-2624109-2024-10-27",
      "headline": "West Ham beat Manchester United with help from controversial VAR callManchester United's slump continued with a controversial 2-1 loss to West Ham, after a dramatic VAR-awarded penalty in stoppage time left Erik ten Hag's side left them only 3 positions away from relegation zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-ballon-dor-deserving-or-not-real-madrid-vs-fc-barcelona-rodri-performance-2624099-2024-10-27",
      "headline": "Vinicius Jr for Ballon D'or or not?: Fans in splits after El ClasicoVinicius Jr.'s Ballon d'Or hopes were riding high after stellar performances, but Real Madrid's 4-0 El Clasico defeat left fans questioning his consistency on the big stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/spin-friendly-tracks-hurting-confidence-of-indian-batters-harbhajan-singh-2624105-2024-10-27",
      "headline": "Spin-friendly tracks hurting confidence of Indian batters: Harbhajan SinghIndia's star batters have lost a lot of confidence over the years by playing on rank turners, with their home averages taking a beating felt former off-spinner Harbhajan Singh. Harbhajan's comments come after India's series loss vs New Zealand at home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-new-zealand-women-2nd-odi-comeback-win-suzie-bates-harmanpreet-kaur-2624093-2024-10-27",
      "headline": "IND W vs NZ W: New Zealand make comeback win over India in 2nd ODINew Zealand Women stormed back into the ODI series with a commanding win over India in Ahmedabad, seizing the second match by 76 runs. Suzie Bates and Lea Tahuhu led the charge, setting up a thrilling series decider."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/el-clasico-spain-government-investigating-racism-incident-against-lamine-yamal-2624097-2024-10-27",
      "headline": "Spain government investigating racism incident against Lamine YamalThe Spain government has opened an investigation into the alleged racist slurs against Lamine Yamal from a section of Real Madrid fans at the El Clasico. Madrid have already launched an investigation of their own after reports of the alleged incident in Spanish media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-has-2-centuries-in-5-years-aakash-chopra-comments-on-batters-form-2624090-2024-10-27",
      "headline": "Kohli has 2 centuries in 5 years: Aakash Chopra comments on batter's formFormer India cricketer Aakash Chopra has commented on Virat Kohli's poor run of form. Chopra has said that Kohli's poor run will be a concern for the side in the coming matches."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}