{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-accused-of-breaching-antitrust-laws-competition-commission-of-india-2630326-2024-11-08",
      "headline": "Zomato, Swiggy accused of unfair practices in food delivery market: ReportThe investigation found these companies implemented practices that gave preferential treatment to certain restaurants on their platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fii-selling-it-gains-weak-q2-earnings-2630311-2024-11-08",
      "headline": "Sensex, Nifty end in red as FII selling offsets IT gains; RVNL tanks 6%The S&P BSE Sensex dropped 55.47 points to settle at 79,486.32, while the NSE Nifty50 fell 89.95 points to 24,109.40.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shiv-nadar-billionaire-edelgive-hurun-india-philanthropy-list-2024-rs-2153-crore-fy24-2630279-2024-11-08",
      "headline": "Shiv Nadar, billionaire with a big heart, donates Rs 2,153 crore in FY24For the third time in five years, Shiv Nadar and his family have topped the EdelGive-Hurun India Philanthropy List 2024, contributing Rs 2,153 crore in the fiscal year 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharan-hegde-faces-criticism-after-laying-off-15-employees-linkedin-post-2630199-2024-11-08",
      "headline": "Sharan Hegde of 1% Club faces criticism after laying off 15% employeesPopular finfluencer Sharan Hegde is facing backlash after announcing layoffs at his company, 1% Club. His LinkedIn post has drawn criticism from many on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-hotels-share-price-gains-6-percent-should-you-buy-sell-hold-brokerage-views-2630161-2024-11-08",
      "headline": "Indian Hotels share price jumps over 6% to hit 1-year high. Buy, hold or sell?Indian Hotels share price: After a softer June quarter, the Tata group's hospitality arm showed strong recovery, buoyed by wedding-driven demand in Mumbai and pent-up bookings delayed by Q1's election and weather impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-reliance-power-share-price-5-percent-lower-circuit-major-setback-seci-bank-2630148-2024-11-08",
      "headline": "Reliance Power share price hits 5% lower circuit after major setback. Details hereReliance Power shares have faced significant volatility this year. The stock has surged by 103% over the past year, reaching a 52-week high of Rs 54.25 in early October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-share-price-decline-continues-down-10-percent-two-days-buy-sell-hold-2630136-2024-11-08",
      "headline": "Trent share price continues to fall. Should you buy, sell or hold? At 11:24 am, Trent's share price was down 2.69% to Rs 6,323.55 on the Bombay Stock Exchange (BSE). In the previous session, Trent shares fell 8%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ircon-international-share-price-today-down-5-percent-q2fy25-results-2630125-2024-11-08",
      "headline": "Explained: Why Ircon International share price slipped 5% after Q2 resultsFor the July-September quarter, Ircon reported a standalone net profit of Rs 202.22 crore, down 12.2% year-on-year (YoY). Revenue from operations also saw a steep fall, dropping 20.3% YoY to Rs 2,298.86 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-8-2024-precious-metals-witness-dip-on-mcx-latest-rates-2630118-2024-11-08",
      "headline": "Gold, silver price today, November 8, 2024: Precious metals witness dip on MCXGold Price Today November 8, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rvnl-share-price-today-q2-results-net-profit-down-explained-2630113-2024-11-08",
      "headline": "Explained: Why RVNL share price plunged over 7% today Earlier this week, on November 6, RVNL secured a new contract valued at over Rs 180 crore from East Central Railway, signaling continued project activity despite the current challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-stock-market-volatile-trade-rvnl-share-price-falls-2630104-2024-11-08",
      "headline": "Sensex, Nifty gain slightly in volatile trade; RVNL falls 5% after Q2 resultsThe S&P BS Sensex was 65.31 points to 79,607.10 at 10:24 am, while the NSE Nifty50 was up just 5.30 points to 24,204.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/federal-reserve-chief-jerome-powell-says-wont-quit-donald-trump-fed-interest-rate-cooling-inflation-2630065-2024-11-08",
      "headline": "Won't resign as US Federal Reserve chief even if Trump asked me to: Jerome PowellSpeaking at a press conference following the latest meeting of the rate-setting Federal Open Market Committee, Jerome Powell was asked if he would step down from central bank leadership if asked by Donald Trump, who repeatedly attacked him in his first term as president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/stocks-rally-as-investors-await-federal-reserves-rate-decision-2629927-2024-11-07",
      "headline": "Stocks rally as investors await Federal Reserve's rate decisionAsian shares recovered as US stocks hit records amid speculations on Trump's presidency and the Fed's rate decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/jet-airways-retail-shareholders-liquidation-order-wipeout-share-price-2629770-2024-11-07",
      "headline": "Jet Airways retail shareholders stare at total loss after liquidation orderJet Airways' stock, which had hit a 5% lower circuit following the court's decision, closed at Rs 34.04 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharan-hegdes-1-club-lays-off-15-of-workforce-amid-ai-driven-cost-cuts-2629750-2024-11-07",
      "headline": "Sharan Hegde lays off 15% of 1% Club's employees, cites AI-driven cost cutsSharan Hegde, the founder and CEO of 1% Club, confirmed in a LinkedIn post that he has laid off 15% of the company's workforce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-donald-trump-fuelled-rally-us-fed-rate-decision-2629713-2024-11-07",
      "headline": "Sensex, Nifty erase Trump-fuelled gains as focus shifts to Fed rate decisionThe S&P BSE Sensex ended 836.34 points to 79,541.79 at the closing bell, while the NSE Nifty50 tumbled 284.70 points to settle at 24,199.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-share-price-down-8-percent-net-profit-revenue-jump-q2fy25-results-2629634-2024-11-07",
      "headline": "Trent share price falls 8% despite 47% rise in Q2 net profit. Here's whyTrent share price: By 1:33 pm, the stock was down 7.49%, trading at Rs 6,432.55 on the Bombay Stock Exchange (BSE).\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-net-worth-rises-26-billion-in-a-day-after-donald-trumps-election-victory-2629597-2024-11-07",
      "headline": "Elon Musk's net worth rises $26 billion in a day after Donald Trump's election victoryThe boost came as Tesla's shares climbed 14.75% to $288.53 during after-hours trading, with Trump's pro-business policies seen as a favorable backdrop for Tesla and Musk's ventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jet-airways-liquidation-supreme-court-non-implementation-resolution-plan-bankrupt-2629587-2024-11-07",
      "headline": "Jet Airways grounded for good as Supreme Court orders liquidationThe Supreme Court noted that five years had passed since the plan was approved, and there had been no significant progress in reviving the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-gains-2-straight-sessions-q2-results-msci-smallcap-index-2629563-2024-11-07",
      "headline": "Ola Electric share price gains after 2 straight sessions. Here's whyOla Electric share price: The uptick in the stock price is attributed to Ola Electric's recent inclusion in the MSCI Small Cap Index."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-dy-chandrachud-retirement-farewell-message-supreme-court-2630305-2024-11-08",
      "headline": "Chief Justice Chandrachud's emotional last working day: Forgive me if I hurt anyoneOn his last working day, Chief Justice DY Chandrachud reflected on his journey in the judiciary and ended his short speech by asking forgiveness from those he might have unintentionally hurt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-opposition-chief-ministerial-fight-maharashtra-rally-assembly-elections-mva-india-bloc-2630177-2024-11-08",
      "headline": "Fight for driver's seat in MVA 'gaadi': PM's dig over chief minister candidateKicking off the BJP's campaign in Maharashtra, PM Modi accused the opposition Maha Vikas Aghadi alliance of looting the state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-high-court-bars-media-from-judging-guilt-in-active-criminal-cases-2630324-2024-11-08",
      "headline": "Media's freedom not a licence to decide guilt: Kerala High CourtThe Kerala High Court ruled that the media has the right to freedom of speech and expression but cannot assume the role of a court, under the guise of this right. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cji-dy-chandrachud-farewell-day-function-justice-sanjiv-khanna-samosas-schedule-good-looks-2630319-2024-11-08",
      "headline": "Your youthful look makes us feel old: Chief Justice's colleagues bid him farewellJustice Sanjiv Khanna, the Chief Justice-designate, praised outgoing CJI DY Chandrachud for following a disciplined lifestyle, including waking up at 4 am and being a vegan. Today is the last working day of CJI Chandrachud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/donald-trump-us-president-abki-baar-trump-sarkar-opinion-2629983-2024-11-08",
      "headline": "Abki Baar Trump SarkarThe United States has seen Donald Trump create a slice of history: the first US President in over 120 years to win presidential elections after being defeated previously as an incumbent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/samosas-cakes-himachal-chief-minister-sukhvinder-singh-sukhu-served-security-staff-cid-probe-2630078-2024-11-08",
      "headline": "Storm over 'no samosa for Himachal Chief Minister', CID says no probe amid rowThe alleged incident took place on October 21, when Chief Minister Sukhvinder Singh Sukhu visited the CID headquarters in Shimla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-khan-death-threat-songwriter-sikander-film-lawrence-bishnoi-gang-2630306-2024-11-08",
      "headline": "Won't spare lyricist: New threat to Salman Khan over song naming BishnoiThe person issued a death threat to the lyricist of 'Main Sikandar Hoon', a song from Salman Khan's upcoming film Sikander. In the past few weeks, the Mumbai Police helpline has received many threat messages for Salman Khan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-rescue-team-citizens-football-fans-dutch-youth-clash-violent-attack-pro-palestine-demonstrators-amsterdam-2630156-2024-11-08",
      "headline": "Israeli football fans faced hit-and-run attacks in Amsterdam, rescue planes rushedThe Israeli military on Friday said that it is preparing to immediately deploy a rescue mission with the coordination of the Dutch government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-baby-announcement-athiya-shetty-wife-india-vs-australia-test-border-gavaskar-2630379-2024-11-08",
      "headline": "KL Rahul, Athiya Shetty announce pregnancy: 'Beautiful blessing coming soon'KL Rahul and Athiya Shetty thrilled fans by announcing they're expecting their first child. The cricketer-actor couple shared the news of their baby, due in 2025, via their social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vijay-69-review-anupam-kher-melodrama-lacklustre-2630204-2024-11-08",
      "headline": "Vijay 69 review: Too much melodrama dampens film, Anupam Kher's spiritReleased-Fri Nov 08, 2024Netflix's Vijay 69 movie review: The predictable plot, melodrama, and half-hearted performances make this Anupam Kher film a lacklustre attempt at portraying ageing. The weak plot development makes it tough to evoke sympathy or pain for Kher, even when he gets teary-eyed during emotional meltdowns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-railways-overcrowded-festive-season-vande-bharat-china-train-driving-holiday-airfare-2630187-2024-11-08",
      "headline": "Indians stuffed in train toilets, China moves billions with little fussMillions of travellers get added in India during the festive season, putting pressure on the railway network. But how has China managed its lunar holiday travellers, which is much higher than India's? This is the bigger story behind people stuffed in train toilets in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-women-commission-men-tailor-women-clothes-gym-trainers-2630243-2024-11-08",
      "headline": "Men shouldn't cut women's hair, tailor their clothes: UP body's proposalBabita Chouhan, chief of the Uttar Pradesh Women's Commission, said school buses transporting girls should mandatorily have a female staffer and proposed the installation of CCTV cameras in coaching centres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/fictosexual-japanese-man-6th-wedding-anniversary-virtual-wife-hatsune-miku-pics-2630378-2024-11-08",
      "headline": "'Fictosexual' Japanese man celebrates 6th wedding anniversary with virtual wifeAkihiko Kondo fell in love with Miku in 2007, shortly after the character was released. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/battle-royal-in-maharashtra-polls-the-big-contenders-2629712-2024-11-07",
      "headline": "Battle royal in Maharashtra polls: The big contendersHow political parties are betting on erstwhile royal families to notch up victories in the assembly elections"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-ranji-trophy-2024-25-ankit-bawne-maharashtra-vs-services-amit-shukla-2630325-2024-11-08",
      "headline": "Ruturaj Gaikwad calls out 'pathetic' umpiring in Ranji Trophy 2024-25India batter Ruturaj Gaikwad called out shoddy umpiring in the Ranji Trophy 2024-25 during the Maharashtra vs Services match where Ankit Bawne wasgiven out wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-first-public-appearance-daughter-dua-airport-2630170-2024-11-08",
      "headline": "Watch: Ranveer-Deepika make first public appearance with daughter Dua at airportRanveer Singh and Deepika Padukone made their first public appearance with daughter Dua Padukone Singh at the airport. Videos of the couple with the little one have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/donald-trump-president-elect-kamala-harris-democrat-republican-us-presidential-election-results-political-fundings-2629542-2024-11-08",
      "headline": "When battle-hardened Trump funded Kamala Harris's election campaignDonald Trump, now a right-wing Republican, switched sides regularly. He was once a registered Democrat and had a soft corner for the party he now bashes. Trump also funded the campaigns of Kamala Harris, twice. The same Harris he would go on to defeat in the 2024 presidential election."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-overrules-1967-order-denying-minority-status-to-aligarh-muslim-university-new-bench-to-decide-2630132-2024-11-08",
      "headline": "Supreme Court overrules its order denying AMU minority status, new bench to decideThe Supreme Court said the issue of whether Aligarh Muslim University is a minority institution would be decided by a separate three-judge bench."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-rubbish-pcb-rumours-hybrid-model-india-travel-2630228-2024-11-08",
      "headline": " Pak rejects rumours of agreeing to hybrid model amid India uncertainty: SourcesChampions Trophy 2025: Pakistan Cricket Board sources rubbished reports that claimed it had agreed to host the 50-over marquee tournament in a hybrid model with India matches in the UAE. The International Cricket Council is all set to announce the schedule for the Champions Trophy in the second week of November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/joe-biden-sharp-speech-health-concern-donald-trump-win-kamala-harris-2630139-2024-11-08",
      "headline": "The Biden that Democrats needed during campaign as post-poll speech goes viralUS election results: On Thursday, as he addressed the nation after Donald Trump's win, Joe Biden was calm and surprisingly upbeat. Biden's six-minute address was devoid of any gaffes or missteps, as was seen in his previous speeches and debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/at-59-shah-rukh-khan-quit-smoking-does-age-matter-when-kicking-the-butt-2629651-2024-11-08",
      "headline": "At 59, Shah Rukh Khan quit smoking. Does age matter when kicking the butt?During a recent Q&A session with fans on his 59th birthday, SRK revealed that he's finally quit smoking. But does it still count when you give it up so late in life?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharan-hegde-faces-criticism-after-laying-off-15-employees-linkedin-post-2630199-2024-11-08",
      "headline": "Sharan Hegde of 1% Club faces criticism after laying off 15% employeesPopular finfluencer Sharan Hegde is facing backlash after announcing layoffs at his company, 1% Club. His LinkedIn post has drawn criticism from many on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-elections-2024-uddhav-sena-vs-eknath-shinde-sena-milind-deora-adani-dharavi-slum-redevelopment-project-2630236-2024-11-08",
      "headline": "Speed-breaker politics: Milind Deora on Uddhav Sena's plan to scrap Adani projectThe opposition has accused the Maharashtra government of orchestrating a major scam around the Dharavi  Development Project, claiming it was tailored to benefit Gautam Adani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-a-vs-ind-a-kl-rahul-poor-form-gets-bowled-between-legs-dhruv-jurel-2630180-2024-11-08",
      "headline": "Watch: KL Rahul's horror run continues, gets bowled between his legs vs Australia AStar India batter KL Rahul continued his poor form as he got bowled between his legs during Day 2 of the second unofficial Test against Australia A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-announce-pregnancy-sonakshi-sinha-sobhita-dhulipala-congratulate-2630390-2024-11-08",
      "headline": "Athiya Shetty-KL Rahul announce pregnancy: Sonakshi Sinha, Sobhita congratulateAthiya Shetty and KL Rahul, who got married in January 2023, have announced they are expecting their first child. The announcement was met with congratulatory messages from celebrities like Sonakshi Sinha, Sobhita Dhulipala, and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-3-releases-in-3-years-new-deal-hombale-salaar-2-update-2630348-2024-11-08",
      "headline": "Prabhas gets 3 releases in 3 years as per new deal with KGF makersActor Prabhas has signed a landmark three-film deal with Hombale Films, the production house behind massive hits like KGF and Kantara. The collaboration kicks off with the much-anticipated Salaar Part 2, following the success of Salaar Part 1: Ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-kanguva-gets-ua-certificate-from-censor-board-cleared-for-november-14-release-2630373-2024-11-08",
      "headline": "Suriya's Kanguva gets U/A from censor board, cleared for November 14 releaseSuriya's pan-India film, Kanguva, has been cleared by the censor board with a U/A rating. The action adventure drama will be released on November 14. Here's all about the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-tears-receiving-gift-saransh-director-mahesh-bhatt-2630353-2024-11-08",
      "headline": "Anupam Kher in tears after receiving a gift from Saransh director Mahesh BhattAnupam Kher received a beautiful gift from his Saraansh director Mahesh Bhatt as he completed 40 years in cinema. The actor shared a picture with the director along with a heartfelt note.  "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-jos-buttler-ipl-2025-rajasthan-royals-2630388-2024-11-08",
      "headline": "He's my Jos bhai: Yuzvendra Chahal's heartfelt note for Jos ButtlerYuzvendra Chahal shared a heartfelt note for Jos Buttler. Both Chahal and Buttler were not retained by the Rajasthan Royals before the Indian Premier League (IPL) 2025 auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lucky-ian-botham-survives-falling-into-crocodile-infested-river-2630385-2024-11-08",
      "headline": "'Lucky' Ian Botham survives falling into crocodile infested riverLegendary England cricketer Ian Botham revealed that he was nearly caught by crocodiles and bull sharks after falling out of his boat on a fishing trip. Botham took to Instagram to reveal the story  and thanked the boat's crew for pulling him out.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-bcci-mohsin-naqvi-icc-hybrid-model-reports-2630381-2024-11-08",
      "headline": "India not to travel to Pakistan? PCB chief says no communication from BCCI Champions Trophy 2025: Pakistan cricket board chief Mohsin Naqvi said on Friday that there has been no written communication from India regarding their participation. Naqvi responded strongly to reports that claimed India wrote to the ICC, informing the global body that they wouldn't travel to Pakistan for the 50-over tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-baby-announcement-athiya-shetty-wife-india-vs-australia-test-border-gavaskar-2630379-2024-11-08",
      "headline": "KL Rahul, Athiya Shetty announce pregnancy: 'Beautiful blessing coming soon'KL Rahul and Athiya Shetty thrilled fans by announcing they're expecting their first child. The cricketer-actor couple shared the news of their baby, due in 2025, via their social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-will-young-ravindra-jadeja-mumbai-wankhede-2630368-2024-11-08",
      "headline": "Will Young reveals how he negated Ravindra Jadeja's threat during the Test seriesNew Zealand batter Will Young revealed how he countered Ravindra Jadeja's threat during the third Test against India at Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2024-smriti-mandhana-adelaide-strikers-debut-brisbane-heat-2630347-2024-11-08",
      "headline": "Smriti Mandhana set for Strikers debut against Heat in WBBL  WBBL 2024: Smriti Mandhana has been named in the Adelaide Strikers squad for the clash against Brisbane Heat on Saturday, November 9 at The Gabba in Brisbane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-ranji-trophy-2024-25-ankit-bawne-maharashtra-vs-services-amit-shukla-2630325-2024-11-08",
      "headline": "Ruturaj Gaikwad calls out 'pathetic' umpiring in Ranji Trophy 2024-25India batter Ruturaj Gaikwad called out shoddy umpiring in the Ranji Trophy 2024-25 during the Maharashtra vs Services match where Ankit Bawne wasgiven out wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-haris-rauf-adelaide-odi-bbl-2630316-2024-11-08",
      "headline": "How Haris Rauf used BBL experience to torment Australia in Adelaide AUS vs PAK: Haris Rauf finished with 8-0-29-5 as Pakistan beat Australia by nine wickets on Friday at the Adelaide Oval to draw level in the three-match ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-second-odi-pat-cummins-border-gavaskar-trophy-2630283-2024-11-08",
      "headline": "AUS vs PAK: Pat Cummins ready to shift focus to Border-Gavaskar TrophyAustralia captain Pat Cummins has claimed that he will now shift his focus completely to the Border-Gavaskar Trophy after the second ODI against Pakistan. Cummins and others will now be rested for the series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-2nd-odi-haris-rauf-saim-ayub-shaheen-afridi-mohammad-rizwan-2630232-2024-11-08",
      "headline": "Rauf, Ayub star as Pakistan end 7-year wait for an ODI win in AustraliaPakistan beat Australia by nine wickets in the second ODI at the Adelaide Oval and levelled the series 1-1. Haris Rauf picked up his second five-wicket haul while youngster Saim Ayub scored a breathtaking 82."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-rubbish-pcb-rumours-hybrid-model-india-travel-2630228-2024-11-08",
      "headline": " Pak rejects rumours of agreeing to hybrid model amid India uncertainty: SourcesChampions Trophy 2025: Pakistan Cricket Board sources rubbished reports that claimed it had agreed to host the 50-over marquee tournament in a hybrid model with India matches in the UAE. The International Cricket Council is all set to announce the schedule for the Champions Trophy in the second week of November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-ranji-trophy-2024-25-ankit-bawne-maharashtra-vs-services-amit-shukla-2630325-2024-11-08",
      "headline": "Ruturaj Gaikwad calls out 'pathetic' umpiring in Ranji Trophy 2024-25India batter Ruturaj Gaikwad called out shoddy umpiring in the Ranji Trophy 2024-25 during the Maharashtra vs Services match where Ankit Bawne wasgiven out wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-haris-rauf-adelaide-odi-bbl-2630316-2024-11-08",
      "headline": "How Haris Rauf used BBL experience to torment Australia in Adelaide AUS vs PAK: Haris Rauf finished with 8-0-29-5 as Pakistan beat Australia by nine wickets on Friday at the Adelaide Oval to draw level in the three-match ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-second-odi-pat-cummins-border-gavaskar-trophy-2630283-2024-11-08",
      "headline": "AUS vs PAK: Pat Cummins ready to shift focus to Border-Gavaskar TrophyAustralia captain Pat Cummins has claimed that he will now shift his focus completely to the Border-Gavaskar Trophy after the second ODI against Pakistan. Cummins and others will now be rested for the series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-2nd-odi-haris-rauf-saim-ayub-shaheen-afridi-mohammad-rizwan-2630232-2024-11-08",
      "headline": "Rauf, Ayub star as Pakistan end 7-year wait for an ODI win in AustraliaPakistan beat Australia by nine wickets in the second ODI at the Adelaide Oval and levelled the series 1-1. Haris Rauf picked up his second five-wicket haul while youngster Saim Ayub scored a breathtaking 82."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-rubbish-pcb-rumours-hybrid-model-india-travel-2630228-2024-11-08",
      "headline": " Pak rejects rumours of agreeing to hybrid model amid India uncertainty: SourcesChampions Trophy 2025: Pakistan Cricket Board sources rubbished reports that claimed it had agreed to host the 50-over marquee tournament in a hybrid model with India matches in the UAE. The International Cricket Council is all set to announce the schedule for the Champions Trophy in the second week of November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-a-vs-india-a-score-2nd-unofficial-test-kl-rahul-mcg-dhruv-jurel-2630209-2024-11-08",
      "headline": "2nd unofficial Test: KL Rahul fails audition, Dhruv Jurel key as India A in troubleAustralia A vs India A, 2nd unofficial Test: KL Rahul failed to impress for the second successive innings as India A were in trouble at Stumps on Day 2. Dhruv Jurel impressed after Australia's Marcus Harris hit a gritty fifty on a pace-friendly pitch in Melbourne on Friday, November 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-adam-zampa-aus-vs-pak-adelaide-2630198-2024-11-08",
      "headline": "Watch: Mohammad Rizwan takes DRS after consulting with Adam Zampa, loses reviewPakistan captain Mohammad Rizwan was seen hilariously consulting with Australia batter Adam Zampa before taking a DRS during the second ODI vs Pakistan in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-a-vs-ind-a-kl-rahul-poor-form-gets-bowled-between-legs-dhruv-jurel-2630180-2024-11-08",
      "headline": "Watch: KL Rahul's horror run continues, gets bowled between his legs vs Australia AStar India batter KL Rahul continued his poor form as he got bowled between his legs during Day 2 of the second unofficial Test against Australia A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-legend-mohammad-nabi-to-retire-from-odis-after-champions-trophy-2630163-2024-11-08",
      "headline": "Afghanistan legend Mohammad Nabi to retire from ODIs after Champions TrophyAfghanistan cricket legend Mohammad Nabi is set to retire from ODIs after the ICC Champions Trophy 2025 in Pakistan. The all-rounder will continue his T20 career, marking the end of an illustrious ODI journey since 2009."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-2nd-odi-haris-rauf-adelaide-steve-smith-shaheen-afridi-2630151-2024-11-08",
      "headline": "AUS vs PAK: Haris Rauf runs through Australia with five-wicket haul in 2nd ODIStar Pakistan fast bowler Haris Rauf ran through the Australian batting line up in the second ODI of the series as he scalped second five wicket haul of his ODI career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-manchester-united-players-want-ruud-van-nistelrooy-to-stay-on-andre-onana-2630141-2024-11-08",
      "headline": "Manchester United players want Ruud van Nistelrooy to stay on: Andre OnanaManchester United goalkeeper Andre Onana has voiced player support for interim manager Ruud van Nistelrooy to stay at the club, despite Ruben Amorim's impending arrival. Van Nistelrooy, who stepped in after Erik ten Hag's sacking, has led United to positive results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-ramandeep-singh-vijaykumar-vyshak-sa-vs-ind-1st-t20i-2630124-2024-11-08",
      "headline": "Watch: Chef Suryakumar Yadav introduces Vyshak, Ramandeep as team's new dishesIndia's new T20I skipper Suryakumar Yadav introduced Vijaykumar Vyshak and Ramandeep Singh as the team India's new dishes while donning the chef's hat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-preview-team-news-predicted-xi-suryakumar-yadav-aiden-markram-durban-2630109-2024-11-08",
      "headline": "Ahead of IPL mega auction, India and South Africa stars renew T20I rivalrySouth Africa vs India; Weeks ahead of the IPL mega auction, India and South Africa will meet in a four-match T20I series. There's a lot to look forward to as Durban prepares to host the series opener on Friday, November 8. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-pak-2nd-odi-haris-rauf-adelaide-steve-smith-shaheen-afridi-2630151-2024-11-08",
      "headline": "AUS vs PAK: Haris Rauf runs through Australia with five-wicket haul in 2nd ODIStar Pakistan fast bowler Haris Rauf ran through the Australian batting line up in the second ODI of the series as he scalped second five wicket haul of his ODI career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-manchester-united-players-want-ruud-van-nistelrooy-to-stay-on-andre-onana-2630141-2024-11-08",
      "headline": "Manchester United players want Ruud van Nistelrooy to stay on: Andre OnanaManchester United goalkeeper Andre Onana has voiced player support for interim manager Ruud van Nistelrooy to stay at the club, despite Ruben Amorim's impending arrival. Van Nistelrooy, who stepped in after Erik ten Hag's sacking, has led United to positive results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-ramandeep-singh-vijaykumar-vyshak-sa-vs-ind-1st-t20i-2630124-2024-11-08",
      "headline": "Watch: Chef Suryakumar Yadav introduces Vyshak, Ramandeep as team's new dishesIndia's new T20I skipper Suryakumar Yadav introduced Vijaykumar Vyshak and Ramandeep Singh as the team India's new dishes while donning the chef's hat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-preview-team-news-predicted-xi-suryakumar-yadav-aiden-markram-durban-2630109-2024-11-08",
      "headline": "Ahead of IPL mega auction, India and South Africa stars renew T20I rivalrySouth Africa vs India; Weeks ahead of the IPL mega auction, India and South Africa will meet in a four-match T20I series. There's a lot to look forward to as Durban prepares to host the series opener on Friday, November 8. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ind-1st-t20i-weather-update-durban-rain-forecast-suryakumar-yadav-aiden-markram-2630095-2024-11-08",
      "headline": "SA vs IND 1st T20I, Durban weather forecast: Will rain play spoilsport?India are set to take on South Africa in the first T20I of the four-match series beginning from November 8 at Kingsmead, Durban. Inclement weather is expected to interrupt the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-a-vs-india-a-second-unofficial-test-day-two-marcus-harris-dismissal-tanush-kotian-melbourne-2630092-2024-11-08",
      "headline": "Out or not out? India A left fuming with Marcus Harris' controversial callThe India-A team was left fuming with the controversial call which saw Marcus Harris stay at the crease after he had seemingly edged the ball to slips on Day 2 of the 2nd official Test against Australia-A. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-1st-t20i-predicted-xis-ramandeep-singh-debut-durban-2630067-2024-11-08",
      "headline": "SA vs IND, 1st T20I Predicted XI: Will Ramandeep make his debut?India's T20I series opener against South Africa may see debut opportunities for fresh faces like Ramandeep Singh and Vijaykumar Vyshak. Both players impressed in the IPL and domestic circuits, earning their call-ups for a promising international debut."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}