{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-rally-end-higher-it-stocks-gain-tcs-tech-mahindra-up-2818136-2025-11-12",
      "headline": "Sensex, Nifty end higher as US optimism sparks IT rallyThe S&P BSE Sensex gained 595.19 points to close at 84,466.51, while the NSE Nifty50 added 180.85 points to end at 25,875.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-gold-etf-buying-bond-india-leads-us-china-shift-physical-precious-metals-why-reason-2818123-2025-11-12",
      "headline": "Gold without the glitter: Why investors are moving away from physical goldIn October 2025, India recorded the third-highest gold ETF inflows globally, behind only the United States and China, a clear sign that the country's love for gold is being redefined in the digital era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-a-house-just-because-you-can-afford-the-emi-think-again-2818050-2025-11-12",
      "headline": "Buying a house just because you can afford the EMI? Think againThe calculator may say you can afford it, but life may say otherwise. A home loan is not just a financial decision — it impacts savings, career choices, and long-term stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-enterprises-share-price-rally-over-6-percent-today-rights-issue-2818043-2025-11-12",
      "headline": "Explained: Why Adani Enterprises shares have gained over 6% todayAdani Enterprises share price: The rise came after the company announced plans for a Rs 24,930-crore rights issue, its biggest fundraising move since the cancelled follow-on public offering (FPO) in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-jump-5-percent-today-why-stock-is-gaining-today-2818041-2025-11-12",
      "headline": "IndusInd Bank shares jump 5% today. What's behind the rally?At around 1:20 pm, IndusInd Bank shares were up 4.38% at Rs 862.05 on the Bombay Stock Exchange (BSE), with trading volumes remaining strong through the afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indias-direct-tax-collection-up-7-percent-but-refunds-down-177-percent-what-does-it-mean-2817988-2025-11-12",
      "headline": "India's direct tax collection up 7%, but refunds down 17.7%. What does it mean?India's direct tax collection climbed 7% this year, but refunds dropped 17.7%. It leaves taxpayers asking what's really driving the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-jump-why-is-stock-market-rising-today-reason-us-india-deal-it-stocks-rally-asian-markets-2817983-2025-11-12",
      "headline": "Sensex jumps 600 points: 3 reasons why stock market is rising todayThe S&P BSE Sensex rose 663.63 points to 84,534.95, while the NSE Nifty50 jumped 196.25 points to 25,891.20 as of 11:38 am. The rally comes after days of sluggish trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-why-so-many-retail-investors-end-up-losing-money-2817758-2025-11-12",
      "headline": "The great IPO gamble: Why so many retail investors end up losing moneyThis is Part 1 of a three-part series examining how India's IPO boom is entering risky territory for retail investors amid sky-high valuations and growing market hype.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-income-rises-but-wealth-doesnt-inside-indias-lifestyle-inflation-problem-2817957-2025-11-12",
      "headline": "When income rises but wealth doesn't: Inside India's lifestyle inflation problemThe globalisation, liberalisation, and privatisation of the post 1991 – propelled GDP growth but fostered dynamics that entrench lifestyle creep at a seed level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-list-12-percent-higher-on-debut-hold-or-book-profit-now-2817921-2025-11-12",
      "headline": "Groww shares list 12% higher on debut: Hold or book profit now?Groww's market debut at Rs 112 marks a strong start for the fintech, but analysts say investors should book partial profits and hold the rest for long-term growth amid valuation risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-opening-bse-nse-14-percent-premium-above-expectations-rs-114-hold-sell-2817915-2025-11-12",
      "headline": "Groww shares list at 14% premium, exceeds expectation on market debutThe stock opened at Rs 114 on the BSE and Rs 112 on the NSE, compared to its IPO price of Rs 100 per share, exceeding market expectations for a modest gain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-demerger-tmcv-shares-lists-with-30-premium-at-rs-340-2817909-2025-11-12",
      "headline": "Tata Motors CV shares list at 28% premium after demerger at Rs 335Tata Motors' commercial vehicle arm listed with a strong premium, reflecting investor confidence in India's transport and infrastructure growth, and marking a major milestone in the company's value-unlocking journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-allotment-status-check-latest-gmp-share-price-expectation-2817908-2025-11-12",
      "headline": "Pine Labs IPO allotment out: Check status, listing date and expected gainsInvestors who have applied for the IPO can check their allotment status through the BSE website or via the registrar, Kfin Technologies Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-us-fed-rate-cut-forecast-precious-metals-outlook-2817906-2025-11-12",
      "headline": "Gold price at Rs 1.24 lakh, silver nears Rs 1.56 lakh: What's next?The rally in precious metals comes amid expectations of a US Federal Reserve rate cut next month, easing concerns around the prolonged US government shutdown and continued weakness in the dollar index."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tenneco-clean-air-ipo-open-bidding-review-price-band-gmp-trend-details-share-analysis-2817884-2025-11-12",
      "headline": "Tenneco Clean Air IPO opens for bidding: Check price band, GMP before subscribingTenneco Clean Air IPO is a book-built issue worth Rs 3,600 crore, entirely an offer for sale (OFS) of 9.07 crore shares. This means all proceeds will go to the selling shareholders, and the company will not receive any fresh capital from the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-400-points-higher-nifty-above-25800-titan-up-1-percent-2817880-2025-11-12",
      "headline": "Sensex, Nifty open higher on optimism over Bihar exit polls, US trade dealOptimism over a likely NDA victory in Bihar and hopes of an imminent India-US trade deal lifted investor sentiment, driving Sensex and Nifty higher even as caution lingered over FII activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-cv-demerger-2025-listing-details-share-price-what-to-expect-investor-guide-2817869-2025-11-12",
      "headline": "Tata Motors CV Listing: Post-demerger details and what it means for investorsThe new entity, Tata Motors Ltd (CV), will be India's largest commercial vehicle manufacturer, with a wide portfolio spanning small cargo vehicles, medium and heavy commercial vehicles (M&HCVs), and buses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-listing-expected-share-price-ipo-debut-nse-bse-check-gmp-review-market-opening-today-2817865-2025-11-12",
      "headline": "Groww IPO listing: Shares to open strong on NSE, BSE? Check GMPGroww IPO opened on November 4 and closed on November 7, with the allotment finalised on November 10. Investors who applied can now check their allotment status on the BSE website or through the registrar, MUFG Intime India Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-names-neville-tata-bhaskar-bhat-as-new-trustees-report-2817724-2025-11-11",
      "headline": "Tata Trusts names Neville Tata, Bhaskar Bhat as new trustees: ReportNeville, 32, currently leads Trent's value fashion brand Zudio and serves on several other Tata Trust boards. Bhaskar Bhat, a former Titan managing director, is credited with driving the company's diversification and expansion during his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-new-paytm-app-brings-greater-privacy-stronger-security-and-control-for-users-2817586-2025-11-11",
      "headline": "All-new Paytm app brings greater privacy, stronger security and control for usersReinforcing its commitment to being the safest UPI app in India, Paytm now prevents screen recording during UPI payments, adding a critical layer of security that protects users from potential fraud."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-simple-suni-gatha-vaibhava-film-release-14-november-support-unique-storytelling-2818067-2025-11-12",
      "headline": "Sudeep praises Simple Suni, calls him one of Kannada cinema's best directors Kichcha Sudeep launched the trailer of Simple Suni's 'Gatha Vaibhava' ahead of its November 14 release, praising the director for his craft and attention to detail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithvirajs-ssmb29-poster-drives-viral-helmet-awareness-campaign-of-kerala-police-2818124-2025-11-12",
      "headline": "Prithviraj's SSMB29 poster drives viral helmet awareness campaign of Kerala Police As excitement builds for SS Rajamouli and Mahesh Babu's upcoming film 'SSMB29', Prithviraj Sukumaran's intense first-look poster has gone viral for an unexpected reason as Kerala Police creatively uses it for a road safety campaign.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-says-her-role-was-cut-short-in-jolly-llb-2-2818133-2025-11-12",
      "headline": "Huma Qureshi says her role was cut short in Jolly LLB 2: I was really upset Huma Qureshi shared that much of her role in 'Jolly LLB 2' was cut during editing, leaving her feeling upset about the reduced screen time. The actor said she dislikes \"ornamental\" parts and hopes for more meaningful roles ahead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/23-years-of-prabhas-23-films-and-countless-milestones-for-the-pan-india-superstar-2818071-2025-11-12",
      "headline": "23 years of Prabhas: 23 films and countless milestones for the pan-India superstar November 11 marked a poetic full circle for Prabhas, from his 2002 debut film 'Eeswar' to the completion of his upcoming film, 'The Raja Saab'. It has been the journey of a star who turned quiet beginnings into pan-India dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/k-pop-star-bang-yedam-on-wanting-to-visit-taj-mahal-delhi-bengaluru-speaks-in-hindi-exclusive-2818099-2025-11-12",
      "headline": "K-pop star Bang Yedam on wanting to visit Taj Mahal, Delhi, Bengaluru, speaks in Hindi | Exclusive South Korean singer-songwriter Bang Yedam, in an exclusive interview with India Today, opened up about his relationship with his fans. The K-pop star, who was in Mumbai to perform at the K-Town Festival, expressed his gratitude towards his fandom and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-maxton-hall-s2-star-damian-hardung-promises-to-visit-india-playing-james-spirituality-2818094-2025-11-12",
      "headline": "Exclusive: Maxton Hall S2 star Damian Hardung promises to visit India, playing James, spirituality In an exclusive chat with India Today's Bhavna Agarwal, Damian Hardung spoke about playing James this season, why it was tougher than Season 1 and visiting India. He shared that he had visited India before but would like to return and especially visit Rajasthan. Joining in for another conversation was director Martin Schreier, who explained why this season was more about them finding each other as individuals versus enemies-to-lovers trope. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-turns-28-star-kid-who-made-filmmaking-cooler-than-stardom-shah-rukh-khan-2818059-2025-11-12",
      "headline": "Aryan Khan turns 28: Star kid who made filmmaking cooler than stardom Who needs a grand launch when you can drop a bold debut? Shah Rukh Khan's son Aryan, with his grand OTT launch, proved that creativity can be the star, too, when it comes to making an impact. As he turns 28 today, take a look at how Aryan Khan chose to rewrite the rules of a star kid's debut and chart his own creative path."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-discharged-from-hospital-after-fainting-emphasizes-yoga-and-pranayama-for-health-2818076-2025-11-12",
      "headline": "Govinda discharged from hospital, says yoga works better than heavy workouts Actor Govinda was released from the hospital on Wednesday after fainting at home the previous night. Upon his discharge, Govinda addressed the media and shared his experience, emphasising the benefits of yoga and pranayama over intense workouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tom-felton-returns-draco-malfoy-harry-potter-cursed-child-broadway-2818042-2025-11-12",
      "headline": "Tom Felton returns as Draco Malfoy on Broadway Tom Felton debuted as Draco Malfoy in 'Harry Potter and the Cursed Child' at New York City's Lyric Theatre, marking his first Broadway appearance and drawing a passionate reaction from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-shehbazs-girlfriend-bashes-farrhana-for-calling-him-rhinoceros-2818051-2025-11-12",
      "headline": "Bigg Boss 19: Shehbaz's girlfriend bashes Farrhana for calling him rhinoceros A recent episode of 'Bigg Boss 19' has drawn attention after contestant Shehbaz Badesha was subjected to body-shaming remarks by housemate Farrhana Bhatt, prompting a public response from his girlfriend Kashish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/neelam-giri-calls-bigg-boss-19-biggest-career-milestone-want-to-do-hindi-films-2818034-2025-11-12",
      "headline": "Neelam Giri calls Bigg Boss 19 biggest career milestone: Want to do Hindi films Bhojpuri actor Neelam Giri, in an exclusive interview with India Today, opened up about her experience of participating in 'Bigg Boss 19'. She is looking forward to doing Hindi films after the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/meghana-raj-sarja-joins-jailer-2-rajinikanth-cast-tamil-comeback-2818021-2025-11-12",
      "headline": "Rajinikanth's Jailer 2 to mark Meghana Raj's return to Tamil cinema: Report Marking her return to Tamil cinema after over a decade, Meghana Raj has reportedly joined the cast of Rajinikanth's 'Jailer 2', one of the most anticipated sequels in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-attends-the-girlfriend-success-celebration-boosting-box-office-momentum-2817959-2025-11-12",
      "headline": "Vijay Deverakonda to attend Rashmika's The Girlfriend success meet Following a steady box office rise of 'The Girlfriend', the film's success meet is set to host Vijay Devarakonda as the chief guest, along with Rashmika Mandanna and the rest of the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arshad-warsi-praises-aryan-khan-for-his-directorial-debut-2818029-2025-11-12",
      "headline": "Arshad Warsi praises Aryan Khan for his directorial debut: Had the film in his head Arshad Warsi praised Aryan Khan's direction in 'The Ba**ds of Bollywood', crediting him entirely for the success of his role as Ghafoor. The actor said Aryan's vision and precision shaped every aspect of his performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-birthday-rajat-bedi-poetic-wish-for-filmmaker-2817993-2025-11-12",
      "headline": "Aryan Khan's birthday: Rajat Bedi has a poetic wish for filmmaker Actor Rajat Bedi shared a heartfelt message for 'The Ba***ds of Bollywood' director Aryan Khan on social media. In a special post, Rajat said Aryan turns each dream into pure light. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-65-kalyan-and-thanuja-clash-as-kingdom-task-adds-fun-2817991-2025-11-12",
      "headline": "Bigg Boss Telugu 9 Day 65: Kalyan and Thanuja clash as Kingdom task adds fun After an intense nomination episode on Day 64, the housemates entered a lighter yet competitive mood on Day 65 as Bigg Boss introduced the \"BB Kingdom\" task — a mix of laughter, strategy, and minor conflicts that kept the energy high throughout the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-discharged-from-hospital-to-recover-at-home-statement-2818005-2025-11-12",
      "headline": "Dharmendra discharged from hospital, to recover at home: Statement Dharmendra, 89, has been released from hospital and will continue his recovery at home in Mumbai. His family and doctors have confirmed his condition is stable, while requesting privacy and condemning recent false reports about his health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jumanji-3-filming-starts-los-angeles-full-cast-final-2026-christmas-release-2817995-2025-11-12",
      "headline": "Dwayne Johnson kicks off Jumanji 3 filming for final adventure Dwayne Johnson has announced that filming for 'Jumanji 3', described as the final movie in the franchise, has started in Los Angeles. The film brings back director Jake Kasdan and the original cast, with a planned release for Christmas 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-prays-for-dharmendra-in-video-hours-before-govindas-hospitalisation-2817999-2025-11-12",
      "headline": "Sunita Ahuja prays for Dharmendra in video hours before Govinda's hospitalisation Actor Govinda was admitted to CritiCare Hospital in Juhu, Mumbai, after losing consciousness at his home. The evening before, his wife, Sunita Ahuja, was seen talking to paparazzi about veteran actor Dharmendra's health."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-cops-launch-massive-hunt-for-ecosport-car-no-dl10ck0458-2818135-2025-11-12",
      "headline": "Delhi bomber owned 2nd car, cops launch massive hunt for EcoSport car DL10CK0458Police are intercepting all red Ford EcoSport cars, to find the one bearing the number DL10CK0458, which was registered to Umar Un Nabi at Rajouri Garden RTO on 22 November 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-red-fort-car-blast-survivors-at-delhis-lnjp-hospital-after-returning-from-bhutan-2818106-2025-11-12",
      "headline": "PM meets Red Fort blast survivors in hospital after returning from BhutanThe Prime Minister, who was on a two-day state visit to Bhutan, went straight to the LNJP hospital after landing in Delhi to meet those injured in the Red Fort blast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/jaish-linked-doctors-planned-red-fort-attack-on-republic-day-plot-was-foiled-2818116-2025-11-12",
      "headline": "Jaish-linked doctors planned to attack Red Fort on Republic Day; plot was foiledHours after police busted the terror module with links to Jaish-e-Mohammed and Ansar Ghazwat-ul-Hind, and arrested eight people including three doctors, a high-intensity blast ripped through a slow-moving car near Delhi's Red Fort area, killing 12 people and injuring several others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-car-blast-terror-module-telegram-groups-doctors-radicalisation-logistics-2818008-2025-11-12",
      "headline": "Turkey trip, Telegram chats, Jaish handler: How doctors module was radicalised  Live updatesAccording to the sources, investigators have traced the origins of the Red Fort car blast module to two Telegram groups linked to radicalisation. Doctors formed a core part of the network, coordinating logistics and explosives across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-blast-al-falah-university-faridabad-doctors-linked-to-terror-module-2818072-2025-11-12",
      "headline": "Red Fort blast trail leads to Al-Falah University, which employed doctors of doomDelhi blast: Since links emerged between the Red Fort blast primary suspect, Dr Umar Nabi, and Al-Falah University, the institution in Faridabad, as well as its recruitment policies, have come under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/live-updates-several-injured-as-car-goes-up-in-flames-near-red-fort-3-vehicles-catch-fire-2816884-2025-11-10",
      "headline": "Live: Benjamin Netanyahu condoles Delhi blast, says Israel stands strong with IndiaRed Fort Blast Live Updates: A massive blast ripped through a Hyundai i20 near Gate No. 1 of Delhi's Red Fort Metro Station around 6:50 pm on Monday, killing ten people and leaving several others critically injured. The explosion occurred as the car halted at a red light, and agencies suspect it to be a planned terror attack, invoking the UAPA in the FIR. Forensic teams have collected 42 exhibits, including car parts and gas cylinder fragments, to determine the nature of explosives used. The NIA has formally taken over the probe as nationwide alerts remain in force. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/red-fort-blast-case-investigation-dr-shaheen-questioning-dr-zafar-hayat-2818086-2025-11-12",
      "headline": "She wanted to go abroad, I wasn't willing: Ex-husband of Jaish-linked Dr ShaheenZafar Hayat, who is also a doctor by profession, said that his marriage to Shaheen ended in 2013 as she wanted to move to Europe, and he wasn't willing to leave India. The couple share two children who live with their father following the divorce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-asim-munir-army-chief-military-coup-fitna-al-khwarij-al-hindustan-afghanistan-india-jihadi-2817215-2025-11-12",
      "headline": "How Asim Munir is taking Pakistan Army to 7th-century ArabiaPakistani Army Chief Asim Munir is staging a silent coup by getting the Constitution amended. Amid consolidation of power, Munir, a Quran-e-Hafiz, is taking the Pakistani military to 7th-century Arabia by using terms like fitna and khawarij from early Islamic history. The indoctrination is such that the Pakistani military is making its battles a jihad for Islam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/drone-footage-amravati-wedding-stabbing-attacker-escape-tracked-2818023-2025-11-12",
      "headline": "Video: Groom stabbed at wedding, cameraman's drone chases attackers for 2 kmA groom was stabbed during his wedding ceremony in Amravati, with the attack caught on drone footage. The drone followed the fleeing attacker for two kilometres, aiding police in their investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-netanyahu-with-benjamin-netanyahu-nyc-visit-can-mamdani-get-him-arrested-fulfil-promise-un-headquarters-icc-2818022-2025-11-12",
      "headline": "Netanyahu invited to New York. Can Mamdani get him arrested, fulfil promise?Israeli Prime Minister Benjamin Netanyahu is set to arrive in in New York on Zohran Mamdani's first day as mayor. The mayor-elect had promised to arrest Netanyahu for \"war crimes\" in Gaza, but can he really get him arrested? The city is bracing for a clash of global politics and local governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-blast-2025-terror-attack-faridabad-module-kashmiri-doctors-arrests-2900kg-anfo-explosives-security-lessons-2818018-2025-11-12",
      "headline": "How Delhi blast broke old pattern, gave new insights | 5 key pointsThe blast near the Red Fort in Delhi broke a pattern and provided key insights into the emerging threats of terrorism. Despite India's security forces managing to restrict terror's footprints, the educated, tech-savvy suspects have revealed that jihadi tentacles can spread far from the hub. Here are five key takeaways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-chanakya-paradox-a-myth-so-useful-we-made-it-history-devdutta-pattanaik-chanakya-myth-2818110-2025-11-12",
      "headline": "The Chanakya paradox: A myth so useful, we made it historyBetween history and legend lies the enigma of Chanakya, a man who may have shaped India's destiny, or never existed at all. But can itihaas and katha not co-exist? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-csk-trade-sanju-samson-rajasthan-royals-2026-2817833-2025-11-12",
      "headline": "Thalapathy's goodbye: What Jadeja's exit would mean for Chennai Super KingsIPL 2026 retention: Ravindra Jadeja has been part of CSK's soul. If the trade to Rajasthan Royals materialises, CSK will lose more than a spin-bowling all-rounder. They will lose a symbol of loyalty and big moments. For CSK, Sanju Samson's arrival would be a promise, and a test of reinvention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-discharged-from-hospital-after-fainting-emphasizes-yoga-and-pranayama-for-health-2818076-2025-11-12",
      "headline": "Govinda discharged from hospital, says yoga works better than heavy workoutsActor Govinda was released from the hospital on Wednesday after fainting at home the previous night. Upon his discharge, Govinda addressed the media and shared his experience, emphasising the benefits of yoga and pranayama over intense workouts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/surinder-koli-confession-forced-torture-supreme-court-nithari-case-detailed-order-organ-trade-police-2818055-2025-11-12",
      "headline": "Surinder Koli's confession to cops forced: Supreme Court on freeing Nithari convictThe police investigation came under sharp scrutiny from the Supreme Court, which observed that circumstantial evidence lacked forensic corroboration and that vital leads, including those concerning the organ trade, were overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/ananya-pandays-bridesmaid-fits-are-a-masterclass-in-wedding-guest-fashion-2817476-2025-11-12",
      "headline": "Ananya Panday's bridesmaid fits are a masterclass in wedding guest fashionAnanya Panday attended a friend's wedding and aced the fashion game with a refreshing mix of comfortably chic pieces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/al-falah-university-distances-from-doctors-arrested-faridabad-terror-module-case-delhi-blast-2818017-2025-11-12",
      "headline": "Al-Falah University breaks silence as doctors' arrest exposes Delhi blast linksClarifying its position, the university said it had \"no connection with the said persons apart from their official duties\" and described the reports linking it to the case as \"baseless and defamatory\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-visa-squid-game-indian-techie-alleges-us-employer-of-caste-bias-forced-labour-green-card-deportation-sirisoft-2818000-2025-11-12",
      "headline": "H-1B is Squid Game: Indian techie accuses US employer of forced labour, caste biasAn Indian techie has sued a US-based company and its Indian-origin CEO, alleging forced labour and wage theft under the H-1B visa programme. He also alleged caste discrimination. The firm, which had earlier promised him a Green Card, threatened it would get him deported, according to a report. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-turns-28-star-kid-who-made-filmmaking-cooler-than-stardom-shah-rukh-khan-2818059-2025-11-12",
      "headline": "Aryan Khan turns 28: Star kid who made filmmaking cooler than stardomWho needs a grand launch when you can drop a bold debut? Shah Rukh Khan's son Aryan, with his grand OTT launch, proved that creativity can be the star, too, when it comes to making an impact. As he turns 28 today, take a look at how Aryan Khan chose to rewrite the rules of a star kid's debut and chart his own creative path."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tata-sierra-comeback-on-november-25-why-it-could-spark-nexon-moment-tata-2818105-2025-11-12",
      "headline": "Why the Tata Sierra could spark a \"Nexon moment\" for the brandTata Motors is set to revive its iconic Sierra SUV on November 25, 2025, blending nostalgic charm with modern technology, design, and versatility. Here's why it could bring the success that the Nexon once did."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/new-red-fort-blast-cctv-captures-i20-blowing-up-on-jam-packed-road-2817939-2025-11-12",
      "headline": "New Red Fort blast CCTV captures i20 blowing up on jam-packed roadFresh CCTV footage, capturing the moment of the explosion, near the Red Fort on November 10 has surfaced. The footage shows an explosion in the car of the suspect, Mohammad Umar,  at the blast site. The control room recordings show a bright flash, described as a red balloon, amid the crowded traffic at Red Fort Chowk. Four-window CCTV coverage captured the blast from multiple angles, documenting the incident in detail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-nithari-killings-victim-family-supreme-court-frees-surinder-koli-2818044-2025-11-12",
      "headline": "Did ghost kill our children? Nithari victim family's long wait ends in heartbreakNineteen years after the Nithari killings shocked the nation, the Supreme Court acquitted Surinder Koli, citing lack of evidence. For the families who lost their children, the verdict has reopened old wounds, leaving them asking—if not him, then who?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/shakuntala-bhagat-first-woman-civil-engineer-india-quadricon-bridge-innovation-2817897-2025-11-12",
      "headline": "India's first woman civil engineer who designed and built bridgesShakuntala Bhagat became India's first woman civil engineer in the 1950s, pioneering modular bridge designs. Her innovations transformed Indian infrastructure and challenged gender stereotypes in engineering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-simple-suni-gatha-vaibhava-film-release-14-november-support-unique-storytelling-2818067-2025-11-12",
      "headline": "Sudeep praises Simple Suni, calls him one of Kannada cinema's best directorsKichcha Sudeep launched the trailer of Simple Suni's 'Gatha Vaibhava' ahead of its November 14 release, praising the director for his craft and attention to detail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithvirajs-ssmb29-poster-drives-viral-helmet-awareness-campaign-of-kerala-police-2818124-2025-11-12",
      "headline": "Prithviraj's SSMB29 poster drives viral helmet awareness campaign of Kerala PoliceAs excitement builds for SS Rajamouli and Mahesh Babu's upcoming film 'SSMB29', Prithviraj Sukumaran's intense first-look poster has gone viral for an unexpected reason as Kerala Police creatively uses it for a road safety campaign.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-confident-shukri-conrad-to-end-test-series-win-india-press-conference-2818125-2025-11-12",
      "headline": "South Africa confident of history of our own in India: Head coach Shukri Conrad IND vs SA, 1st Test: In the press conference before the Kolkata Test, South Africa head coach Shukri Conrad said that the Proteas have a potent spin attack and are more than capable of beating India in their upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/security-beefed-up-for-sri-lankan-cricket-team-amid-terror-threats-mohsin-naqvi-2818092-2025-11-12",
      "headline": "Security beefed up for Sri Lanka team after suicide bombing in Islamabad Pakistan has ramped up security for the visiting Sri Lankan cricket team following recent militant attacks, deploying the army and paramilitary forces for protection. PCB chairman and Interior Minister Mohsin Naqvi personally assured the visitors of fool-proof safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-test-dhruv-jurel-replace-nitish-reddy-eden-gardens-kolkata-2818091-2025-11-12",
      "headline": "IND vs SA: Dhruv Jurel to replace Nitish Reddy in Kolkata Test, Ten Doeschate confirms India assistant coach Ryan ten Doeschate confirmed Dhruv Jurel will play the first Test against South Africa in Kolkata. The wicketkeeper-batter's twin centuries against South Africa A secured his spot, while Nitish Reddy may miss out this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-one-handed-catch-shaheen-afridi-pakistan-sri-lanka-odi-2818066-2025-11-12",
      "headline": "Superman: Shaheen Afridi in awe of Babar Azam's stunning catch vs Sri Lanka PAK vs SL: Shaheen Shah Afridi hailed Babar Azam's stunning one-handed catch in the slips during the first ODI against Sri Lanka, calling it a \"Superman\" effort. However, Babar's struggles with the bat persisted, as he managed just 29 runs and extended his century drought to 83 innings.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raheem-sterling-family-safe-after-attempted-break-in-berkshire-home-chelsea-2818053-2025-11-12",
      "headline": "Chelsea's Raheem Sterling and family safe after attempted home break-in: Report Chelsea forward Raheem Sterling and his family escaped unharmed after masked intruders attempted to break into their Berkshire home. The incident, Sterling's second in recent years, occurred on Saturday evening. Police have launched an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-coaching-delhi-capitals-ipl-2027-2818037-2025-11-12",
      "headline": "Sourav Ganguly as DC head coach from IPL 2027? Ex-India captain gives a subtle hint Sourav Ganguly, who has long served as mentor and Director of Cricket for Delhi Capitals, has hinted at taking up a coaching role with the IPL franchise from the 2027 season. Currently the head coach of Pretoria Capitals, Ganguly remains deeply involved with DC's men's and women's teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-south-africa-hungry-end-15-year-wait-test-win-india-keshav-maharaj-2818032-2025-11-12",
      "headline": "South Africa hungry to end 15-year wait for a Test win in India, says Keshav Maharaj South Africa's Keshav Maharaj acknowledged that while the team has managed success across other parts of the subcontinent, winning a Test in India — something they haven't done in 15 years — remains the ultimate challenge and a goal they are determined to achieve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-josh-hazlewood-cleared-to-play-injury-scare-sean-abbott-ruled-out-2818031-2025-11-12",
      "headline": "Ashes 2025: Josh Hazlewood cleared to play after injury scare, Sean Abbott ruled out Josh Hazlewood has been cleared of injury and is set to play the Ashes opener in Perth, while Sean Abbott has been ruled out with a hamstring strain. With Pat Cummins also sidelined, Scott Boland and Mitchell Starc will lead Australia's pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-dhruv-jurel-rishabh-pant-wicketkeeper-no-competition-2818012-2025-11-12",
      "headline": "Jurel rubbishes Pant competition talk: If we both play, even better Dhruv Jurel has brushed aside rivalry talk with Rishabh Pant, saying that the main focus is on the Indian team winning. Jurel has worked as the understudy for Pant in the Indian Test squad, but is making a case for a regular spot with his recent performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-matheus-cunha-manchester-united-brazil-call-ups-world-cup-2817976-2025-11-12",
      "headline": "Matheus Cunha considers Manchester United resurgence as Brazil call-ups reason Matheus Cunha credits the recent Manchester United resurgence to his Brazil call-ups as the forward hopes to be a regular for the national team ahead of the 2026 World Cup. Cunha has played a big role in United's recent improved performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-vijay-hazare-trophy-virat-kohli-bcci-odi-selection-domestic-cricket-2817954-2025-11-12",
      "headline": "Rohit informs Mumbai of Vijay Hazare availability, no clarity on Kohli: Report Rohit Sharma has reportedly informed the Mumbai Cricket Association that he is ready to play the Vijay Hazare Trophy. However, Virat Kohli's plans remain uncertain at this point in time about being a part of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-south-africa-hungry-end-15-year-wait-test-win-india-keshav-maharaj-2818032-2025-11-12",
      "headline": "South Africa hungry to end 15-year wait for a Test win in India, says Keshav Maharaj South Africa's Keshav Maharaj acknowledged that while the team has managed success across other parts of the subcontinent, winning a Test in India — something they haven't done in 15 years — remains the ultimate challenge and a goal they are determined to achieve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-josh-hazlewood-cleared-to-play-injury-scare-sean-abbott-ruled-out-2818031-2025-11-12",
      "headline": "Ashes 2025: Josh Hazlewood cleared to play after injury scare, Sean Abbott ruled out Josh Hazlewood has been cleared of injury and is set to play the Ashes opener in Perth, while Sean Abbott has been ruled out with a hamstring strain. With Pat Cummins also sidelined, Scott Boland and Mitchell Starc will lead Australia's pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-dhruv-jurel-rishabh-pant-wicketkeeper-no-competition-2818012-2025-11-12",
      "headline": "Jurel rubbishes Pant competition talk: If we both play, even better Dhruv Jurel has brushed aside rivalry talk with Rishabh Pant, saying that the main focus is on the Indian team winning. Jurel has worked as the understudy for Pant in the Indian Test squad, but is making a case for a regular spot with his recent performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-matheus-cunha-manchester-united-brazil-call-ups-world-cup-2817976-2025-11-12",
      "headline": "Matheus Cunha considers Manchester United resurgence as Brazil call-ups reason Matheus Cunha credits the recent Manchester United resurgence to his Brazil call-ups as the forward hopes to be a regular for the national team ahead of the 2026 World Cup. Cunha has played a big role in United's recent improved performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-vijay-hazare-trophy-virat-kohli-bcci-odi-selection-domestic-cricket-2817954-2025-11-12",
      "headline": "Rohit informs Mumbai of Vijay Hazare availability, no clarity on Kohli: Report Rohit Sharma has reportedly informed the Mumbai Cricket Association that he is ready to play the Vijay Hazare Trophy. However, Virat Kohli's plans remain uncertain at this point in time about being a part of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-initiates-disciplinary-proceedings-against-vladimir-kramnik-cheating-allegations-2817941-2025-11-12",
      "headline": "FIDE moves against ex-champion Kramnik over Naroditsky, Navara cheating allegationsThe International Chess Federation has formally initiated proceedings against Vladimir Kramnik, citing concerns about recent public allegations and their impact within the chess community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-retentions-ravindra-jadeja-sanju-samson-trade-chennai-super-kings-rajasthan-royals-stalled-2817931-2025-11-12",
      "headline": "Jadeja-Samson trade stalls as RR hit overseas quota, fund crunch: ReportThe high-profile Ravindra Jadeja–Sanju Samson trade has reportedly stalled, with Rajasthan Royals facing overseas quota and budget constraints. The deal, which could also involve Sam Curran, may only proceed after the IPL retention deadline on November 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-test-kolkata-south-africa-spinners-keshav-maharaj-simon-harmer-senuran-muthusamy-impact-2817919-2025-11-12",
      "headline": "Can South Africa's spinners do a New Zealand to take down India in Kolkata?IND vs SA, 1st Test: South Africa have a strong spin attack, and they would fancy their chances when the series opener starts on November 14 at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-hayden-mumbai-indians-trent-boult-release-ipl-2026-retentions-gujarat-titans-middle-order-2817907-2025-11-12",
      "headline": "IPL 2026 Retentions: Will MI consider releasing Boult? Matthew Hayden respondsMatthew Hayden feels that Mumbai Indians maybe tempted to release Trent Boult and then buy him for a lesser price during the IPL 2026 auction. Boult was key to MI's run to the play-offs last season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-bowling-injury-concerns-hazlewood-abbott-ashes-opener-2817887-2025-11-12",
      "headline": "Hazlewood suffers injury scare in Shield game ahead of Ashes opener: ReportAustralia's Test preparations took a hit after Josh Hazlewood and Sean Abbott left the field and didn't return for Day 3 of the Sheffield Shield clash at the SCG. The nature of the injuries of both players is yet to be determined, with the Australian medical team monitoring their conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/manju-bala-five-year-doping-ban-nada-asian-games-2817876-2025-11-12",
      "headline": "Asian Games medallist Manju Bala gets five-year doping ban, several others suspendedAsian Games medallist Manju Bala has been handed a five-year ban by NADA after testing positive for banned substances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-csk-trade-sanju-samson-rajasthan-royals-2026-2817833-2025-11-12",
      "headline": "Thalapathy's goodbye: What Jadeja's exit would mean for Chennai Super KingsIPL 2026 retention: Ravindra Jadeja has been part of CSK's soul. If the trade to Rajasthan Royals materialises, CSK will lose more than a spin-bowling all-rounder. They will lose a symbol of loyalty and big moments. For CSK, Sanju Samson's arrival would be a promise, and a test of reinvention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-bowling-injury-concerns-hazlewood-abbott-ashes-opener-2817887-2025-11-12",
      "headline": "Hazlewood suffers injury scare in Shield game ahead of Ashes opener: ReportAustralia's Test preparations took a hit after Josh Hazlewood and Sean Abbott left the field and didn't return for Day 3 of the Sheffield Shield clash at the SCG. The nature of the injuries of both players is yet to be determined, with the Australian medical team monitoring their conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/manju-bala-five-year-doping-ban-nada-asian-games-2817876-2025-11-12",
      "headline": "Asian Games medallist Manju Bala gets five-year doping ban, several others suspendedAsian Games medallist Manju Bala has been handed a five-year ban by NADA after testing positive for banned substances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-csk-trade-sanju-samson-rajasthan-royals-2026-2817833-2025-11-12",
      "headline": "Thalapathy's goodbye: What Jadeja's exit would mean for Chennai Super KingsIPL 2026 retention: Ravindra Jadeja has been part of CSK's soul. If the trade to Rajasthan Royals materialises, CSK will lose more than a spin-bowling all-rounder. They will lose a symbol of loyalty and big moments. For CSK, Sanju Samson's arrival would be a promise, and a test of reinvention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-radiofrequency-groin-operation-spain-world-cup-qualifiers-2817839-2025-11-12",
      "headline": "Spain manager shocked by Yamal's surprise surgery and national team withdrawalSpain head coach Luis de la Fuente expressed surprise and dissatisfaction after learning Lamine Yamal underwent treatment without the national federation's awareness. The RFEF criticised the lack of communication, resulting in Yamal's withdrawal from Spain's squad for upcoming World Cup qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-12-team-wtc-odi-super-league-revival-2027-2817829-2025-11-12",
      "headline": "Two-tier Test system unlikely as ICC plans 12-team WTC cycle in 2027: ReportThe proposed two-tier Test system is unlikely to move forward, as the ICC is reportedly planning for all 12 full member teams to participate in the WTC cycle in 2027. The ICC is also thinking about reviving the ODI Super League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-2026-ipl-retentions-releases-auction-targets-2817825-2025-11-12",
      "headline": "IPL 2026 retention prediction: Will KKR undergo major overhaul under Nayar? After a disappointing title defence, KKR will be aiming for a massive overhaul under new coach Abhishek Nayar. Will the three-time champions look to rebuild a new core with Nayar at the helm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-fc-barcelona-really-want-to-go-back-camp-nou-inter-miami-2817778-2025-11-11",
      "headline": "Lionel Messi opens up on abrupt FC Barcelona departure: Really want to go backLionel Messi has once again opened up about his deep-rooted love for FC Barcelona, admitting that he still misses the city and dreams of returning one day to live in Catalonia with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-exclusive-womens-world-cup-life-after-new-era-2817759-2025-11-11",
      "headline": "Deepti Sharma on life after World Cup glory and women's cricket's rise: Feels surrealIndia's Women's World Cup hero Deepti Sharma opened up on how life has seen a sudden fame, which also marks the sport's new era. She shared how public recognition and the title win are reshaping her world and women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/karnataka-nurtures-future-champions-4th-mini-games-concludes-with-over-5000-young-athletes-ytvd-2817757-2025-11-11",
      "headline": "Karnataka Nurtures Future Champions: 4th Mini Games Concludes With Over 5,000 Young Athletes.The 4th Mini Karnataka Games 2025, a week-long event for under-14 athletes, has concluded in Bengaluru. Organized by the Karnataka Olympic Association, the Department of Youth Empowerment and Sports, and the Sports Authority of Karnataka, the games featured over 5,000 participants competing in 27 sports. An official stated, 'Future of our country will be relying on our young children. At this age, if we groom and then if we make them to participate in state level and national level, then they will be our products for next Olympics and Asian Games and Commonwealth Games and international championships.' The state government has also announced cash prizes for national-level medalists and job reservations for sports achievers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-prasad-karnataka-cricket-president-election-anil-kumble-backing-2817722-2025-11-11",
      "headline": "Venkatesh Prasad to run for Karnataka cricket president with Kumble, Srinath backingFormer India fast bowler Venkatesh Prasad announced his bid for the Karnataka State Cricket Association (KSCA) president's post. His panel received strong backing from legends Anil Kumble and Javagal Srinath ahead of the November 30 elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-help-china-embassy-australia-open-playoff-visa-rejected-social-media-appeal-2817719-2025-11-11",
      "headline": "Sumit Nagal seeks Chinese embassy help after visa denied for Australia Open PlayoffIndia's top-ranked tennis player Sumit Nagal has urged Chinese authorities to review his visa rejection ahead of the Australian Open Asia-Pacific Playoff in Chengdu. The denial has cast doubt over his participation in the crucial event."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}