{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lg-electronics-india-rs-15000-crore-ipo-to-open-on-october-7-check-details-2795771-2025-09-30",
      "headline": "LG Electronics India's Rs 15,000 crore IPO to open on October 7. Check detailsThe much-anticipated IPO of LG Electronics India, worth Rs 15,000 crore, is scheduled to open on October 7. Here's everything you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buffet-vs-la-carte-all-you-can-eat-bbq-nation-the-gt-road-profit-business-model-2795755-2025-09-30",
      "headline": "Behind the buffet: How restaurants profit from all-you-can-eat deals'All you can eat.' That is how buffets work. But then how do famous buffets such as BBQ Nation, The GT Road, and Pirates of Grill, with prices ranging from Rs 900-1400, make a profit serving unlimited food?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-and-silver-lead-the-way-as-investors-seek-stability-says-expert-bullion-boom-2795753-2025-09-30",
      "headline": "Gold and silver lead the way as investors seek stability, says expertWith stock market volatility unsettling investors, many are turning to gold and silver for safety. Experts say the renewed interest in precious metals reflects a broader search for stability amid uncertain conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-rbi-mpc-decision-auto-fmcg-psu-banking-shares-2795726-2025-09-30",
      "headline": "Sensex, Nifty fall for 8th day in a row ahead of RBI MPC decisionThe S&P BSE Sensex lost 97.32 points to close at 80,267.62, while the NSE Nifty50 was down by 23.80 points to end at 24,611.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-staying-consistent-matters-more-than-timing-the-market-says-expert-2795674-2025-09-30",
      "headline": "Why staying consistent matters more than timing the market, says expertWhile market swings grab attention, experts insist that consistent investing, rather than trying to predict peaks and dips, is what helps investors achieve reliable growth over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-made-in-india-founder-sridhar-vembu-arattai-free-of-cost-whatsapp-competition-2795665-2025-09-30",
      "headline": "Is Zoho made in India? Founder Sridhar Vembu answersSridhar Vembu, founder and former CEO of Zoho Corporation, has addressed concerns about where Zoho products are developed, where user data is stored, and the pricing of its messaging service, Arattai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-reasons-why-gold-hit-a-record-high-today-should-you-buy-2795630-2025-09-30",
      "headline": "5 reasons why gold hit a record high today. Should you buy?Today, gold touched a historic high, fuelled by global uncertainty and market trends. We break down five key factors behind the rise, and whether it's a smart buy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-layoff-job-cut-staff-fluidity-list-it-shares-free-fall-h1b-visa-decline-orders-report-2795595-2025-09-30",
      "headline": "TCS shares slide as uncertainty grows over job cuts, staff report fluidity listTCS stock has fallen 4.65% in the past five days and 6.72% in the past month. Over the past year, it has lost nearly a third of its value, with reports of large-scale layoffs creating fresh panic among employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-post-office-savings-schemes-like-ppf-and-nsc-witness-a-rate-cut-2795557-2025-09-30",
      "headline": "Will Post Office Savings Schemes like PPF and NSC witness a rate cut?With the Finance Ministry set to review small savings rates at the end of September, many investors are wondering if schemes like PPF and NSC will see a cut. The RBI's recent repo rate reductions have only added to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/where-to-invest-in-psu-bank-nbfcs-analysts-pick-top-stocks-bajaj-pbn-housing-2795541-2025-09-30",
      "headline": "Where to invest in PSU banks and NBFCs? Analysts pick top stocksPSU banks remain one of the most attractive options in the current market. With the Reserve Bank of India (RBI) scheduled to meet soon, market watchers are keeping a close eye on any rate-related decisions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposal-new-rules-gold-silver-loans-easy-borrowing-tighten-credit-checks-2795519-2025-09-30",
      "headline": "New RBI proposals to make borrowing easier, tighten credit checksAnnounced through seven directions and circulars on September 29, 2025, three of these changes will take effect from October 1, while four others have been released for public consultation until October 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-250-points-nifty-above-24500-bel-gains-1-percent-2795491-2025-09-30",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; BEL gains 1%The S&P BSE Sensex was up 299.85 points to 80,664.79, while the NSE Nifty50 added 71 points to 24,705.90 as of 9:24 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-what-expect-from-dhanush-kriti-sanon-film-2795788-2025-09-30",
      "headline": "Tere Ishk Mein: What to expect from Dhanush and Kriti Sanon's film Filmmaker Aanand L Rai and Dhanush reunite for the romantic drama 'Tere Ishk Mein'. The teaser hints at a passionate love story with soulful music and new character dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-karimi-hospitalised-my-last-heartbeat-turned-out-to-be-exhaustion-2795782-2025-09-30",
      "headline": "Actor Mandana Karimi hospitalised: My last heartbeat turned out to be exhaustion Actor Mandana Karimi was hospitalised after fearing she had felt her last heartbeat. Extensive tests later confirmed her condition was caused by extreme exhaustion, dehydration, and stress rather than a heart problem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/avika-gor-marries-long-time-boyfriend-milind-chandwani-on-pati-patni-aur-panga-2795792-2025-09-30",
      "headline": "Avika Gor marries long-time boyfriend Milind Chandwani on Pati, Patni Aur Panga Actor Avika Gor and her long-time boyfriend Milind Chandwani are now married. Their wedding took place on the sets of 'Pati Patni Aur Panga.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-fees-payment-news-2795770-2025-09-30",
      "headline": "Kantara Chapter 1: Here's what Rishab Shetty charged for the film Ahead of 'Kantara Chapter 1', the details of actor-director Rishab Shetty's paycheque are out. The film is made on a budget of Rs 125 crore and is set to release in cinemas on October 2, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-or-kriti-sanon-thamma-writer-niren-bhatt-hints-at-werewolf-cameo-2795751-2025-09-30",
      "headline": "Varun Dhawan or Kriti Sanon? Thamma writer Niren Bhatt hints at werewolf cameo Writer Niren Bhatt teased a surprise regarding the identity of the werewolf in the upcoming horror-comedy 'Thamma'. The Maddock Horror Comedy Universe nears a major character crossover by introducing a larger, more powerful werewolf and unresolved questions for viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-clickbait-headlines-negativity-stepping-back-film-industry-2795769-2025-09-30",
      "headline": "Anurag Kashyap: Was feeling isolated, my peers didn't want to be seen with me Anurag Kashyap opens up about his frustration with clickbait culture and negativity in the film industry. He reveals how this disillusionment has led him to step away from cinema and focus on what he truly loves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/param-punjab-that-girl-whos-changing-the-game-with-raw-musical-talent-2795716-2025-09-30",
      "headline": "Param: Punjab's 'That Girl' who's changing the game with raw musical talent Paramjeet Kaur, a 19-year-old from Punjab, is making waves as the first authentic female rapper in Punjabi hip-hop. Her viral debut track challenges industry norms and inspires many across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/single-salma-trailer-huma-qureshi-stuck-in-quirky-love-triangle-with-shreyas-talpade-sunny-singh-2795757-2025-09-30",
      "headline": "Single Salma trailer: Huma stuck in quirky love triangle with Shreyas, Sunny Singh The trailer of Huma Qureshi's upcoming film 'Single Salma' is finally out. The movie also stars Shreyas Talpade and Sunny Singh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-parties-with-seventeen-mingyu-for-cxm-unit-debut-2795636-2025-09-30",
      "headline": "BTS' Jungkook parties with SEVENTEEN's Mingyu for CXM unit debut BTS' Jungkook attended SEVENTEEN Mingyu and S Coups' listening party for CXM's debut mini-album. Multiple K-pop stars, including members of the '97-liners' group, gathered to support the new unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/chainsaw-man-the-movie-reze-arc-review-a-tongue-biting-actioner-with-quirky-romance-2795679-2025-09-30",
      "headline": "Chainsaw Man Reze Arc review: A 'tongue-biting' actioner with quirky romanceRelease Date:Tue Sep 30, 2025 'Chainsaw Man The Movie Reze Arc' is a Japanese anime film based on the manga series of the same name by Tatsuki Fujimoto. The film follows Denji, aka Chainsaw Man, who develops a liking for two girls, Makima and Reze, before one of them goes \"boom.\" Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-reviews-pawan-kalyan-they-call-him-og-at-par-with-hollywood-2795683-2025-09-30",
      "headline": "Chiranjeevi reviews Pawan Kalyan's They Call Him OG: On par with Hollywood Actor Pawan Kalyan's film 'They Call Him OG' released to strong box office response. His elder brother Chiranjeevi praised its Hollywood-level quality, highlighting the film's emotional depth and team effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-kissing-scene-trimmed-anti-alcohol-disclaimer-added-2795680-2025-09-30",
      "headline": "Sunny Sanskari: Kissing scene trimmed, anti-alcohol disclaimer added 'Sunny Sanskari Ki Tusli Kumari' has been granted UA certification by the censor board. The makers have been asked to add an anti-alcohol disclaimer along with a kissing scene reduced by 60 per cent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers clarify The poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol emerging from inside the dome of the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiva temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-rekha-viral-moment-star-studded-party-wins-internet-video-2795614-2025-09-30",
      "headline": "Orry and Rekha's viral moment at star-studded party wins over Internet. Watch Influencer Orry shared a video on Monday from producer Boney Kapoor's party. However, it was his interaction with veteran actor Rekha that is now going viral. The video has garnered more than a million views on Instagram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-good-bad-ugly-to-og-are-fanboy-films-the-new-formula-or-a-scary-trend-2795577-2025-09-30",
      "headline": "Vikram, Good Bad Ugly to OG: Are fanboy films the new formula or a scary trend? Indian cinema is witnessing a shift where fans influence film narratives, creating star-centric spectacles.  While these films thrill fanbases, concerns grow over storytelling being sidelined for mass appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahakali-akshaye-khanna-first-look-as-shukracharya-revealed-during-durga-puja-2795628-2025-09-30",
      "headline": "Mahakali: Akshaye Khanna's first look as Shukracharya revealed during Durga Puja Actor Akshaye Khanna's striking look as Shukracharya in 'Mahakali' was unveiled on Durga Puja. This marks a monumental chapter in the Prasanth Varma Cinematic Universe with Khanna's Telugu debut in a never-seen-before role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-resumes-patriot-filming-october-health-break-2795642-2025-09-30",
      "headline": "Mammootty resumes Patriot filming in October after 8-month health-related hiatus Malayalam superstar Mammootty will return to shoot after an eight-month-long break for health treatment. Director Mahesh Narayanan confirmed the actor's involvement during absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-sweet-moment-with-queer-fan-goes-viral-2795644-2025-09-30",
      "headline": "Got married because of you: Aishwarya Rai's sweet moment with queer fan goes viral Aishwarya Rai Bachchan shared a heartwarming moment with queer influencer Aditya Madiraju at Paris Fashion Week, who shared he got married because of her. The actor was touched by the story and gifted him a lipstick, praising his talent and sending blessings to his family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zurich-summit-sees-debut-of-ai-actor-tilly-norwood-dubbed-next-scarlett-johannson-2795593-2025-09-30",
      "headline": "Zurich Summit sees debut of AI actor Tilly Norwood, dubbed 'next Scarlett' AI actor Tilly Norwood debuts at the Zurich Summit, sparking interest from talent agencies. Creator Eline Van der Velden highlights the advantages of AI talent and industry attitudes."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/truth-will-emerge-soon-actor-politician-vijay-in-first-video-message-amid-blame-game-over-karur-stampede-2795717-2025-09-30",
      "headline": "Vijay blames Stalin for stampede in video message: Get me if you want revengeActor-politician Vijay, addressing the Karur stampede fallout, defended his supporters and called out authorities. He insisted he prioritised public safety, rejected any wrongdoing, and vowed that truth behind the incident will soon be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-final-voter-list-to-be-out-today-poll-schedule-likely-by-oct-6-7-2795485-2025-09-30",
      "headline": "Final Bihar voter list released after controversial Special Intensive RevisionThe Election Commission deleted 68 lakh names and added 21 lakh new voters, bringing Bihar's final roll to 7.4 crore after the conclusion of the controversial Special Intensive Revision process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/explosion-at-frontier-corps-headquarters-in-eastern-quetta-in-pakistan-5-killed-at-least-15-injured-2795653-2025-09-30",
      "headline": "10 killed in car bombing, firing outside Frontier Corps HQ in Pak's QuettaAt least 10 people died and several were injured in a blast near Quetta FC headquarters. Initial reports suggest the blast was of high intensity, but the exact nature of the explosion has not yet been determined. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-polls-bjp-nda-efforts-shahabad-kushwaha-and-rajput-communities-2795784-2025-09-30",
      "headline": "BJP's Operation Shahabad: How party plans to regain lost Bihar bastionShahabad — comprising Bhojpur, Buxar, Rohtas, and Kaimur — was once an NDA stronghold but has turned into its weakest link. With just weeks left for the Bihar polls, the BJP-led alliance has stepped up efforts to ensure victory in the key region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-the-taj-story-no-shiv-temple-claim-taj-mahal-controversy-2795672-2025-09-30",
      "headline": "Paresh Rawal's Taj Story poster sparks backlash, makers clarifyThe poster for Paresh Rawal's film 'The Taj Story' drew criticism for depicting a Shiva idol emerging from inside the dome of the Taj Mahal. Following backlash, filmmakers stated the film makes no religious claims and does not assert a Shiva temple exists in the monument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Ranaweera triple-strike rocks IndiaWomen's Cricket World Cup Live Updates: After a fairly slow start, Pratika Rawal and Harleen Deol have begun to pick up the pace as they started going after the bowlers. They will look to pick up the scoring rate after their sluggish start following the dismissal of Smriti Mandhana."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arattai-app-sridhar-vembu-tamil-nadu-entrepreneurs-learn-hindi-business-dealings-zoho-founder-language-debate-2795318-2025-09-30",
      "headline": "Simple app, difficult name? Arattai revives language debateEarlier this year, Zoho's Sridhar Vembu urged Tamils to learn Hindi for business, sparking outrage in the south. Months later, his app Arattai, named in Tamil, has sparked a debate over its \"hard to pronounce\" name for Hindi speakers. The name of the app, whose downloads are soaring, has also revived the language debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/whats-behind-the-sudden-spell-of-heavy-rain-in-delhi-ncr-imd-explains-2795677-2025-09-30",
      "headline": "What's behind the sudden spell of heavy rain in Delhi-NCR?Heavy rains and festive rush combined to create a double blow for Delhiites, as they struggled through traffic jams on their way to their destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buffet-vs-la-carte-all-you-can-eat-bbq-nation-the-gt-road-profit-business-model-2795755-2025-09-30",
      "headline": "Behind the buffet: How restaurants profit from all-you-can-eat deals'All you can eat.' That is how buffets work. But then how do famous buffets such as BBQ Nation, The GT Road, and Pirates of Grill, with prices ranging from Rs 900-1400, make a profit serving unlimited food?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-companies-eye-india-for-offshore-operations-amid-h-ib-visa-fee-surge-tech-companies-trump-global-capability-centres-2795678-2025-09-30",
      "headline": "US companies eye India for offshore operations amid H-1B fee surgeUS companies are eyeing India's 1,700 global capability centres (GCCs) for offshore operations as President Donald Trump's $100,000 H-1B visa fee disrupts talent strategies. India, hosting over half the world's GCCs, is evolving into a hub for high-value tasks like AI and drug discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation TilakSpeaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ghee-health-risks-saturated-fats-heart-disease-experts-caution-moderation-2795734-2025-09-30",
      "headline": "Ghee is tasty but not a superfood: What you should knowGhee, a revered Indian product, is back in the debate over claims of being a \"superfood\". While it does have health benefits, its high content of saturated fats and lack of enough omega-3 fatty acids still make it a suboptimal option for regular daily consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/aatish-taseer-on-losing-oci-status-overseas-citizenship-indian-immigrant-exile-fragile-idea-home-a-return-to-self-2795634-2025-09-30",
      "headline": "Aatish Taseer on losing OCI status, exile and the fragile idea of homeIn his latest book, A Return to Self, writer Aatish Taseer turns the loss of his Overseas Citizenship of India (OCI) status into a journey of self-exploration, using travel as a mirror to probe identity, belonging, and exile. Blending memoir, history, and sensory observation, he examines the delicate space between estrangement and intimacy, and freedom and constraint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-p-chidambaram-mumbai-terror-attack-international-pressure-condoleeza-rice-bjp-reactions-2795429-2025-09-30",
      "headline": "US stopped us: Chidambaram's big 26/11 admission, BJP says too little, too lateAt the time of the attacks in 2008, the Congress veteran leader was the Union Home Minister. He revealed that the then US Secretary of State Condoleeza Rice had visited India to meet him and the Prime Minister, asking them not to react to the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-tilak-varma-profile-india-vs-pakistan-asia-cup-final-2795723-2025-09-30",
      "headline": "Wired for greatness: How Tilak Varma, an electrician's son, became Asia Cup hero22-year-old Tilak Varma turned out to be the hero for India in the Asia Cup Final. From modest beginnings to cricketing greatness, here is the story of a youngster who was never supposed to play cricket in the first place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-pan-indian-film-2025-1000-crore-2795245-2025-09-30",
      "headline": "Kantara Chapter 1: The last Rs 1,000 crore hope for Indian cinema in 2025With the success of its predecessor and a bold prequel set in the Kadamba era, Rishab Shetty's 'Kantara Chapter 1' is the most anticipated Rs 1,000 crore contender of 2025 in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/delhi-traffic-advisory-ahead-of-pm-modis-cr-park-visit-today-routes-to-avoid-2795756-2025-09-30",
      "headline": "Delhi traffic advisory amid buzz that PM may visit CR Park pandal todayDelhi Traffic Police has issued an advisory amid reports that PM Modi is likely to visit a CR Park puja pandal today. Commuters have been advised to take alternate routes and avoid restricted areas to ensure smooth traffic flow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-claims-yuzvendra-chahal-cheated-on-her-two-months-into-marriage-2795481-2025-09-30",
      "headline": "Dhanashree Verma claims Yuzvendra Chahal cheated on her two months into marriageDhanashree Verma has opened up about her troubled marriage with cricketer Yuzvendra Chahal, claiming infidelity just two months after their wedding. The couple divorced after three years, with Dhanashree focusing on personal well-being amidst public speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-nobel-peace-prize-gaza-peace-plan-middle-east-israel-qatar-arab-nations-2795600-2025-09-30",
      "headline": "Finally, Trump has a real shot at the Nobel Peace PrizeUS President Donald Trump's ambitious Gaza peace plan, backed by Israel, Qatar, and other Arab nations, has reignited speculation about his Nobel Peace Prize chances. If implemented, the deal could reshape Middle East diplomacy and secure Trump the award he had aggressively lobbied for. If not this year, then next, Trump now looks to have a real shot at the Peace Nobel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-festivals-decide-who-you-should-fall-in-love-with-2795200-2025-09-30",
      "headline": "Love in India now comes with a festival testWould you date someone who doesn't share your excitement for pandal hopping or garba nights? Festivals can reveal a lot about your partner, but should they really decide your love story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/meet-pavan-davuluri-the-new-windows-chief-leading-microsofts-big-ai-powered-comeback-2795685-2025-09-30",
      "headline": "Meet Pavan Davuluri, the new Windows chief leading Microsoft's big AI-powered comebackIn a major reorganisation move, Microsoft has reunited its Windows engineering teams under Pavan Davuluri, the newly promoted President of Windows and Devices. Davuluri is now in-charge of driving Microsoft's AI-powered vision for Windows.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/this-could-be-the-first-animal-that-appeared-on-earth-before-dinosaurs-2795765-2025-09-30",
      "headline": "First animal that appeared on Earth, long before dinosaurs, discoveredOcean-dwelling, soft-bodied sponges existed well before the Cambrian explosion of complex life about 541 million years ago."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-youtuber-felix-gerald-held-for-spreading-fake-news-on-tvk-vijay-rally-karur-stampede-2795468-2025-09-30",
      "headline": "YouTuber Felix Gerald arrested for allegedly spreading fake news on Karur stampedeTamil Nadu YouTuber Felix Gerald, who runs the RedPix channel, was arrested by Cyber Crime Police for allegedly uploading fake news linked to the deadly stampede at Karur during TVK chief Vijay's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-what-expect-from-dhanush-kriti-sanon-film-2795788-2025-09-30",
      "headline": "Tere Ishk Mein: What to expect from Dhanush and Kriti Sanon's filmFilmmaker Aanand L Rai and Dhanush reunite for the romantic drama 'Tere Ishk Mein'. The teaser hints at a passionate love story with soulful music and new character dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandana-karimi-hospitalised-my-last-heartbeat-turned-out-to-be-exhaustion-2795782-2025-09-30",
      "headline": "Actor Mandana Karimi hospitalised: My last heartbeat turned out to be exhaustionActor Mandana Karimi was hospitalised after fearing she had felt her last heartbeat. Extensive tests later confirmed her condition was caused by extreme exhaustion, dehydration, and stress rather than a heart problem. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wins-japan-open-2025-beating-taylor-fritz-2795779-2025-09-30",
      "headline": "Carlos Alcaraz continues winning spree, thumps Taylor Fritz to win Japan Open World No. 1 Carlos Alcaraz defeated Taylor Fritz to win the Japan Open final. The victory marked his eighth title of the year despite a foot injury scare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-tilak-varma-profile-india-vs-pakistan-asia-cup-final-2795723-2025-09-30",
      "headline": "Wired for greatness: How Tilak Varma, an electrician's son, became Asia Cup hero 22-year-old Tilak Varma turned out to be the hero for India in the Asia Cup Final. From modest beginnings to cricketing greatness, here is the story of a youngster who was never supposed to play cricket in the first place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepesh-devendran-five-wicket-haul-india-youth-test-australia-2795743-2025-09-30",
      "headline": "Five-star Devendran: India U-19's young gun rattles Australia in Youth Test Deepesh Devendran's brilliant bowling helped India gain the upper hand in the Youth Test against Australia. His five-wicket haul set the tone for a strong Indian performance with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-joins-sharjah-warriorz-ilt20-batting-finisher-season-4-2795747-2025-09-30",
      "headline": "Dinesh Karthik set for ILT20 debut, joins Sharjah Warriorz for fourth season Former India wicketkeeper Dinesh Karthik will make his ILT20 debut with Sharjah Warriorz. Karthik replaces Sri Lanka's Kusal Mendis in the JP Duminy-coached Sharjah side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-cheeky-retirement-message-chris-woakes-england-career-2795737-2025-09-30",
      "headline": "Pant's cheeky retirement wish for Woakes: Definitely left a mark on me Rishabh Pant sent a cheeky message to Chris Woakes after the England pacer announced his retirement from all formats of the game on September 29. Woakes played a total of 217 international games for England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-gautam-gambhir-kuldeep-yadav-ahmedabad-2795706-2025-09-30",
      "headline": "No rest for Gambhir: Coach arrives early in Ahmedabad for India vs West Indies Test India vs West Indies: No rest for coach Gautam Gambhir. Two days after the Asia Cup final, the head coach was in Ahmedabad. Spinner Kuldeep Yadav also travelled with the coach. The first Test of the two-match series will get underway on Thursday, October 2 at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/tilak-varma-echoes-suryakumar-india-vs-pakistan-rivalry-no-longer-worth-the-hype-2795687-2025-09-30",
      "headline": "Tilak Varma echoes Suryakumar: India vs Pakistan rivalry no longer worth the hype Asia Cup 2025: Tilak Varma addressed the press upon his arrival in Hyderabad on Tuesday. From playing down the buzzword Operation Tilak to echoing Suryakumar Yadav's hot take on the India vs Pakistan rivalry, the young batter fielded a variety of questions. Tilak hit a match-winning 69 in the final against Pakistan in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation Tilak Speaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Ranaweera triple-strike rocks India Women's Cricket World Cup Live Updates: After a fairly slow start, Pratika Rawal and Harleen Deol have begun to pick up the pace as they started going after the bowlers. They will look to pick up the scoring rate after their sluggish start following the dismissal of Smriti Mandhana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-livestream-pitch-report-2795570-2025-09-30",
      "headline": "Women's World Cup: IND vs SL livestreaming details, pitch and weather report The 2025 ICC Women's ODI World Cup kicks off on September 30, with India facing Sri Lanka in Guwahati. Here's everything you need to know about the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/tilak-varma-echoes-suryakumar-india-vs-pakistan-rivalry-no-longer-worth-the-hype-2795687-2025-09-30",
      "headline": "Tilak Varma echoes Suryakumar: India vs Pakistan rivalry no longer worth the hype Asia Cup 2025: Tilak Varma addressed the press upon his arrival in Hyderabad on Tuesday. From playing down the buzzword Operation Tilak to echoing Suryakumar Yadav's hot take on the India vs Pakistan rivalry, the young batter fielded a variety of questions. Tilak hit a match-winning 69 in the final against Pakistan in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-vs-pakistan-asia-cup-final-operation-tilak-press-conference-2795673-2025-09-30",
      "headline": "Tilak Varma refuses to call India's Asia Cup win over Pakistan Operation Tilak Speaking to the press in Hyderabad on Tuesday, Tilak Varma said he was thrilled to have made the country proud with his match-winning knock against Pakistan in the Asia Cup final. The 22-year-old struck an unbeaten 69 to guide India to a successful chase of 147 in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-2025-opening-ceremony-india-vs-sri-lanka-live-score-2795664-2025-09-30",
      "headline": "IND vs SL Live: Ranaweera triple-strike rocks India Women's Cricket World Cup Live Updates: After a fairly slow start, Pratika Rawal and Harleen Deol have begun to pick up the pace as they started going after the bowlers. They will look to pick up the scoring rate after their sluggish start following the dismissal of Smriti Mandhana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-livestream-pitch-report-2795570-2025-09-30",
      "headline": "Women's World Cup: IND vs SL livestreaming details, pitch and weather report The 2025 ICC Women's ODI World Cup kicks off on September 30, with India facing Sri Lanka in Guwahati. Here's everything you need to know about the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/royal-challengers-bengaluru-sale-ipl-title-2024-diageo-valuation-2795612-2025-09-30",
      "headline": "RCB for sale? Lalit Modi fuels speculation, predicts record valuationLalit Modi's social media post, along with ongoing reports, suggests that Royal Challengers Bengaluru, fresh from their maiden IPL title, may soon change ownership, as Diageo explores a sale that could establish new valuation benchmarks for the league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-saim-ayub-asia-cup-test-squad-vs-south-africa-2795613-2025-09-30",
      "headline": "Pakistan punish Saim Ayub, all rounder loses place in Test squadPakistan have pusnished Saim Ayub for his horrid run in the Asia Cup. The young all-rounder has been left out of the team's Test squad vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-west-indies-ian-bishop-captian-rohit-paudel-presentation-ceremony-2795561-2025-09-30",
      "headline": "Watch: West Indies great inspires Nepal captain with touching words after T20I upsetFormer West Indies pacer Ian Bishop came up with a heartwarming gesture after Nepal's historic T20I win, pausing during the presentation to praise captain Rohit Paudel.  Nepal outclassed West Indies by 90 runs on Monday in Sharjah to win a T20I series against the former world champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-withdraw-2795547-2025-09-30",
      "headline": "Mohun Bagan withdraw from ACL 2 as foreign players refuse to travel to IranIndian football giant Mohun Bagan has withdrawn from the AFC Champions League 2 after six foreign players refused to travel to Iran due to safety concerns. The club has approached the Court of Arbitration for Sport seeking a fair resolution amid potential sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home?Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as prosAsia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo lingerIn Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-syed-kirmani-politics-cricket-2795482-2025-09-30",
      "headline": "I am ashamed: World Cup winner slams politics mixing with cricket at Asia CupSyed Kirmani has criticised the mixing of politics and sport during the Asia Cup, warning that the current era lacks the camaraderie and gentlemanly spirit of earlier times. The 1983 World Cup winner urged players to focus on cricket and play the game with sporting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-2025-world-cup-maiden-title-challenge-harmanpreet-kaur-2794717-2025-09-30",
      "headline": "Can Harmanpreet Kaur's Team India script history at home?Women's World Cup 2025 Preview: Harmanpreet Kaur faces a challenging task as India begin their quest for a maiden ICC title against Sri Lanka on September 30 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-collapse-asia-cup-final-india-captaincy-controversy-2795294-2025-09-30",
      "headline": "Mischievous schoolboys can't win Asia Cup: Pakistan focus on theatrics, fail as prosAsia Cup 2025: Pakistan's campaign was a disaster on every level and the team prioritised antics over cricket. Until they abandon theatrics and focus on basics, Pakistan will keep humiliating themselves despite early promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistn-tilak-varma-shivam-dube-ms-dhoni-yuvraj-2795486-2025-09-30",
      "headline": "In Tilak Varma-Shivam Dube's epic stand, shades of MS Dhoni-Yuvraj Singh duo lingerIn Dubai's City of Gold, Tilak Varma and Shivam Dube shone under pressure, forging a partnership that echoed Dhoni and Yuvraj. Their calm yet explosive stand carried India past Pakistan to Asia Cup glory, thus establishing their legacy within Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-syed-kirmani-politics-cricket-2795482-2025-09-30",
      "headline": "I am ashamed: World Cup winner slams politics mixing with cricket at Asia CupSyed Kirmani has criticised the mixing of politics and sport during the Asia Cup, warning that the current era lacks the camaraderie and gentlemanly spirit of earlier times. The 1983 World Cup winner urged players to focus on cricket and play the game with sporting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-freak-inury-australia-vs-new-zealand-2795478-2025-09-30",
      "headline": "Maxwell suffers freak injury in nets, likely to miss India T20Is with broken armAustralia all-rounder Glenn Maxwell has been ruled out of the New Zealand T20Is due to a freak injury in the nets. He is likely to be ruled out of the 5-match T20I series against India as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-sri-lanka-match-preview-2795443-2025-09-30",
      "headline": "IND vs SL: Harmanpreet Kaur's India eyes winning start to home Women's World CupIndia vs Sri Lanka, Women's World Cup: With home support and strong form on their side, the Indian women's cricket team will look to begin their ODI World Cup campaign on a winning note when they face Sri Lanka in the opener in Guwahati on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-india-vs-sri-lanka-opening-match-guwahati-curtain-raiser-2795136-2025-09-30",
      "headline": "After 12 years, India set for Women's World Cup return in cricket's grand festivalThe 2025 ICC Women's World Cup is set to take place from September 30 to November 2, with matches being hosted across India and Colombo. Australia, the defending champions, have claimed the title seven times, while India will be aiming to secure their first-ever ICC Women's World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-suryakumar-yadav-hardik-receive-warm-welcome-in-mumbai-after-title-win-2795405-2025-09-29",
      "headline": "Asia Cup: Suryakumar Yadav, Hardik receive warm welcome in Mumbai after title winTeam India's finest, skipper Suryakumar Yadav and star all-rounder Hardik Pandya received a rousing response as they returned to the Mumbai airport following their triumph at the Asia Cup, downing Pakistan to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-t20i-series-win-west-indies-largest-margin-associate-team-2795402-2025-09-29",
      "headline": "2nd T20I: Nepal secure historic series win vs West Indies with 90-run victoryNepal achieved a historic milestone on Monday (September 29), securing their first-ever T20I series win over a full-member nation by dominating former world champions West Indies in the second match in Sharjah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-rousing-welcome-hyderabad-asia-cup-heroics-2795395-2025-09-29",
      "headline": "Watch: Tilak Varma receives rousing welcome in Hyderabad after Asia Cup heroicsIndia's Asia Cup 2025 final hero, Tilak Varma, received a rapturous welcome from fans as he returned to Hyderabad on Monday. The 21-year-old southpaw, who scored an unbeaten 69 to seal victory against Pakistan, was greeted with thunderous cheers at Shamshabad Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-in-india-watershed-moment-cricket-sachin-tendulkar-2795389-2025-09-29",
      "headline": "Women's World Cup in India watershed moment for the game: Sachin TendulkarSachin Tendulkar believes the ICC Women's World Cup in India marks a pivotal moment for women's cricket, calling on the nation to embrace it as a catalyst for fresh aspirations and equal recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-praises-india-asia-cup-win-team-character-final-2795376-2025-09-29",
      "headline": "Gutted to miss final but Indian team showed character: Hardik on Asia Cup winHardik Pandya was understandably \"gutted\" to have missed the Asia Cup final against Pakistan due to a niggle, but he found comfort in the team's title triumph, saying such tight chases will stand the side in good stead for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-harmanpreet-kaur-india-under-no-pressure-title-drought-2795368-2025-09-29",
      "headline": "India are under no pressure: Harmanpreet confident of winning Women's World CupIndia women's cricket captain Harmanpreet Kaur expresses strong confidence ahead of their first ODI World Cup match at home. The team aims to leverage recent successes and fan support to make history in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/rinku-hooda-sundar-singh-gurjar-gold-silver-mens-javelin-f46-world-para-athletics-2795361-2025-09-29",
      "headline": "World Para Athletics Championships: Javelin star Rinku Hooda bags India's 2nd goldRinku Hooda and Sundar Singh Gurjar produced a historic one-two finish in the men's javelin throw F46 at the World Para Athletics Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-india-beat-pakistan-tilak-varma-shivam-dube-conversation-2795348-2025-09-29",
      "headline": "Pakistan players were saying lot of things, I wanted my bat to respond: Tilak VarmaPakistan players had \"a lot to say\" to Tilak Varma as he walked out to bat in the Asia Cup final, spurring the young Indian batter to play one of the most defining innings of his career so far in the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-amir-emotional-after-pakistan-asia-cup-final-loss-india-2795346-2025-09-29",
      "headline": "Watch: Mohammad Amir nearly brought to tears after Pakistan's Asia Cup final lossMohammad Amir was nearly brought to tears after Pakistan lost the Asia Cup final to India. His reflections highlight Pakistan's batting failures and praise India's Tilak Varma's composure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}