{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-imposes-import-curbs-on-plain-silver-jewellery-till-march-2026-2792832-2025-09-24",
      "headline": "Government imposes import curbs on plain silver jewellery till March 2026The restrictions have been introduced in the wake of an import of plain silver jewellery from under preferential duty exemptions rising steeply during April-June 2024-25 to April-June 2025-26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/investors-cautious-of-it-stocks-h-1b-visa-changes-psu-consumption-banking-gold-vs-equities-2792662-2025-09-24",
      "headline": "Should investors be cautious of IT stocks amid H-1B visa changes?With ongoing changes in visa fees and policies, analysts say the outlook for the sector has turned uncertain in the short run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/npci-rs-500-crore-profit-half-of-world-digital-payment-upi-transactions-2792595-2025-09-24",
      "headline": "How NPCI powers half the world's digital payments on just Rs 500 croreNational Payments Corporation of India handles 46% of the world's digital transactions. UPI alone processes 3,729 transactions per second. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-rs-1866-crore-productivity-bonus-for-railway-staff-2792634-2025-09-24",
      "headline": "Cabinet clears Rs 1,866 crore productivity bonus for railway staffRailway employees are in for festive cheer as the Union Cabinet has approved a productivity-linked bonus, benefiting lakhs of staff members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-have-two-credit-cards-here-is-what-you-need-to-know-2792617-2025-09-24",
      "headline": "Should you have two credit cards? Here's what you need to knowCredit card usage is on the rise in India, and many people are wondering if having a second card makes sense. From rewards to financial flexibility, here's what you should know before applying for another card."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-386-points-lower-nifty-below-25100-tata-motors-bel-among-top-losers-2792602-2025-09-24",
      "headline": "Sensex, Nifty end lower as profit booking continues; Tata Motors falls over 2%The S&P BSE Sensex fell 386.47 points to 81,715.63, while the NSE Nifty50 lost 112.60 points to close at 25,056.90. Broader market indices also ended lower, with sectoral breadth largely negative, except for pharma stocks, which managed modest gains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cashless-health-insurance-claim-rejection-key-reasons-explained-2792600-2025-09-24",
      "headline": "Why your cashless insurance claim isn't always 'cashless'Cashless claims promise convenience, but long delays, unclear policies, and unjust deductions often leave patients stressed. Understanding your rights and navigating the system proactively can prevent financial and medical headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-scss-ssy-are-small-saving-scheme-interest-rates-set-to-change-sukanya-samriddhi-yojana-public-provident-fund-2792534-2025-09-24",
      "headline": "PPF, SCSS, SSY: Are Small Saving Scheme interest rates set to change?As the September 30 announcement approaches, savers are wondering if interest rates on popular small saving schemes like PPF, SCSS, and Sukanya Samriddhi Yojana (SSY) will change. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-buy-gold-the-right-way-this-festive-season-2792466-2025-09-24",
      "headline": "How to buy gold the right way this festive seasonGold shopping is a festive tradition for many Indian families, but with rising prices and endless options, making the right choice can feel tricky. Here's how you can buy gold the right way this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-us-h1b-visa-fee-hike-trump-tariff-remittance-money-send-india-2792464-2025-09-24",
      "headline": "H-1B crackdown cracks the rupee. Know why INR hit an all-time lowEconomists estimate that remittances, the money Indians abroad send back, could drop by around $400 million. For a country that relies on foreign money flowing in, that's significant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-around-the-corner-union-cabinet-likely-to-approve-bonus-for-railways-employees-government-sources-2792463-2025-09-24",
      "headline": "Union Cabinet likely to clear bonus for railway staff soon: Government sourcesThe bonus, usually extended to non-gazetted railway employees, is meant to recognise their contribution to the efficiency and performance of one of India's most crucial transport networks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-2025-deadlines-rules-and-penalties-you-must-know-2792436-2025-09-24",
      "headline": "Income tax audit 2025: Deadlines, rules and penalties you must knowThe clock is ticking for taxpayers who fall under the audit bracket. With the income tax audit deadline for FY 2024–25 just around the corner, here's a quick look at key dates, rules, and penalties."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/pawan-kalyan-they-call-him-og-review-gangster-drama-sujeeth-thaman-2792870-2025-09-25",
      "headline": "They Call Him OG review: Pawan Kalyan lifts predictable film with unmatched auraRelease Date:Thu Sep 25, 2025 They Call Him OG movie review: Director Sujeeth's 'They Call Him OG' is a fan-service to Power Star Pawan Kalyan. The gangster drama, with a Japanese connection, has redundant ideas but is lifted by rousing elevation sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-aamir-khan-too-much-with-kajol-twinkle-khanna-divorce-fatherhood-expectations-2792719-2025-09-24",
      "headline": "Salman on fatherhood, Aamir on divorce: How superstars made Two Much too much Excited for 'Two Much with Kajol and Twinkle' premiere? From embracing fatherhood to bonding after divorce, here's a glimpse into the candid revelations made by superstars Aamir and Salman Khan on the talk show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-last-film-roi-roi-binale-musical-love-story-fans-will-love-it-says-wife-garima-saikia-garg-2792759-2025-09-24",
      "headline": "Zubeen Garg's last film is a musical love story and fans will love it, says wife Late singer Zubeen Garg's wife, Garima, shared her resolve to complete his last film 'Roi Roi Binale'. Despite the sadness of his death, she is dedicated to honouring his legacy and fulfilling his unfinished work for his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/shah-rukh-khans-national-award-for-jawan-three-decades-too-late-2792721-2025-09-24",
      "headline": "Shah Rukh Khan's National Award for Jawan: Three decades too late? Shah Rukh Khan wins his first National Award in 2025 for 'Jawan'. More than a single performance, the honour marks a long-overdue recognition of SRK's three-decade legacy, iconic films, and unmatched cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-reacts-to-anurag-kashyap-vikramaditya-motwanes-ai-criticism-2792722-2025-09-24",
      "headline": "Sunny Leone reacts to Anurag Kashyap, Vikramaditya Motwane's AI criticism Actor Sunny Leone recently addressed the concerns around the use of artificial intelligence (AI) in cinema. She also highlighted the relevance of AI-driven cinema in the entertainment industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-anurag-kashyap-follow-saiyaara-playbook-for-nishaanchi-leads-aaishvary-thackeray-2792709-2025-09-24",
      "headline": "Exclusive: Did Anurag Kashyap follow Saiyaara playbook for Nishaanchi leads? In an exclusive chat with India Today, filmmaker-actor Anurag Kashyap revealed why he kept newcomers away from interviews ahead of 'Nishaanchi's' release. He praised Aaishvary Thackeray's impressive debut while brushing aside nepotism concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-anniversary-post-paris-2792604-2025-09-24",
      "headline": "Parineeti Chopra's playful anniversary wish for Raghav Chadha has a Paris twist Actor Parineeti Chopra wished her politician husband, Raghav Chadha, on their second wedding anniversary with a dash of humour. The reference to Paris in their social media post was unmissable. Check it out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-manoj-kumar-sharma-is-family-stood-by-me-at-national-film-awards-2792663-2025-09-24",
      "headline": "Vikrant Massey: Manoj Kumar Sharma is family, stood by me at National Awards Vikrant Massey's Best Actor win for '12th Fail' at the 71st National Film Awards was a heartfelt celebration shared with the real-life IPS officer, Manoj Kumar Sharma, who inspired the film. The actor, while rooted in portraying the common man, told us that he is eager to explore diverse roles and entertain audiences in new ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/urmila-jevliya-wins-rs-kbc-17-strategic-play-amitabh-bachchan-cricket-joke-indi-pakistan-2792517-2025-09-24",
      "headline": "KBC 17: Amitabh Bachchan jokes about Pakistanis smashing TVs after losing to India In the latest episode of 'Kaun Banega Crorepati 17', host Amitabh Bachchan entertained all with a joke about Pakistani fans after a cricket match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-enjoy-london-outing-with-son-akaay-viral-pics-2792633-2025-09-24",
      "headline": "Anushka Sharma, Virat Kohli enjoy London outing with son Akaay. See viral pics Anushka Sharma and Virat Kohli, who have been staying in London lately, were clicked enjoying strolling on the streets. The couple was accompanied by their son, Akaay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-one-piece-season-2-loguetown-grand-line-new-adventures-2026-2792383-2025-09-24",
      "headline": "One Piece Season 2: First look at Loguetown out crew sets sail for Grand Line Netflix teases new locations for 'One Piece' Season 2, beginning with Loguetown. Official synopsis highlights peril and discovery in the Grand Line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/honoured-to-share-national-award-with-shah-rukh-khan-hes-a-legend-actor-vikrant-massey-to-india-today-2792621-2025-09-24",
      "headline": "Vikrant Massey on National Award win: To be mentioned in same breath as SRK... Vikrant Massey celebrated his first National Award for '12th Fail', calling it a \"dream\" to share the honour with Shah Rukh Khan, who also won his first for 'Jawan'. The actor recalled a heartfelt moment with SRK and Rani Mukerji as they cherished their medals together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-ai-film-kaur-vs-kore-first-indian-ai-powered-feature-film-2792597-2025-09-24",
      "headline": "Exclusive: Sunny Leone sets trend with AI-driven feature film 'Kaur vs KORE' Sunny Leone is set to star in 'Kaur vs KORE', a pioneering AI-powered film. The movie blends futuristic technology with human emotions and highlights digital safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/main-hoon-nas-amrita-rao-recalls-shah-rukh-khans-advice-on-choosing-films-2792458-2025-09-24",
      "headline": "Main Hoon Na's Amrita Rao recalls Shah Rukh Khan's advice on choosing films Actor Amrita Rao shared valuable career advice she received from Shah Rukh Khan. She said on a recent podcast that the actor's philosophy guided her selective approach to signing films. What was his advice? Read on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-akaza-anime-backstories-2792169-2025-09-24",
      "headline": "How humanised backstories of demons made Demon Slayer a global hit Demon Slayer: Infinity Castle Part 1 – Akaza Returns' has become a global blockbuster, and one key reason is that it demonstrates not only the Demon Slayers' strength but also how demons reflect human vices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-restored-version-premiere-in-sydney-with-original-ending-as-centrepiece-2792545-2025-09-24",
      "headline": "Sholay restored version to premiere in Sydney with original ending as centrepiece The newly restored version of 'Sholay' will be screened as centrepiece at The Indian Film Festival of Sydney. The restoration includes the original ending and involved archival discoveries in London and Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-was-sad-after-saiyaara-fever-wiped-out-tanvi-the-great-2792495-2025-09-24",
      "headline": "Anupam Kher says he was sad after Saiyaara fever wiped out Tanvi: The Great Actor Anupam Kher recently opened up on being heartbroken over his directorial 'Tanvi: The Great' being sidelined by 'Saiyaara'. He revealed how he had to borrow money from friends after the financier backed out of the film at the last moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/sai-pallavi-trolled-for-wearing-swimsuit-because-saree-girl-cant-be-a-beach-babe-2792544-2025-09-24",
      "headline": "Sai Pallavi trolled for wearing swimsuit, because saree girl can't be a beach babe Sai Pallavi was trolled for wearing a swimsuit on the beach, with fans unable to see beyond her saree-clad image. The outrage exposes society's hypocrisy, patriarchy, and the fragile idea of culture that refuses women the freedom to just be human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samyuktha-hedge-claims-baseer-ali-is-not-a-good-boyfriend-amid-bigg-boss-19-link-ups-2792515-2025-09-24",
      "headline": "Samyuktha Hedge claims Baseer is not a good boyfriend amid Bigg Boss 19 link-ups Actor Samyuktha Hegde called her rumoured boyfriend Baseer Ali a bad boyfriend. The Bigg Boss 19 contestant has recently been linked to Nehal Chudasama and Farrhana Bhatt on 'Bigg Boss 19'. However, that doesn't stop Samyuktha from supporting him in the reality show."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/leh-protests-ladakh-statehood-sixth-schedule-bjp-office-torched-reason-gen-z-delay-statehood-explained-2792643-2025-09-24",
      "headline": "What sparked Gen Z protests in Ladakh? Explained in 5 pointsThe agitation for Ladakh's statehood and inclusion in the Sixth Schedule in the capital Leh turned violent on Wednesday. Four people were killed and over 60 injured. This came even as protesters torched a BJP office and a CRPF van. Activist Sonam Wangchuk has called the protests a \"Gen Z revolution\". The BJP has slammed the Congress for the chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonam-wangchuk-ladakh-statehood-protest-violence-bjp-u-turns-joblessness-youth-frustration-2792833-2025-09-24",
      "headline": "Activist Sonam Wangchuk says BJP U-turns, job crisis fuelled Ladakh violenceCalling it one of the \"saddest days\" of his life, activist Sonam Wangchuk said the violent turn in Ladakh's protests reflected years of pent-up anger among local youth over jobs, autonomy and broken promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pmo-push-puts-long-pending-drdo-revamp-back-on-track-2792652-2025-09-24",
      "headline": "PMO push puts long-pending DRDO revamp back on trackThe restructuring of DRDO into a leaner and strategically agile institution is being led by a senior PMO official. Deadline: the 68th Foundation Day on January 1, 2026\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-match-report-abhishek-sharma-bumrah-2792844-2025-09-24",
      "headline": "Sluggish India still too strong for Bangladesh in Super 4, storm into finalIndia might not have been at their best, but still proved too strong for Bangladesh in the Super 4 for Asia Cup 2025. The result forced Bangladesh into a virtual knockout against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/protests-demanding-statehood-for-ladakh-turn-violent-bjp-office-vehicle-torched-2792622-2025-09-24",
      "headline": "4 dead, 60 injured as Ladakh's statehood protests turn violent, curfew imposedThe call for a shutdown came after two of 15 people on a hunger strike, led by climate activist Sonam Wangchuk, since September 10 were shifted to a hospital due to deteriorating health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-blames-activist-sonam-wangchuk-for-ladakh-violence-says-his-provocative-speeches-incited-mob-2792816-2025-09-24",
      "headline": "Sonam Wangchuk's provocative statements led to Ladakh violence: GovernmentAt least four people were killed and more than 60 others were injured as protests held in Leh by demonstrators demanding statehood for Ladakh turned violent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-snubs-joe-biden-with-autopen-photo-on-new-presidential-walk-of-fame-glbs-2792868-2025-09-25",
      "headline": "Trump snubs Biden with autopen photo on new Presidential Walk of FameThe White House unveiled a \"Presidential Walk of Fame,\" featuring portraits of presidents — but Joe Biden is represented by an autopen photo, sparking debate over his use of the device."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tejashwi-yadav-jabs-deputy-chief-ministers-nitish-kumar-government-crime-corruption-bihar-polls-2792755-2025-09-24",
      "headline": "Criminals became Vijay, Samrat: Tejashwi Yadav jabs Bihar deputy chief ministersIn an interview with India Today TV, RJD leader Tejashwi Yadav alleged that crime has increased under Nitish Kumar-led government in the state and took a sharp jibe at Bihar Deputy Chief Ministers Samrat Chaudhary and Vijay Kumar Sinha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/retreating-lion-dancing-dragon-rogue-hyena-the-chaotic-geopolitical-jungle-of-2025-2792142-2025-09-24",
      "headline": "Chaotic geopolitical jungle of 2025: Retreating Lion, Dancing Dragon, Reckless Bear, Rogue HyenaThe global geopolitical landscape in 2025 is a volatile multipolar arena marked by America's retreat, China's rise, and shifting alliances. India faces both challenges and opportunities in this unpredictable world order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/h1b-visa-wage-based-lottery-system-overhaul-key-changes-job-location-explained-2792695-2025-09-24",
      "headline": "How your wage, job site will play a role in Trump's new H-1B selection processThe Trump administration has proposed a major overhaul of the H-1B visa selection process, causing confusion and concern, especially among Indian techies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mohsin-naqvi-fighter-jet-2792836-2025-09-24",
      "headline": "After Haris Rauf, PCB chief uses Ronaldo video to signal jet-downing gesturePakistan Cricket Board chief Mohsin Naqvi took to X to mock India just days after the India vs Pakistan clash in Asia Cup. Naqvi shared a video of Cristiano Ronaldo which insinuated the controversial fighter-jet gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/honoured-to-share-national-award-with-shah-rukh-khan-hes-a-legend-actor-vikrant-massey-to-india-today-2792621-2025-09-24",
      "headline": "Vikrant Massey on National Award win: To be mentioned in same breath as SRK...Vikrant Massey celebrated his first National Award for '12th Fail', calling it a \"dream\" to share the honour with Shah Rukh Khan, who also won his first for 'Jawan'. The actor recalled a heartfelt moment with SRK and Rani Mukerji as they cherished their medals together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-extends-general-anil-chauhans-tenure-as-chief-of-defence-staff-till-2026-2792795-2025-09-24",
      "headline": "Centre extends General Anil Chauhan's tenure as Chief of Defence Staff till 2026General Anil Chauhan's tenure as Chief of Defence Staff (CDS) has been extended till May 30, 2026, with the Appointments Committee of the Cabinet approving his continuation as Secretary, Department of Military Affairs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/trump-goes-after-h-1b-visa-indian-diaspora-ceos-make-an-unpleasant-statement-by-saying-nothing-2792718-2025-09-24",
      "headline": "Trump goes after H-1B visa, here is what Indian diaspora CEOs are sayingA lot of people have said many things about US President Donald Trump targeting H-1B visas. But one group, the group of Indian tech CEOs, is silent and their silence is now catching the attention of Indians on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-ashram-swami-chaitanyananda-saraswati-trail-of-abuse-threats-to-fail-obscene-messages-deleted-chats-2792586-2025-09-24",
      "headline": "Come to my room: Delhi godman's indecent messages to women he 'molested'Swami Chaitanyananda Saraswati reportedly summoned girls to his room late at night, threatened to reduce their marks or fail them if they did not comply, and lured some with promises of foreign trips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/shah-rukh-khans-national-award-for-jawan-three-decades-too-late-2792721-2025-09-24",
      "headline": "Shah Rukh Khan's National Award for Jawan: Three decades too late?Shah Rukh Khan wins his first National Award in 2025 for 'Jawan'. More than a single performance, the honour marks a long-overdue recognition of SRK's three-decade legacy, iconic films, and unmatched cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/gunman-opens-fire-at-dallas-ice-office-killing-and-wounding-several-before-taking-own-life-2792726-2025-09-24",
      "headline": "2 dead in Dallas immigration office shooting, sniper wrote 'anti-ICE' on bulletFBI Director Kash Patel said an initial review of evidence suggests the attack at the Dallas Immigration and Customs Enforcement (ICE) office was ideologically motivated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-h1b-fee-cause-66k-yearly-drop-in-immigrant-work-authorisations-jpmorgan-chase-co-economists-abdelwahed-indian-techies-2792609-2025-09-24",
      "headline": "New H-1B fee could end 1.4 lakh jobs a year in US, says expertThe Trump administration's new $100,000 fee on H-1B visa applications could reduce immigrant work authorisations by over 66,000 annually, according to JPMorgan economists. Another expert warned the fee hike could dismantle the H-1B system, potentially eliminating up to 140,000 skilled jobs annually. Indian workers, who make up 71% of H-1B recipients, are likely to be hit the hardest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kashmir-man-who-provided-logistical-support-to-pahalgam-terrorists-arrested-2792704-2025-09-24",
      "headline": "Kashmir man who provided logistical support to Pahalgam terrorists arrestedPolice have arrested Mohammad Yousuf Kataria, a 26-year-old resident of Kulgam, for providing logistical support to the terrorists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangkok-sinkhole-swallows-cars-power-poles-near-hospital-caught-on-cctv-2792467-2025-09-24",
      "headline": "Viral video: Massive sinkhole opens near Bangkok hospital, swallows cars, power polesThe incident, which took place in the Thai capital's Samsen Road area, has been linked to the construction of a nearby railway station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-mohanlal-is-the-unfading-star-of-malayalam-cinema-2792667-2025-09-24",
      "headline": "Why Mohanlal is the unfading star of Malayalam cinemaWhile the Dadasaheb Phalke Award rightly crowns Mohanlal's 47-year-long career, his box-office blockbusters of 2025 suggest 'Picture abhi baaki hai'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-loses-10kg-ahead-odi-return-australia-2792772-2025-09-24",
      "headline": "Rohit Sharma sheds 10kg: Abhishek Nayar reveals stunning ODI comeback lookAhead of his return to international cricket, Rohit Sharma has been working hard on his fitness. Training under former India assistant coach Abhishek Nayar, the 38-year-old has shed around 10 kilograms through intensive sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/stop-russias-war-now-or-face-most-destructive-arms-race-in-history-zelenskyy-in-un-glbs-2792770-2025-09-24",
      "headline": "Stop Russia's war or face most destructive arms race in history: Zelenskyy in UNZelenskyy accused Russian President Vladimir Putin of seeking to push the war beyond Ukraine's borders. He pointed to alleged violations of Nato airspace by Russian drones and jets as evidence of Moscow's wider ambitions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-mohanlal-sanjay-manjrekar-interview-2792860-2025-09-25",
      "headline": "Watch: Sanju Samson turns to Mohanlal analogy to answer tough batting question Asia Cup 2025: Sanju Samson drew inspiration from Malayalam superstar Mohanlal to explain the importance of versatility in India's ever-competitive set-up. Speaking during the Asia Cup, Samson cleverly used the actor's ability to play varied roles as an analogy for adapting to batting order changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-sunil-gavaskar-india-batting-order-experiments-suryakumar-shot-selection-2792858-2025-09-25",
      "headline": "IND vs BAN: Sunil Gavaskar questions India's batting order experiments Legendary Indian batter Sunil Gavaskar, speaking to India Today from Dubai, questioned the team management's decision to send Shivam Dube ahead of captain Suryakumar Yadav in the Super 4 clash against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-match-report-abhishek-sharma-bumrah-2792844-2025-09-24",
      "headline": "Sluggish India still too strong for Bangladesh in Super 4, storm into final India might not have been at their best, but still proved too strong for Bangladesh in the Super 4 for Asia Cup 2025. The result forced Bangladesh into a virtual knockout against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mohsin-naqvi-fighter-jet-2792836-2025-09-24",
      "headline": "After Haris Rauf, PCB chief uses Ronaldo video to signal jet-downing gesture Pakistan Cricket Board chief Mohsin Naqvi took to X to mock India just days after the India vs Pakistan clash in Asia Cup. Naqvi shared a video of Cristiano Ronaldo which insinuated the controversial fighter-jet gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-second-successive-fifty-asia-cup-india-bangladesh-super-4-2792820-2025-09-24",
      "headline": "Abhishek Sharma smashes 37-ball 75, goes past mentor Yuvraj Singh in elite list Super 4: Abhishek Sharma smashed his second consecutive fifty in the Asia Cup against Bangladesh. He scored a fifty in 25 balls or fewer for the fifth time in his nascent career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/after-gill-abhishek-yuvraj-singh-trains-prabhsimran-singh-priyansh-arya-2792793-2025-09-24",
      "headline": "After Gill-Abhishek's success, Yuvraj trains Prabhsimran Singh, Priyansh Arya Legendary India all-rounder Yuvraj Singh was spotted training Punjab Kings batters Priyansh Arya and Prabhsimran Singh. Yuvraj earlier trained Shubman Gill and Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-taking-time-with-tactical-tweaks-to-tackle-carlos-alcaraz-2792779-2025-09-24",
      "headline": "Jannik Sinner taking time with tactical tweaks to tackle Carlos Alcaraz World number two Jannik Sinner said he is making small adjustments to his game following his defeat to Carlos Alcaraz in the U.S. Open final earlier this month, adding that he is confident it is only a matter of time before these changes translate into match play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-loses-10kg-ahead-odi-return-australia-2792772-2025-09-24",
      "headline": "Rohit Sharma sheds 10kg: Abhishek Nayar reveals stunning ODI comeback look Ahead of his return to international cricket, Rohit Sharma has been working hard on his fitness. Training under former India assistant coach Abhishek Nayar, the 38-year-old has shed around 10 kilograms through intensive sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-venue-change-foreign-player-visa-issues-2792764-2025-09-24",
      "headline": "Mohun Bagan seek venue change for ACL match in Iran, citing player safety Mohun Bagan Super Giant, reigning Indian Super League champions, have formally requested the Asian Football Confederation to move their September 30 AFC Champions League 2 clash against Sepahan SC out of Iran, citing safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-second-string-team-asia-cup-super-4-clash-india-litton-das-injury-2792746-2025-09-24",
      "headline": "Asia Cup: Why are Bangladesh playing second-string team vs India? Bangladesh field a second string team against India after Litton Das injury. The team makes four changes aiming to challenge India in a crucial Super 4 Asia Cup match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-taking-time-with-tactical-tweaks-to-tackle-carlos-alcaraz-2792779-2025-09-24",
      "headline": "Jannik Sinner taking time with tactical tweaks to tackle Carlos Alcaraz World number two Jannik Sinner said he is making small adjustments to his game following his defeat to Carlos Alcaraz in the U.S. Open final earlier this month, adding that he is confident it is only a matter of time before these changes translate into match play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-loses-10kg-ahead-odi-return-australia-2792772-2025-09-24",
      "headline": "Rohit Sharma sheds 10kg: Abhishek Nayar reveals stunning ODI comeback look Ahead of his return to international cricket, Rohit Sharma has been working hard on his fitness. Training under former India assistant coach Abhishek Nayar, the 38-year-old has shed around 10 kilograms through intensive sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-venue-change-foreign-player-visa-issues-2792764-2025-09-24",
      "headline": "Mohun Bagan seek venue change for ACL match in Iran, citing player safety Mohun Bagan Super Giant, reigning Indian Super League champions, have formally requested the Asian Football Confederation to move their September 30 AFC Champions League 2 clash against Sepahan SC out of Iran, citing safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-second-string-team-asia-cup-super-4-clash-india-litton-das-injury-2792746-2025-09-24",
      "headline": "Asia Cup: Why are Bangladesh playing second-string team vs India? Bangladesh field a second string team against India after Litton Das injury. The team makes four changes aiming to challenge India in a crucial Super 4 Asia Cup match."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}