{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-crash-sensex-nifty-decline-reason-why-bse-nse-top-losers-it-stocks-2755394-2025-07-14",
      "headline": "Sensex down 400 points: Why is stock market falling todayAs of 11:50 am, the S&P BSE Sensex was down by 388.85 points to 82,111.62, while the NSE Nifty50 lost 110.85 points to 25,039.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/only-67-percent-filed-itrs-coinswitch-co-founder-ashish-singhal-on-why-indians-delay-tax-filing-2755368-2025-07-14",
      "headline": "Only 6.7% filed ITRs: CoinSwitch co-founder on why Indians delay tax filingIndia has made big progress in digital tax filing over the years. There are new portals, better forms and more ways to pay taxes online. Yet, millions still wait till the last few days to get their documents in order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rise-5-percent-q1-results-store-close-profit-sales-number-2755365-2025-07-14",
      "headline": "Explained: Why Ola Electric shares gained 5% todayOla Electric share price: The stock touched an intraday high of Rs 43.60 before trading 5.45% higher at Rs 41.99 around 11:11 am, shortly after the electric two-wheeler maker announced its financial results for the first quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-usd-120000-why-reasons-us-policy-latest-price-crypto-ether-2755326-2025-07-14",
      "headline": "Bitcoin zooms past $120,000 to reach all-time high. Here's whyThe world's largest cryptocurrency was last seen trading at $120,700.54, up 1.32%, as investor confidence remained strong ahead of important regulatory discussions in the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-95-points-lower-nifty-below-25200-hcltech-up-1-percent-hul-down-2755305-2025-07-14",
      "headline": "Sensex, Nifty start week in red as IT stocks drag markets lower againThe S&P BSE Sensex lost 266.34 points to 82,234.13, while the NSE Nifty50 was down by 67.95 points to 25,081.90 as of 9:22 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-market-debut-listing-today-latest-gmp-listing-gains-2755300-2025-07-14",
      "headline": "Travel Food Services to make market debut today; here's the latest GMPTravel Food Services listing: The grey market premium (GMP), which had dropped sharply in the past week, has seen a slight rise ahead of the listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-sebi-ban-over-deposit-rs-48435-crore-return-stock-market-trading-report-2755288-2025-07-14",
      "headline": "Jane Street deposits Rs 4,843.5 crore, set to return to Dalal Street: ReportIn its interim order, Sebi had accused Jane Street of using manipulative strategies in Indian stock markets. The regulator directed the firm to deposit alleged unlawful gains in an escrow account with a scheduled commercial bank in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-claiming-your-pf-money-seems-so-difficult-provident-fund-epfo-problems-in-pf-withdrawal-2755045-2025-07-13",
      "headline": "Why claiming your PF money seems so difficultIt all starts with tiny mistakes. A spelling error in your name, a mismatch in your date of birth, or an old bank account number can be enough to freeze your claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-500-percent-tariff-donald-trump-russia-sanction-act-2025-2754768-2025-07-12",
      "headline": "Will India be hit with a 500% tariff? Here's what we knowIndia remains one of the few countries still in talks with the US at a time when the Trump administration is preparing to enforce steep new tariffs on imports from several nations starting August 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-drops-coming-soon-teaser-on-new-x-account-ahead-of-india-launch-2754573-2025-07-11",
      "headline": "Tesla drops 'coming soon' teaser on new X account ahead of India launchTesla is set to open its first Indian showroom in Mumbai's Bandra Kurla Complex on July 15. The Tesla India X account shared a \"coming soon\" post on Friday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-likely-to-begin-first-deliveries-in-india-from-august-report-2754454-2025-07-11",
      "headline": "Elon Musk's Tesla likely to begin first deliveries in India from August: ReportThis move comes at a key moment for Tesla. The carmaker has seen sales dip in other countries and is now turning to India, the world's third-largest car market, to reach new buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-nithin-kamath-hits-back-at-dark-patterns-used-by-financial-apps-2754421-2025-07-11",
      "headline": "Zerodha's Nithin Kamath hits back at 'dark patterns' used by financial appsNithin Kamath says these tricks are designed to push people into taking actions that are not in their best interest, just so companies can make more money. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-lollapalooza-berlin-kim-taehyung-v-jimin-2755381-2025-07-14",
      "headline": "Lollapalooza Berlin: J-hope owns the stage and delivers as BTS was watchingBTS member J-Hope rocked the stage in Berlin at the Lollapalooza festival. Meanwhile, his fellow band members tuned in live on Weverse to show their support. Find out which members joined the online concert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rajeev-khandelwal-recalls-quitting-kahiin-to-hoga-fight-with-ektaa-kapoor-2755335-2025-07-14",
      "headline": "Rajeev Khandelwal recalls quitting Kahiin Toh Hoga, choosing quality over moneyActor Rajeev Khandelwal recently opened up on the perception around him after he quit Ektaa Kapoor's 'Kahiin To Hoga' (2003-2005). He mentioned the negative articles written about him at that time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/legendary-south-actor-b-saroja-devi-dies-at-87-2755349-2025-07-14",
      "headline": "Legendary South actor B Saroja Devi dies at 87B Saroja Devi, one of South Indian cinema's most iconic and beloved female actors, died at 87. Known for her memorable roles across Tamil, Telugu, and Kannada films, she was a towering figure in Indian cinema for over six decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/superman-box-office-collection-day-3-detailed-report-james-gunn-film-flies-high-crushes-1st-weekend-numbers-2755328-2025-07-14",
      "headline": "Superman box office day 3: James Gunn's film flies high, crushes 1st weekend numbers'Superman' rocked a fabulous first weekend at the Indian box office. The James Gunn-directorial has impressed the Indian audience, and is looking at recording a good first week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-carries-labubus-to-wimbledon-2025-2755317-2025-07-14",
      "headline": "Urvashi Rautela carries labubus to Wimbledon, internet can't stop laughingUrvashi Rautela's photos from Wimbledon 2025 went viral after she carried four Labubu dolls to the match while wearing a white gown. Fans on social media shared funny comments and memes about her unique look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-collection-day-10-detailed-report-anurag-basu-monsoon-romantic-drama-wins-all-over-2755313-2025-07-14",
      "headline": "Metro In Dino box office Day 10: Anurag Basu's monsoon romantic drama wins all overMetro... In Dino remained steady during weekdays, and performed decently well during its second weekend at the box office. The film has also surpassed the new Bollywood releases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-pushes-fan-trying-for-selfie-at-kota-srinivasa-rao-funeral-viral-video-2755299-2025-07-14",
      "headline": "SS Rajamouli pushes fan trying for selfie at Kota Srinivasa Rao's funeral. VideoA video of SS Rajamouli pushing away a fan trying to click a selfie during veteran actor Kota Srinivasa Rao's funeral in Hyderabad has gone viral. The farewell was also attended by several Tollywood actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasan-tr-weight-loss-transformation-loses-10-kgs-in-10-days-for-vetri-maaran-upcoming-film-2755185-2025-07-13",
      "headline": "Actor Silambarasan sheds 10 kg in 10 days for Vetri Maaran's upcoming filmSilambarasan TR, known as STR, has undergone significant weight loss for his role in Vetri Maaran's new film. He reportedly lost around 10 kilograms in 10 days to play a youthful version in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-addresses-hindi-marathi-debate-says-never-faced-any-problem-2755175-2025-07-13",
      "headline": "R Madhavan addresses Hindi-Marathi debate, says never faced any problemActor R Madhavan shared his views on the Hindi-Marathi language row. He shared his personal experience and said he never faced any problems because of language. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/stuntman-raju-dies-performing-car-stunt-kollywood-film-pa-ranjith-arya-actor-visual-expresses-sorrow-2755153-2025-07-13",
      "headline": "Stuntman dies during shoot of Pa Ranjith-Arya film, actor Vishal pays tributeStuntman Raju died while performing a car stunt on the sets of an upcoming Kollywood film. The film features actor Arya and is being directed by Pa Ranjith. Actor Vishal paid tribute to Raju on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-met-riteish-deshmukh-asked-if-i-was-working-genelia-deshmukh-on-how-she-was-cast-in-sitaare-zameen-par-2755141-2025-07-13",
      "headline": "Aamir met Riteish, asked if I was working: Genelia on how she was cast in SitaareActor Genelia Deshmukh discussed how she was cast for 'Sitaare Zameen Par'. She said it was actor Aamir Khan who met her husband Riteish Deshmukh and enquired whether she was working. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-accuses-anu-malik-of-ruining-father-daboo-maliks-career-2755139-2025-07-13",
      "headline": "Singer Amaal Mallik accuses Anu Malik of ruining father Daboo Malik's careerAmaal Mallik has accused his uncle Anu Malik of professional sabotage that led to his father Daboo Malik's depression, revealing deep family and industry tensions. Despite the rivalry, Amaal seeks to establish his own identity in music while distancing himself from Anu's controversial past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-stuns-in-intense-punjab-95-poster-as-jaswant-singh-khalra-2755136-2025-07-13",
      "headline": "Diljit Dosanjh stuns in intense Punjab 95 poster as Jaswant Singh KhalraDiljit Dosanjh's latest poster for 'Punjab 95' powerfully captures the intense narrative of slain human rights activist Jaswant Singh Khalra. He shared the poster on social media on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-hesitant-to-work-in-malayalam-films-says-wont-be-able-to-do-justice-2755116-2025-07-13",
      "headline": "Shilpa Shetty hesitant to work in Malayalam films, says won't be able to do justiceActor Shilpa Shetty shared that she has been offered a few movies in Malayalam but never felt sure if she could do justice to her role. She also shared her admiration for actor Mohanlal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruquis-son-hospitalised-wife-mehzabeen-shares-update-in-touching-pos-2755103-2025-07-13",
      "headline": "Munawar Faruqui's son hospitalised, wife Mehzabeen shares update in touching postComedian Munawar Faruqui is facing a personal challenge as his son Mikael battles a viral infection. His partner, Mehzabeen Coatwala, shared the update on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aayush-sharma-reflects-on-back-surgeries-says-ignored-body-signs-2755101-2025-07-13",
      "headline": "Aayush Sharma reflects on back surgeries, says ignored body's signsActor Aayush Sharma recently reflected on his back surgeries. In an interview, he noted that a six-pack body doesn't necessarily mean a fit body. He also stated that his time at the hospital helped him bond with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/superman-box-office-day-2-james-gunn-film-soars-past-f1-jurassic-world-in-india-2755097-2025-07-13",
      "headline": "Superman box office Day 2: James Gunn film soars past F1, Jurassic World in IndiaJames Gunn's 'Superman' starring David Corenswet has made a strong debut at the Indian box office, earning Rs 9.25 crore on its second day and leading over recent Hollywood and Bollywood releases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-jackie-shroff-tu-meri-main-tera-main-tera-tu-meri-ananya-panday-new-film-release-update-2755066-2025-07-13",
      "headline": "Jackie Shroff joins Kartik Aaryan's Tu Meri Main Tera, fans say OG with Gen Z heroActors Kartik Aaryan and Jackie Shroff are all set to team up for the upcoming film 'Tu Meri Main Tera Main Tera Tu Meri'. The announcement video sparked excitement amongst fans on social media. In the film, Aaryan is paired opposite actor Ananya Panday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kota-srinivasa-rao-dies-chiranjeevi-pawan-kalyan-attend-funeral-pay-tribute-2755077-2025-07-13",
      "headline": "Kota Srinivasa Rao dies: Chiranjeevi, Pawan Kalyan attend funeral, pay tributeProminent Tollywood stars gathered to pay their respects to late Telugu icon Kota Srinivasa Rao on Sunday. He died at 83, leaving behind a rich legacy in Indian cinema with over 750 films across multiple languages. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-fuel-control-module-replaced-twice-before-crash-2755337-2025-07-14",
      "headline": "Air India replaced crashed plane's fuel switch module twice; Boeing says it's safeAir India replaced the critical throttle control module, which includes the fuel control switches, twice on the Boeing 787 before it crashed. The investigation continues into what caused the fuel cutoff switches to activate during takeoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-sco-meet-india-china-relation-han-zheng-foreign-ministers-meeting-beijing-2755334-2025-07-14",
      "headline": "S Jaishankar attends SCO meet in China, calls for open dialogue to sustain tiesAt the SCO meet in Beijing, External Affairs Minister S Jaishankar met Chinese Vice President Han Zheng, stressing open dialogue and voicing hope that recent gains in India-China ties will continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/puducherry/story/26-year-old-model-san-rachel-2021-miss-puducherry-dies-by-suicide-2755364-2025-07-14",
      "headline": "Former Miss Puducherry who spoke against colourism dies by suicideModel and pageant winner San Rechal Gandhi, who challenged colourism and advocated for women's safety, passed away in Puducherry after a reported overdose of sleeping pills. She had represented India in several international modelling events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rare-earth-mineral-metal-critical-reserves-strategy-china-crisis-ev-manufacturing-explained-2754928-2025-07-14",
      "headline": "Is China's rare-earth weaponisation giving India a rare chance?China, the biggest holder of rare earths, is weaponising them by restricting the supply. Though it has hit the EV industry in India, will the country, which possesses the third-biggest reserve of rare earths, be able to use this as a rare opportunity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/schrodingers-aadhaar-in-bihar-it-is-everything-and-nothing-at-the-same-time-2755327-2025-07-14",
      "headline": "Schrodinger's Aadhaar in Bihar, it is everything and nothing at the same timeThe Election Commission exercise on voter rolls in Bihar again brings up the old question: What is Aadhaar? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-to-undock-today-ex-isro-scientist-explains-ax-4s-return-journey-2755353-2025-07-14",
      "headline": "Shux to undock today: Ex-Isro scientist breaks down his return journeyDuring their time on the ISS, the crew carried out over 60 experiments, including seven from the Indian Space Research Organisation (Isro) on microalgae, muscle loss, and plant growth in space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-to-give-ukraine-patriot-missiles-putin-talks-nice-then-bombs-russia-sanctions-2755302-2025-07-14",
      "headline": "Trump to give Ukraine Patriot missiles, says Putin 'talks nice, then bombs'Trump fumed at Putin for saying he wanted peace and then stepping up his attacks on Ukraine. Amid growing disenchantment with the Russian leader, the US President said he would send Patriot air defence missiles to Kyiv."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suspended-trinamool-student-leader-rajanya-haldar-says-her-nude-deepfakes-shared-within-party-2755341-2025-07-14",
      "headline": "Nude deepfakes shared by Trinamool cadres: Suspended student leader's big chargeThis development comes just days after the student leader Rajanya Haldar, appearing on a local TV show, condemned the gangrape of a first-year law college student in Kolkata. She claimed that such misogynistic attitudes are prevalent among a certain section of student leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-parupalli-kashyap-divorce-marriage-date-2755254-2025-07-14",
      "headline": "Saina Nehwal announces separation from Parupalli Kashyap after 7 years of marriageBadminton stars Saina Nehwal and Parupalli Kashyap have decided to separate after nearly 7 years of marriage. Saina announced her decision in an Instagram post on Sunday, July 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/packaged-food-alert-why-india-needs-warning-labels-not-health-star-ratings-2754431-2025-07-12",
      "headline": "Packaged food alert: Why India needs warning labels, not health star ratingsExperts share how the country's draft guidelines on food labelling require more democratic dialogue in order to truly empower the consumer\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-rivalry-jannik-sinner-wimbledon-final-loss-2755294-2025-07-14",
      "headline": "Alcaraz draws motivation from intense rivalry with Sinner despite Wimbledon lossCarlos Alcaraz views his fierce rivalry with Jannik Sinner as a powerful source of motivation, despite the pain of losing his Wimbledon crown to the Italian.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tripura-girl-missing-in-delhi-for-6-days-found-dead-under-city-flyover-2755226-2025-07-13",
      "headline": "Delhi University student's body found in Yamuna, 6 days after disappearanceSneha was a student of Atma Ram Sanatan Dharma College, Delhi University, and had been living in Delhi away from her family for some time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-brad-pitts-tangaliya-shirt-in-f1-movie-spotlights-a-700-year-old-indian-craft-2754433-2025-07-12",
      "headline": "How Brad Pitt's Tangaliya shirt in 'F1' movie spotlights a 700-year-old Indian craftPitt's onscreen character has put Tangaliya's handwoven artistry on the global stage, but can the attention help revive a fading tradition?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/plane-crashes-at-londons-southend-airport-turns-into-fireball-on-runway-2755232-2025-07-13",
      "headline": "Plane crashes moments after takeoff at London airport, turns into fireballThe crash led to the cancellation of at least four scheduled flights on Sunday afternoon, according to the airport's website. Authorities have not yet disclosed how many people were on board the aircraft or their condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/donald-trump-fifa-club-world-cup-chelsea-celebrations-trophy-2755362-2025-07-14",
      "headline": "Watch: Trump refuses to leave podium, crashes Chelsea's CWC celebrationsDonald Trump was in no mood to back away as he refused to leave the podium and stood alongside the Chelsea players who went on to lift the FIFA Club World Cup title after a crushing 3-1 over Chelsea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-day-4-score-summary-cracking-finish-2755240-2025-07-13",
      "headline": "Slow burn to fireworks: 14-wicket Day 4 sets up crackling Lord's Test finaleLord's Test: After three days of slowburn, the third Test exploded on Day 4. India bowled England out for 192 before England fought back with four wickets late on Sunday. The fifth and final day promises to be a cracker. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-looks-ambitious-fearless-from-space-says-shubhanshu-shukla-ahead-of-homecoming-2755197-2025-07-13",
      "headline": "India looks ambitious, fearless from space, says Shux ahead of homecomingIn a heartfelt ceremony, Shubhanshu Shukla reflected on his journey, the achievements of the mission, and the collaborative spirit that defined his time in orbit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-usd-120000-why-reasons-us-policy-latest-price-crypto-ether-2755326-2025-07-14",
      "headline": "Bitcoin zooms past $120,000 to reach all-time high. Here's whyThe world's largest cryptocurrency was last seen trading at $120,700.54, up 1.32%, as investor confidence remained strong ahead of important regulatory discussions in the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shahrukh-pathan-killed-mukhtar-ansari-gang-sharpshooter-up-police-encounter-2755321-2025-07-14",
      "headline": "Mukhtar Ansari gang hitman killed in UP Police encounter; guns, cartridges seizedReleased on bail six months ago, Shahrukh Pathan had resumed threatening and attacking witnesses in old murder cases before he was tracked down and killed in a police encounter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/paul-reiffel-umpiring-errors-india-lords-test-controversy-2755237-2025-07-13",
      "headline": "Paul Reiffel is the new Steve Bucknor: Fans slam umpiring at Lord'sUmpire Paul Reiffel faced heavy criticism for poor decisions against India at Lord's Test. The controversial calls sparked frustration amongst players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-lords-highest-successful-chase-data-2755227-2025-07-13",
      "headline": "Can India chase 193 at Lord's? Here's what history suggestsEngland vs India: India bowled England out for 192 on Day 4 of the third Test at Lord's. Washington Sundar's impressive four-wicket haul was key in restricting England on a challenging pitch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/swiggy-delivery-agent-assaulted-in-bengaluru-road-rage-incident-at-modi-hospital-junction-2755308-2025-07-14",
      "headline": "Swiggy delivery agent assaulted in Bengaluru road rage incidentA Swiggy delivery executive was assaulted by three unidentified men at a busy Bengaluru traffic signal, allegedly for not moving while at a red light. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-alcohol-protest-at-over-20000-bars-in-maharashtra-today-over-duty-hikes-2755298-2025-07-14",
      "headline": "'No alcohol' protest at over 20,000 bars in Maharashtra today over duty hikesThe unprecedented shutdown, supported by regional hotel associations in Palghar, Vasai, Pune, Nagpur, Aurangabad, Lonavala, Mahabaleshwar, and Nashik, marks one of the largest unified protests in Maharashtra's hospitality history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/well-get-6-wickets-in-1st-hour-england-coach-marcus-trescothick-2755252-2025-07-14",
      "headline": "Get 6 wickets in 1st hour: England coach warns India ahead of Day 5England's assistant coach Marcus Trescothick is confident of his bowlers getting the job done on Day 5 of the third Test against India at Lord's after England took four early wickets before stumps on Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rajeev-khandelwal-recalls-quitting-kahiin-to-hoga-fight-with-ektaa-kapoor-2755335-2025-07-14",
      "headline": "Rajeev Khandelwal recalls quitting Kahiin Toh Hoga, choosing quality over moneyActor Rajeev Khandelwal recently opened up on the perception around him after he quit Ektaa Kapoor's 'Kahiin To Hoga' (2003-2005). He mentioned the negative articles written about him at that time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/legendary-south-actor-b-saroja-devi-dies-at-87-2755349-2025-07-14",
      "headline": "Legendary South actor B Saroja Devi dies at 87B Saroja Devi, one of South Indian cinema's most iconic and beloved female actors, died at 87. Known for her memorable roles across Tamil, Telugu, and Kannada films, she was a towering figure in Indian cinema for over six decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/superman-box-office-collection-day-3-detailed-report-james-gunn-film-flies-high-crushes-1st-weekend-numbers-2755328-2025-07-14",
      "headline": "Superman box office day 3: James Gunn's film flies high, crushes 1st weekend numbers'Superman' rocked a fabulous first weekend at the Indian box office. The James Gunn-directorial has impressed the Indian audience, and is looking at recording a good first week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-carries-labubus-to-wimbledon-2025-2755317-2025-07-14",
      "headline": "Urvashi Rautela carries labubus to Wimbledon, internet can't stop laughingUrvashi Rautela's photos from Wimbledon 2025 went viral after she carried four Labubu dolls to the match while wearing a white gown. Fans on social media shared funny comments and memes about her unique look."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-nasser-hussain-lords-test-rahul-pant-day-5-2755376-2025-07-14",
      "headline": "Hussain backs KL Rahul and Pant to lead India to historic Lord's winFormer England captain Nasser Hussain believes that the partnership between KL Rahul and Rishabh Pant could be key to India's chances of winning the Lord's Test. With six wickets in hand, India need 135 more runs to take a 2-1 lead in the five-match Test series at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/donald-trump-fifa-club-world-cup-chelsea-celebrations-trophy-2755362-2025-07-14",
      "headline": "Watch: Trump refuses to leave podium, crashes Chelsea's CWC celebrationsDonald Trump was in no mood to back away as he refused to leave the podium and stood alongside the Chelsea players who went on to lift the FIFA Club World Cup title after a crushing 3-1 over Chelsea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-new-york-beat-washington-mlc-final-major-league-cricket-title-2755348-2025-07-14",
      "headline": "MI New York clinch thriller vs Washington Freedom to secure second titleMI New York held its nerve in a tense finish to defeat Washington Freedom by five runs and claim its second Major League Cricket (MLC) title at Grand Prairie Stadium in Dallas on July 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-final-luis-enrique-joao-pedro-fight-regret-2755333-2025-07-14",
      "headline": "Luis Enrique rues scuffle at CWC final: Situation could've been avoidedLuis Enrique admitted that the on-field scuffle between PSG and Chelsea could have been avoided. The incident took place at the FIFA Club World Cup final, where Chelsea came out victorious with a crushing 3-1 win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-jannik-sinner-breaks-carlos-alcaraz-barrier-lessons-from-past-2755324-2025-07-14",
      "headline": "Jannik Sinner breaks the Carlos Alcaraz barrier with lessons from the pastWimbledon 2025: World No.1 Jannik Sinner made a stupendous recovery from his French Open loss to Carlos Alcaraz and beat the Spaniard on Sunday at the All England Club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-press-conference-india-chase-win-lords-test-england-2755312-2025-07-14",
      "headline": "India have solid batters in dressing room: Sundar confident of special Lord's winEngland vs India, 3rd Test: A confident Washington Sundar said the presence of \"solid\" batters in the dressing room would help India chase down the 193-run target on Day 5 of the Lord's Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-rivalry-jannik-sinner-wimbledon-final-loss-2755294-2025-07-14",
      "headline": "Alcaraz draws motivation from intense rivalry with Sinner despite Wimbledon lossCarlos Alcaraz views his fierce rivalry with Jannik Sinner as a powerful source of motivation, despite the pain of losing his Wimbledon crown to the Italian.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-duckett-sledge-shubman-gill-lords-test-2755285-2025-07-14",
      "headline": "Duckett's sledge unsettles Gill as India falters in Lord's TestEngland opener Ben Duckett took a sly dig at India captain Shubman Gill on Day 4 of the third Test at Lord's as tensions ran high between the two sides. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-west-indies-3rd-test-day-2-report-2755284-2025-07-14",
      "headline": "West Indies batting collapse puts Australia in control on 15-wicket dayShamar Joseph and Alzarri Joseph bowled with pace and vintage West Indies intent during the night session on Sunday, as Australia struggled to 99 for six in their second innings — a lead of 181 in the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-champin-jannik-sinner-gifts-prince-george-princess-charlotte-royal-family-2755278-2025-07-14",
      "headline": "Watch: Wimbledon champion Sinner brings gifts for Prince George, Princess CharlotteWimbledon champion Jannik Sinner was spotted handing signed tennis balls to Prince George and Princess Charlotte following his historic win over Carlos Alcaraz in the final on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-new-tennis-rivalry-wimbledon-future-2755270-2025-07-14",
      "headline": "You complete me: Sinner and Alcaraz are crafting tennis's next great rivalryJannik Sinner returned from heartbreak in Paris to conquer Wimbledon, a comeback Carlos Alcaraz saw coming. Their rivalry, steeped in respect and driven by the relentless urge to outdo and learn from each other, is becoming tennis's most compelling new saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-rivalry-jannik-sinner-wimbledon-final-loss-2755294-2025-07-14",
      "headline": "Alcaraz draws motivation from intense rivalry with Sinner despite Wimbledon lossCarlos Alcaraz views his fierce rivalry with Jannik Sinner as a powerful source of motivation, despite the pain of losing his Wimbledon crown to the Italian.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-duckett-sledge-shubman-gill-lords-test-2755285-2025-07-14",
      "headline": "Duckett's sledge unsettles Gill as India falters in Lord's TestEngland opener Ben Duckett took a sly dig at India captain Shubman Gill on Day 4 of the third Test at Lord's as tensions ran high between the two sides. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-west-indies-3rd-test-day-2-report-2755284-2025-07-14",
      "headline": "West Indies batting collapse puts Australia in control on 15-wicket dayShamar Joseph and Alzarri Joseph bowled with pace and vintage West Indies intent during the night session on Sunday, as Australia struggled to 99 for six in their second innings — a lead of 181 in the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-champin-jannik-sinner-gifts-prince-george-princess-charlotte-royal-family-2755278-2025-07-14",
      "headline": "Watch: Wimbledon champion Sinner brings gifts for Prince George, Princess CharlotteWimbledon champion Jannik Sinner was spotted handing signed tennis balls to Prince George and Princess Charlotte following his historic win over Carlos Alcaraz in the final on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-new-tennis-rivalry-wimbledon-future-2755270-2025-07-14",
      "headline": "You complete me: Sinner and Alcaraz are crafting tennis's next great rivalryJannik Sinner returned from heartbreak in Paris to conquer Wimbledon, a comeback Carlos Alcaraz saw coming. Their rivalry, steeped in respect and driven by the relentless urge to outdo and learn from each other, is becoming tennis's most compelling new saga."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}