{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-day-3-check-latest-subscription-gmp-sees-dip-2625226-2024-10-29",
      "headline": "Afcons Infrastructure Day 3: Check latest subscription, GMP sees dip  The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-expert-tips-to-maximise-your-diwali-returns-review-2625087-2024-10-29",
      "headline": "Muhurat trading 2024: Expert tips to maximise your Diwali returnsMuhurat trading is a unique session conducted by Indian stock exchanges on Diwali, rooted in the belief that this 'auspicious hour' is a time to attract prosperity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-q2-results-profit-surges-664-percent-yoy-to-rs-1742-crore-2625030-2024-10-29",
      "headline": "Adani Enterprises Q2 results: Profit surges 664% YoY to Rs 1,742 croreThe company reported a net profit of Rs 1,742 crore in the July-September quarter, up from Rs 228 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-momentum-weak-session-banking-diwali-week-2625027-2024-10-29",
      "headline": "Sensex, Nifty pare losses to end higher as banking stocks gainThe S&P BSE Sensex rose 363.99 points to 80,369.03 at the closing bell, while the NSE Nifty50 gained 127.70 points to settle at 24,446.85. Most of the broader market indices, including smallcap and midcaps, staged a stronger recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buying-property-this-festive-season-diwali-2024-top-3-things-you-should-consider-expert-advice-2625010-2024-10-29",
      "headline": "Buying property this festive season: 3 things you should consider Many people consider Dhanteras an auspicious time to make significant investments, with property being one of the most popular choices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-falls-over-5-percent-q2-profit-declines-market-expectations-2624959-2024-10-29",
      "headline": "Maruti Suzuki share price slumps over 5% as Q2 profit declines 17%Following a disappointing Q2 performance, shares of Maruti Suzuki fell over 5.5% amid concerns about the company's future growth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-fully-booked-check-latest-subscription-gmp-good-bad-2624953-2024-10-29",
      "headline": "Afcons Infrastructure IPO fully booked: Check latest subscription, GMPAfcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-muhurat-trading-2024-stocks-axis-bank-ltd-can-fin-homes-karur-vysya-bank-stylam-industries-2624948-2024-10-29",
      "headline": "Diwali Muhurat trading 2024: 4 stocks set to shine by next yearThe Muhurat trading session will be held on Friday, November 1, 2024, from 6 PM to 7 PM, with a pre-opening session starting between 5:45 PM and 6 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-down-should-you-buy-or-avoid-price-target-2624941-2024-10-29",
      "headline": "Zomato share price falls nearly 2% today. Should you buy or avoid? Zomato shares are down nearly 2% today. Is this dip a chance to buy in on India's food delivery growth story? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buying-gold-prices-dhanteras-diwali-check-latest-rates-future-outlook-2624904-2024-10-29",
      "headline": "Buying gold this Dhanteras? Check latest price and future outlookCelebrated just before Diwali, Dhanteras is considered an auspicious occasion for buying gold in various forms, whether jewellery, coins, or bars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/federal-bank-share-price-jump-over-8-percent-q2fy25-results-should-you-buy-2624896-2024-10-29",
      "headline": "Federal Bank share price jumps over 8% after Q2 results: Should you buy?Federal Bank's impressive Q2 results have investors buzzing as its shares jumped over 8% during Tuesday's trading session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/federal-bank-idfc-first-bank-indian-bank-should-you-buy-these-banking-stocks-or-avoid-2624886-2024-10-29",
      "headline": "Federal Bank, IDFC First Bank, Indian Bank: Should you buy these banking stocks?With mixed earnings in the second quarter, are these banking stocks poised for growth or further declines? Here is all you need to know. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-to-open-next-week-10-things-you-need-to-know-date-issue-size-price-band-2624877-2024-10-29",
      "headline": "Swiggy IPO to open next week: 10 things you need to knowSwiggy's IPO follows a book-building process, with a total issue size of Rs 11,327.43 crore. It includes a fresh issue of 11.54 crore shares, amounting to Rs 4,499 crore, and an offer for sale of 17.51 crore shares, amounting to Rs 6,828.43 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-sensex-nifty-recovery-diwali-week-domestic-investors-fii-outflows-2624843-2024-10-29",
      "headline": "Can Diwali week light up Dalal Street amid volatility and FII outflows?As the festive spirit of Diwali fills the air, market watchers are left wondering: Can Diwali week bring sustained cheer to Dalal Street amid shifting investor sentiments?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-29-2024-precious-metals-record-hike-on-mcx-2624839-2024-10-29",
      "headline": "Gold, silver price today, October 29, 2024: Precious metals record hike on MCXGold Price Today October 29, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-fall-after-flat-opening-weak-q2-results-diwali-dhanteras-2624805-2024-10-29",
      "headline": "Sensex, Nifty open lower amid weak Q2 earnings dampen Diwali weekAt 9:54 am, the NSE Nifty50 shed 109.60 points to 24,225.55 points, while the BSE Sensex fell 369.17 points to 79,635.87."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-guide-timings-history-what-to-expect-diwali-2024-2624463-2024-10-28",
      "headline": "Muhurat trading guide: Timings, history, and what to expect on Diwali 2024Muhurat trading is a unique session conducted by Indian stock exchanges on Diwali, rooted in the belief that this 'auspicious hour' is a time to attract prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-jump-on-banking-boost-end-five-day-losing-streak-icici-bank-2624403-2024-10-28",
      "headline": "Sensex, Nifty jump on banking boost, end 5-day losing streakThe S&P BSE Sensex added 602.75 points to close at 80,005.04, while the NSE Nifty50 gained 158.35 points to close at 24,339.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ian-bremmer-explains-why-china-economic-crisis-is-reshaping-its-foreign-policy-exclusive-2624350-2024-10-28",
      "headline": "Economic crisis forcing China to adjust foreign policy: Ian BremmerIan Bremmer explained why China is showing less willingness to engage in confrontational behaviour and is actively seeking to reduce tensions with key partners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-2-subscription-status-gmp-subscribe-or-skip-review-2624275-2024-10-28",
      "headline": "Afcons Infrastructure IPO: Day 2 subscription status, GMP. Subscribe or skip?The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-officials-confess-leaking-intelligence-sensitive-information-against-india-washington-post-2625379-2024-10-30",
      "headline": "Canadian officials confess to leaking 'intel' against India to Washington PostNathalie Drouin, Justin Trudeau's national-security and intelligence adviser, told a parliamentary panel on Tuesday that she did not require the Prime Minister's authorisation for the leak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/india-faces-threat-climate-sensitive-diseases-excessive-heat-exposure-reveals-lancet-report-2625369-2024-10-30",
      "headline": "India faces threat of climate-sensitive diseases, heat exposure: ReportAccording to the new Lancet report, the spread of climate-sensitive infectious diseases in India fuels demand for improved climate-integrated forecasting, strengthened healthcare infrastructure, and increased community awareness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-2024-x-misinformation-ai-images-being-paid-donald-trump-kamala-harris-elon-musk-2625376-2024-10-30",
      "headline": "Users spreading US poll misinformation, AI images claim being paid by X: ReportThe support for US presidential candidates - Republican pick Donald Trump and Democratic nominee Kamala Harris - is split among these networks. While some even support independents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/milind-deora-aaditya-thackeray-worli-elections-maharashtra-assembly-shiv-sena-2625337-2024-10-29",
      "headline": "Milind Deora on poll battle against Aaditya Thackeray: He's like younger brotherMilind Deora dismissed claims of being a 'sacrificial lamb' in his Maharashtra Assembly bid against Aaditya Thackeray and said that he is contesting the polls to end \"speed-breaker politics\" happening in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/do-you-really-need-two-foundations-for-combination-skin-2624957-2024-10-30",
      "headline": "Do you really need two foundations for combination skin?Struggling to find the perfect foundation for your combination skin? You might want to consider using separate products for different areas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-old-elderly-couple-visually-impaired-blind-lives-deceased-son-dead-body-2625172-2024-10-29",
      "headline": "Blind parents in Hyderabad didn't realise son had died, lived with body for daysAn elderly and visually impaired couple in Hyderabad lived with the body of their deceased son for days, not knowing he had died. The incident was discovered only after the neighbours called police telling them of foul smell coming from the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-canada-diplomatic-row-opposition-leader-pierre-poilievre-cancels-diwali-event-overseas-friends-of-india-canada-2625381-2024-10-30",
      "headline": "Canada opposition leader cancels Diwali event, slammed for 'discriminatory act' The Overseas Friends of India Canada (OFIC), the event's organiser, received no explanation for the cancellation of the Diwali celebration, originally set to be hosted by Conservative MP Todd Doherty on October 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-confirms-manchester-united-interest-no-decision-yet-2625380-2024-10-30",
      "headline": "Ruben Amorim confirms Manchester United interest but no decision made yetRuben Amorim addressed speculation linking him to Manchester United, confirming that no deal was finalized despite Sporting's announcement that the Premier League club was prepared to meet his €10 million ($10.79 million) release clause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaya-kishori-spiritual-speaker-motivational-christian-dior-bag-iphone-trolled-aiport-spotted-leather-2625256-2024-10-29",
      "headline": "Not just Dior bag, Jaya Kishori loves iPhones too. Should it really matter?Spiritual orator and life coach Jaya Kishori was trolled for her Dior handbag, which costs over Rs 2 lakh. Kishori, all of 29, is a self-confessed iPhone lover too. Does her love for luxury handbags and costly smartphones contradict what she speaks about?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-doctor-raping-blackmailing-patient-woman-arrest-injection-sedative-arrested-2625283-2024-10-29",
      "headline": "Bengal doctor rapes woman after injecting her with sedative, blackmails herA doctor in West Bengal's North 24 Parganas was arrested on charges of raping a woman after injecting her with a sedative at his clinic. He also blackmailed her after he threatened to leak her private photos on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/even-amid-festive-cheer-inventory-pile-up-no-discount-on-these-maruti-hyundai-mahindra-models-2624803-2024-10-29",
      "headline": "No discount on these car models despite festive cheer, inventory pile-upThe festive offers are usually in the form of cash discounts, exchange bonuses and corporate discounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/jagan-reddy-ys-sharmila-property-dispute-ys-vijayamma-letter-family-assets-2625378-2024-10-30",
      "headline": "YSR didn't divide family assets: Jagan Reddy's mother amid property feudYS Vijayamma, the widow of former Andhra Pradesh Chief Minister YS Rajasekhara Reddy, said all assets belonged to the joint family and said her children YS Jagan Mohan Reddy and YS Sharmila would settle the property dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bigbasket-to-deliver-quicker-rollout-begins-with-top-25-cities-2625182-2024-10-29",
      "headline": "BigBasket to deliver quicker; rollout begins with top 25 citiesWith BB Now, the company aims to transition from the traditional slotted delivery to quick commerce and tap changing consumer preferences\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-calls-congress-irregularities-charge-haryana-polls-baseless-2625163-2024-10-29",
      "headline": "Refrain from baseless charges election after election: Poll body rebukes CongressThe Election Commission of India (ECI) has asked Congress and other political parties to avoid raising \"unfounded and sensational complaints\" at critical times, such as polling and counting days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-polls-nawab-malik-ajit-pawar-ncp-mankhurd-shivaji-nagar-seat-2625017-2024-10-29",
      "headline": "Nawab Malik fielded by Ajit Pawar's NCP, but will not get BJP's supportNawab Malik's candidature provoked a sharp response from ally BJP, which has firmly refused to campaign for \"people connected to Dawood Ibrahim\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-india-china-border-breakthrough-ladakh-standoff-patrolling-deal-resolution-2625358-2024-10-30",
      "headline": "US welcomes India-China border breakthrough: Didn't play role in resolutionThe US clarified that it did not play in the resolution of the India-China border row even though it welcomed the disengagement of Indian and Chinese troops along the friction points in eastern Ladakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-the-mafia-is-stealing-prime-defence-land-2625156-2024-10-29",
      "headline": "How the mafia is stealing prime defence landOrganised theft of land owned by the armed forces by land sharks in connivance with corrupt officials endangers national security\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ravindra-jadeja-chennai-super-kings-tease-ipl-retentions-with-cryptic-post-2625288-2024-10-29",
      "headline": "Chennai Super Kings tease IPL retentions with cryptic postChennai Super Kings teased their possible retentions with a cryptic post on social media on Tuesday, October 29. Chennai asked their fans to vote for the players that they would like to be retained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/china-launches-astronauts-tiangong-space-station-programme-shenzhou-crew-manned-mission-2625366-2024-10-30",
      "headline": "China sends 3 astronauts to Tiangong space station in picture-perfect launchThe crew consists of Commander Cai Xuzhe, 48, and two rookie astronauts - Song Lingdong, 34, a former air force pilot, and Wang Haoze, 34, a spaceflight engineer and China's third female astronaut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/fact-check-diwali-offer-iphone-smartphones-data-harvesting-scam-rajasthan-2625273-2024-10-29",
      "headline": "Don't fall for Diwali offers selling iPhones for Rs 99! It's a scamIndia Today Fact Check investigated the scam websites and found they had connections to two Rajasthan cities. Read the story to find out how. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanpur-gym-trainer-raped-minor-sedative-injection-hostage-held-police-case-arrested-2625367-2024-10-30",
      "headline": "Kanpur gym trainer raped minor, held her hostage, arrested nearly 2 years laterA Class 11 student was raped by a Kanpur-based gym trainer after she was sedated and was held hostage for several months. The accused was arrested despite the victim filing a case against him nearly two years ago and after court intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/election-commission-maharashtra-police-baba-siddique-murder-jharkhand-assembly-elections-bypolls-2625363-2024-10-30",
      "headline": "Curb politically motivated crimes: Election Commission to Maharashtra PoliceChief Election Commissioner Rajiv Kumar told the Maharashtra Police to be extra vigilant and to keep additional forces in case any untoward incident occurred in the poll-bound state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-missile-test-ukraine-nuclear-war-response-simulation-putin-2625349-2024-10-29",
      "headline": "Russia test missile to simulate 'massive response' to nuclear attackThe exercise, to simulate a \"massive\" nuclear response to an enemy first strike, involved Russia's full nuclear \"triad\" of ground, sea and air-launched missiles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/harris-trump-voters-battle-of-sexes-us-presidential-elections-november-5-gender-gap-men-women-2624938-2024-10-29",
      "headline": "Why Harris vs Trump is turning out to be battle of sexesThe 2024 US presidential election, now just a week away, has become a battle of the sexes as women, cutting across all sections, support Kamala Harris, while men are backing Donald Trump. Both candidates have stayed away from gender attacks, and know that support of the opposite sex is crucial for a victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-son-updates-on-recovery-after-accident-stitches-removed-2625383-2024-10-30",
      "headline": "Govinda's son updates fans on actor's recovery after accident: Stitches are removedGovinda's son, Yashvardhan Ahuja, updated fans on his father's health after the actor accidentally shot himself in the leg. He said that Govinda is recovering well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nishadh-yusuf-editor-kanguva-thallumala-dead-kochi-suicide-2625382-2024-10-30",
      "headline": "Nishad Yusuf, editor of Kanguva, found dead at his Kochi homeFilm editor Nishadh Yusuf was found dead at his home in Panampilly, Kochi. He was the editor for Suriya's Kanguva and Tovino Thomas's Thallumaala, among other films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-video-call-dulquer-salmaan-balayya-unstoppable-with-nbk-2625374-2024-10-30",
      "headline": "Watch: Mammootty on video call as Dulquer appears on Balayya's showMalayalam superstar Mammootty made a rare appearance on Nandamuri Balakrishna's chat show, Unstoppable with NBK. Dulquer Salmaan and director Venky Atluri were the guests for the special episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-did-not-pursue-a-life-abroad-after-postgraduate-degree-2625277-2024-10-29",
      "headline": "Vicky Kaushal shares why he didn't pursue a life abroad after postgraduate degreeActor Vicky Kaushal reflects on his journey from pursuing engineering to becoming a Bollywood star. He shared how an industrial visit to a multinational company changed his career path."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-confirms-manchester-united-interest-no-decision-yet-2625380-2024-10-30",
      "headline": "Ruben Amorim confirms Manchester United interest but no decision made yetRuben Amorim addressed speculation linking him to Manchester United, confirming that no deal was finalized despite Sporting's announcement that the Premier League club was prepared to meet his €10 million ($10.79 million) release clause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paris-masters-carlos-alcaraz-reaches-last-16-after-win-opener-2625375-2024-10-30",
      "headline": "Carlos Alcaraz advances to last 16 after dazzling win in openerCarlos Alcaraz advances to the next round of the Paris Masters with a decisive win over Nicolas Jarry. The young tennis star aims to close the gap with World No. 1 Jannik Sinner, who withdrew due to illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shimron-hetmyer-returns-west-indies-odi-squad-england-series-2625370-2024-10-30",
      "headline": "Shimron Hetmyer returns to West Indies ODI squad for England series Shimron Hetmyer has been recalled to the West Indies' ODI squad for their eagerly awaited three-match series against England, beginning in Antigua on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-australia-vs-india-keep-them-quiet-pressure-2625353-2024-10-30",
      "headline": "Our job is to keep them quiet: Cummins' message to 'under pressure' IndiaSkipper Pat Cummins sounded confident about Australia's chances in their upcoming Test series against Rohit Sharma's India, who recently lost to New Zealand at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-set-for-boxing-day-new-years-test-against-afghanistan-2625336-2024-10-29",
      "headline": "Zimbabwe set for Boxing Day, New Year's Test vs Afghanistan Afghanistan are set to tour Zimbabwe for a Test, ODI and T20I series to be played from December 9. The Harare Sports Club and Queens Sports Club in Bulawayo will host the matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harmanpreet-kaur-odi-series-2625311-2024-10-29",
      "headline": "India wanted to win the series at any cost: Harmanpreet Kaur  IND-W vs NZ-W: Harmanpreet Kaur was happy after India's series win over New Zealand and also credited centurion Smriti Mandhana for her match-winning 100 on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sporting-confirm-manchester-uniteds-interest-in-ruben-amorim-as-manager-2625305-2024-10-29",
      "headline": "Sporting confirm Manchester United's interest in Ruben Amorim as managerPortuguese football club Sporting have confirmed Manchester United's interest in Ruben Amorim as their next manager. Amorim is one of the favourites to take over the club after the sacking of Erik ten Hag.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ravindra-jadeja-chennai-super-kings-tease-ipl-retentions-with-cryptic-post-2625288-2024-10-29",
      "headline": "Chennai Super Kings tease IPL retentions with cryptic postChennai Super Kings teased their possible retentions with a cryptic post on social media on Tuesday, October 29. Chennai asked their fans to vote for the players that they would like to be retained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-womens-odi-smriti-mandhana-hundred-2625279-2024-10-29",
      "headline": "Had to be hard on myself: How Mandhana redeemed herself with stunning 100IND-W vs NZ-W: Smriti Mandhana scored a match-winning hundred as India beat New Zealand by six wickets in the series decider on Tuesday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-phil-salt-harbhajan-singh-opines-on-kkr-ipl-retentions-2625271-2024-10-29",
      "headline": "Rinku Singh, Phil Salt: Harbhajan Singh opines on KKR IPL retentionsFormer India spinner Harbhajan Singh feels that KKR might find it a little difficult to fix their retentions. Harbhajan Singh wants players like Rinku Singh, Shreyas Iyer to stay at KKR.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-new-zealand-women-smriti-mandhana-deepti-sharma-harmanpreet-kaur-2625268-2024-10-29",
      "headline": "Mandhana, Deepti lead India to ODI series win vs New Zealand IND-W vs NZ-W: Smriti Mandhana scored her eighth ODI hundred as India beat New Zealand by six wickets in the series decider in Ahmedabad to claim the three-match series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sporting-confirm-manchester-uniteds-interest-in-ruben-amorim-as-manager-2625305-2024-10-29",
      "headline": "Sporting confirm Manchester United's interest in Ruben Amorim as managerPortuguese football club Sporting have confirmed Manchester United's interest in Ruben Amorim as their next manager. Amorim is one of the favourites to take over the club after the sacking of Erik ten Hag.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ravindra-jadeja-chennai-super-kings-tease-ipl-retentions-with-cryptic-post-2625288-2024-10-29",
      "headline": "Chennai Super Kings tease IPL retentions with cryptic postChennai Super Kings teased their possible retentions with a cryptic post on social media on Tuesday, October 29. Chennai asked their fans to vote for the players that they would like to be retained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-womens-odi-smriti-mandhana-hundred-2625279-2024-10-29",
      "headline": "Had to be hard on myself: How Mandhana redeemed herself with stunning 100IND-W vs NZ-W: Smriti Mandhana scored a match-winning hundred as India beat New Zealand by six wickets in the series decider on Tuesday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-phil-salt-harbhajan-singh-opines-on-kkr-ipl-retentions-2625271-2024-10-29",
      "headline": "Rinku Singh, Phil Salt: Harbhajan Singh opines on KKR IPL retentionsFormer India spinner Harbhajan Singh feels that KKR might find it a little difficult to fix their retentions. Harbhajan Singh wants players like Rinku Singh, Shreyas Iyer to stay at KKR.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-new-zealand-women-smriti-mandhana-deepti-sharma-harmanpreet-kaur-2625268-2024-10-29",
      "headline": "Mandhana, Deepti lead India to ODI series win vs New Zealand IND-W vs NZ-W: Smriti Mandhana scored her eighth ODI hundred as India beat New Zealand by six wickets in the series decider in Ahmedabad to claim the three-match series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-goes-past-mithali-raj-with-record-8th-odi-hundred-2625265-2024-10-29",
      "headline": "Smriti Mandhana goes past Mithali Raj with record 8th ODI hundredIndia batter Smriti Mandhana went into the record books with her 8th ODI hundred in women's cricket. Mandhana surpassed Mithali Raj's record of 7 centuries with a series-winning knock against New Zealand.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tony-de-zorzi-becomes-3rd-south-african-opener-to-score-test-hundred-in-bangladesh-2625185-2024-10-29",
      "headline": "Tony de Zorzi becomes 3rd South African opener to score Test hundred in BangladeshTony de Zorzi became only the 3rd South African opener after Graeme Smith and Neil McKenzie to score a century in Bangladesh. Tristan Stubbs also scored his maiden Test hundred to help South Africa post 307/2 on Day 2 stumps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harshit-rana-to-join-indian-squad-in-mumbai-ahead-of-third-test-2625171-2024-10-29",
      "headline": "Harshit Rana to join Indian squad in Mumbai ahead of third TestRookie pacer Harshit Rana joins the Indian squad ahead of the third Test against New Zealand, following a standout performance in the Ranji Trophy. His impressive form raises hopes for a potential debut, especially with workload management for key players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-retentions-gujarat-titans-set-to-keep-shubman-gill-rashid-khan-mohammed-shami-2625157-2024-10-29",
      "headline": "Gujarat Titans set to retain Shubman Gill and Rashid Khan, Shami snubbedGujarat Titans are likely to retain Shubman Gill Rashid Khan and Sai Sudharsan ahead of the the 2025 mega-auction. GT might not retain Mohammed Shami, who has been one of their key members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-believes-fighting-racism-led-to-ballon-dor-winner-rodri-2625151-2024-10-29",
      "headline": "Vinicius Jr. believes fighting racism led to Ballon d'Or defeatBrazil and Real Madrid forward Vinicius Jr said on Monday that he will keep on fighting racism even if his activism is what led to him not winning the Ballon d'Or, sources close to the player told Reuters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-hires-paddy-upton-before-world-chess-championship-final-vs-ding-liren-2625145-2024-10-29",
      "headline": "D Gukesh hires Paddy Upton before World Chess Championship FinalIndia's D Gukesh has hired former Indian cricket team mental coach Paddy Upton in his staff. Upton is expected to sharpen Gukesh's skills in key moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-tim-paine-rishabh-pant-border-gavaskar-trophy-2020-21-2625138-2024-10-29",
      "headline": "Not Pant but Cheteshwar Pujara helped India win series in 2020-21: Tim PaineFormer Australia captain Tim Paine said that Cheteshwar Pujara doesn't get his due credit for helping India win the Border Gavaskar Trophy 2020-21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajat-patidar-slams-68-ball-hundred-in-ranji-trophy-ahead-of-ipl-retention-2625126-2024-10-29",
      "headline": "Rajat Patidar slams 68-ball hundred in Ranji Trophy ahead of IPL retentionRajat Patidar's remarkable 68-ball century against Haryana marks a stunning comeback, reigniting his form ahead of the IPL retention deadline. This blistering knock sets a new Madhya Pradesh record and showcases his potential as a key player for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-believes-fighting-racism-led-to-ballon-dor-winner-rodri-2625151-2024-10-29",
      "headline": "Vinicius Jr. believes fighting racism led to Ballon d'Or defeatBrazil and Real Madrid forward Vinicius Jr said on Monday that he will keep on fighting racism even if his activism is what led to him not winning the Ballon d'Or, sources close to the player told Reuters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-hires-paddy-upton-before-world-chess-championship-final-vs-ding-liren-2625145-2024-10-29",
      "headline": "D Gukesh hires Paddy Upton before World Chess Championship FinalIndia's D Gukesh has hired former Indian cricket team mental coach Paddy Upton in his staff. Upton is expected to sharpen Gukesh's skills in key moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-tim-paine-rishabh-pant-border-gavaskar-trophy-2020-21-2625138-2024-10-29",
      "headline": "Not Pant but Cheteshwar Pujara helped India win series in 2020-21: Tim PaineFormer Australia captain Tim Paine said that Cheteshwar Pujara doesn't get his due credit for helping India win the Border Gavaskar Trophy 2020-21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajat-patidar-slams-68-ball-hundred-in-ranji-trophy-ahead-of-ipl-retention-2625126-2024-10-29",
      "headline": "Rajat Patidar slams 68-ball hundred in Ranji Trophy ahead of IPL retentionRajat Patidar's remarkable 68-ball century against Haryana marks a stunning comeback, reigniting his form ahead of the IPL retention deadline. This blistering knock sets a new Madhya Pradesh record and showcases his potential as a key player for the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paris-masters-jannik-sinner-withdraws-virus-illness-2625129-2024-10-29",
      "headline": "Jannik Sinner, down with virus, withdraws from Paris Masters 2024 Paris Masters 2024: World No.1 Jannik Sinner would not be a part of the indoor hard-court tournament after saying that he was 'down with virus'. The 23-year-old is looking to get fit before the ATP Finals next month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-yashasvi-jaiswal-ind-vs-nz-mumbai-3rd-test-2625111-2024-10-29",
      "headline": "Manoj Tiwary's massive praise for Yashasvi Jaiswal: He's a legend in the makingFormer India cricketer Manoj Tiwary has hailed young opener Yashasvi Jaiswal as a legend in the making following his recent exploits in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-day-1-tony-de-zorzi-tristan-stubbs-hundreds-2625102-2024-10-29",
      "headline": "Stubbs, De Zorzi hundreds give South Africa upper hand in Chattogram TestBAN vs SA, 2nd Test Day 1: Tony de Zorzi and Tristan Stubbs have put South Africa in a dominating position after scoring hundreds on an excellent pitch to bat on at the Zahur Ahmed Chowdhury Stadium in Chattogram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-to-play-inaugural-match-as-hong-kong-sixes-returns-after-7-years-2625100-2024-10-29",
      "headline": "India-Pakistan to play inaugural match as Hong Kong Sixes returns after 7 yearsThe highly-anticipated and the fastest form of the game, Hong Kong Cricket Sixes is back after a gap of 7 years. India will face Pakistan in the opener of the tournament."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}