{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-ends-over-400-points-higher-nifty-above-24700-eternal-gains-5-percent-2736178-2025-06-05",
      "headline": "Sensex ends over 400 points higher, Nifty above 24,700; Eternal gains 5%Sensex ends over 400 points higher, Nifty above 24,700; Eternal gains 5%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-eli-scheme-benefits-make-sure-your-uan-and-aadhaar-are-linked-by-this-date-2736138-2025-06-05",
      "headline": "Want ELI scheme benefits? Make sure your UAN and Aadhaar are linked by this dateThe Employees' Provident Fund Organisation has extended the deadline for UAN activation and Aadhaar linking to bank accounts under the ELI scheme until 30 June 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-you-a-freelancer-5-things-to-know-while-filing-your-itr-without-form-15-explains-tax-expert-2736113-2025-06-05",
      "headline": "Are you a freelancer? 5 things to know while filing your ITRFreelancers can claim deductions for expenses directly related to their work. These include internet bills, rent for a co-working space, cost of software tools, professional fees, marketing and advertising costs, and travel expenses related to business, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-remove-12-percent-slab-shift-items-to-5-and-18-percent-2736092-2025-06-05",
      "headline": "GST Council may remove 12% slab, shift items to 5% and 18% tax ratesThe GST Council is considering eliminating the 12% tax slab as part of efforts to streamline the tax structure, potentially moving these items to either the 5% or 18% brackets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dr-reddys-shares-rise-alvotech-keytruda-biosimilar-collaboration-2736067-2025-06-05",
      "headline": "Dr Reddy's shares jump over 3% today. Here's whyDr Reddy's shares soar 3.54% after Alvotech partnership for Keytruda biosimilar, enhancing global reach in cancer immunotherapy and signaling growth potential in competitive biosimilar market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/department-of-posts-launches-digipin-precise-digital-addressing-system-new-digital-address-system-in-india-2736018-2025-06-05",
      "headline": "What is DIGIPIN? India's new digital address system explainedThe Department of Posts has launched DIGIPIN, a geocoded digital address system aiming to improve location accuracy and service delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-rise-4-percent-morgan-stanley-maintains-rs-320-target-2735974-2025-06-05",
      "headline": "Eternal shares continue to rally, jumps over 4%. Should you buy?By approximately 10:06 am, the company's shares had risen 4.42% to Rs 256.35 on the Bombay Stock Exchange (BSE). This marks a 12% rise over the past five trading sessions and a 6% increase over the past month. However, year-to-date, the stock remains down by over 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-rally-400-points-nifty-up-ril-eternal-adani-ports-shares-gain-2735970-2025-06-05",
      "headline": "Sensex rallies 800 points: Why is stock market rising today?As of 12:24 pm, the S&P BSE Sensex had jumped 770.31 points to reach 81,768.56. The NSE Nifty50 was also up by 230.50 points at 24,850.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-111-points-higher-nifty-above-24600-eternal-shares-rise-over-1-percent-2735958-2025-06-05",
      "headline": "Sensex, Nifty rise as RBI rate cut hopes lift market; pharma stocks rallyThe S&P BSE Sensex was up 273 points to 81,271.25, while the NSE Nifty50 gained 86.55 points to 24,706.75 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-expectation-sensex-nifty-rally-trading-setup-nse-bse-2735939-2025-06-05",
      "headline": "Stock market opening: Sensex, Nifty to rally today? Check key levelsGift Nifty futures were trading at 24,733.5 as of 8:00 am, signalling a strong start above Nifty50's previous close of 24,620.2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-5-nse-bse-reliance-infra-yes-bank-bel-hal-rec-power-grid-2735933-2025-06-05",
      "headline": "Stocks to watch on June 5: Reliance Infra, Yes Bank, BEL, HAL, REC, Power GridAn overview of stock movements on Dalal Street today, including updates on Adani Airports, Reliance Infrastructure, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-to-trim-35000-jobs-in-germany-by-2030-german-carmakers-plans-layoffs-2735697-2025-06-04",
      "headline": "Volkswagen to trim 35,000 jobs in Germany by 2030Volkswagen is planning to cut 35,000 jobs in Germany by the year 2030. To make the transition easier, Volkswagen is preparing severance packages for affected employees."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-challenging-roles-criminal-justice-season-4-big-film-rejection-2736100-2025-06-05",
      "headline": "Surveen Chawla on joining Criminal Justice 4 and turning down a big filmSurveen Chawla joins Criminal Justice Season 4, sharing insights on her role choices and experiences. She also reveals turning down a major film to avoid repeating herself as an actress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thug-life-review-kamal-haasan-silambarasan-mani-ratnam-haphazard-screenplay-hollow-2736118-2025-06-05",
      "headline": "Thug Life review: Kamal Haasan, Silambarasan's gangster drama soars, then sinksReleased-Thu Jun 05, 2025Thug Life Review: Directed by Mani Ratnam, 'Thug Life', starring Kamal Haasan and Silambarasan, is a gangster drama with emotional beats. While the film had a great set-up pre-interval, it falls into a deep pit in the second half and there is no turning back – even for a legend like Mani Ratnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khans-request-to-paps-sparks-pregnancy-buzz-about-wife-sshura-2736090-2025-06-05",
      "headline": "Samjha karo: Arbaaz Khan's request to paps sparks pregnancy buzz about wife SshuraArbaaz Khan and wife Sshura Khan were spotted during a family outing in Mumbai, sparking pregnancy rumours. Arbaaz's request for privacy from paparazzi further hinted at the couple expecting their first child together.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/wicked-for-good-trailer-cynthia-erivo-ariana-grande-reunite-in-battle-against-wizard-2736026-2025-06-05",
      "headline": "Wicked 2 trailer: Cynthia Erivo-Ariana Grande reunite in battle against wizardThe second act of the American musical fantasy featuring Cynthia Erivo and Ariana Grande is back. The trailer for 'Wicked 2' shows Elphaba and Glinda reuniting amidst witchcraft, spells, flying monkeys while fighting an evil wizard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dakota-johnson-chris-martin-break-up-rumours-after-8-years-2736091-2025-06-05",
      "headline": "Dakota Johnson-Chris Martin break up after dating for 8 years: ReportActor Dakota Johnson and singer Chris Martin have allegedly broken up after dating for 8 years. Reports say \"the break-up seems final this time.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhon-ki-gustaakhiyan-teaser-vikrant-massey-shanaya-kapoor-2736108-2025-06-05",
      "headline": "Aankhon Ki Gustaakhiyan teaser: Vikrant, Shanaya and their love beyond sightThe teaser of 'Aankhon Ki Gustaakhiyan' introduces a love story between Vikrant Massey and debutant Shanaya Kapoor. Set against a monsoon backdrop, the film explores love that begins with a chance meeting and is tested by life's unexpected turns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-custom-jacket-pays-tribute-to-sridevi-chiranjeevi-classic-film-jagadeka-veerudu-athiloka-sundari-2736076-2025-06-05",
      "headline": "Janhvi Kapoor's custom jacket pays tribute to Sridevi-Chiranjeevi's classic filmActor Janhvi Kapoor recently watched her mother Sridevi's and Chirenajeevi Konidela's classic film 'Jagadeka Veerudu Athiloka Sundari'. She even paid tribute to the film with a custom jacket. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kamal-haasan-r-madhavan-sonu-sood-celebs-mourn-bengaluru-stampede-tragedy-2736044-2025-06-05",
      "headline": "Kamal Haasan, R Madhavan, Sonu Sood, celebs mourn Bengaluru stampede tragedyA huge crowd gathered outside the Chinnaswamy stadium in Bengaluru on Wednesday to celebrate Royal Challengers Bengaluru's victory march following their IPL win. The government said 11 were killed in a stampede right outside the stadium. The celebs from the film industry offered condolences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-pics-friend-tanya-saha-wedding-spain-2736053-2025-06-05",
      "headline": "Alia Bhatt shares pics of the most beautiful bride and wedding that felt like homeAlia Bhatt attended her best friend Tanya Saha Gupta's wedding in Spain. She played the bridesmaid and shared dreamy moments from the celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anil-kapoor-dil-dhadakne-do-film-10-years-throwback-photos-2736002-2025-06-05",
      "headline": "Anil Kapoor celebrates 10 years of Dil Dhadakne Do'Dil Dhadakne Do' completes 10 years of film release today (June 5). On the ocassion, Anil Kapoor has shared throwback photos on his social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-teams-up-with-atrangi-re-aanand-l-rai-for-next-film-2736015-2025-06-05",
      "headline": "Exclusive: Sara Ali Khan teams up with Aanand L Rai for next filmActor Sara Ali Khan has teamed up with director Aanand L Rai for her next film. The much-anticipated project is set to present her in a very different avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-twitter-x-review-kamal-haasan-film-is-unconventional-gives-goosebumps-check-tweets-2735985-2025-06-05",
      "headline": "Thug Life X review: Kamal Haasan's film is unconventional, gives goosebumpsKamal Haasan's 'Thug Life' is receiving all kinds of reviews from fans on social media. While many feel that this Silambarasan TR has overshadowed Haasan in the film, others feel that the background music is not up to the mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/head-of-state-new-trailer-priyanka-chopra-john-cena-idris-elba-promise-explosive-action-2735984-2025-06-05",
      "headline": "Head of State new trailer: Priyanka, John Cena, Idris Elba promise explosive actionPriyanka Chopra, John Cena, and Idris Elba's upcoming film 'Heads of State ' is set to entertain fans on July 2. Ahead of the grand premiere on Prime Video, the makers released another powerful trailer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-better-sister-review-power-patriarchy-and-murder-in-a-brilliantly-layered-show-2735893-2025-06-05",
      "headline": "The Better Sister review: Power, patriarchy and murder in a brilliantly layered showReleased-Thu May 29, 2025'The Better Sister', co-created by Olivia Milch and Regina Corrado, is streaming on Prime Video. The show featuring Jessica Biel and Elizabeth Banks is an intriguing whodunnit with stellar performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-joju-george-shares-video-of-daughter-singing-thug-life-song-muthamazhai-2735797-2025-06-05",
      "headline": "Actor Joju George shares video of daughter singing Thug Life song MuthamazhaiA cute video of actor Joju George singing the 'Muthamazhai' song from 'Thug Life' alongside his daughter Sara has gone viral on social media, charming fans with its candid warmth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-prediction-day-1-detailed-report-kamal-haasan-film-to-roar-on-opening-day-solid-tamil-nadu-box-office-update-2735951-2025-06-05",
      "headline": "Thug Life box office prediction day 1: Kamal Haasan film to roar on opening dayKamal Haasan and Mani Ratnam's 'Thug Life' is out to set the cash registers ringing at the box office. The opening-day looks solid with a packed audience in theatres, and the advance booking numbers echo the same. Check the detailed report here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-accused-of-dangling-woman-off-17-story-balcony-in-ongoing-sex-trafficking-glbs-2735908-2025-06-05",
      "headline": "Diddy accused of dangling woman off 17-story balcony in ongoing sex traffickingHip-hop mogul Sean \"Diddy\" Combs is on trial for sex trafficking and racketeering. A witness testified he dangled her off a 17-story balcony in 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wicked-for-good-trailer-to-debut-in-arizona-theaters-on-june-4-glbs-2735890-2025-06-05",
      "headline": "'Wicked: For Good' trailer to debut in Arizona theaters on June 4The Wicked: For Good trailer premieres in theaters on June 4, 2025, during a special rerelease of Part 1 at select Arizona Harkins locations. Streaming options are also available.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-leg-injury-while-shooting-for-shah-rukh-khan-king-2735604-2025-06-04",
      "headline": "Raghav Juyal injures leg while shooting for Shah Rukh Khan's King: ReportRaghav Juyal got injured while shooting a tough stunt for Shah Rukh Khan's upcoming film 'King' but continued filming afterward. The movie, releasing in 2026, features a star-studded cast including SRK, Suhana Khan, Deepika Padukone, and more."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/over-1000-cops-deployed-for-rcb-event-karnataka-to-court-day-after-dk-shivakumar-said-5000-cops-present-2736161-2025-06-05",
      "headline": "Over 1,000 cops for RCB event: Karnataka to court after DK Shivakumar's 5,000 claimThe Karnataka government told the High Court that over 1,000 police were deployed during RCB's IPL celebration, a day after DK Shivakumar claimed that 5,000 personnel were present for managing the crowd.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/court-grants-interim-bail-to-influencer-sarmishta-panoli-in-op-sindoor-post-case-asks-cops-to-ensure-safety-2736133-2025-06-05",
      "headline": "Influencer Sharmishta Panoli gets interim bail in Op Sindoor post caseThe Calcutta High Court has granted interim bail to the 22-year-old fourth-year law student from Pune, Sharmishta Panoli. She was arrested on May 30 in Gurugram in connection with a post related to Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-stampede-update-live-chinnaswamy-stadium-rcb-event-tragedy-reactions-updates-2736000-2025-06-05",
      "headline": "2.5 lakh turned up at 30,000-capacity stadium: Karnataka to court on stampedeThe Karnataka High Court has begun hearing the Chinnaswamy Stadium stampede case after it took cognisance of the matter on its own earlier in the day. The court has sought a government report on security lapses. As many as 11 people were killed and 47 others were injured in the stampede during a felicitation event for Royal Challengers Bengaluru (RCB) following their IPL victory.\r\n\r\nAs thousands gathered to celebrate, the situation turned tragic. The stadium could accommodate only 30,000 people, but over 2 lakh RCB fans showed up. While the players were being honoured inside, the road outside became uncontrollable, leading to the stampede. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-police-wanted-rcb-event-on-sunday-government-ignored-suggestion-sources-2736112-2025-06-05",
      "headline": "Government ignored Bengaluru cops' request to hold RCB event on Sunday: SourcesThe Karnataka government insisted on holding the felicitation event for Royal Challengers Bengaluru the day after their victory, despite Bengaluru Police requesting it be moved to the weekend, top sources revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-india-doesnt-call-out-trumps-ceasefire-claim-india-pakistan-shashi-tharoor-answered-operation-sindoor-2736033-2025-06-05",
      "headline": "How Tharoor hit Trump, Rahul Gandhi with a single stone on ceasefireTrump's claim of brokering a ceasefire between India and Pakistan has been used by the Congress and its leaders, including Rahul Gandhi, to attack PM Narendra Modi. But why hasn't India vociferously rejected Trump's claim? Congress MP Shashi Tharoor revealed why the Indian government has been diplomatic in rejecting Trump's claims, and destroyed Rahul's arguments too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-rcb-event-chinnaswamy-stadium-victims-karnataka-government-2736084-2025-06-05",
      "headline": "Teens, dancer, jobseekers: The 11 lives lost in Bengaluru RCB event stampedeFans climbed trees, walls, and gates to enter Chinnaswamy Stadium in Bengaluru after mixed messages about the RCB event venue spread. Moments later, a stampede left 11 dead and 47 injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-mahua-moitra-marries-former-bjd-mp-pinaki-mishra-in-ceremony-abroad-2736117-2025-06-05",
      "headline": "Trinamool MP Mahua Moitra marries former BJD MP Pinaki Misra in ceremony abroadMahua Moitra and BJD leader Pinaki Misra, both sitting Lok Sabha members, have reportedly married in a quiet overseas ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-rajat-patidar-bengaluru-2736056-2025-06-05",
      "headline": "IPL final: Undoubtedly Virat Kohli's night, but RCB mates deserved moreVirat Kohli was undoubtedly the main man on the night of RCB's ultimate triumph. But there were others who deserved recognition as well. Kohli seemed to sense the stories left untold even in the haze of victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thug-life-review-kamal-haasan-silambarasan-mani-ratnam-haphazard-screenplay-hollow-2736118-2025-06-05",
      "headline": "Thug Life review: Kamal Haasan, Silambarasan's gangster drama soars, then sinksReleased-Thu Jun 05, 2025Thug Life Review: Directed by Mani Ratnam, 'Thug Life', starring Kamal Haasan and Silambarasan, is a gangster drama with emotional beats. While the film had a great set-up pre-interval, it falls into a deep pit in the second half and there is no turning back – even for a legend like Mani Ratnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-china-diplomacy-shy-away-from-publicly-supporting-pakistan-war-india-2733304-2025-06-05",
      "headline": "Why China engages in diplomacy of silence on PakistanChina has used diplomacy of silence on the India-Pakistan issue for decades. Even as Pakistan deployed several Chinese weapons against India during the recent conflict, Beijing, by not supporting Islamabad publicly, reinforced its aspirations -- a power broker that shapes the polities of the Asia-Pacific, and an arms supplier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/children-died-difficult-to-take-this-loss-deputy-chief-minister-dk-shivakumar-breaks-down-on-camera-amid-row-2736048-2025-06-05",
      "headline": "Those children…: DK Shivakumar, under fire, breaks down over stampede deathsKarnataka Deputy Chief Minister DK Shivakumar broke down while addressing the media about the stampede at Chinnaswamy Stadium which claimed the lives of 11 people. He expressed sorrow over the deaths and recounted the chaos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/rare-mahatma-gandhi-portrait-for-which-he-agreed-to-sit-on-sale-auction-london-bonhams-uk-clare-leighton-oil-painting-2736052-2025-06-05",
      "headline": "Rare Gandhi portrait, for which he agreed to sit, on sale in LondonA rare 1931 portrait of Mahatma Gandhi, for which he agreed to sit and pose, is set to be auctioned in London this July, with an estimated price of 50,000-70,000 pounds. The portrait, by British artist Clare Leighton during Gandhi's visit to London, was reportedly attacked by a Hindu right-wing activist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/a-brief-political-history-of-operation-bluestar-the-lowdown-2736079-2025-06-05",
      "headline": "A brief political history of Operation BluestarOperation Bluestar was launched by the Indian Army to remove Sikh militants from Amritsar's Golden Temple. Rooted in decades of political, religious, and separatist tensions, the operation left lasting scars on India's social and historical fabric."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-rcb-karnataka-ipl-death-siddaramaiah-bjp-congress-vidhana-soudha-chinnaswamy-stadium-2736061-2025-06-05",
      "headline": "Even after knowing about deaths, Siddaramaiah went to eat halwa, dosa: BJPThe BJP alleges that the Bengaluru stampede began even before Karnataka Chief Minister Siddaramaiah reached the venue. They claimed he knew of the deaths but still went ahead with the event and went to a hotel to eat badam halwa.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-father-whose-son-died-in-bengaluru-stampede-asks-authorities-to-return-his-childs-boy-2735990-2025-06-05",
      "headline": "Give my child back: Father whose son died in Bengaluru stampede refuses postmortemHis son was one of the 11 cricket fans who lost their lives in a tragic stampede during a chaotic celebration at Bengaluru's M Chinnaswamy Stadium last evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-twitter-x-review-kamal-haasan-film-is-unconventional-gives-goosebumps-check-tweets-2735985-2025-06-05",
      "headline": "Thug Life X review: Kamal Haasan's film is unconventional, gives goosebumpsKamal Haasan's 'Thug Life' is receiving all kinds of reviews from fans on social media. While many feel that this Silambarasan TR has overshadowed Haasan in the film, others feel that the background music is not up to the mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/meghan-markle-posts-throwback-dance-video-from-pregnancy-with-lilibet-2736070-2025-06-05",
      "headline": "Meghan Markle posts throwback dance video from pregnancy with LilibetIn the video, shot from her hospital room shortly before she went into labour, Meghan Markle is seen grooving to a song called Baby Mama in a black dress, alongside the Duke of Sussex, Prince Harry, as part of a TikTok challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-to-count-castes-not-classes-in-2027-census-sources-2736111-2025-06-05",
      "headline": "Government to count castes, not classes in 2027 census: SourcesThe 2027 Census will record individuals' self-declared castes but not categorise them into OBC, SC, or ST groups, sources told India Today TV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bjp-slams-congress-over-zameer-ahmed-khan-sons-stage-access-during-vidhana-soudha-rcb-felicitation-2736114-2025-06-05",
      "headline": "Row over Congress Minister's son granted stage access at Vidhana Soudha RCB eventThe Karnataka BJP criticises the government for allowing Congress Minister's sons on stage while the public was denied entry to the Vidhana Soudha felicitation for Royal Challengers Bengaluru's IPL victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-never-asked-donald-trump-shashi-tharoor-reacts-to-rahul-gandhi-surrender-jibe-2735963-2025-06-05",
      "headline": "India never asked anyone: Shashi Tharoor reacts to Rahul Gandhi's 'surrender' jibeWhen asked about his party leader Rahul Gandhi's 'Narender surrender' remark on Operation Sindoor, Congress MP Shashi Tharoor reiterated that there was no third-party intervention at any point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-pics-friend-tanya-saha-wedding-spain-2736053-2025-06-05",
      "headline": "Alia Bhatt shares pics of the most beautiful bride and wedding that felt like homeAlia Bhatt attended her best friend Tanya Saha Gupta's wedding in Spain. She played the bridesmaid and shared dreamy moments from the celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-rcb-wanted-event-karnataka-government-congress-siddaramaiah-2735983-2025-06-05",
      "headline": "Stampede blame game? Government says RCB, Karnataka cricket body wanted eventAmid the criticism over the stampede and alleged negligence of crowd control, the Karnataka government revealed that the event was organised at the request of RCB and the state cricket association.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-bans-entry-from-12-countries-imposes-restrictions-on-7-others-glbs-2735918-2025-06-05",
      "headline": "We don't want them: Trump issues travel ban on 12 countries, restrictions on 7The countries facing the total ban were found to be 'deficient in screening and vetting' and were determined to pose a very high risk to the United States, according to a statement from the White House."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tejasvi-surya-blasts-bhutto-in-us-india-gives-tech-titans-pak-terrorists-glbs-2735921-2025-06-05",
      "headline": "Tejasvi Surya blasts Bhutto in US: India gives tech titans, Pak gives terroristsBJP MP Tejasvi Surya slammed Pakistan's image, contrasting Indian achievers with terrorists, mocked its Chinese arms dependency, and declared global support firmly behind India. He accused Pakistan of playing the victim abroad while arming itself with low-grade Chinese weaponry."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-compensation-rupees-10-lakh-2736198-2025-06-05",
      "headline": "RCB announces Rs 10 lakh each for families of 11 victims, to create fund to support fans injured in stampedeRCB announces Rs 10 lakh each for families of 11 victims, to create fund to support fans injured in stampede"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachithra-senanayake-match-fixing-lanka-premier-league-2736197-2025-06-05",
      "headline": "Former KKR spinner indicted for match-fixing in Lanka Premier LeagueFormer Sri Lanka off-spinner Sachithra Senanayake, who was part of the Kolkata Knight Riders in IPL 2013, has been indicted for attempting to lure a fellow player into match-fixing during the 2020 edition of the Lanka Premier League (LPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wpl-womens-cricket-revenues-2736174-2025-06-05",
      "headline": "Support for WPL shows that women's cricket can generate revenues: Smriti MandhanaSmriti Mandhana said the growth of the Women's Premier League (WPL) shows that women's cricket has progressed and people are now willing to invest in the women's game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-pep-guardiola-third-place-finish-2736162-2025-06-05",
      "headline": "Manchester City's 3rd place finish in 2024/25 better than title win: Pep GuardiolaPep Guardiola has dismissed the notion that the 2024-25 season was disastrous and said the third-place finish was better than his last title win. City failed to win a trophy last season and barely got into the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-waited-for-only-18-years-sachin-tendulkars-wait-was-even-longer-sehwag-2736144-2025-06-05",
      "headline": "Kohli waited for only 18 years, Sachin Tendulkar's wait was even longer: SehwagFormer India cricketer Virender Sehwag has compared Virat Kohli's wait for an IPL title with Sachin Tendulkar's World Cup wait saying that the latter had to wait even longer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-squad-india-tests-jamie-overton-squad-2736124-2025-06-05",
      "headline": "England name squad for 1st India Test, all-rounder returns after 3 yearsChris Woakes, Jamie Overton and Jamie Overton made their comebacks as England named their squad for the opening Test against India to be held from June 20 at Headingley in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-press-conference-live-gautam-gambhir-shubman-gill-2736120-2025-06-05",
      "headline": "ENG vs IND, press conference LIVE: Gambhir, Shubman to address pressIndia tour of England press conference live: India's new Test captain Shubman Gill and head coach Gautam Gambhir will be addressing the press conference before leaving for England for the upcoming Test series. India and England will lock horn in a five-match series beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-smriti-mandhana-rcb-bengaluru-stampede-2736110-2025-06-05",
      "headline": "Bengaluru stampede: Mandhana heartbroken as chaos unfolds after IPL finalIndian women's cricketer Smriti Mandhana reacted to the tragic stampede outside the M Chinnaswamy Stadium in Bengaluru, which took place after Royal Challengers Bengaluru (RCB) won their maiden Indian Premier League (IPL) title by defeating Punjab Kings in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-strike-rate-rcb-title-win-cheteshwar-pujara-2736109-2025-06-05",
      "headline": "Evolved batter Virat Kohli shut down strike-rate critics in IPL 2025: Cheteshwar PujaraCheteshwar Pujara feels that Virat Kohli evolved as a batter during the IPL 2025 season and shut down his strike-rate critics with his performance. Kohli played a starring role as RCB won the IPL title for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madan-lal-blasts-rcb-over-chaotic-planning-of-ipl-victory-celebrations-2736054-2025-06-05",
      "headline": "Madan Lal blasts RCB over chaotic planning of IPL victory celebrationsFormer India cricketer and 1983 World Cup winner Madan Lal has slammed Royal Challengers Bengaluru (RCB) for their poor planning of the IPL victory celebrations in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-rajat-patidar-bengaluru-2736056-2025-06-05",
      "headline": "IPL final: Undoubtedly Virat Kohli's night, but RCB mates deserved moreVirat Kohli was undoubtedly the main man on the night of RCB's ultimate triumph. But there were others who deserved recognition as well. Kohli seemed to sense the stories left untold even in the haze of victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-press-conference-live-gautam-gambhir-shubman-gill-2736120-2025-06-05",
      "headline": "ENG vs IND, press conference LIVE: Gambhir, Shubman to address pressIndia tour of England press conference live: India's new Test captain Shubman Gill and head coach Gautam Gambhir will be addressing the press conference before leaving for England for the upcoming Test series. India and England will lock horn in a five-match series beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-smriti-mandhana-rcb-bengaluru-stampede-2736110-2025-06-05",
      "headline": "Bengaluru stampede: Mandhana heartbroken as chaos unfolds after IPL finalIndian women's cricketer Smriti Mandhana reacted to the tragic stampede outside the M Chinnaswamy Stadium in Bengaluru, which took place after Royal Challengers Bengaluru (RCB) won their maiden Indian Premier League (IPL) title by defeating Punjab Kings in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-strike-rate-rcb-title-win-cheteshwar-pujara-2736109-2025-06-05",
      "headline": "Evolved batter Virat Kohli shut down strike-rate critics in IPL 2025: Cheteshwar PujaraCheteshwar Pujara feels that Virat Kohli evolved as a batter during the IPL 2025 season and shut down his strike-rate critics with his performance. Kohli played a starring role as RCB won the IPL title for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madan-lal-blasts-rcb-over-chaotic-planning-of-ipl-victory-celebrations-2736054-2025-06-05",
      "headline": "Madan Lal blasts RCB over chaotic planning of IPL victory celebrationsFormer India cricketer and 1983 World Cup winner Madan Lal has slammed Royal Challengers Bengaluru (RCB) for their poor planning of the IPL victory celebrations in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-rajat-patidar-bengaluru-2736056-2025-06-05",
      "headline": "IPL final: Undoubtedly Virat Kohli's night, but RCB mates deserved moreVirat Kohli was undoubtedly the main man on the night of RCB's ultimate triumph. But there were others who deserved recognition as well. Kohli seemed to sense the stories left untold even in the haze of victory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}