{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cabinet-approves-rs-7280-crore-scheme-to-promote-manufacturing-of-rare-earth-magnets-2826354-2025-11-26",
      "headline": "Cabinet clears Rs 7,280 crore rare earths scheme amid China's export curbsThe government has cleared a financial outlay of Rs 7,280 crore to set up 6,000 metric tonnes per year of fully integrated REPM manufacturing capacity in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-take-home-pay-drop-new-labour-code-basic-salary-allowance-2826385-2025-11-26",
      "headline": "Will the new labour codes cut your in-hand salary? Here's the mathNow that the new labour codes are in force and wages are being recalculated, will your monthly take-home salary take a hit?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/most-rise-in-home-real-estate-prices-not-mumbai-bengaluru-pune-but-delhi-ncr-luxury-housing-affordable-flats-2826373-2025-11-26",
      "headline": "Not Mumbai, Bengaluru or Pune, this city has seen sharpest rise in home pricesNew data from ANAROCK shows that one city has pulled far ahead of Mumbai, Bengaluru and Pune to record the sharpest rise in home prices across almost every budget segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/newly-married-insurance-guide-life-health-for-couples-2826312-2025-11-26",
      "headline": "Newly married? Here's the insurance playbook every couple needsBig life changes often bring financial blind spots. For newlyweds, reviewing insurance early is a simple step that keeps their plans on track as they start their new chapter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1000-points-up-nifty-above-26200-ril-gains-2-percent-2826309-2025-11-26",
      "headline": "Sensex ends 1,000 points up, Nifty above 26,200; RIL gains 2%The S&P BSE Sensex jumped 1,022.50 points to close at 85,609.51, while the NSE Nifty50 gained 320.50 points to end at 26,205.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-are-gold-and-silver-prices-rising-again-this-week-2826268-2025-11-26",
      "headline": "Why are gold and silver prices rising again this week?Prices of gold and silver have moved up once more, with global economic signals and firmer market demand driving this renewed momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/air-pollution-health-insurance-costlier-premiums-risk-explained-2826252-2025-11-26",
      "headline": "Will worsening air quality make your health insurance premium costlier?As pollution worsens across Indian cities, are health insurers preparing to charge residents more for risks they cannot control? The big question now is how soon premiums will change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-accurately-calculate-your-pf-balance-without-logging-in-2826225-2025-11-26",
      "headline": "PF balance check: How to calculate it without logging inChecking your PF balance no longer requires a portal login. Several quick offline and mobile-based tools now let you check it instantly using just your phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-planning-fixed-deposits-risks-inflation-strategy-explained-2826188-2025-11-26",
      "headline": "The retirement mistake that quietly burns your savingsMany retirees feel safest locking their life savings into fixed deposits. Financial planners warn that this comfort comes at a cost, as inflation and low returns can quietly weaken long-term retirement wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delays-explained-income-tax-department-shares-expected-timeline-2826167-2025-11-26",
      "headline": "ITR refund delays explained: Tax department shares expected timelineSeveral taxpayers who filed their returns months ago are still waiting for refunds. The tax department has now explained the reasons and shared when refunds are expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-up-why-reasons-us-fed-rate-cut-optimism-crude-oil-wall-street-bse-nse-2826141-2025-11-26",
      "headline": "Bull run on Dalal Street: 5 reasons why Sensex, Nifty jumped todayThe S&P BSE Sensex jumped 751.75 points to 85,338.76, while the NSE Nifty50 rose 237.25 points to 26,122.05 by 11:08 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-confusing-investment-tools-with-goals-are-costing-you-2826132-2025-11-26",
      "headline": "How confusing investment tools with goals is costing youIt's easy to fall for traps with exciting returns, lifestyle upgrades, peer pressure or the \"this stock is the next big thing\" buzz. But life rarely hands you one challenge at a time. School fees, a home loan, a parent's health emergency or an unexpected crisis – they can all come together. Hence, relying on just one tool is like trying to build a house with no foundation – one storm and the whole thing collapses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-share-price-down-why-3-percent-block-deal-35-crore-shares-indian-continent-investment-singtel-2826094-2025-11-26",
      "headline": "Explained: Why Bharti Airtel shares are down 3% todayBharti Airtel share price: Around 3.5 crore shares, equal to nearly 0.6% of Airtel's equity, were traded at Rs 2,108 apiece in the block deal window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-nearly-200-points-higher-nifty-above-25900-airtel-down-3-percent-2826061-2025-11-26",
      "headline": "Sensex opens nearly 200 points up, Nifty above 25,900; Airtel down 3%The S&P BSE Sensex added 274.90 points to 84,861.91, while the NSE Nifty50 gained 83.25 points to 25,968.05 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-allotment-status-check-bse-mufg-online-guide-listing-date-latest-gmp-2826058-2025-11-26",
      "headline": "Sudeep Pharma IPO allotment today: Step-by-step status check and listing dateThe three-day subscription window, which closed on November 25, saw the IPO race towards nearly 100 times subscription, reflecting strong interest across investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-listing-today-expected-share-price-stock-open-higher-lower-latest-gmp-2826041-2025-11-26",
      "headline": "Excelsoft Technologies IPO listing today: Will the stock open higher or lower?The allotment of shares was completed on November 24, and with the kind of subscription numbers the company has posted, many retail investors are hoping for a firm opening on the exchanges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-may-hike-prices-early-next-quarter-2825935-2025-11-25",
      "headline": "Tata Motors may hike prices early next quarterChandra said Tata Motors currently holds 16–17 per cent share in the SUV segment, and the Sierra is expected to lift this to 20–25 per cent once fully ramped up."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-november-russian-oil-imports-set-to-hit-five-month-high-amid-us-tariffs-2825865-2025-11-25",
      "headline": "India's November Russian oil imports set to hit 5-month high amid US tariffsIndia, the world's third-largest oil importer, has been the biggest buyer of discounted seaborne Russian crude after Russia was shunned by Western countries following its 2022 invasion of Ukraine.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-314-points-lower-nifty-below-26000-infosys-down-1-percent-2825677-2025-11-25",
      "headline": "Sensex closes 314 points lower, Nifty below 26,000; Infosys down 1%The S&P BSE Sensex lost 313.70 points to close at 84,587.01, while the NSE Nifty50 was down by 74.70 points to end at 25,884.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-code-implementation-do-new-codes-hit-narayana-murthy-9-9-6-dreams-work-life-balance-working-hours-2825644-2025-11-25",
      "headline": "Do new Labour Codes hit Narayana Murthy's 9-9-6 dreams?India's new Labour Codes cap workweeks at 48 hours, with flexibility on scheduling, overtime pay, and a mandatory day of rest. But as industry leaders like Narayana Murthy push for 72-hour weeks and L&T's SN Subrahmanyan praises 90-hour schedules, many are raising questions whether these reforms will hold ground in a culture where overwork is routine."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhanush-shares-serene-varanasi-pics-with-kriti-sanon-ahead-of-tere-ishk-mein-release-2826544-2025-11-26",
      "headline": "Dhanush shares serene Varanasi pics with Kriti Sanon ahead of Tere Ishk Mein release Dhanush shared a heartfelt moment from Tere Ishk Mein promotions in Varanasi, posting joyful photos with Kriti Sanon and director Aanand L Rai. The devotional note and warm camaraderie come as the film's advance bookings soar ahead of its 2025 release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-discharged-after-health-scare-wedding-remains-postponed-2826536-2025-11-26",
      "headline": "Palaash Muchhal discharged after health scare, wedding remains postponed Palaash Muchhal has been discharged from the hospital. He was admitted following stress-related complications that arose after his wedding to Smriti Mandhana was put on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vin-diesel-praises-dwayne-johnson-the-smashing-machine-hints-at-end-of-feud-2826506-2025-11-26",
      "headline": "Vin Diesel praises Dwayne Johnson's The Smashing Machine, hints at end of feud Vin Diesel ended his feud with Dwayne Johnson, praising the actor's commitment to the 'Fast' franchise and celebrating his moving performance in 'The Smashing Machine' (2025) while sharing personal anecdotes about their dynamic pairing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-twinkle-khanna-say-two-much-landed-them-in-trouble-admit-disclaimer-lapse-2826500-2025-11-26",
      "headline": "Kajol, Twinkle say Two Much landed them in trouble, admit disclaimer lapse Twinkle Khanna and Kajol acknowledged that their talk show 'Two Much' led to controversy in the bonus episode. The duo said that they should have included a disclaimer from the beginning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-stars-rank-seasons-expose-the-messiest-castmate-ahead-of-final-2826507-2025-11-26",
      "headline": "Stranger Things stars rank seasons, expose the messiest castmate ahead of final Ahead of the 'Stranger Things' Season 5 premiere, the cast shared hilarious behind-the-scenes stories and playful banter during an interview, teasing fans with nostalgia and excitement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-not-based-on-major-mohit-sharma-aditya-dhar-sets-the-record-straight-2826508-2025-11-26",
      "headline": "Dhurandhar not based on Major Mohit Sharma: Aditya Dhar sets the record straight After Major Mohit Sharma's brother raised concerns, director Aditya Dhar clarified that Dhurandhar is not based on the late soldier's life. The film stars Ranveer Singh in a still-undisclosed role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-celebrates-kireedam-4k-world-premiere-at-iffi-calls-it-an-honour-2826489-2025-11-26",
      "headline": "Mohanlal celebrates Kireedam 4K world premiere at IFFI, calls it an honour The 56th International Film Festival of India in Goa featured the world premiere of the 4K-restored classic Malayalam film Kireedam, with actor Mohanlal expressing his appreciation for the efforts to preserve Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/eight-hour-workday-demand-indian-film-industry-keerthy-suresh-insights-2826404-2025-11-26",
      "headline": "Keerthy Suresh explains why an eight-hour workday is vital for film crews Actor Keerthy Suresh discussed the debate on standardising an eight-hour workday for film crews and actors, highlighting differences across Indian film industries and the impact on work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-jailer-2-gets-bigger-vijay-sethupathi-joins-cast-report-2826482-2025-11-26",
      "headline": "Rajinikanth's Jailer 2 gets bigger, Vijay Sethupathi joins cast: Report Jailer 2, the sequel to the 2023 blockbuster, is growing bigger by the day, with fresh reports hinting that Vijay Sethupathi has joined the Rajinikanth-starrer, marking a potential reunion after Petta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-longest-hindi-film-in-17-years-says-report-see-runtime-2826477-2025-11-26",
      "headline": "Ranveer Singh's Dhurandhar has duration of over 3 hours. Check out exact runtime Director Aditya Dhar's spy-thriller 'Dhurandhar', already split into two parts due to its vast story, is now anticipated to be one of the longest Hindi films in 17 years, with Part 1 reportedly clocking a runtime of more than 3 hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-bijlani-slams-paparazzi-for-insensitive-coverage-after-dharmendra-death-2826485-2025-11-26",
      "headline": "Arjun Bijlani slams paparazzi for insensitive coverage after Dharmendra's death Celebrities including Arjun Bijlani, Karan Johar, Ameesha Patel and Amitabh Bachchan criticised the paparazzi for their intrusive behaviour while the Deol family mourned Dharmendra's passing. The incident sparked a larger conversation about media ethics, dignity and privacy during moments of personal grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bhumi-pednekar-daldal-prime-video-first-look-unveiled-56th-international-film-festival-of-india-2826456-2025-11-26",
      "headline": "Bhumi Pednekar's Daldal first look unveiled at IFFI. Details inside The first look of Bhumi Pednekar's new series 'Daldal' was revealed at a special event during the 56th International Film Festival of India. The actor delved deeper into how she prepared for the role during a fireside chat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kapil-sharma-opens-up-on-triple-shooting-at-his-canada-cafe-calls-mumbai-safest-2826470-2025-11-26",
      "headline": "Kapil Sharma opens up on triple shooting at his Canada cafe, calls Mumbai safest Kapil Sharma reacted to the triple shooting at his Canada-based Kaps Cafe, calling Mumbai the safest place for him. The comedian shared how the incident reached Canada's parliament and prompted law-and-order action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-on-why-he-made-they-call-him-og-fans-felt-hurt-so-i-did-it-for-them-2826435-2025-11-26",
      "headline": "Pawan Kalyan on why he made They Call Him OG: Fans felt hurt, so I did it for them At a public meeting in Razole, Pawan Kalyan revealed that he completed 'They Call Him OG' only because fans urged him not to step away from cinema entirely while pursuing politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-kartik-aaryan-to-begin-their-third-film-after-naagzilla-report-2826425-2025-11-26",
      "headline": "Karan Johar-Kartik Aaryan to begin their third film after Naagzilla: Report Karan Johar and Kartik Aaryan expand their professional partnership with a third film set for August 2026, as new details surface on the upcoming fantasy film Naagzilla and its planned franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-harsh-mehta-dating-rumours-airport-2025-2826363-2025-11-26",
      "headline": "Malaika Arora's appearance with friend at Mumbai Airport sparks buzz Malaika Arora's recent appearance at the Mumbai airport has reignited public curiosity about her personal life. She was accompanied by the same individual seen with her at the Enrique Iglesias concert last month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidhu-vinod-chopra-abuses-content-creators-slams-casting-process-at-iffi-goa-2025-2826403-2025-11-26",
      "headline": "Vidhu Vinod Chopra abuses content creators; slams casting process at IFFI Goa 2025 During his IFFI masterclass, filmmaker Vidhu Vinod Chopra vehemently attacked social media influencers, questioning their talent and branding power while criticising casting directors for prioritising digital followers over genuine dedication to the craft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nandamuri-balakrishna-nbk-111-gopichand-malineni-launched-first-look-2826352-2025-11-26",
      "headline": "Nandamuri Balakrishna's NBK 111 with Gopichand Malineni launched. See first look Balakrishna's next big film, the historical epic NBK 111, was launched with a grand pooja ceremony, reuniting the actor with director Gopichand Malineni and marking his fourth collaboration with Nayanthara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/arnold-vosloo-vijay-deverakonda-vd14-british-officer-villain-period-thriller-2826360-2025-11-26",
      "headline": "The Mummy villain Arnold Vosloo shoots for Vijay Devarakonda's period drama VD14 Hollywood actor Arnold Vosloo, best known for his role as the antagonist in The Mummy, was spotted in India, reportedly shooting for Vijay Devarakonda's upcoming period drama tentatively titled 'VD 14'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-1011-the-explosive-truth-how-the-red-fort-car-bomb-ingredients-were-sourced-so-easily-2826537-2025-11-26",
      "headline": "Exclusive: How Delhi's Red Fort car bomb ingredients were sourced so easilyAn India Today sting investigation shows how farm outlets allegedly fudge land records to show bulk sales of fertilisers, unaware of their potential use in crude car bombs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-has-no-moral-standing-to-lecture-others-government-rejects-remarks-on-ram-temple-flag-hoisting-2826480-2025-11-26",
      "headline": "No moral standing to lecture: India slams Pak's remarks on Ram Mandir flag-hoistingPakistan had called the Ram Mandir flag-hoisting by Prime Minister Narendra Modi an example of \"Islamophobia\" and \"heritage desecration\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ahmedabad-announced-official-host-city-commonwealth-games-2030-2826474-2025-11-26",
      "headline": "Ahmedabad announced as official host city of Commonwealth Games 2030India were announced as the hosts for the Commonwealth Games 2030. Ahmedabad is set to host the competition. The centenary edition is set to feature between 15-17 sports disciplines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-races-to-be-global-rare-earths-magnet-repm-with-rs-7300-crore-plan-china-dependence-ev-fighter-jet-semiconductors-2826495-2025-11-26",
      "headline": "How India's Rs 7,280-crore rare earths plan will help it escape China chokeholdThe Cabinet on Wednesday cleared a Rs 7,280-crore rare earth permanent magnet (REPM) scheme to cut import dependence on China. The 7-year plan isn't just crucial for the EV, wind energy, electronics and defence sectors, it will help New Delhi geopolitically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-longest-hindi-film-in-17-years-says-report-see-runtime-2826477-2025-11-26",
      "headline": "Ranveer Singh's Dhurandhar has duration of over 3 hours. Check out exact runtimeDirector Aditya Dhar's spy-thriller 'Dhurandhar', already split into two parts due to its vast story, is now anticipated to be one of the longest Hindi films in 17 years, with Part 1 reportedly clocking a runtime of more than 3 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-warns-china-over-arunachal-woman-harassment-any-arbitrary-action-harms-trust-2826493-2025-11-26",
      "headline": "India warns China over Arunachal woman harassment: Any arbitrary action harms trustAddressing a press briefing in New Delhi, Ministry of External Affairs spokesperson Randhir Jaiswal said that India had issued a \"strong demarche\" and raised the issue with the Chinese side both in Delhi and Beijing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uidai-disables-over-2-crore-aadhaar-ids-of-dead-people-in-major-database-clean-up-2826365-2025-11-26",
      "headline": "Big Aadhaar clean-up: Centre disables 2 crore IDs of dead peopleUIDAI carried out the deactivations after matching Aadhaar records with death registrations and other data received from the Registrar General of India, state governments and several central ministries and departments. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/imran-khan-sisters-demand-impartial-probe-police-assault-adiala-jail-2826413-2025-11-26",
      "headline": "Dragged on streets: Imran Khan's sisters allege police assault during jail protestVideos posted on social media platform X showed PTI workers and Imran Khan's sisters gathered around their sibling Noreen, who appeared visibly shaken. Aleema Khan remarked, \"Those women were dragging her on the road,\" as Noreen's hands trembled in the footage shared by Imran Khan's party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/prayagraj-bride-leads-her-own-baraat-viral-video-delights-internet-2826517-2025-11-26",
      "headline": "Prayagraj bride leads her own baraat in style, viral video delights InternetA video of a bride in Uttar Pradesh's Prayagraj leading her own baraat has gone viral, with viewers calling it one of the season's most memorable wedding highlights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sack-india-vs-south-africa-2826526-2025-11-26",
      "headline": "12 mahine me do baar: India's home Test problem is of their own makingThe Indian cricket team has lost their second home Test series under the coaching of Gautam Gambhir. Last year it was 12 saal me ek baar. But now under Gambhir's coaching, is this going to become the new normal?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/imran-khan-health-rumours-viral-amid-reports-of-ex-pak-pm-in-solitary-confinement-2826306-2025-11-26",
      "headline": "Imran Khan health rumours viral amid reports of ex-Pak PM in solitary confinementImran Khan has been lodged in a prison in Rawalpindi since January 2025, where he has often complained of mistreatment and harassment by jail authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/joe-rogan-raves-about-ellora-kailasa-temple-carved-top-to-bottom-monolith-rock-here-why-it-is-unique-2826186-2025-11-26",
      "headline": "Fu***ng insane: Joe Rogan raves about Kailasa Temple. Here's why it's uniqueTop American influencer and podcast host Joe Rogan raved about the Kailasa Temple in Maharashtra, saying his \"mind was blown\" by its symmetry and architecture. The 8th-century temple is the world's largest monolithic structure, carved top-down from a single rock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-visa-fraud-india-chennai-consulate-claims-exceed-cap-glbs-2825994-2025-11-26",
      "headline": "Chennai got 220,000 H-1B visas: US economist alleges massive fraud in India's capThe former US Representative alleged that the H-1B system had been \"captured by industrial-scale fraud\", asserting that visa allocations from India had reached levels that defied statutory limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/please-wait-ill-call-you-rahul-gandhis-whatsapp-text-to-dk-shivakumar-amid-tussle-2826178-2025-11-26",
      "headline": "Rahul Gandhi's text to Shivakumar ahead of Congress's Dec 1 decision on Karnataka CMAmid Karnataka's leadership tussle and a decision due before the December 1 Parliament session, Rahul Gandhi replied to DK Shivakumar saying, \"Please wait, I will call you.\" DK Shivakumar is also seeking a meeting with Sonia Gandhi on November 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uri-hydro-plant-attack-pakistan-cisf-foiled-operation-sindoor-2826089-2025-11-26",
      "headline": "The 19 Bahadur: How CISF foiled Pakistan attack on Uri hydro plantUri Pakistan attack: After India launched Operation Sindoor, Pakistan targeted the Uri hydroelectric power projects in Jammu and Kashmir. However, a CISF team of 19 foiled the Pakistani attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-brother-in-law-jeet-pabari-dies-suicide-2826554-2025-11-26",
      "headline": "Cheteshwar Pujara's brother-in-law Jeet Pabari dies by suicideJeet Pabari, brother-in-law of former India cricketer Cheteshwar Pujara, died by suicide at his Rajkot home on Wednesday. Police have begun an investigation and are awaiting statements from family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-suspends-sports-officer-as-2-basketball-players-die-in-separate-accidents-2826337-2025-11-26",
      "headline": "Haryana suspends sports official after 2 basketball players die in freak accidentsSports Minister Gaurav Gautam has ordered a high-level review on November 28 and issued strict directives for immediate inspections, removal of unsafe equipment and personal accountability for lapses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/grap-iii-measures-in-delhi-ncr-revoked-as-air-quality-slightly-improves-2826494-2025-11-26",
      "headline": "GRAP-III revoked as Delhi AQI improves, curbs under Stage 1, 2 intensifiedThe CAQM has revoked GRAP Stage III curbs in Delhi-NCR as air quality improved, though Stage I and II measures will continue with stricter enforcement. Construction sites previously shut for violations will remain closed until cleared by the Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/us-professional-degree-rule-may-hurt-women-dominated-fields-the-most-2826299-2025-11-26",
      "headline": "US may strip 'professional' status from key degrees. Women-ruled fields hit hardestThe US Education Department's draft rule redefining \"professional degrees\" could strip nursing, social work, public health and teacher-prep programmes of higher federal loan caps from July 2026. Because these fields are overwhelmingly women-dominated, the change triggers a gendered impact — and major pushback from universities and professional bodies nationwide."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hong-kong-tai-po-fire-kills-high-rise-flats-bamboo-scaffolding-2826383-2025-11-26",
      "headline": "13 killed, 700 evacuated as fire engulfs high-rise buildings in Hong KongA massive blaze tore through seven high-rise blocks in Hong Kong's Tai Po district, killing 13 people, injuring at least 15 and leaving hundreds displaced as firefighters battled the level-5 alarm inferno through the night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-temba-bavuma-press-conference-2826347-2025-11-26",
      "headline": "Asked about coach's grovel remark, Temba Bavuma serves 'bauna' reminder to IndiaIND vs SA: South Africa captain Temba Bavuma attended the press conference after the team's series win against India. Bavuma in his fiery press conference said that there were certain players who crossed the line in this series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-discharged-after-health-scare-wedding-remains-postponed-2826536-2025-11-26",
      "headline": "Palaash Muchhal discharged after health scare, wedding remains postponedPalaash Muchhal has been discharged from the hospital. He was admitted following stress-related complications that arose after his wedding to Smriti Mandhana was put on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhanush-shares-serene-varanasi-pics-with-kriti-sanon-ahead-of-tere-ishk-mein-release-2826544-2025-11-26",
      "headline": "Dhanush shares serene Varanasi pics with Kriti Sanon ahead of Tere Ishk Mein releaseDhanush shared a heartfelt moment from Tere Ishk Mein promotions in Varanasi, posting joyful photos with Kriti Sanon and director Aanand L Rai. The devotional note and warm camaraderie come as the film's advance bookings soar ahead of its 2025 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vin-diesel-praises-dwayne-johnson-the-smashing-machine-hints-at-end-of-feud-2826506-2025-11-26",
      "headline": "Vin Diesel praises Dwayne Johnson's The Smashing Machine, hints at end of feudVin Diesel ended his feud with Dwayne Johnson, praising the actor's commitment to the 'Fast' franchise and celebrating his moving performance in 'The Smashing Machine' (2025) while sharing personal anecdotes about their dynamic pairing."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-brother-in-law-jeet-pabari-dies-suicide-2826554-2025-11-26",
      "headline": "Cheteshwar Pujara's brother-in-law Jeet Pabari dies by suicide Jeet Pabari, brother-in-law of former India cricketer Cheteshwar Pujara, died by suicide at his Rajkot home on Wednesday. Police have begun an investigation and are awaiting statements from family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-decline-south-africa-historic-series-win-guwahati-2826547-2025-11-26",
      "headline": "From WTC finalists to home punching bags: How India fell from grace in Tests From dominating visiting sides to being overpowered on their own pitches, India's Test decline has been as swift as it is shocking. With roles unclear and identity uncertain, the once-formidable home fortress has become just another venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sack-india-vs-south-africa-2826526-2025-11-26",
      "headline": "12 mahine me do baar: India's home Test problem is of their own making The Indian cricket team has lost their second home Test series under the coaching of Gautam Gambhir. Last year it was 12 saal me ek baar. But now under Gambhir's coaching, is this going to become the new normal?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-top-five-sporting-nation-mandaviya-cwg-2030-ahmedabad-2826535-2025-11-26",
      "headline": "India to be top 5 sporting nation by 2047: Sports Minister after CWG 2030 nod Sports Minister Mansukh Mandaviya says India will become a top-five sporting nation by 2047, reacting to the confirmation of Ahmedabad as host of the 2030 Commonwealth Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-commonwealth-games-pm-narendra-modi-reaction-2826532-2025-11-26",
      "headline": "Looking forward to welcoming the world: PM Modi reacts to India hosting CWG 2030 India has officially won the bid to host the Centenary Commonwealth Games in 2030. This historic event marks a significant milestone for Indian sports and international camaraderie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-whitewash-south-africa-gautam-gambhir-criticism-ashwin-2826520-2025-11-26",
      "headline": "Gautam Gambhir is not my relative, but…: R Ashwin defends coach amid severe backlash IND vs SA: India's latest 0-2 home Test series loss to South Africa has intensified criticism of head coach Gautam Gambhir, even as R Ashwin defended him and urged players to take greater responsibility for the team's ongoing slump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-dinesh-karthik-teams-not-scared-of-touring-india-2826513-2025-11-26",
      "headline": "Teams were scared when touring India, now must be licking their lips: Dinesh Karthik Dinesh Karthik says India has lost their aura when playing at home, after a second Test whitewash in 12 months, urging clarity, stability and tougher decisions to fix the team's red-ball decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/its-official-ahmedabad-to-host-2030-commonwealth-games-after-indias-successful-bid-ytvd-2826502-2025-11-26",
      "headline": "It's Official: Ahmedabad To Host 2030 Commonwealth Games After India's Successful Bid This news bulletin reports on the official confirmation that Ahmedabad, India, will host the 2030 Commonwealth Games in October 2030. The report notes that the decision was finalized after a successful campaign by India, with the Indian Olympic Association delegation present at a board meeting in Glasgow where the decision was made. The bulletin highlights this as a significant moment for the country, which previously hosted the games in 2010. A reporter on the ground clarifies that while hosting was previously recommended, the official announcement has now been made, with the bulletin stating, 'the Commonwealth Games will be held in Ahmedabad in Gujarat'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-struggles-calls-specialist-red-ball-coach-south-africa-series-defeat-2826469-2025-11-26",
      "headline": "India need a specialist red-ball coach: DC co-owner wants Gautam Gautam to be axed Delhi Capitals co-owner Parth Jindal has urged the BCCI to appoint a specialist coach for India's Test side after a 2-0 series loss to South Africa exposed the team's red-ball weaknesses under Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ahmedabad-announced-official-host-city-commonwealth-games-2030-2826474-2025-11-26",
      "headline": "Ahmedabad announced as official host city of Commonwealth Games 2030 India were announced as the hosts for the Commonwealth Games 2030. Ahmedabad is set to host the competition. The centenary edition is set to feature between 15-17 sports disciplines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-basketball-pole-collapse-two-teen-deaths-vinesh-phogat-negligence-2826428-2025-11-26",
      "headline": "Death of Haryana basketball players not accident, but negligence: Vinesh Phogat Veteran wrestler Vinesh Phogat condemned administrative negligence after two teenage basketball players died in Haryana within 48 hours, prompting the suspension of Rohtak's sports officer and a statewide safety review.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-dinesh-karthik-teams-not-scared-of-touring-india-2826513-2025-11-26",
      "headline": "Teams were scared when touring India, now must be licking their lips: Dinesh Karthik Dinesh Karthik says India has lost their aura when playing at home, after a second Test whitewash in 12 months, urging clarity, stability and tougher decisions to fix the team's red-ball decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/its-official-ahmedabad-to-host-2030-commonwealth-games-after-indias-successful-bid-ytvd-2826502-2025-11-26",
      "headline": "It's Official: Ahmedabad To Host 2030 Commonwealth Games After India's Successful Bid This news bulletin reports on the official confirmation that Ahmedabad, India, will host the 2030 Commonwealth Games in October 2030. The report notes that the decision was finalized after a successful campaign by India, with the Indian Olympic Association delegation present at a board meeting in Glasgow where the decision was made. The bulletin highlights this as a significant moment for the country, which previously hosted the games in 2010. A reporter on the ground clarifies that while hosting was previously recommended, the official announcement has now been made, with the bulletin stating, 'the Commonwealth Games will be held in Ahmedabad in Gujarat'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-struggles-calls-specialist-red-ball-coach-south-africa-series-defeat-2826469-2025-11-26",
      "headline": "India need a specialist red-ball coach: DC co-owner wants Gautam Gautam to be axed Delhi Capitals co-owner Parth Jindal has urged the BCCI to appoint a specialist coach for India's Test side after a 2-0 series loss to South Africa exposed the team's red-ball weaknesses under Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ahmedabad-announced-official-host-city-commonwealth-games-2030-2826474-2025-11-26",
      "headline": "Ahmedabad announced as official host city of Commonwealth Games 2030 India were announced as the hosts for the Commonwealth Games 2030. Ahmedabad is set to host the competition. The centenary edition is set to feature between 15-17 sports disciplines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-basketball-pole-collapse-two-teen-deaths-vinesh-phogat-negligence-2826428-2025-11-26",
      "headline": "Death of Haryana basketball players not accident, but negligence: Vinesh Phogat Veteran wrestler Vinesh Phogat condemned administrative negligence after two teenage basketball players died in Haryana within 48 hours, prompting the suspension of Rohtak's sports officer and a statewide safety review.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-gautam-gambhir-booed-whitewash-south-africa-fans-video-2826399-2025-11-26",
      "headline": "Gautam Gambhir hay hay: Fans let it rip after India's horror-show in GuwahatiGautam Gambhir was given no mercy by the fans after their shocking defeat to South Africa in Guwahati which resulted in a second whitewash on home soil in his coaching tenure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-target-alyssa-healy-wpl-2026-auction-2826378-2025-11-26",
      "headline": "Alyssa Healy can't be overlooked, DC likely to eye her in auction: Anjum ChopraFormer Indian batter Anjum Chopra suggested that the Delhi Capitals may target Alyssa Healy for the wicketkeeping and leadership role in the upcoming WPL auction to be held in New Delhi on November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-gautam-gambhir-slammed-all-rounder-obsession-2826355-2025-11-26",
      "headline": "IND v SA: Gautam Gambhir slammed for embarrassing obsession with all-roundersIndia's head coach, Gautam Gambhir, faced the heat from former cricketers for his obsession with all-rounders as India succumbed to a second Test whitewash on home turf under his tenure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-temba-bavuma-press-conference-2826347-2025-11-26",
      "headline": "Asked about coach's grovel remark, Temba Bavuma serves 'bauna' reminder to IndiaIND vs SA: South Africa captain Temba Bavuma attended the press conference after the team's series win against India. Bavuma in his fiery press conference said that there were certain players who crossed the line in this series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-series-guwahati-record-stats-2826334-2025-11-26",
      "headline": "India unravel at home, Bavuma unbeaten: South Africa's 2-0 whitewash in numbersIND vs SA, 2nd Test: India slumped to a 0-2 defeat in the Test series against South Africa. On Wednesday, the hosts slumped to a 408-run defeat in the second Test at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/gautam-gambhir-defiant-after-0-2-defeat-still-the-guy-who-won-champions-trophy-2826321-2025-11-26",
      "headline": "Gautam Gambhir defiant after 0-2 defeat: Still the guy who won Champions TrophyIndia vs South Africa, 2nd Test: Speaking to the press, head coach Gautam Gambhir conceded that India were below-par in the series defeat to South Africa. However, he remained defiant when asked about his future as Test coach, saying he is still the guy under whom India won the Champions Trophy, the Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-dressage-team-wins-silver-asian-equestrian-championships-2025-2826311-2025-11-26",
      "headline": "India win silver at Asian Equestrian Championships 2025 in PattayaThe Indian dressage team delivered an exceptional performance at the Asian Equestrian Championship 2025 held in Pattaya, Thailand, winning the silver medal in the team finals. While Thailand secured the gold, Hong Kong bagged the bronze medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gambhir-under-fire-after-indias-historic-2-0-test-whitewash-by-south-africa-at-home-ytvd-2826314-2025-11-26",
      "headline": "Gambhir Under Fire After India's Historic 2-0 Test Whitewash By South Africa At HomeThis special report covers the fallout from Team India's 2-0 Test series whitewash at home against South Africa, a historic defeat that marks the team's second consecutive home series whitewash in the last 12 months. The programme focuses on the response of head coach Gautam Gambhir, who, while accepting blame, has termed the loss a collective failure of the dressing room. India Today's Nikhil Narz analyses the situation, describing it as one of the lowest points in Indian cricket and questioning the coach's team selection and strategies. Gambhir stated, 'I have said it before as well that we win together, we lose together'. The discussion also highlights India's precarious position in the current World Test Championship cycle following the defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-series-guwahati-record-stats-2826334-2025-11-26",
      "headline": "India unravel at home, Bavuma unbeaten: South Africa's 2-0 whitewash in numbersIND vs SA, 2nd Test: India slumped to a 0-2 defeat in the Test series against South Africa. On Wednesday, the hosts slumped to a 408-run defeat in the second Test at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/gautam-gambhir-defiant-after-0-2-defeat-still-the-guy-who-won-champions-trophy-2826321-2025-11-26",
      "headline": "Gautam Gambhir defiant after 0-2 defeat: Still the guy who won Champions TrophyIndia vs South Africa, 2nd Test: Speaking to the press, head coach Gautam Gambhir conceded that India were below-par in the series defeat to South Africa. However, he remained defiant when asked about his future as Test coach, saying he is still the guy under whom India won the Champions Trophy, the Asia Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-dressage-team-wins-silver-asian-equestrian-championships-2025-2826311-2025-11-26",
      "headline": "India win silver at Asian Equestrian Championships 2025 in PattayaThe Indian dressage team delivered an exceptional performance at the Asian Equestrian Championship 2025 held in Pattaya, Thailand, winning the silver medal in the team finals. While Thailand secured the gold, Hong Kong bagged the bronze medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gambhir-under-fire-after-indias-historic-2-0-test-whitewash-by-south-africa-at-home-ytvd-2826314-2025-11-26",
      "headline": "Gambhir Under Fire After India's Historic 2-0 Test Whitewash By South Africa At HomeThis special report covers the fallout from Team India's 2-0 Test series whitewash at home against South Africa, a historic defeat that marks the team's second consecutive home series whitewash in the last 12 months. The programme focuses on the response of head coach Gautam Gambhir, who, while accepting blame, has termed the loss a collective failure of the dressing room. India Today's Nikhil Narz analyses the situation, describing it as one of the lowest points in Indian cricket and questioning the coach's team selection and strategies. Gambhir stated, 'I have said it before as well that we win together, we lose together'. The discussion also highlights India's precarious position in the current World Test Championship cycle following the defeat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-press-conference-fans-scrutiny-india-loss-test-series-south-africa-2826291-2025-11-26",
      "headline": "Sack Gautam Gambhir for his press conference alone: Fans slam defiant head coachIndia vs South Africa: Fans have slammed India head coach Gautam Gambhir after the 0-2 series whitewash to South Africa, with many saying he \"deserved to be sacked\" for what they described as an arrogant and defiant post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-sack-2826239-2025-11-26",
      "headline": "Sack Gambhir? Pressure mounts as India lose Test series 0–2 to South AfricaIND vs SA: India have been blanked at home for the second time in the Gautam Gambhir era. The calls for sacking the head coach are louder than ever after India surrendered at home against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-guatam-gambhir-press-conference-2826243-2025-11-26",
      "headline": "Still the right man for Test job? Up to the BCCI to decide, says Gautam GambhirGautam Gambhir faced tough media questions after India's 0-2 Test series loss to South Africa in Guwahati. The defeat intensified scrutiny on his coaching as India suffer historic home whitewashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-regains-no-1-icc-odi-batting-ranking-ahead-south-africa-series-2826242-2025-11-26",
      "headline": "Rohit Sharma back to No. 1 in ODI rankings ahead of South Africa seriesFormer India captain Rohit Sharma has dethroned New Zealand star Daryl Mitchell to reclaim the top spot in the ICC ODI batting rankings ahead of the South Africa series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-india-2-0-guwahati-test-rishabh-pant-reaction-2826219-2025-11-26",
      "headline": "Can't take cricket for granted: Rishabh Pant lost for words after SA whitewashStand-in India captain Rishabh Pant cut a dejected figure as he tried to process another series whitewash at home, admitting that the hosts had been outplayed in every department after a meek surrender on Day 5 of the second Test in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-wtc-points-table-gautam-gambhir-pakistan-2826213-2025-11-26",
      "headline": "India slip behind Pakistan, drop to No.5 in WTC standings after 0–2 loss to South AfricaThe Indian team fell behind Pakistan in the World Test Championships points table after their embarrassing whitewash against South Africa. The Rishabh Pant-led team lost by 408 runs against the Proteas in the second and final Test match of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-guwahati-whitewash-score-2826202-2025-11-26",
      "headline": "Humbled at home again: India lose Guwahati Test, whitewashed 0-2 by SAIndia vs South Africa, 2nd Test: South Africa rode on Simon Harmer's sensational six-wicket haul to decimate India by 408 runs in Guwahati on Wednesday. India slumped to their second successive whitewash in a home Test series in as many years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-dhruv-jurel-fails-bat-gambhir-kumble-2826191-2025-11-26",
      "headline": "Dhruv Jurel fails: Anil Kumble rues too many experiments under Gautam GambhirIND vs SA: Youngster Dhruv Jurel, playing as a specialist batter against South Africa, failed in both Test matches. As criticism mounted on the youngster, legendary Anil Kumble came to the batter's defense and questioned India's team selection."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}