{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/elon-musks-starlink-gets-licence-from-telecom-ministry-2736847-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence from telecom ministryElon Musk's Starlink has received a crucial licence from India's telecom ministry, paving the way for its satellite internet services in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shweta-basu-prasad-reinvention-acting-pankaj-tripathi-criminal-justice-season-4-2736795-2025-06-06",
      "headline": "Shweta Basu Prasad says she is scared of repeating herself as an actorActor Shweta Basu Prasad opens up about her evolving acting choices and experience with Pankaj Tripathi in 'Criminal Justice'. She highlights the importance of reinvention and chemistry to keep storytelling fresh and engaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-sanjay-dutt-star-power-arabic-thriller-7-dogs-teaser-2736924-2025-06-06",
      "headline": "7 Dogs teaser: Salman Khan, Sanjay Dutt's powerful cameos light up Arabic thrillerSalman Khan and Sanjay Dutt featured in the power-packed teaser of the Arabic film '7 Dogs.' The video has sparked major excitement among Indian fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhanush-to-play-an-iaf-officer-in-tere-ishk-mein-pics-from-sets-spark-buzz-2736775-2025-06-06",
      "headline": "Dhanush to play an IAF officer in Tere Ishk Mein? Pics from sets spark buzzA new look of actor Dhanush has been shared from his upcoming film 'Tere Ishk Mein'. He will be sharing screen space with Kriti Sanon in the Aanand L Rai film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/preity-zinta-emotional-note-after-pbks-ipl-loss-says-will-come-back-to-finish-the-job-2736857-2025-06-06",
      "headline": "Will come back to finish the job: Preity Zinta's emotional note after PBKS IPL lossPreity Zinta has written an emotional note after her team PBKS lost the IPL final against RCB. The actor thanked fans for their support and said this year was unique."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-uncomfortable-urination-scene-shaitaan-had-to-be-authentic-2736791-2025-06-06",
      "headline": "R Madhavan recalls uncomfortable scene from Shaitaan: Had to be authenticActor R Madhavan recently recalled feeling uncomfortable while shooting the urination scene in 'Shaitaan'. The actor admitted that he tried to remain authentic despite the discomfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/lafangey-ott-show-review-emotionally-enriching-series-about-career-family-and-society-2736665-2025-06-06",
      "headline": "Lafangey review: Emotionally enriching show about career, family and societyReleased-Fri Jun 06, 2025'Lafangey', co-directed by Prem Mistry and Abhishek Yadav, is streaming on MX Player. The slice-of-life drama about youth aspirations delves into family bonding, the Indian education system and the job crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/housefull-2-shazahn-padamsee-marries-businessman-ashish-kanakia-2736845-2025-06-06",
      "headline": "Actor Shazahn Padamsee marries Ashish Kanakia in intimate wedding ceremony. PicsActor Shazahn Padamsee got married to businessman Ashish Kanakia in an intimate wedding ceremony on June 5, 2025. The dreamy celebrations were attended by close friends and family, with a post-wedding party scheduled for June 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tender-is-the-new-tough-for-leading-men-in-k-dramas-2736055-2025-06-06",
      "headline": "Tender is the new tough for leading men in K-dramasK-dramas' male leads have evolved from toxic and controlling to being kind, respectful, and emotionally mature. This shift reflects the ever-so-changing viewer's expectations and a growing focus on healthy, realistic relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddharth-anand-responds-to-akshay-kumar-collab-rumours-2736668-2025-06-06",
      "headline": "Siddharth Anand responds to Akshay Kumar collab rumours, fans left disappointedDirector Siddharth Anand denied rumours of a film with Akshay Kumar, sparking disappointment and debate among fans online. Despite reports of a potential horror collaboration, Siddharth's cryptic 'False' post only fuelled confusion and speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyuns-global-rise-amid-scandal-as-anti-garosero-petition-grows-2735538-2025-06-06",
      "headline": "Kim Soo Hyun's global rise amid scandal as anti-GaroSero petition growsKim Soo Hyun is regaining global popularity as his hit drama 'My Love from the Star' debuts in Brazil on SBT, despite ongoing controversy in South Korea involving allegations related to the late Kim Sae Ron. The show's international success marks a key moment in his image revival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-j-hope-impress-in-classic-suits-ahead-of-bts-festa-2025-2736615-2025-06-06",
      "headline": "BTS Jin, J-Hope impress in classic suits ahead of BTS Festa 2025BTS members Jin and J-Hope shared new photos for Festa 2025, marking BTS's 12th anniversary and upcoming reunion after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-farhan-akhtar-sivakarthikeyan-almost-signed-for-sitare-zameen-par-2736821-2025-06-06",
      "headline": "Aamir Khan reveals Sitaare Zameen Par almost starred Farhan Akhtar, SivakarthikeyanAamir Khan, in a recent round-table interaction, revealed that he had initially backed out of 'Sitare Zameen Par'. The actor recalled that Farhan Akhtar and Sivakarthikeyan were signed in for the film's Hindi and "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-receives-dostoevsky-star-award-shabana-azmi-reacts-2736753-2025-06-06",
      "headline": "Javed Akhtar receives Dostoevsky Star Award, Shabana Azmi shares glimpsesVeteran poet and lyricist Javed Akhtar has been honoured with the prestigious Dostoevsky Star Award by the Russian House for his global literary impact. This adds to his long list of accolades, including the Padma Bhushan and Sahitya Akademi Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-again-will-be-worth-the-wait-2736787-2025-06-06",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed again: Will be worth the waitAfter months of speculation, the release of Pawan Kalyan's long-delayed period action drama, 'Hari Hara Veera Mallu', has officially been postponed once again. It was slated for a grand release on June 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-loses-cool-at-mumbai-airport-after-fan-persistent-request-for-selfie-2736532-2025-06-06",
      "headline": "AP Dhillon loses cool at Mumbai airport after fan's persistent request for selfieAP Dhillon was visibly uncomfortable at Mumbai airport after a fan repeatedly asked for selfies and invaded his personal space. Annoyed at the fan's request, AP Dhillon asked,\"Kitni photos lega yaar? (How many photos will you take)\". The singer firmly said \"enough\" before walking away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/housefull-5-movie-review-cringe-and-chaos-in-this-mystery-of-who-killed-comedy-2736724-2025-06-06",
      "headline": "Housefull 5 review: Cringe and chaos in this mystery of who killed comedyReleased-Fri Jun 06, 2025Housefull 5 movie review: In the Akshay Kumar-starrer, the real comedian, Johnny Lever, takes a backseat while the cruise sails full speed ahead in a tide of obscene jokes and crass humour. If this is what Bollywood thinks comedy is, we might need a national sense of humour check. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hina-khan-rocky-jaiwal-wedding-resumes-work-award-show-2736672-2025-06-06",
      "headline": "Hina Khan resumes work a day after wedding with Rocky JaiswalActor Hina Khan resumed work a day after her wedding with long-time boyfriend Rocky Jaiswal. She was clicked at an event in Mumbai.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-theatre-only-release-sitaare-zameen-par-amitabh-bachchan-encouragement-2736669-2025-06-06",
      "headline": "Aamir Khan: Amitabh Bachchan encouraged Sitaare Zameen Par's theatre-only releaseBollywood actor Aamir Khan has decided to release Sitaare Zameen Par exclusively in theatres, rejecting early digital release. He revealed that Amitabh Bachchan's support played a key role in this risky but cinema-loyal decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-dept-q-redefines-slow-burn-police-procedural-drama-scottish-noir-2736675-2025-06-06",
      "headline": "Netflix's Dept.Q is a masterful Scottish crime drama that rewards patienceIn 'Dept. Q', Netflix delivers a masterful Scottish thriller that combines authentic character development with methodical storytelling. This slow-burn procedural proves the audience's patience pays off in the end. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-confirms-g7-summit-invite-from-canadian-counterpart-says-looking-forward-to-meeting-2736921-2025-06-06",
      "headline": "PM gets G7 Summit invite from Canadian counterpart, says looking forward to meetPrime Minister Narendra Modi received an invitation from his Canadian counterpart Mark Carney on Friday to attend the upcoming G7 summit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/rcb-felicitation-at-vidhana-soudha-came-with-stringent-guidelines-shows-karnataka-government-letter-stampede-2736885-2025-06-06",
      "headline": "Karnataka okayed RCB's Vidhana Soudha event, letter surfaces amid stampede rowThe Karnataka government approved RCB's felicitation at Vidhana Soudha under 19 strict conditions, including a Rs 15 lakh deposit for tents, as per the official approval letter, accessed exclusively by India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-omar-abdullah-pm-modi-jk-statehood-chief-minister-demoted-2736741-2025-06-06",
      "headline": "I got demoted: Omar Abdullah shares stage with PM, pushes for J&K statehoodWhile sharing the stage with PM Modi, Jammu and Kashmir Chief Minister Omar Abdullah renewed his call for restoring J&K's statehood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/kolkata-eid-al-dha-namaaz-red-road-raf-fighter-planes-took-off-calcutta-world-war-ii-history-2736811-2025-06-06",
      "headline": "When Red Road, in heart of Kolkata, turned into an airstrip during World War IIWhile the landing of fighter jets on highways might seem like a recent phenomenon, planes of the Royal Air Force (RAF) landed and took off from the Red Road in Calcutta almost 80 years ago, during the peak of World War II. This is the same road in Kolkata next to the Army's Eastern Command HQ that was in the news over Eid namaaz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-snubs-musk-after-meltdown-says-not-particularly-interested-in-call-with-man-who-lost-his-mind-report-2736900-2025-06-06",
      "headline": "Trump snubs Musk after feud, says won't speak to man who lost his mind: ReportUS President Donald Trump snubbed his former ally Elon Musk amid a public spat between both of them, saying he was particularly \"not interested in a call with a man who lost his mind\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-semifinals-live-updates-carlos-alcaraz-novak-djokovic-jannik-sinner-2736887-2025-06-06",
      "headline": "Semi-finals Live Updates: Musetti makes Alcaraz work hard in 2nd setFrench Open 2025 Live Updates: Lorenzo Musetti has won the opening set against Carlos Alcaraz in the first semi-final of the day on Centre Court. Their clash will be followed by the match between Novak Djokovic and Jannik Sinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-to-hold-polls-in-april-2026-yunus-announces-rejecting-oppositions-demand-for-early-elections-2736952-2025-06-06",
      "headline": "Bangladesh polls in 2026, Yunus announces, rejecting demand for early electionsAddressing a public gathering on the eve of the Eid festival, he also said that the country's Election Commission will provide a roadmap for next year's polls in the coming months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modis-powerful-kashmir-message-with-tricolour-chenab-rail-bridge-lal-chowk-2736892-2025-06-06",
      "headline": "Modi's powerful Kashmir message with TricolourPrime Minister Narendra Modi delivered a powerful message as he marched on the Chenab Rail bridge with an Indian flag in hand. The Tricolour march reminded many of the 1992 Republic Day flag-hoisting at the Lal Chowk in Srinagar, during the peak of militancy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiahs-political-secretary-shunted-amid-massive-anger-over-bengaluru-stampede-2736784-2025-06-06",
      "headline": "Siddaramaiah's political secretary sacked after Bengaluru stampede deathsThe Karnataka government has removed K Govindraj from his post as the Chief Minister Siddaramaiah's political secretary. The move follows the stampede outside Chinnaswamy Stadium that claimed 11 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/housefull-5-movie-review-cringe-and-chaos-in-this-mystery-of-who-killed-comedy-2736724-2025-06-06",
      "headline": "Housefull 5 review: Cringe and chaos in this mystery of who killed comedyReleased-Fri Jun 06, 2025Housefull 5 movie review: In the Akshay Kumar-starrer, the real comedian, Johnny Lever, takes a backseat while the cruise sails full speed ahead in a tide of obscene jokes and crass humour. If this is what Bollywood thinks comedy is, we might need a national sense of humour check. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-elon-musk-breakup-saga-wrecks-the-maga-soap-opera-2736695-2025-06-06",
      "headline": "Trump-Musk breakup saga wrecks the MAGA soap operaDonald Trump and Elon Musk's public feud erupts, turning their bromance into a bitter spectacle. Egos clash, secrets spill, and empires tremble in this chaotic, meme-fuelled theatre of the absurd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/how-frolleagues-and-streaming-platforms-are-redefining-travel-in-2025-2736586-2025-06-06",
      "headline": "How 'frolleagues' and streaming platforms are redefining travel in 2025A recent survey highlights that not just family and friends, but work besties are becoming preferred travel companions in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/satellite-images-chenab-rail-bridge-making-jammu-kashmir-2736840-2025-06-06",
      "headline": "The making of Chenab rail bridge captured in satellite imagesSatellite images shows the decade-long construction of the Chenab Rail Bridge, now the world's highest railway arch, connecting Kashmir to mainland India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-letters-indus-waters-treaty-india-pahalgam-terror-attack-diplomatic-offensive-2736836-2025-06-06",
      "headline": "Parched Pak wrote 4 letters to India to reinstate Indus Waters Treaty: SourcesPakistan, battling a severe water crisis, urged India to reconsider its decision to pause the Indus Waters Treaty through four letters, sources said, nearly two months after 26 people were killed in the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/no-coercive-steps-against-state-cricket-body-for-now-karnataka-high-court-day-after-stampede-case-filed-2736818-2025-06-06",
      "headline": "High Court bars coercive steps against Karnataka cricket body in stampede caseJustice SR Krishna Kumar, directing the petitioners to not leave the jurisdiction of the court without permission, also instructed KSCA officials to cooperate with the probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/permanently-closed-label-jaish-e-mohammed-markaz-subhan-allah-jamia-masjid-headquarters-2736902-2025-06-06",
      "headline": "Permanently closed label on Jaish headquarters in Pak after India's strikeWhile India has produced video evidence showing that its strike on Jaish-e-Mohammed's terror headquarters, Markaz Subhan Allah, in Pakistan's Bahawalpur, has been reduced to rubble, the terror headquarters founded by Masood Azhar is now also marked as \"permanently closed\" on Google Maps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/german-chancellor-friedrich-merz-trump-grandfather-birth-certificate-oval-office-meeting-2736788-2025-06-06",
      "headline": "German Chancellor gifts Trump his grandfather's birth certificate at Oval OfficeGerman Chancellor Friedrich Merz met US President Donald Trump at the Oval Office and presented him with a gold-framed certificate of his grandfather, Friedrich Trump, who was born in Germany and later immigrated to the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-inaugurates-worlds-highest-rail-bridge-over-river-chenab-that-will-link-kashmir-valley-to-rest-of-countr-2736622-2025-06-06",
      "headline": "PM opens landmark Chenab Bridge, flags off Vande Bharat in massive Kashmir pushThe inauguration of multiple all-weather infrastructure projects in Kashmir served as a strong message from PM Modi that his government remains committed to the development of the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-kanyakumari-railway-chenab-bridge-srinagar-vande-bharat-jammu-130-year-old-dream-maharaja-pratap-singh-history-2736605-2025-06-06",
      "headline": "A 140-year-old dream gets fulfilled with Kashmir-Kanyakumari rail linkThe inauguration of the last section of the Udhampur-Baramulla-Srinagar Rail Link, Chenab Bridge and Ajni Bridge will enable direct train travel from Kashmir to Kanyakumari. The project, which needed modern engineering capabilities, was a dream of the Dogra king of Jammu and Kashmir, Maharaja Pratap Singh, who in the late 1880s envisioned the route and engaged British engineers for surveys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/b-dayananda-suspension-creates-online-backlash-against-ktaka-govt-support-for-bangalore-police-commissioner-ove-stadium-stampede-case-2736681-2025-06-06",
      "headline": "Support pours in for Bengaluru top cop B Dayananda after suspension over stampedePublic and political backlash has erupted online after Bengaluru Police Commissioner B Dayananda was suspended following the June 4 stampede, with calls for accountability redirected at the government itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chenab-bridge-inauguration-pm-modi-kashmir-visit-congress-jairam-ramesh-2736661-2025-06-06",
      "headline": "Don't hog credit: Congress targets PM as record-setting Chenab rail bridge opensThe Congress accused PM Modi of claiming sole credit for the Chenab rail bridge, highlighting contributions by past prime ministers, including the late Manmohan Singh and Atal Bihari Bajpayee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-embassy-in-india-warns-visa-applicants-of-fraud-bengaluru-scam-reported-america-visa-interview-2736745-2025-06-06",
      "headline": "US Embassy warns visa applicants of fraudsters after Bengaluru scam reportedThe US Embassy in New Delhi has warned visa applicants about cyber fraudsters exploiting policy changes to scam those seeking US visas. Following a Bengaluru case where a 45-year-old engineer was duped after being promised an advanced interview, the embassy urged people not to share login credentials or pay for fast-tracking."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raphinha-laliga-player-season-barcelona-domestic-treble-2024-25-2736957-2025-06-06",
      "headline": "Barcelona's Raphinha named LaLiga player of the seasonRaphinha has been named LaLiga player of the season following Barcelona's dominant 2024-25 campaign. His goals and assists played a key role in the club's historic domestic treble win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-ousmane-dembele-spain-vs-france-nations-league-2736914-2025-06-06",
      "headline": "Lamine Yamal's sly dig at Dembele after Spain win: Best to talk on the pitchLamine Yamal edged ahead in the Ballon d'Or race with a dazzling brace against France, throwing subtle shade at Ousmane Dembele. The Spain star now gears up for a blockbuster final against Cristiano Ronaldo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-semifinals-live-updates-carlos-alcaraz-novak-djokovic-jannik-sinner-2736887-2025-06-06",
      "headline": "Semi-finals Live Updates: Musetti makes Alcaraz work hard in 2nd setFrench Open 2025 Live Updates: Lorenzo Musetti has won the opening set against Carlos Alcaraz in the first semi-final of the day on Centre Court. Their clash will be followed by the match between Novak Djokovic and Jannik Sinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/fih-pro-league-india-world-cup-spot-craig-fulton-2736826-2025-06-06",
      "headline": "World Cup qualification via Hockey Pro League a priority for India: Coach Craig FultonIn an exclusive interaction with India Today, men's hockey team coach Craig Fulton said that India will be aiming to secure their spot in the World Cup next year by finishing in the top spot in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-shubman-gill-pack-of-wolves-virat-kohli-2736794-2025-06-06",
      "headline": "Shubman Gill should create a pack of wolves: Ex India cricketerShubman Gill has been named India's new Test captain. Akash Chopra has urged the batters to create a pack of wolves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-opens-up-on-not-returning-to-india-for-ipl-2736781-2025-06-06",
      "headline": "Mitchell Starc opens up on not returning to India for IPL: We saw what happenedAustralia fast bowler Mitchell Starc recently opened up on his decision to pull out of the last leg of the Indian Premier League 2025 (IPL 2025) and revealed that a variety of factors influenced his decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-lions-vs-india-a-2nd-unofficial-test-live-score-and-updates-2736772-2025-06-06",
      "headline": "England Lions vs India A Live: KL Rahul scores brisk fifty, Jurel steady as wellEngland Lions vs India A 2nd Unofficial Test, Day 1 Live: Chris Woakes returns to the attack and LBW's Karun Nair in the 34th over of Day 1. KL Rahul has scored his fifty and Dhruv Jurel is steady on the other end as well. Woakes had previously dismissed Yashasvi Jaiswal and Abhimanyu Easwaran in his first spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-t20i-series-schedule-squads-livestreaming-details-2736747-2025-06-06",
      "headline": "ENG vs WI T20I series: live-streaming details and all you need to knowEngland and West Indies are all set to begin their journey to the T20 World Cup 2026 with a three-match series, which will begin on Friday, June 6. England and West Indies will have new captains at the helm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/piyush-chawla-retires-from-all-forms-of-cricket-2736731-2025-06-06",
      "headline": "3rd highest wicket-taker in IPL history, Piyush Chawla retires from all forms of cricketIndian leg spinner Piyush Chawla called his time on his cricketing career on Friday, June 6. A multi-time World Cup, Chawla, retires as the third-highest wicket-taker in the history of the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mark-wood-likely-to-be-fit-by-fourth-test-against-india-luke-wright-2736716-2025-06-06",
      "headline": "Mark Wood likely to be fit by 4th Test against India: England national selectorEngland fast bowler Mark Wood is likely to be fit by the fourth Test of the series against India, revealed England's national selector Luke Wright. Engalnd and India will lock horns in a five-match Test series from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-opens-up-on-not-returning-to-india-for-ipl-2736781-2025-06-06",
      "headline": "Mitchell Starc opens up on not returning to India for IPL: We saw what happenedAustralia fast bowler Mitchell Starc recently opened up on his decision to pull out of the last leg of the Indian Premier League 2025 (IPL 2025) and revealed that a variety of factors influenced his decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-lions-vs-india-a-2nd-unofficial-test-live-score-and-updates-2736772-2025-06-06",
      "headline": "England Lions vs India A Live: KL Rahul scores brisk fifty, Jurel steady as wellEngland Lions vs India A 2nd Unofficial Test, Day 1 Live: Chris Woakes returns to the attack and LBW's Karun Nair in the 34th over of Day 1. KL Rahul has scored his fifty and Dhruv Jurel is steady on the other end as well. Woakes had previously dismissed Yashasvi Jaiswal and Abhimanyu Easwaran in his first spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-t20i-series-schedule-squads-livestreaming-details-2736747-2025-06-06",
      "headline": "ENG vs WI T20I series: live-streaming details and all you need to knowEngland and West Indies are all set to begin their journey to the T20 World Cup 2026 with a three-match series, which will begin on Friday, June 6. England and West Indies will have new captains at the helm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/piyush-chawla-retires-from-all-forms-of-cricket-2736731-2025-06-06",
      "headline": "3rd highest wicket-taker in IPL history, Piyush Chawla retires from all forms of cricketIndian leg spinner Piyush Chawla called his time on his cricketing career on Friday, June 6. A multi-time World Cup, Chawla, retires as the third-highest wicket-taker in the history of the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mark-wood-likely-to-be-fit-by-fourth-test-against-india-luke-wright-2736716-2025-06-06",
      "headline": "Mark Wood likely to be fit by 4th Test against India: England national selectorEngland fast bowler Mark Wood is likely to be fit by the fourth Test of the series against India, revealed England's national selector Luke Wright. Engalnd and India will lock horns in a five-match Test series from June 20."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}