{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wolf-in-sheeps-clothing-kutniti-report-flags-elon-musk-starlink-us-military-intelligence-ties-india-entry-plans-2633628-2024-11-15",
      "headline": "'Wolf in sheep's clothing': Report flags Starlink's US military tiesStarlink operates through a constellation of satellites to provide internet access worldwide, a model distinct from traditional telecom services that rely on ground-based towers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-nse-bse-closed-today-holiday-guru-nanak-jayanti-no-trading-sensex-nifty-2633616-2024-11-15",
      "headline": "Stock markets closed today for Guru Nanak Jayanti holiday?Sensex and Nifty, have faced a six-session losing streak, marked by selling pressure from foreign institutional investors (FIIs) and worries over rising retail inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-icici-sbi-itc-titan-stocks-sector-safe-bet-market-fall-infrastructure-housing-finance-investing-tips-2633338-2024-11-14",
      "headline": "Markets in free fall: These sectors and stocks can be safe betsBoth the Sensex and Nifty indices have fallen around 10% from their 52-week peaks, marking a notable slump in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cypto-bull-run-memecoin-dogecoin-donald-trump-push-tokens-soaring-2633317-2024-11-14",
      "headline": "Donald Trump's crypto push: Not just Bitcoin, even these tokens are soaringThe bull run is not only crucial in terms of Bitcoin's valuation but also in its wider impact on the altcoin market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-phase-sensex-nifty-fall-sixth-stright-session-trump-factor-fii-selling-2633278-2024-11-14",
      "headline": "Trump factor, FII selling: Why Sensex, Nifty fell for 6th straight sessionThe benchmark Sensex dropped over 250 points, while the Nifty fell over 100 points during intraday trade, marking a significant 10% decline from their September peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-changes-budget-2025-simpler-filing-lower-brackers-all-key-details-2633226-2024-11-14",
      "headline": "Can you expect major income tax changes in Budget 2025? Check detailsThe Finance Ministry has established 22 specialised sub-committees to examine various aspects of the Income Tax Act, with an aim to simplify tax structures, expand tax base, and balance revenue generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-financial-services-share-price-jump-6-percent-today-nse-futures-and-options-inclusion-2633213-2024-11-14",
      "headline": "Explained: Why Jio Financial Services share price surged over 6% todayJio Financial Services share price: At midday, JFS shares were trading at Rs 318.70, marking a 6.45% increase. The development came as a relief for the stock, which has seen declines in recent months but has gained attention for its potential in the derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-share-price-fall-3-percent-should-you-buy-or-avoid-2633177-2024-11-14",
      "headline": "Swiggy share price falls 3% after listing. Should you buy or avoid?Swiggy share price: The drop comes after a decent debut, closing at Rs 455.95 the previous day, marking a 10.67% rise from its initial listing price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eicher-motors-share-price-gains-over-7-percent-after-q2-results-buy-hold-sell-2633159-2024-11-14",
      "headline": "Eicher Motors share price jumps over 8% after Q2 results. Should you buy?Eicher Motors share price: Royal Enfield's parent company posted an 8% year-on-year net profit increase to Rs 1,100 crore, up from Rs 1,016 crore a year earlier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-shares-listing-stock-price-decent-d-street-debut-lists-at-6-percent-premium-bse-nse-2633146-2024-11-14",
      "headline": "Niva Bupa share price: Stock lists at 6% premium on D-Street debutNiva Bupa shares listing: Shares of Niva Bupa listed at Rs 78.50 on the Bombay Stock Exchange at a premium of 6.08%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-higher-eicher-motors-shares-gain-7-percent-2633138-2024-11-14",
      "headline": "Sensex, Nifty open marginally higher; Eicher Motors shares gain 7% The S&P BSE Sensex was up 62.80 points to 77,753.75, while NSE Nifty50 gained 6.60 points to 23,565.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-breaches-usd-93000-mark-amid-donald-trump-pro-crypto-stance-2633133-2024-11-14",
      "headline": "Bitcoin breaches $93,000 mark amid Donald Trump's pro-crypto stanceBitcoin touched $93,400 at its peak, before settling around $90,000 as traders monitored its path toward the significant $100,000 level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trading-setup-today-stock-market-shares-gift-nifty-starts-lower-down-stocks-to-watch-2633114-2024-11-14",
      "headline": "GIFT Nifty starts in red, down 10 points; market trading setup for todayThe stock market has been struggling due to sustained foreign fund outflows, weakening demand in certain sectors, and a fluctuating rupee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-today-varun-beverages-hero-motocorp-cipla-grasim-2633099-2024-11-14",
      "headline": "Top stocks to watch today: Varun Beverages, Hero MotoCorp, Cipla, Grasim Stocks to watch: Several major stocks such as Grasim, Hero MotoCorp, and Honasa Consumer are likely to draw attention due to company updates and the release of quarterly results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-budget-2025-income-tax-filing-simplification-act-amendment-finance-ministry-2632972-2024-11-13",
      "headline": "Major income tax reforms in pipeline, Budget 2025 to ease filing process: SourcesThe upcoming Union Budget 2025-26 is set to simplify India's Income Tax Act, by streamlining tax filing processes, reducing compliance burdens and expanding the tax base, Finance Ministry sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-listing-gains-70-dollar-millionaires-500-crorepati-employees-2632844-2024-11-13",
      "headline": "Inside Swiggy's listing gains: 70 dollar millionaires, 500 crorepati employees Swiggy market listing: As many as 70 current and former employees stand to become dollar millionaires."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-air-quality-remains-severe-third-straight-day-aqi-curbs-classes-online-smog-2633602-2024-11-15",
      "headline": "Delhi pollution in severe category for third straight day, AQI stands at 409The stringent anti-pollution measures under Stage 3 of the Graded Response Action Plan (GRAP) came into force on Friday as Delhi's air quality remains under the severe category. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-notice-diljit-dosanjh-hyderabad-concert-against-songs-promoting-drugs-violence-using-children-2633625-2024-11-15",
      "headline": "Notice to Diljit Dosanjh ahead of Hyderabad concert: Don't sing songs on drugsThe Telangana government has instructed singer Diljit Dosanjh to refrain from performing songs promoting alcohol, drugs, or violence during his upcoming Hyderabad concert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-iran-un-ambassador-meeting-first-buddy-donald-trump-administration-influence-2633613-2024-11-15",
      "headline": "'First buddy' Elon Musk meets Iran's UN envoy to defuse tensions: ReportThe meeting between Elon Musk and Iran's ambassador to the United Nations, which took place on Monday at a secret location, was described by Iranian sources as \"positive,\" according to a New York Times report "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/video/will-ladki-bahin-be-maharashtra-game-changer-rajdeep-sardesais-ground-report-2633542-2024-11-14",
      "headline": "Will Ladki Bahin be Maharashtra game-changer? Rajdeep Sardesai's ground reportIn this episode of Maharashtra Majha with Rajdeep Sardesai, watch what women of Maharashtra have to say about the Ladki Bahin Yojana, which was rolled out by Maharashtra Chief Minister Eknath Shinde. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/freedom-at-midnight-review-powerful-portrayal-of-india-partition-stellar-acting-rating-2633621-2024-11-15",
      "headline": "Freedom at Midnight review: Powerful portrayal of partitionReleased-Fri Nov 15, 2024Freedom at Midnight review: The Nikkhil Advani show has a light, easygoing way of telling the story, weaving together different threads that build up quietly. The dialogues and performances strike emotional chords effectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/how-do-we-explain-elon-musk-moby-dick-opinion-2633358-2024-11-14",
      "headline": "How do we explain Elon Musk? Moby DickWhat drives Elon Musk is the same thing that drives everyone else, and on some occasions to a tragic end: the white whale. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-marital-rape-minor-wife-age-of-consent-maharashtra-2633620-2024-11-15",
      "headline": "Consensual sex with minor wife is rape: High Court upholds 10-year jail for manThe Bombay High Court upheld a 10-year sentence for a man accused of raping his minor wife, ruling that consensual sex with a minor, even in marriage, constitutes rape under the law. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/kanguva-movie-opinion-suriya-bobby-deol-siva-tamil-cinema-2633607-2024-11-15",
      "headline": "Kanguva: Latest product of Tamil cinema's FOMO that disrespects audienceHigh on ambition, Suriya's latest film, Kanguva, is let down by weak writing. None of the central themes resonate in Siruthai Siva's big-budget offering. We have seen this before in Tamil cinema. Haven't we?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-mike-tyson-slaps-jake-paul-final-face-off-blockbuster-bout-2633615-2024-11-15",
      "headline": "Watch: Mike Tyson slaps Jake Paul in final face-off ahead of blockbuster boutMike Tyson slapped Jake Paul in a heated final face-off ahead of their blockbuster boxing match. The 58-year-old Tyson is set to face 27-year-old Paul in Texas on Friday, November 15, marking Tyson's first professional fight in 19 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-anti-vaccine-activist-robert-f-kennedy-jr-health-secretary-2633597-2024-11-15",
      "headline": "Trump picks anti-vaccine activist Robert F Kennedy Jr as health secretaryPresident-elect Donald Trump's decision of nominating Robert F Kennedy Jr as Health Secretary drew alarm from public health experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/ajit-pawar-key-ncp-leaders-skip-pm-modis-mumbai-rally-2633598-2024-11-15",
      "headline": "Ajit Pawar, top NCP leaders skip PM's Mumbai rally amid Mahayuti rift buzzAjit Pawar's NCP faction leaders Nawab Malik, Sana Malik and Zeeshan Siddique have refrained from attending PM Modi's rally at Chhatrapati Shivaji Park in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/scammer-dressed-as-cop-dials-the-wrong-number-lands-in-thrissur-cyber-cells-trap-2633546-2024-11-14",
      "headline": "Scammer dressed as cop dials the wrong number, lands in Thrissur cyber cell's trapIn a bizarre turn of events, a scammer attempting to impersonate a police officer accidentally video-called the Thrissur Cyber Cell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/india-today-expose-evm-whistleblower-syed-shuja-rigging-machines-maharashtra-elections-mva-mahayuti-2633527-2024-11-14",
      "headline": "'Whistleblower' offers to hack EVMs for Maharashtra MP for Rs 53 croreIndia Today's special investigation team, with one of them posing as the personal assistant of an MP, got in touch with self-proclaimed cyber expert Syed Shuja via a video call to probe his claims of getting the EVMs hacked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/four-year-old-boy-survives-minor-injuries-car-runs-over-him-betul-madhya-pradesh-accident-2633569-2024-11-14",
      "headline": "Video: 4-year-old on cycle run over by car in Madhya Pradesh, climbs out safeThe mother of the boy alleged that the man behind the steering wheel ran the car over her son intentionally in Madhya Pradesh's Betul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-todd-blanche-deputy-attorney-general-hush-money-defence-lawyer-2633599-2024-11-15",
      "headline": "Trump picks Todd Blanche, his hush money case lawyer, as deputy attorney generalA former federal prosecutor, Todd Blanche led the legal team that defended Donald Trump at his hush money criminal trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-box-office-collection-day-1-suriya-siva-40-crore-globally-2633604-2024-11-15",
      "headline": "Kanguva box office Day 1: Suriya's film mints nearly Rs 40 crore globallySuriya's magnum-opus Kanguva opened to mixed reviews from critics and fans alike. It is reported that the film earned nearly Rs 40 crore worldwide on its first day in theatres."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/single-composer-sanjay-chakraborty-arrested-pocso-case-molesting-minor-kolkata-2633545-2024-11-14",
      "headline": "Singer-composer Sanjay Chakraborty arrested for allegedly molesting minorSanjay Chakraborty has been arrested under Pocso charges. He was produced before a Kolkata court on Wednesday and sent to police custody till November 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/agra/story/agra-air-quality-monitoring-systems-india-today-investigation-data-manipulation-row-2633492-2024-11-14",
      "headline": "India Today probe reveals how effective Agra's air quality monitoring systems areAmid allegations of potential manipulation of air quality data in Agra, an India Today TV team conducted an on-ground investigation of the air quality monitoring system across several locations in the city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/delhi-smog-explained-why-air-turned-hazardous-and-early-respite-looks-bleak-2633206-2024-11-14",
      "headline": "Delhi smog explained: Why air turned hazardous and early respite looks bleakEven smaller cities in the National Capital Region are reeling under very high PM2.5 levels; what's worse: slow wind speeds indicate a longer overhang of the pollutants\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-california-suspects-use-bear-costume-fake-attack-luxury-cars-insurance-fraud-2633563-2024-11-14",
      "headline": "4 suspects in US use costume to stage 'bear attacks' on Rolls-Royce, MercedesDubbed \"Operation Bear Claw\" by the California Department of Insurance (CDI), the investigation revealed that the suspects submitted staged footage supposedly showing a bear tearing up luxury cars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-4th-t20i-preview-series-win-2633619-2024-11-15",
      "headline": "India look to end memorable year with series win in South AfricaSA vs IND, 4th T20I preview in Johannesburg: India will look to cap off what has been a memorable year in T20Is with a series win in South Africa. In what is expected to be a high-scoring venue, Indian batters need to be at their best on Friday. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-terrorist-arsh-dalla-arshdeep-singh-gill-arrested-in-canada-india-relationship-strain-hardeep-singh-nijjar-2633497-2024-11-14",
      "headline": "How Arsh Dalla, a Punjab gangster, turned into Khalistani terrorist in CanadaArshdeep Singh Gill, alias Arsh Dalla, a Khalistani terrorist and one of India's most wanted, has been arrested in Canada. This is how Dalla, a local gangster in Punjab, moved to Canada in 2020 and became a Khalistani terrorist with an international network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/x-exodus-people-quitting-social-media-platform-donald-trump-victory-blue-sky-jamie-lee-curtis-elton-john-2633469-2024-11-14",
      "headline": "As X sees X-odus of users and celebs, these platforms are gainingPeople are deserting X, the Elon Musk-owned social media platform, after Donald Trump's victory. This is the biggest exodus of users from X since what was seen after Musk's takeover of Twitter.  Even celebs like Elton John, Mia Farrow and Jim Carrey, have stopped using X. Who is gaining from X's loss? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nikhil-dwivedi-update-shraddha-kapoor-naagin-2025-shoot-2633570-2024-11-15",
      "headline": "Exclusive: Nikhil Dwivedi says Shraddha's Naagin shoot will begin in 2025Producer Nikhil Dwivedi shared an update on Shraddha Kapoor-starrer Naagin. He said that the script took three years to perfect and the film will be going on floors next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/krushna-abhishek-mocks-rabindranath-tagore-the-great-indian-kapil-show-bengali-poet-apology-2633626-2024-11-15",
      "headline": "Bengali poet slams Krushna Abhishek for Tagore joke on Kapil's ShowComedian-actor Krushna Abhishek was recently slammed for his joke on Rabindranath Tagore on The Great Indian Kapil Show. A Bengali poet shared a lengthy note and called out Krushna for his mockery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-notice-diljit-dosanjh-hyderabad-concert-against-songs-promoting-drugs-violence-using-children-2633625-2024-11-15",
      "headline": "Notice to Diljit Dosanjh ahead of Hyderabad concert: Don't sing songs on drugsThe Telangana government has instructed singer Diljit Dosanjh to refrain from performing songs promoting alcohol, drugs, or violence during his upcoming Hyderabad concert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/freedom-at-midnight-review-powerful-portrayal-of-india-partition-stellar-acting-rating-2633621-2024-11-15",
      "headline": "Freedom at Midnight review: Powerful portrayal of partitionReleased-Fri Nov 15, 2024Freedom at Midnight review: The Nikkhil Advani show has a light, easygoing way of telling the story, weaving together different threads that build up quietly. The dialogues and performances strike emotional chords effectively. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-injury-scare-simulation-australia-vs-india-perth-test-bgt-2633629-2024-11-15",
      "headline": "KL Rahul walks off the field injured during India's match simulation sessionBorder-Gavaskar Trophy: India batter KL Rahul suffered an injury scare during a match simulation session on Friday morning ahead of the first Test against Australia at the WACA in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kane-williamson-returns-new-zealand-test-squad-series-vs-england-2633627-2024-11-15",
      "headline": "Williamson returns as New Zealand name Test squad for home series vs England Star batter Kane Williamson is set to make his comeback for New Zealand in the upcoming home Test series against England. The England series is likely to be the international swansong for veteran bowler Tim Southee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-4th-t20i-preview-series-win-2633619-2024-11-15",
      "headline": "India look to end memorable year with series win in South AfricaSA vs IND, 4th T20I preview in Johannesburg: India will look to cap off what has been a memorable year in T20Is with a series win in South Africa. In what is expected to be a high-scoring venue, Indian batters need to be at their best on Friday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-mike-tyson-slaps-jake-paul-final-face-off-blockbuster-bout-2633615-2024-11-15",
      "headline": "Watch: Mike Tyson slaps Jake Paul in final face-off ahead of blockbuster boutMike Tyson slapped Jake Paul in a heated final face-off ahead of their blockbuster boxing match. The 58-year-old Tyson is set to face 27-year-old Paul in Texas on Friday, November 15, marking Tyson's first professional fight in 19 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-beat-west-indies-3rd-t20i-report-series-win-2633610-2024-11-15",
      "headline": "England secure series win over West Indies with two matches to spareEngland secured a T20 series victory against the West Indies, taking an unassailable 3-0 lead after a nail-biting, final-over win in the third match at the Daren Sammy Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-tim-southee-retire-tests-after-england-series-2633603-2024-11-15",
      "headline": "New Zealand's Tim Southee set to retire from Test cricket after England seriesNew Zealand's Tim Southee is set to make the third Test against England his final appearance in the format, marking the end of an illustrious career in Test cricket. However, he will remain available for selection if the Black Caps qualify for the World Test Championship (WTC) final next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/atp-finals-jannik-sinner-semi-final-taylor-firtz-vs-alex-de-minaur-daniil-medvedev-turin-2633566-2024-11-14",
      "headline": "ATP Finals: Sinner seals semi-final spot, Fritz awaits Medvedev resultTaylor Fritz's win over Alex de Minaur has taken him closer to the ATP Finals semi-finals, though he must await the outcome of Jannik Sinner's match against Daniil Medvedev to see if his journey in Turin continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-tour-pakistan-dates-announced-2633558-2024-11-14",
      "headline": "Champions Trophy arrives in Pakistan, trophy tour from November 16 The Champions Trophy arrived in Pakistan on Thursday, November 14. The trophy will be on a tour from November 16 to 24 across several cities in the country despite the uncertainty around the 50-over tournament, scheduled to be held in February-March 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-sarfaraz-khan-injury-update-perth-test-2633552-2024-11-14",
      "headline": "Sarfaraz Khan injury 'not serious' after blow to elbow in Perth training sessionBorder-Gavaskar Trophy: Sarfaraz Khan was hit on the elbow while training in the nets at the WACA Stadium in Perth on Thursday, November 14. Sarfaraz could be in contention to play the series opener, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rohit-sharma-perth-test-update-travel-border-gavaskar-trophy-2633551-2024-11-14",
      "headline": "Will Rohit Sharma travel to Australia before first Test in Perth?Border Gavaskar Trophy: In a piece of positive news for Indian cricket fans, Rohit Sharma might travel to Perth in the lead-up to the first Test. The BCCI is making all arrangements to ensure Rohit reaches on time, if the captain makes himself available to be part of the series opener, starting November 22. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/atp-finals-jannik-sinner-semi-final-taylor-firtz-vs-alex-de-minaur-daniil-medvedev-turin-2633566-2024-11-14",
      "headline": "ATP Finals: Sinner seals semi-final spot, Fritz awaits Medvedev resultTaylor Fritz's win over Alex de Minaur has taken him closer to the ATP Finals semi-finals, though he must await the outcome of Jannik Sinner's match against Daniil Medvedev to see if his journey in Turin continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-tour-pakistan-dates-announced-2633558-2024-11-14",
      "headline": "Champions Trophy arrives in Pakistan, trophy tour from November 16 The Champions Trophy arrived in Pakistan on Thursday, November 14. The trophy will be on a tour from November 16 to 24 across several cities in the country despite the uncertainty around the 50-over tournament, scheduled to be held in February-March 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-sarfaraz-khan-injury-update-perth-test-2633552-2024-11-14",
      "headline": "Sarfaraz Khan injury 'not serious' after blow to elbow in Perth training sessionBorder-Gavaskar Trophy: Sarfaraz Khan was hit on the elbow while training in the nets at the WACA Stadium in Perth on Thursday, November 14. Sarfaraz could be in contention to play the series opener, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rohit-sharma-perth-test-update-travel-border-gavaskar-trophy-2633551-2024-11-14",
      "headline": "Will Rohit Sharma travel to Australia before first Test in Perth?Border Gavaskar Trophy: In a piece of positive news for Indian cricket fans, Rohit Sharma might travel to Perth in the lead-up to the first Test. The BCCI is making all arrangements to ensure Rohit reaches on time, if the captain makes himself available to be part of the series opener, starting November 22. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-usman-khawaja-plans-jasprit-bumrah-pace-will-not-get-out-border-gavaskar-trophy-2633529-2024-11-14",
      "headline": "Khawaja reveals plans to handle Bumrah: 'Will not think about getting out'As the Border-Gavaskar Trophy series nears, Usman Khawaja shared his insights on facing India's ace pacer Jasprit Bumrah, detailing the challenge and excitement of adapting to Bumrah's unique bowling style while keeping a sharp focus on staying grounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-advice-rohit-sharma-batting-restraint-mitchell-starc-2633510-2024-11-14",
      "headline": "Sunil Gavaskar's advice to struggling Rohit Sharma ahead of Australia Test seriesIndia legend Sunil Gavaskar advised Rohit Sharma to curb his instinct for big hits, emphasizing patience against Australia's bowlers as essential to secure runs in the upcoming Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-king-australia-ravi-shastri-warning-2633489-2024-11-14",
      "headline": "'King' Kohli back in his territory in Australia: Ravi Shastri warns naysayersBorder-Gavaskar Trophy 2024-25: Ravi Shastri backed Virat Kohli to hit peak form with the bat in Australia, saying the former captain will enjoy batting in conditions where he has had success in the past. Kohli averages over 50 runs per innings in Tests in Australia with six hundreds Down Under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-vs-india-bgt-virat-kohli-rohit-sharma-home-sanjay-manjrekar-2633485-2024-11-14",
      "headline": "Australia will be home away from home for Virat Kohli, Rohit Sharma: ManjrekarBorder-Gavaskar Trophy: Sanjay Manjrekar backed Virat Kohli and Rohit Sharma to return to form in the upcoming five-Test series Down Under. The two batters failed in India's shocking 0-3 defeat to New Zealand in spin-friendly conditions at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sarfaraz-khan-shubman-gill-presents-bat-fun-perth-training-session-2633483-2024-11-14",
      "headline": "Sarfaraz presents Shubman Gill a bat during fun Perth training sessionIndia's Border-Gavaskar Trophy preparations saw a light-hearted moment as Sarfaraz Khan humorously presented Shubman Gill with the ball during a training session in Perth, adding a dose of camaraderie before the high-stakes series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-erling-haaland-transfer-rumours-sporting-director-deco-lewandowski-replacement-2633449-2024-11-14",
      "headline": "Haaland to Barcelona? Sporting Director Deco reacts on transfer buzzBarcelona Sporting Director Deco praised Erling Haaland's exceptional skills amid speculation linking the Manchester City star to a potential Barcelona move. Deco suggested Haaland's abilities could make him an ideal long-term successor to Robert Lewandowski."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-ipl-auction-mahipal-lomror-audition-triple-hundred-rajasthan-vs-uttarakhand-2633451-2024-11-14",
      "headline": "Ranji Trophy: Ex-RCB star warms up for IPL auction with blazing triple hundredRanji Trophy 2024: Mahipal Lomror has been making the right noises in the lead-up to the IPL mega auction. The left-handed batter scored his maiden triple hundred for Rajasthan against Uttarakhand on Thursday, October 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-mohammed-shami-to-be-flown-in-ranji-trophy-return-2633445-2024-11-14",
      "headline": "Mohammed Shami could be flown to Australia after brilliant Ranji trophy returnThe Indian team are reportedly considering flying in Mohammed Shami to Australia after the pacer made a sensational return in the Ranji Trophy for Bengal. Shami wreaked havoc on the Madhya Pradesh batting order as he picked up 4 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sarfaraz-khan-shubman-gill-presents-bat-fun-perth-training-session-2633483-2024-11-14",
      "headline": "Sarfaraz presents Shubman Gill a bat during fun Perth training sessionIndia's Border-Gavaskar Trophy preparations saw a light-hearted moment as Sarfaraz Khan humorously presented Shubman Gill with the ball during a training session in Perth, adding a dose of camaraderie before the high-stakes series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-erling-haaland-transfer-rumours-sporting-director-deco-lewandowski-replacement-2633449-2024-11-14",
      "headline": "Haaland to Barcelona? Sporting Director Deco reacts on transfer buzzBarcelona Sporting Director Deco praised Erling Haaland's exceptional skills amid speculation linking the Manchester City star to a potential Barcelona move. Deco suggested Haaland's abilities could make him an ideal long-term successor to Robert Lewandowski."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-ipl-auction-mahipal-lomror-audition-triple-hundred-rajasthan-vs-uttarakhand-2633451-2024-11-14",
      "headline": "Ranji Trophy: Ex-RCB star warms up for IPL auction with blazing triple hundredRanji Trophy 2024: Mahipal Lomror has been making the right noises in the lead-up to the IPL mega auction. The left-handed batter scored his maiden triple hundred for Rajasthan against Uttarakhand on Thursday, October 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-mohammed-shami-to-be-flown-in-ranji-trophy-return-2633445-2024-11-14",
      "headline": "Mohammed Shami could be flown to Australia after brilliant Ranji trophy returnThe Indian team are reportedly considering flying in Mohammed Shami to Australia after the pacer made a sensational return in the Ranji Trophy for Bengal. Shami wreaked havoc on the Madhya Pradesh batting order as he picked up 4 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-gautam-gambhir-brad-haddin-ricky-ponting-border-gavaskar-trophy-2024-25-aus-vs-ind-2633420-2024-11-14",
      "headline": "Gautam Gambhir reminded of his 1-match ban by Brad Haddin amid Ricky Ponting rowFormer Australia wicketkeeper batter touched upon Gautam Gambhir's one match man after physical altercation with Shane Watson in 2008 amid his ongoing row with Ricky Ponting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-glenn-maxwell-fireworks-reduced-overs-gabba-shootout-babar-azam-2633413-2024-11-14",
      "headline": "Gabba T20I: Maxwell fireworks too good for Pakistan in 7-over shootoutAustralia, under Josh Inglis' leadership, secured a decisive win over Pakistan in a rain-shortened T20I at The Gabba, taking a 1-0 series lead with an explosive batting display led by Glenn Maxwell and a strong bowling performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-predicted-xis-yash-dayal-vijaykumar-vysakh-debut-wanderers-johannesburg-2633395-2024-11-14",
      "headline": "SA vs IND 4th T20I Predicted XIs: Will Dayal or Vijaykumar get a look in?India and South Africa are all set to clash in the series finale, which will emanate from the Wanderers stadium in Johannesburg on November 15, Friday. Will India go for a change and give a debut to Yash Dayal or Vijaykumar Vysakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-links-ayemric-laporte-feels-good-defender-injury-concerns-al-nassr-2633386-2024-11-14",
      "headline": "Real Madrid links feel good: Al Nassr defender Laporte opens up on transfer buzzAl Nassr defender Aymeric Laporte hinted he would consider joining Real Madrid if they approached him, emphasising the honour of being linked with the LaLiga giants amid their search for defensive reinforcements due to a string of key injuries."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}