{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1282-points-lower-nifty-below-24600-infosys-down-nearly-4-percent-2724104-2025-05-13",
      "headline": "Sensex ends 1,282 points lower, Nifty below 24,600; Infosys down nearly 4%Sensex ends 1,282 points lower, Nifty below 24,600; Infosys down nearly 4%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nissan-q4-result-loss-usd-45-billion-japan-carmaker-honda-jv-job-cut-2724084-2025-05-13",
      "headline": "Nissan reports loss of $4.5 billion amid financial woesNissan Q4: This is one of the biggest yearly losses in the company's history and a major drop compared to the previous year's net profit of 426.6 billion yen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/staying-invested-and-staying-patient-radhika-gupta-md-and-ceo-of-edelweiss-mutual-fund-advice-after-stock-market-surge-may-12-2724069-2025-05-13",
      "headline": "'Staying invested and staying patient': Radhika Gupta's advice after market surgeIndian stock markets surged over 3.7% on May 12, their strongest performance in nearly a year. The rally came after a ceasefire agreement between India and Pakistan over the weekend, along with positive signals from global markets and strong mutual fund inflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crypto-platforms-asked-to-track-jk-transactions-for-money-laundering-report-2724035-2025-05-13",
      "headline": "Crypto platforms asked to track J&K transactions for money laundering: ReportOver the last year, exchanges have made crypto withdrawals more restrictive, requiring users to provide more information about who is receiving the funds and why. These measures aim to curb misuse, given the anonymous and borderless nature of crypto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-recovers-as-us-china-tariff-truce-spurs-bargain-buying-2724029-2025-05-13",
      "headline": "Gold recovers as US-China tariff truce spurs bargain-buyingSpot gold was up 0.6% at $3,254.39 an ounce, as of 0639 GMT. Bullion recorded a 2.7% decline in the previous session. US gold futures GCcv1 were up 1% at $3,258.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-sensex-nifty-fall-1000-points-investors-not-panic-dalal-street-bullish-experts-stay-calm-2724017-2025-05-13",
      "headline": "Sensex drops over 1,200 points, but here's why you shouldn't panicThe market pulled back from the gains made in the last session. The Sensex dropped over 1,000 points in early trade, and Nifty also slipped as investors booked profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-shares-continue-to-rally-up-4-percent-today-buy-sell-or-hold-2724013-2025-05-13",
      "headline": "Yes Bank shares continue to rally, up 4% today. Buy, sell or hold?The stock has now climbed nearly 19% in just five trading sessions and 21% in a month, but top brokerages remain unconvinced. Most still have a 'sell' or 'neutral' rating on the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-all-7-forms-out-key-changes-taxpayers-must-know-itr-1-itr-2-itr-3-itr-4-itr-5-itr-6-itr-7-2723975-2025-05-13",
      "headline": "ITR Filing 2025: All 7 forms out, key changes taxpayers must knowOne big change this year affects salaried individuals and small business owners who earn long-term capital gains (LTCG) from listed shares or mutual funds. If the gains are up to Rs 1.25 lakh a year, they can now file returns using ITR-1 or ITR-4 forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/swiggy-share-price-fall-7-percent-all-time-low-52-week-down-why-ipo-lock-in-period-expire-2723951-2025-05-13",
      "headline": "Explained: Why Swiggy shares fell up to 7% to hit 52-week low todaySwiggy shares have fallen around 45% since the beginning of the year. Over the past month, the stock has dropped 10%, and in the last three months, it has declined by 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-announce-q4-results-today-what-to-expect-pat-revenue-profit-2723930-2025-05-13",
      "headline": "Tata Motors to announce Q4 results today. Here's what to expectTata Motors stock: The company's share price fell nearly 1% during morning trade on Tuesday. It opened at Rs 720.55 and dropped to a day's low of Rs 714.35 as investors showed caution ahead of the results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-counter-tariffs-on-us-goods-over-steel-and-aluminium-duties-2723916-2025-05-13",
      "headline": "India proposes retaliatory tariffs on select US goods over steel duties: ReportIndia is mulling retaliatory duties on select US goods exported to the country in response to Washington's tariffs on steel and aluminium products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-fall-after-ceasefire-rally-why-is-dalal-street-declining-today-2723897-2025-05-13",
      "headline": "Sensex sinks over 1,200 points: Why is the stock market falling today?At 1:03 pm, the BSE Sensex had dropped 1150.76 points to 81,285.65, while the NSE Nifty50 slipped 284.80 points to 24,641.65. Most Nifty sectoral indices were mixed, reflecting broader uncertainty."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-wasted-zeenat-amans-comeback-ishaan-khatter-bhumi-pednekar-2724066-2025-05-13",
      "headline": "All smoke, no screen time: How The Royals wasted Zeenat Aman's comebackVeteran actor Zeenat Aman makes her much-anticipated comeback in Netflix's 'The Royals', but her return leaves fans disheartened. Read to find out how her presence was reduced to ornamental screen time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannes-film-festival-2025-homebound-to-charak-indian-films-set-for-global-spotlight-2724076-2025-05-13",
      "headline": "Cannes 2025: Homebound to Charak, Indian films set for global spotlightIndian films are making a strong mark at the Cannes Film Festival 2025 with films including 'Homebound', 'Aranyer Din Ratri', 'Tanvi The Great' and 'Charak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-tory-lanez-attacked-in-prison-while-serving-time-in-megan-thee-stallion-case-2724065-2025-05-13",
      "headline": "Rapper Tory Lanez attacked in prison while serving time in Megan Thee Stallion caseRapper Tory Lanez was stabbed 14 times while serving his time in California prison for shooting American rapper and songwriter Megan Thee Stallion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-joins-prabhas-in-sandeep-vanga-spirit-2724061-2025-05-13",
      "headline": "Deepika Padukone lands her biggest pay cheque ever for Prabhas's SpiritBollywood actor Deepika Padukone is set to star alongside Telugu superstar Prabhas in the highly-anticipated film 'Spirit'. The film marks her return after motherhood and with a record-breaking remuneration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/lee-min-ho-throws-ahn-hyo-seop-into-sea-in-omniscient-reader-the-prophet-second-trailer-2724060-2025-05-13",
      "headline": "Omniscient Reader 2nd trailer suprises as Lee Min-ho throws Ahn Hyo-seop into seaThe second teaser trailer for 'Omniscient Reader: The Prophet' is out. Ahn Hyo-seop, Lee Min-ho, and Blackpink's Jisoo battle to save humanity as a chaotic web novel world begins to collide with reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cannes-2025-leonardo-dicaprio-to-present-robert-de-niro-with-lifetime-achievement-award-2724045-2025-05-13",
      "headline": "Cannes 2025: Leonardo DiCaprio to present Robert De Niro with honorary Palme d'OrActor Leonardo DiCaprio will present veteran actor Robert De Niro with the honorary Palme d'Or at the 78th Cannes Film Festival. The festival begins on May 13. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-is-ruining-his-life-sitting-at-home-says-wife-sunita-ahuja-2724030-2025-05-13",
      "headline": "Govinda is 'ruining his life' sitting at home, says wife Sunita AhujaSunita Ahuja urged her husband, actor Govinda, to return to films, saying he is wasting his talent by staying away from the industry. She blamed bad company and outdated choices for his long absence from the screen. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-box-office-recovery-major-releases-india-pakistan-tensions-2723974-2025-05-13",
      "headline": "What's next for Bollywood amid rising India-Pak tensions? Experts weigh inRising India-Pak tensions are influencing Bollywood's film release strategies. Trade experts remain hopeful as recent hits and upcoming big films signal industry recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nitanshi-goel-parul-gulati-to-make-cannes-red-carpet-debut-2724000-2025-05-13",
      "headline": "Actors Nitanshi Goel, Parul Gulati to make Cannes red carpet debutActors Nitanshi Goel and Parul Gulati will make their Cannes red carpet debut this year. The two will represent Loreal Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-remembers-kantara-co-star-rakesh-poojary-died-heart-attack-2723982-2025-05-13",
      "headline": "Rishab Shetty remembers Kantara co-star Rakesh PoojaryKannada actor and comedian Rakesh Poojary died at the age of 33 after suffering a heart attack during a friend's function in Udupi. Kantara star Rishab Shetty paid tribute to him in an emotional Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-arrive-in-vrindavan-to-visit-premanand-maharaj-2723959-2025-05-13",
      "headline": "Anushka Sharma-Virat Kohli visit Premanand Maharaj in VrindavanA day after announcing his retirement from Test cricket, cricketer Virat Kohli, along with his wife Anushka Sharma, arrived in Vrindavan to visit Premanand Maharaj. A video of the duo inside a cab is going viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shaheer-sheikh-sleepless-night-family-safety-jammu-amid-india-pakistan-tension-salutes-army-2723927-2025-05-13",
      "headline": "Shaheer Sheikh had 'sleepless nights' over family's safety in Jammu, thanks ArmyShaheer Sheikh expressed deep gratitude towards the Indian Armed Forces amid rising tensions following Pakistan's attacks on Jammu, sharing his personal worries for his family in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-salutes-indian-army-for-their-sacrifice-amid-india-pakistan-tension-2723926-2025-05-13",
      "headline": "Behind every uniform there's a mother who hasn't slept: Alia Bhatt's powerful noteAlia Bhatt responded to the growing tension between India and Pakistan by sharing a heartfelt note dedicated to the brave individuals standing tall at the borders. On the occasion of Mother's Day, she also paid tribute to their mothers, giving them a special shoutout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kunal-kapoor-backs-jewel-thief-amid-backlash-2723882-2025-05-13",
      "headline": "Kunal Kapoor backs Jewel Thief amid backlash: It wasn't supposed to be profoundKunal Kapoor responded to the backlash faced by Jewel Thief, emphasising the film's creative intent and strong performances. He stood firmly with co-stars Saif Ali Khan and Jaideep Ahlawat in the face of criticism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-says-shah-rukh-khan-loved-bhool-bhulaiyaa-2-always-discusses-his-films-2723889-2025-05-13",
      "headline": "Kartik Aaryan says 'warm and kind' SRK complimented him for Bhool Bhulaiyaa 2Kartik Aaryan revealed that Shah Rukh Khan complimented him for Bhool Bhulaiyaa 2 and said he enjoyed it. The actor also shared that he is shy when it comes to complimenting colleagues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-daughter-klin-kaara-confuses-wax-figure-with-him-upasana-shares-adorable-moment-2723855-2025-05-13",
      "headline": "Ram Charan's daughter confuses wax figure with him, Upasana shares adorable momentRam Charan's daughter, Klin Kaara, adorably gatecrashed the unveiling of his wax statue, charming everyone in attendance. The heartwarming moment quickly went viral, capturing hearts across India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-trial-shocking-hotel-video-shows-alleged-assault-of-cassie-ventura-glbs-2723846-2025-05-13",
      "headline": "Diddy Trial: Shocking hotel video shows alleged assault of Cassie VenturaSean \"Diddy\" Combs is on trial for sex trafficking and assault, with surveillance footage showing him allegedly attacking ex-girlfriend Cassie Ventura. Prosecutors claim he abused women during coercive relationships.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cannes-film-festival-bans-nudity-and-oversized-outfits-on-red-carpet-glbs-2723843-2025-05-13",
      "headline": "Cannes Film Festival bans nudity and oversized outfits on red carpetThe Cannes Film Festival updates its red carpet dress code, banning nudity and oversized outfits. The new rules aim to enhance safety and decorum, balancing glamour with comfort and legal compliance at this high-profile event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-to-vicky-kaushal-celebs-react-to-virat-kohlis-test-retirement-2723714-2025-05-12",
      "headline": "Ranveer Singh to Vicky Kaushal, celebs react to Virat Kohli's Test retirementVirat Kohli announced his retirement from Test cricket on Monday. Bollywood actors like Ranveer Singh, Vicky Kaushal, and Suniel Shetty shared heartfelt tributes to honour his remarkable journey."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-place-in-pakistan-where-terrorists-can-hide-ghar-mein-ghus-kar-maarenge-pms-address-at-adampur-airbase-2724117-2025-05-13",
      "headline": "Ghar mein ghus kar maarenge: PM says no place in Pak where terrorists can hideNo place in Pakistan where terrorists can hide, ghar mein ghus kar maarenge: PM's address at Adampur airbase"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tension-live-updates-operation-sindoor-ceasefire-india-pak-conflict-news-drone-attack-2723850-2025-05-13",
      "headline": "Live: Terrorists, those backing them same in India's eyes, says PMThree days after India and Pakistan reached an understanding to halt military action, the situation along the border remains largely calm, barring a few instances of drone sightings on Monday night. Prime Minister Narendra Modi, in a strong and assertive speech on Monday, stated that Operation Sindoor has established a \"new normal\" in relations with neighbouring Pakistan. He reiterated that \"blood and water cannot flow together\" and warned Islamabad of a strong response in the event of any specific provocations or operations. Flight operations, which were widely disrupted, have begun to resume. However, some flights and airports remain non-operational. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-adampur-airbase-visit-message-importance-pakistan-s400-operation-sindoor-2724041-2025-05-13",
      "headline": "How PM Modi's visit to Adampur airbase debunked Pak's S-400 claimDuring PM Modi's visit to Adampur, an image of an MiG-29 jet and an intact S-400 air defence system was visible in the background. It debunked Pakistan's claim that its jets destroyed the S-400 air defence system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-400-missile-defence-systems-india-russia-operation-sindoor-pakistan-drones-2724090-2025-05-13",
      "headline": "India seeks additional S-400 missile defence systems from Russia: SourcesAfter the S-400's successful performance during Operation Sindoor, India has reportedly requested more such units from Russia to bolster its air defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorist-killed-in-gunfight-with-security-forces-in-jks-shopian-two-more-suspected-to-be-trapped-2723938-2025-05-13",
      "headline": "3 Lashkar terrorists killed in gunfight with security forces in J&K, AK-47s seizedThe Army launched Operation Keller -- named after the encounter site -- after it received \"specific intelligence\" from the Rashtriya Rifles unit. Of the three, the two slain terrorists were identified as Shahid Kuttay and Adnan Shafi, both residents of Shopian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-former-president-abdul-hamid-fled-thailand-controversy-interim-muhammad-yunus-awami-league-ban-2724025-2025-05-13",
      "headline": "Storm in Bangladesh as ex-President leaves for Thailand in lungi on 3 am flight  Former President Abdul Hamid left Bangladesh for Thailand in the wee hours last week, becoming the latest Awami League leader to slip out of the country after the fall of the Sheikh Hasina regime. A high-level probe has been constituted as to how Hamid was allowed to leave as he was an accused in at least one murder case. His exit coincides with the interim government of Muhammad Yunus banning the Awami League."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-admits-paf-air-force-officials-killed-india-strikes-operation-sindoor-2723994-2025-05-13",
      "headline": "Pak air force chief technician among 11 soldiers killed in Indian strikesThis is the first time Pakistan has confirmed that it lost air force personnel during India's 'Operation Sindoor', giving credence to the Indian Air Force's claim that it shot down 'a few planes' of the PAF."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-indias-akash-missile-hunts-locks-and-destroys-operation-sindoor-2724102-2025-05-13",
      "headline": "How India's Akash missile hunts, locks, and destroysIts success in neutralising the targets during Operation Sindoor showed its advanced capabilities, high success rate in defending Indian assets and why it needs to be celebrated more. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/railway-minister-ashwini-vaishnaw-shares-video-of-pm-modi-adampur-air-base-visit-fact-check-for-pakistan-2724073-2025-05-13",
      "headline": "Fact-check for Pakistan: Minister shares video of PM's Adampur air base visitThe Prime Minister's visit was significant as it demonstrated the air base was in fine condition, refuting reports of any damage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/satellite-images-pakistan-air-bases-nur-khan-india-operation-sindoor-2723934-2025-05-13",
      "headline": "Clear satellite pics show extensive damage to Pak bases after Indian strikesThe post-strike satellite images of the highest quality released by Maxar Technologies offer clear evidence of India's precision airstrikes on key military facilities in Pakistan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-declares-emergency-after-indian-strikes-cripple-vital-airstrips-2723969-2025-05-13",
      "headline": "Pakistan to revalidate emergency airstrips after Indian strikes cripple basesSources confirm that revalidation exercises for the M1 and M2 emergency airstrips - located on the Islamabad-Peshawar and Islamabad-Lahore motorways - are scheduled for this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-wasted-zeenat-amans-comeback-ishaan-khatter-bhumi-pednekar-2724066-2025-05-13",
      "headline": "All smoke, no screen time: How The Royals wasted Zeenat Aman's comebackVeteran actor Zeenat Aman makes her much-anticipated comeback in Netflix's 'The Royals', but her return leaves fans disheartened. Read to find out how her presence was reduced to ornamental screen time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mystery-over-the-death-of-padma-shri-scientist-subbanna-ayyappan-suicide-died-cauvery-river-found-body-2724039-2025-05-13",
      "headline": "Mystery over drowning death of scientist who spearheaded India's Blue RevolutionPadma Shri awardee and aquaculture pioneer scientist Subbanna Ayyappan, who had been missing for several days, was found dead on May 10. His body was recovered from the Cauvery River at Srirangapatna and later identified by police. Though initial findings point to a possible suicide, authorities aren't ruling out other angles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-families-name-daughters-sindoor-in-tribute-to-army-response-to-pahalgam-terror-attack-2724082-2025-05-13",
      "headline": "17 UP families name newborn daughters 'Sindoor' after India's operationSeventeen newborn girls in Kushinagar have been named Sindoor by their parents to honor India's military strike and instill a sense of bravery and patriotism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-sanjiv-khanna-retires-landmark-cases-judgements-legacy-waqf-law-2724067-2025-05-13",
      "headline": "A voice from the bench, not the podium: CJI Sanjiv Khanna's quiet legacyA private, deeply introspective judge with no prior experience as a High Court Chief Justice and just a six-month tenure at the Supreme Court's helm, Chief Justice Sanjiv Khanna defied expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-man-unbearable-experience-air-india-express-flight-ac-failure-viral-linkedin-post-2724004-2025-05-13",
      "headline": "Man posts pics of 'unbearable experience' on Air India Express flight after AC failureIn a now-viral post on LinkedIn, a Gurugram-based man shared pictures of visibly distressed passengers inside an Air India Express flight after the aircraft's air conditioning allegedly failed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/msbshse-board-class-10th-result-2025-live-maharashtra-ssc-10th-result-at-1-pm-today-at-sscresultmkclorg-pass-percentage-toppers-list-details-2723940-2025-05-13",
      "headline": "Maharashtra SSC Result 2025 declared Live: Direct link to check on sscresult.mkcl.orgMSBSHSE Maharashtra SSC Result 2025, mahresult.nic.in Live Updates: The Maharashtra State Board has announced the SSC 10th Result 2025 today, May 13. Over 15 lakh students can check their scores online at sscresult.mkcl.org and other official websites.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-board-result-2025-class-10th-12th-live-updates-cbseresults-nic-in-marks-scorecard-websites-to-check-digilocker-direct-link-2723941-2025-05-13",
      "headline": "CBSE Board 10th, 12th Result 2025 OUT: 93.66% pass Class 10, 88.39% pass Class 12CBSE Board Results Class 10th 12th 2025 Live Updates: The CBSE 10th and 12th results have been declared today. Check your CBSE result on official websites cbseresults.nic.in, cbse.gov.in, results.cbse.nic.in. Get latest updates on scorecard, result timing, past trends, DigiLocker access and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/indians-to-be-hit-as-uk-pm-tightens-permanent-residency-rules-migrants-in-united-kingdom-british-pm-keir-starmer-2723650-2025-05-12",
      "headline": "UK makes permanent residency norms tougher; Indians will be hit mostPrime Minister Keir Starmer unveiled the UK's immigration policy, doubling the wait time for permanent residency from 5 to 10 years. This will significantly impact Indian nationals, who are the largest group of immigrants to the UK. Starmer also vowed to introduce additional measures to curb immigration to the UK if needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-is-ruining-his-life-sitting-at-home-says-wife-sunita-ahuja-2724030-2025-05-13",
      "headline": "Govinda is 'ruining his life' sitting at home, says wife Sunita AhujaSunita Ahuja urged her husband, actor Govinda, to return to films, saying he is wasting his talent by staying away from the industry. She blamed bad company and outdated choices for his long absence from the screen. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/wont-have-any-impact-but-expect-it-to-be-rolled-back-pakistan-on-indias-indus-waters-treaty-move-2723898-2025-05-13",
      "headline": "Won't have any impact but expect it to be rolled back: Pak on India's Indus moveIn an interview with Reuters, Pakistani Finance Minister Muhammad Aurangzeb said there is no immediate impact from India's suspension of the treaty and that Pakistan does not even want to consider any scenario that does not involve the agreement's reinstatement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/anti-naxal-bijapur-chhattisgarh-operation-questioned-coverup-alleges-ex-cm-bhupesh-baghel-2724103-2025-05-13",
      "headline": "What is government hiding: Ex-Chhattisgarh Chief Minister doubts Naxal operationFormer Chhattisgarh Chief Minister Bhupesh Baghel sharply criticised the state government over an operation that reportedly killed 22 Naxals. He cited deleted tweets, conflicting statements and lack of transparency as evidence of a potential cover-up, and questioned the validity of the operation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-rises-to-2nd-spot-in-odi-batting-rankings-2724089-2025-05-13",
      "headline": "Smriti Mandhana rises to 2nd spot in ODI batting rankings after prolific tri seriesStar India batter Smriti Mandhana climbed to second spot in the ICC women's ODI batting rankings following her prolific run in the India's recent tri-nation series triumph in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-do-hyun-military-discharge-new-drama-offers-career-comeback-2724098-2025-05-13",
      "headline": "Lee Do-hyun discharged from military service: What's Next for Korean actor?South Korean actor Lee Do-hyun has been officially discharged from his military service after 21 months. His return to the entertainment industry is expected to bring new projects and rekindle his rising career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-wasted-zeenat-amans-comeback-ishaan-khatter-bhumi-pednekar-2724066-2025-05-13",
      "headline": "All smoke, no screen time: How The Royals wasted Zeenat Aman's comebackVeteran actor Zeenat Aman makes her much-anticipated comeback in Netflix's 'The Royals', but her return leaves fans disheartened. Read to find out how her presence was reduced to ornamental screen time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannes-film-festival-2025-homebound-to-charak-indian-films-set-for-global-spotlight-2724076-2025-05-13",
      "headline": "Cannes 2025: Homebound to Charak, Indian films set for global spotlightIndian films are making a strong mark at the Cannes Film Festival 2025 with films including 'Homebound', 'Aranyer Din Ratri', 'Tanvi The Great' and 'Charak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-tory-lanez-attacked-in-prison-while-serving-time-in-megan-thee-stallion-case-2724065-2025-05-13",
      "headline": "Rapper Tory Lanez attacked in prison while serving time in Megan Thee Stallion caseRapper Tory Lanez was stabbed 14 times while serving his time in California prison for shooting American rapper and songwriter Megan Thee Stallion."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-rises-to-2nd-spot-in-odi-batting-rankings-2724089-2025-05-13",
      "headline": "Smriti Mandhana rises to 2nd spot in ODI batting rankings after prolific tri seriesStar India batter Smriti Mandhana climbed to second spot in the ICC women's ODI batting rankings following her prolific run in the India's recent tri-nation series triumph in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-andy-murry-coach-split-french-open-2025-2724086-2025-05-13",
      "headline": "Novak Djokovic ends partnership with coach Andy Murray after poor start to seasonNovak Djokovic ended his partnership with coach Andy Murray after enduring a horror run on clay. Djokovic has not won a match on one of his favourite surfaces in the lead-up to this year's French Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-tribute-fans-rcb-vs-kkr-ipl-2025-viral-2724075-2025-05-13",
      "headline": "RCB fans call on crowd to wear Test whites for Virat Kohli tribute vs KKRRCB fans plan to wear whites in emotional tribute to Virat Kohli's iconic Test career during the team's first match after IPL 2025's restart against KKR at the Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-deserved-proper-send-off-bcci-must-look-into-it-anil-kumble-2724058-2025-05-13",
      "headline": "Both Kohli and Rohit deserved proper send-off, BCCI must look into it: Anil KumbleLegendary India spinner Anil Kumble feels that Virat Kohli and Rohit Sharma deserved proper farewells and the authorities must look into it. Rohit and Kohli announced their retirement from Tests within a space of six days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-has-set-an-example-often-senior-players-are-removed-childhood-coach-2723978-2025-05-13",
      "headline": "Virat Kohli has set an example, often senior players are removed: Childhood coachStar India batter Virat Kohli's childhood coach Rajkumar Sharma has said that he has set an example by announcing his retirement as often senior players are forced to leave the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-fitness-culture-cheteshwar-pujara-2723977-2025-05-13",
      "headline": "Virat Kohli brought the fitness culture to India Test team: Cheteshwar PujaraIndia batter Cheteshwar Pujara recalled how Virat Kohli revolutionised the team's Test cricket culture by prioritising fitness, intensity, and a results-driven mindset — setting new standards that reshaped the way India approached the red-ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-anushka-sharma-arrive-virndavan-test-rertirement-watch-video-2723960-2025-05-13",
      "headline": "Virat Kohli arrives in Vrindavan with wife Anushka day after Test retirementVirat Kohli and his wife Anushka visited Vrindavan's Premanand Maharaj a day after his sudden Test retirement. The popular couple have made multiple visits to spiritual centres in recent years, often in times of transition as this one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-set-to-clash-with-international-calendar-after-resumption-2723952-2025-05-13",
      "headline": "IPL 2025 set to clash with international calendar after resumptionThe Indian Premier League 2025 (IPL 2025) is all set to clash with the international calendar as it re-starts on May 17 with a fixture between Royal Challengers Bengaluru (RCB) and Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sairaj-pardeshi-weightlifting-gold-medal-khelo-india-youth-games-2723928-2025-05-13",
      "headline": "Sairaj breaks youth national records to win 81kg weightlifting goldSairaj Pardeshi stole the spotlight at the Khelo India Youth Games with three national records in weightlifting, while athletics saw multiple meet records shattered and Kerala surged up the medal tally with a kalarippayattu sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-world-test-championship-final-squad-cameron-green-returns-2723915-2025-05-13",
      "headline": "Cameron Green returns as Australia name squad for WTC finalCameron Green's return headlines Australia's strong squad for the World Test Championship Final against South Africa, as Pat Cummins leads a balanced mix of experience and youth into the high-stakes clash at the Lord's Stadium in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-sunil-gavaskar-workload-management-2723884-2025-05-13",
      "headline": "Make Jasprit Bumrah Test captain: Sunil Gavaskar rubbishes workload concernsSunil Gavaskar believes Jasprit Bumrah was the ideal choice to lead India's Test team, dismissing concerns around his workload and backing the pacer's ability to manage his fitness and responsibilities as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-anushka-sharma-arrive-virndavan-test-rertirement-watch-video-2723960-2025-05-13",
      "headline": "Virat Kohli arrives in Vrindavan with wife Anushka day after Test retirementVirat Kohli and his wife Anushka visited Vrindavan's Premanand Maharaj a day after his sudden Test retirement. The popular couple have made multiple visits to spiritual centres in recent years, often in times of transition as this one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-set-to-clash-with-international-calendar-after-resumption-2723952-2025-05-13",
      "headline": "IPL 2025 set to clash with international calendar after resumptionThe Indian Premier League 2025 (IPL 2025) is all set to clash with the international calendar as it re-starts on May 17 with a fixture between Royal Challengers Bengaluru (RCB) and Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sairaj-pardeshi-weightlifting-gold-medal-khelo-india-youth-games-2723928-2025-05-13",
      "headline": "Sairaj breaks youth national records to win 81kg weightlifting goldSairaj Pardeshi stole the spotlight at the Khelo India Youth Games with three national records in weightlifting, while athletics saw multiple meet records shattered and Kerala surged up the medal tally with a kalarippayattu sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-world-test-championship-final-squad-cameron-green-returns-2723915-2025-05-13",
      "headline": "Cameron Green returns as Australia name squad for WTC finalCameron Green's return headlines Australia's strong squad for the World Test Championship Final against South Africa, as Pat Cummins leads a balanced mix of experience and youth into the high-stakes clash at the Lord's Stadium in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-sunil-gavaskar-workload-management-2723884-2025-05-13",
      "headline": "Make Jasprit Bumrah Test captain: Sunil Gavaskar rubbishes workload concernsSunil Gavaskar believes Jasprit Bumrah was the ideal choice to lead India's Test team, dismissing concerns around his workload and backing the pacer's ability to manage his fitness and responsibilities as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-timing-england-tour-opinion-2723879-2025-05-13",
      "headline": "Did Virat Kohli time his Test retirement right?Virat Kohli's retirement from Test cricket, just 770 runs short of 10,000, marks the end of an era defined by passion, grit, and unmatched intensity. Despite calls to continue, Kohli chose to exit on his own terms—before the game could make the decision for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-shashi-tharoor-tribute-post-2723874-2025-05-13",
      "headline": "Shashi Tharoor pens special post for immortal Virat Kohli's Test retirementShashi Tharoor's emotional tribute to Virat Kohli captured the collective sentiment of fans, expressing admiration for the Test legend while lamenting the suddenness of his retirement without a farewell match on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-cricket-australia-players-return-support-individual-decision-2723861-2025-05-13",
      "headline": "Australia board to support players' individual decisions on IPL 2025 returnCricket Australia has confirmed it will support players' individual choices regarding their return to IPL 2025, allowing them to prioritize safety, recovery, and preparation for upcoming international commitments, especially the World Test Championship final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-interview-virat-kohli-rohit-sharma-india-test-team-2723796-2025-05-12",
      "headline": "India to go through a difficult transition phase, Sunil GavaskarIndia will go through a difficult phase of transition as they try to replace three senior players - R Ashwin, Rohit Sharma and Virat Kohli, feels Sunil Gavaskar. Gavaskar said that any team in the world would have found it tough to replace three players in one go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-revised-schedule-bcci-confirms-final-june-3-2723766-2025-05-12",
      "headline": "IPL 2025 to resume on May 17, 6 venues decided, final on June 3: BCCIIPL 2025: The BCCI confirmed that the Indian Premier League will restart on May 17 and the final will be played on June 3. The remainder of the season will be played across six venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-sunil-gavaskar-reaction-selection-2723762-2025-05-12",
      "headline": "Not surprised by Virat Kohli's Test retirement: Sunil GavaskarLegendary Sunil Gavaskar, speaking to India Today, said the selectors and the BCCI top brass would have discussed plans for the next cycle of the World Test Championship with both Rohit Sharma and Virat Kohli, influencing their decisions to retire before the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-doubts-virat-kohli-rohit-sharma-2027-odi-world-cup-chances-2723758-2025-05-12",
      "headline": "Virat Kohli and Rohit Sharma will not play 2027 ODI World Cup: GavaskarSunil Gavaskar has expressed doubts over Virat Kohli and Rohit Sharma's chances in India's 2027 ODI World Cup squad. Rohit and Virat will be 40 and 38 respectively by the time of the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-interview-virat-kohli-rohit-sharma-india-test-team-2723796-2025-05-12",
      "headline": "India to go through a difficult transition phase, Sunil GavaskarIndia will go through a difficult phase of transition as they try to replace three senior players - R Ashwin, Rohit Sharma and Virat Kohli, feels Sunil Gavaskar. Gavaskar said that any team in the world would have found it tough to replace three players in one go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-revised-schedule-bcci-confirms-final-june-3-2723766-2025-05-12",
      "headline": "IPL 2025 to resume on May 17, 6 venues decided, final on June 3: BCCIIPL 2025: The BCCI confirmed that the Indian Premier League will restart on May 17 and the final will be played on June 3. The remainder of the season will be played across six venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-sunil-gavaskar-reaction-selection-2723762-2025-05-12",
      "headline": "Not surprised by Virat Kohli's Test retirement: Sunil GavaskarLegendary Sunil Gavaskar, speaking to India Today, said the selectors and the BCCI top brass would have discussed plans for the next cycle of the World Test Championship with both Rohit Sharma and Virat Kohli, influencing their decisions to retire before the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-doubts-virat-kohli-rohit-sharma-2027-odi-world-cup-chances-2723758-2025-05-12",
      "headline": "Virat Kohli and Rohit Sharma will not play 2027 ODI World Cup: GavaskarSunil Gavaskar has expressed doubts over Virat Kohli and Rohit Sharma's chances in India's 2027 ODI World Cup squad. Rohit and Virat will be 40 and 38 respectively by the time of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-appointed-brazil-head-coach-after-real-madrid-exit-2723741-2025-05-12",
      "headline": "Greatest coach in greatest team: Brazil welcomes Carlo AncelottiCarlo Ancelotti will become the head coach of Brazil after leaving Real Madrid. His appointment aims to restore Brazil's dominance ahead of the 2026 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-restart-plan-pcb-2723736-2025-05-12",
      "headline": "Pakistan prepares to restart PSL 2025 by May 16: ReportThe Pakistan Cricket Board is planning to complete the remainder of the Pakistan Super League in Rawalpindi and Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-leadership-test-cricket-india-overseas-success-retirement-praised-roger-binny-2723727-2025-05-12",
      "headline": "Virat Kohli changed the way India competed overseas: BCCI presidentBCCI president Roger Binny has praised Virat Kohli for his exceptional leadership in Indian Test cricket. Kohli's retirement closes a significant chapter, highlighting his impact on India's overseas success and cricket culture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-shocking-delhi-coach-sarandeep-singh-england-test-tour-2723722-2025-05-12",
      "headline": "Virat Kohli aimed for 3-4 tons in England, was ready to play for India A: Delhi coachDelhi's Ranji Trophy coach, Sarandeep Singh, said Virat Kohli was keen on playing for India in the tour of England in June. The former India spinner said Kohli had told him that he was ready to play practice matches with India 'A' team before the Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-leaves-real-madrid-xabi-alonso-new-manager-2723690-2025-05-12",
      "headline": "Carlo Ancelotti to exit Real Madrid, Xabi Alonso to replace himCarlo Ancelotti will leave Real Madrid at the end of the season to coach Brazil. Xabi Alonso is set to replace him, aiming to lead Real into the new era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-reactions-nextgen-shubman-gill-yashasvi-jaiswal-2723683-2025-05-12",
      "headline": "Gill to Jaiswal: How India's NextGen reacted to Virat Kohli's Test retirementFrom Shubman Gill to Nitish Kumar Reddy, the next generation of Indian cricket paid glowing tribute to Virat Kohli after the star batter retired from Tests. \"A true torchbearer who renewed our love for Test cricket,\" Reddy wrote, capturing the impact Kohli had on the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retires-test-cricket-30-hundreds-record-captain-wins-2723676-2025-05-12",
      "headline": "Virat Kohli retires: An ode to a Test captain and player who did things his wayVirat Kohli leaves Test cricket as one of the greatest batters for India in the format and as their best captain. Throughout his career, Kohli did one thing only – he played the game his way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retires-india-most-successful-test-captain-2723664-2025-05-12",
      "headline": "Virat Kohli's India instilled fear in opposition: Karthik on batter's legacyVirat Kohli has retired from Test cricket, ending an era of intense leadership and batting excellence. Dinesh Karthik speaks on the legacy that the batter leaves behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-mohammed-siraj-superhero-tribute-anushka-sharma-2723640-2025-05-12",
      "headline": "Mohammed Siraj's tribute to 'superhero' Virat Kohli wins heart from Anushka SharmaFast bowler Mohammed Siraj wrote an emotional tribute to Virat Kohli after the former captain retired from Test cricket on Monday, May 12. Siraj played eight Tests under Kohli's captaincy and played a key role in the famous win at Lord's in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaun-tait-bangladesh-bowling-coach-pakistan-2723635-2025-05-12",
      "headline": "Former Pakistan coach joins Bangladesh as pace bowling coachBangladesh roped in Shaun Tait as their pace bowling coach before the two-match T20I series against the United Arab Emirates (UAE) to be held from May 17. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-bengal-eden-gardens-ipl-armed-forces-2723609-2025-05-12",
      "headline": "CAB drapes Eden Gardens in banner in salute to armed forcesThe Cricket Association of Bengal (CAB) paid tribute to the Indian armed forces by displaying a large banner on the Eden Gardens clubhouse. This heartfelt gesture honours the bravery, resilience, and dedication of the Indian Army, Navy, and Air Force."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-captains-stats-analysis-india-retirement-2723562-2025-05-12",
      "headline": "Where does Virat Kohli, India's greatest, stand among the best Test captains?Virat Kohli is India's most successful Test captain, with 40 wins from the 68 matches he led. But where does he rank among the greatest skippers Test cricket has ever seen?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}