{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's comeback on trial after deadly Air India Dreamliner crashThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-crashes-over-1100-points-nifty-below-24600-tata-group-shares-fall-up-to-2-percent-2740097-2025-06-13",
      "headline": "Sensex, Nifty crash as Israel attacks Iran; oil prices jump sharplyThe S&P BSE Sensex tanked 838.78 points to 80,853.20, while the NSE Nifty50 lost 252.80 points to 24,635.40 as of 9:25 am. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-1200-points-iran-israel-middle-east-conflict-oil-prices-explained-2740093-2025-06-13",
      "headline": "Sensex falls over 1,100 points. Why is the stock market falling today?The BSE Sensex was down 1121.35 points to 80,570.63 at 9:16 am, while the NSE Nifty50 tumbled 334.65 points to trade at 24,553.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-13-sensex-nifty-crash-today-israel-iran-war-conflict-crude-oil-price-aviation-tata-adani-air-india-2740065-2025-06-13",
      "headline": "Stock market opening: Will Sensex, Nifty crash today over Israel-Iran conflict?The situation in the Middle East has affected global investor sentiment. Oil prices also jumped on fears that the strikes could affect supply from the region, which is known for producing large amounts of oil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-13-nse-bse-trading-tata-group-ril-hcl-asian-paints-icra-icici-bank-2740062-2025-06-13",
      "headline": "Stocks to watch on June 13: Tata Group, RIL, HCL, Asian Paints, ICRA, ICICI BankShares of several Tata Group companies, such as Tata Motors, Tata Steel and Tata Chemicals, are expected to remain in the spotlight after the crash of Air India flight AI171 in Ahmedabad shortly after takeoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/boeing-shares-nosedive-5-percent-after-air-india-dreamliner-crash-kills-over-200-2739941-2025-06-12",
      "headline": "Boeing shares slide 5% after Air India Dreamliner crash kills over 200Flight AI171, bound for London, went down minutes after departure, killing more than 200 people in what is now the world's deadliest aviation disaster in a decade. The cause of the crash remains unclear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-to-give-rs-1-crore-to-families-of-ahmedabad-air-india-787-dreamliner-plane-crash-victims-2739919-2025-06-12",
      "headline": "Tata Group to give Rs 1 crore to families of Ahmedabad Air India crash victimsTata Group will offer Rs 1 crore to family members of people who lost their lives in the Ahmedabad crash of Air India Flight 171, which killed over 200 people on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-ceo-campbell-wilson-reaction-to-ahmedabad-london-787-dreamliner-plane-crash-2739907-2025-06-12",
      "headline": "This is a difficult day for us: Air India CEO reacts to Ahmedabad plane crashAt least 204 people were killed and 41 injured after the London-bound Air India flight crashed just minutes after taking off from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-six-year-low-falls-to-282-percent-in-may-2025-2739809-2025-06-12",
      "headline": "Retail inflation hits six-year low, falls to 2.82% in May 2025The decline in retail inflation is mainly because food prices rose at a much slower pace than before. Cheaper vegetables, fruits, cereals, and pulses helped bring food inflation down sharply. In May, food inflation fell to 0.99% from 1.78% in April."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-review-karan-johar-show-feels-like-a-luxe-twisted-roadies-ride-2739994-2025-06-13",
      "headline": "The Traitors review: Bigg Boss meets Roadies in Karan Johar's luxe reality showReleased-Thu Jun 12, 2025Karan Johar-hosted show 'The Traitors' is now streaming on Prime Video. The reality show, with an impressive lineup of 20 celebrities, is a power play of vicious betrayals, cold-hearted deception, and constant manipulations. Read our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-rm-emotional-letter-on-bands-12th-anniversary-moves-fans-to-tears-2740145-2025-06-13",
      "headline": "BTS RM's emotional letter on band's 12th anniversary moves fans to tearsBTS commemorated their 12th anniversary with leader RM sharing an emotional letter expressing gratitude and disbelief. Fans across were touched by his heartfelt words celebrating the group's journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-veer-pahariya-helped-recover-stolen-mahavir-chakra-ab-devayya-2740144-2025-06-13",
      "headline": "How Akshay Kumar, Veer Pahariya helped recover stolen war hero's Mahavir ChakraActors Akshay Kumar and Veer Pahariya helped recover and return the stolen Mahavir Chakra medal of 1965 war hero, Squadron Leader AB Devayya. The medal was handed back to his family in a special ceremony held by the Indian Air Force in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mountain-of-sadness-anupam-kher-priyanka-chopra-condole-air-india-plane-crash-2740135-2025-06-13",
      "headline": "Mountain of sadness: Anupam Kher, Priyanka Chopra condole Air India plane crashActors Anupam Kher and Priyanka Chopra mourned the loss of lives in the Air India plane crash on Thursday afternoon. Anupam expressed the plane was not just a machine but a moving hope in which our loved ones were sitting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-loses-luxury-apartment-penalty-payment-kim-sae-ron-garosero-2740127-2025-06-13",
      "headline": "South Korean actor Kim Soo-hyun loses apartment after missing penalty paymentActor Kim Soo-hyun failed to pay a penalty fee for one of his luxury apartments, a day after winning a court order to seize Kim Se Ui's properties over the Kim Sae Ron scandal fallout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hopes-killin-it-girl-is-the-empowerment-anthem-weve-been-waiting-for-2740139-2025-06-13",
      "headline": "BTS' J-hope's Killin' It Girl is the empowerment anthem we've been waiting forJ-hope returns with his infectious solo Killin' It Girl, blending pop and hip-hop with a powerful message of self-love. Featuring GloRilla, the track and its vibrant visuals celebrate confidence and independence, making it a summer anthem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahima-chaudhry-daughter-ariana-birthday-instagram-video-2740134-2025-06-13",
      "headline": "Mahima Chaudhry celebrates daughter Ariana's birthday, fans call them twinsActor Mahima Chaudhry celebrated her daughter Ariana's birthday by sharing a lovely video on Instagram. Fans and celebrities sent wishes and also commented that Ariana is a spitting image of her mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-priya-sachdev-sunjay-kapoor-wife-karisma-kapoor-2740120-2025-06-13",
      "headline": "Who is Priya Sachdev, Sunjay Kapur's wife who once worked with Kareena Kapoor?Actor Karisma Kapoor's ex-husband, industrialist Sunjay Kapur, died on June 12 following a heart attack. He was married to former actor and entrepreneur Priya Sachdev.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tiger-shroff-trolls-cricket-video-in-track-pants-2740110-2025-06-13",
      "headline": "Tiger Shroff responds to trolls with new cricket video in track pantsActor Tiger Shroff responded to trolls about his viral cricket video, where he played in briefs. The actor shared a new clip in track pants with a funny caption on his Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-day-7-akshay-kumars-film-slows-down-after-one-week-run-2740111-2025-06-13",
      "headline": "Housefull 5 box office Day 7: Akshay Kumar's film slows down after one week run'Housefull 5', Akshay Kumar's comedy entertainer, witnessed a drop in its day-wise collection on Day 7. The film released in theatres on June 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-metro-in-dino-shoots-in-minimal-clothing-2740094-2025-06-13",
      "headline": "Pankaj Tripathi shoots in minimal clothing, says it's not for sensationalismPankaj Tripathi stepped out of his comfort zone in 'Metro… In Dino' by shooting a bold scene in public with minimal clothing. He called it a necessary part of the story and not just done for attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-8-kamal-haasan-film-no-growth-45-crore-in-india-2740103-2025-06-13",
      "headline": "Thug Life box office Day 8: No growth for Kamal Haasan's film, eyes Rs 45 croreKamal Haasan and director Mani Ratnam's 'Thug Life' has been earning around Rs 1 crore in India during the weekdays. It is inching closer to Rs 45 crore nett at the domestic box office, which is low for a film with big names."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-rashmika-kuberaa-pre-release-event-postponed-after-air-india-plane-crash-2740068-2025-06-13",
      "headline": "Dhanush, Rashmika's Kuberaa pre-release event postponed after Air India plane crashThe makers of 'Kuberaa' have postponed the film's pre-release event following the tragic Ahmedabad plane crash. This move is to honour the victims and show solidarity during this difficult time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-becomes-first-punjabi-rapper-to-attend-paris-mens-fashion-week-2025-2740064-2025-06-13",
      "headline": "Badshah becomes first Punjabi rapper to attend Paris Men's Fashion Week 2025Indian rapper Badshah is set to make his debut at Paris Men's Fashion Week 2025. He became the first Punjabi rapper to attend as a celebrity guest.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-personal-trainer-prashant-sawants-wedding-2740076-2025-06-13",
      "headline": "Shah Rukh Khan turns up at his stylish best at personal trainer's wedding. VideoShah Rukh Khan attended his personal trainer Prashant Sawant's wedding in Mumbai on Thursday. He was accompanied by his manager, Pooja Dadlani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-clarifies-air-india-flight-co-pilot-clive-kunder-wasnt-his-cousin-2740059-2025-06-13",
      "headline": "Vikrant Massey clarifies Air India flight co-pilot Clive Kunder wasn't his cousinActor Vikrant Massey has addressed rumours about losing his cousin in the recent Air India crash. He confirmed that the victim, Clive Kunder, was a close family friend, not a relative.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-saif-ali-khan-karisma-kapoor-house-after-ex-husband-sunjay-kapur-death-2740047-2025-06-13",
      "headline": "Kareena and Saif rush to Karisma Kapoor's house after Sunjay Kapur's deathKareena Kapoor and Saif Ali Khan rushed to Karisma Kapoor's house after her ex-husband Sunjay Kapur's death. Sunjay died of a heart attack while playing polo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-opens-up-about-als-diagnosis-in-first-tv-interview-glbs-2740032-2025-06-13",
      "headline": "Eric Dane opens up about ALS diagnosis: I don't think this is end of my story'Grey's Anatomy' actor Eric Dane opened up about his ALS diagnosis in an emotional GMA interview, sharing strength, hope, and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mel-brooks-to-return-as-yogurt-in-long-awaited-spaceballs-sequel-glbs-2740022-2025-06-13",
      "headline": "Mel Brooks to Return as Yogurt in Long-Awaited 'Spaceballs' SequelMel Brooks will reprise his role as Yogurt in a new Spaceballs sequel from Amazon MGM, set for 2027. The cult comedy legend returns to acting just ahead of his 99th birthday.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-live-updates-air-india-flight-boeing-london-passengers-death-casualties-rescue-2739697-2025-06-12",
      "headline": "Live: Black box not recovered, reports only speculation, says Air IndiaAir India Ahmedabad-London Flight Crash Live: At least 265 people have died in the Air India plane crash that took place in Ahmedabad on Thursday. Prime Minister Narendra Modi is likely to visit Ahmedabad to take stock of the situation. The airline, in a post on X, confirmed that only one of the 242 passengers and crew onboard had miraculously survived the crash. Rescue operations at the site have now been completed. The flight bound for London crashed near Ahmedabad airport during take-off. The crash occurred as the aircraft was lifting off, according to early reports. Emergency services are at the scene. Stay with IndiaToday.in for live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/plane-broke-my-seat-came-off-lone-air-india-crash-survivor-reveals-how-he-escaped-deadly-accident-2740133-2025-06-13",
      "headline": "How I survived: Vishwas Kumar, on seat 11A, recounts miracle escape from crashVishwash Kumar Ramesh was in seat 11A of the doomed Air India flight. After the plane crashed and exploded, he was the only person pulled out alive from the wreckage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-launches-airstrike-in-iran-explosions-heard-in-tehran-report-glbs-2740035-2025-06-13",
      "headline": "Israel hits Iran's nuke sites, Army chief killed; Tehran retaliates with 100 drones  Live UpdatesIsrael on Friday launched preemptive strikes on Iran, which the nation called Operation Rising Lion, and said was necessary to wade off the nuclear threat from Tehran's side. Meanwhile, Iran has vowed retaliation and after the strikes killed several, including Iran's Revolutionary Guards Commander Hossein Salami."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-latest-news-ahmedabad-airport-death-injured-survivor-pm-modi-amit-shah-boeing-cause-investigation-2740044-2025-06-13",
      "headline": "265 dead in Air India crash, 1 survivor; forensics team at accident siteAir India Flight AI171 bound for London crashed moments after taking off from Ahmedabad airport, killing at least 265 people in what authorities described as the world's worst aviation disaster in a decade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-explainer-how-ill-fated-air-india-171-crashed-2739913-2025-06-12",
      "headline": "Video explainer: How ill-fated Air India AI-171 crashedAn Air India plane with 242 people on board crashed near Sardar Vallabhbhai Patel International Airport shortly after taking-off on Thursday in Ahmedabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-was-aware-of-israels-strikes-on-iran-in-advance-says-no-surprises-report-2740109-2025-06-13",
      "headline": "Trump was aware of Israel's strikes on Iran in advance, says no surprises: ReportDonald Trump claimed that he and his administration had prior information that Israel was going to strike Iran and he hopes that Iran will return to the negotiating table following the strikes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-london-air-india-flight-diverted-due-to-iran-airspace-closure-after-israel-strike-2740095-2025-06-13",
      "headline": "At least 16 Air India flights diverted due to Iran airspace closure after Israel strikeSeveral Air India flights were diverted or forced to return to their origin airports after Iran closed its airspace following a major Israeli strike on Tehran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-rafael-nadal-novak-djokovic-big-three-grand-slam-2740122-2025-06-13",
      "headline": "Was never loved like Roger Federer and Rafael Nadal: Novak DjokovicNovak Djokovic has claimed that he was never loved like Roger Federer and Rafael Nadal during their playing days and felt like the third guy in tennis. Djokovic shared legendary rivalries with both Federer and Nadal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-review-karan-johar-show-feels-like-a-luxe-twisted-roadies-ride-2739994-2025-06-13",
      "headline": "The Traitors review: Bigg Boss meets Roadies in Karan Johar's luxe reality showReleased-Thu Jun 12, 2025Karan Johar-hosted show 'The Traitors' is now streaming on Prime Video. The reality show, with an impressive lineup of 20 celebrities, is a power play of vicious betrayals, cold-hearted deception, and constant manipulations. Read our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/passenger-list-of-the-ahmedabad-plane-crash-what-we-know-so-far-2739746-2025-06-12",
      "headline": "169 Indians among 241 flyers killed in Air India flight crash: List of passengersAn Air India flight carrying over 242 passengers crashed near Ahmedabad Airport minutes after takeoff, triggering a massive rescue operation. Details about the passengers and casualties are still emerging as authorities work at the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-narendra-modi-meets-air-india-plane-crash-lone-survivor-vishwash-kumar-ramesh-ahmedabad-hospital-video-2740150-2025-06-13",
      "headline": "Video: PM Modi meets Air India plane crash lone survivor at Ahmedabad hospitalPM Modi visits the Civil Hospital in Ahmedabad and meets the lone survivor, Vishwash Kumar Ramesh, of the Air India plane crash and other people injured in the accident.  In the plane crash, 265 people lost their lives. He was accompanied by Gujarat Chief Minister Bhupendra Patel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-ahmedabad-airport-banswara-family-death-toll-2739989-2025-06-12",
      "headline": "Rajasthan couple headed to London with kids among Air India plane crash victimsThe family was traveling together when the ill-fated aircraft, operating as flight AI171, crashed into a medical college complex in Ahmedabad's Meghaninagar area and erupted into flames."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-ex-husband-sunjay-kapur-dies-of-heart-attack-at-53-2740002-2025-06-12",
      "headline": "Karisma Kapoor's ex-husband Sunjay Kapur dies of heart attack at 53 Actor Karisma Kapoor's ex-husband, Sanjay Kapur, died of a heart attack in England. He was 53."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/temperature-high-due-to-burning-of-125-lakh-litre-fuel-no-opportunity-to-save-anyone-amit-shah-2739968-2025-06-12",
      "headline": "No chance to save, 1.25 lakh litre fuel burned: Amit Shah on plane crashOn Thursday, flight AI-171 crashed on a government hospital hostel near Ahemdabad's Sardar Vallabbhai Patel International Airport, leaving a field of debris and scenes of devastation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newlywed-from-rajasthan-on-way-to-meet-husband-in-uk-among-victims-of-gujarat-air-crash-2739949-2025-06-12",
      "headline": "Newlywed on way to meet husband in UK among victims of Gujarat air crashKhushboo and Vipul married in January this year. While Vipul had left for UK shortly after the wedding, Khushboo was on her way to join him when the flight she was travelling on crashed in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-expresses-deep-concern-on-iran-israel-tension-urges-both-sides-to-avoid-any-escalatory-steps-2740146-2025-06-13",
      "headline": "Deeply concerned: India calls for restraint as Israel, Iran trade airstrikesThe Ministry of External Affairs said that India shares close and friendly relations with both Iran and Israel and \"stands ready to extend all possible support.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dua-lipa-callum-turner-are-engaged-singer-reflects-on-growing-old-with-actor-2739915-2025-06-12",
      "headline": "Dua Lipa, Callum Turner are engaged, singer reflects on growing old with actorSinger Dua Lipa confirmed her engagement to British actor Callum Turner. She also opened up on her future plans with Turner, while reflecting on their bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-revolutionary-guards-chief-hossein-salam-killed-in-israeli-strike-tehran-state-media-confirms-2740046-2025-06-13",
      "headline": "Iran's Revolutionary Guards chief Hossein Salami killed in Israeli strike: ReportsIranian state media on Friday confirmed the killing of Iran's Revolutionary Guards Commander Hossein Salami in an Israeli strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-clarifies-air-india-flight-co-pilot-clive-kunder-wasnt-his-cousin-2740059-2025-06-13",
      "headline": "Vikrant Massey clarifies Air India flight co-pilot Clive Kunder wasn't his cousinActor Vikrant Massey has addressed rumours about losing his cousin in the recent Air India crash. He confirmed that the victim, Clive Kunder, was a close family friend, not a relative.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-gujrat-vijay-rupani-dies-air-india-crash-london-bound-ahmedabad-airport-abvp-2739829-2025-06-12",
      "headline": "Vijay Rupani: How the Rangoon-born came to lead GujaratFormer Gujarat Chief Minister Vijay Rupani died in the Air India crash in Ahmedabad on Thursday, just five minutes after take-off. Born in Myanmar and raised in Rajkot, Rupani rose from a student activist to Gujarat's 16th CM, with deep roots in the BJP and strong ties to PM Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/diya-chitale-ultimate-table-tennis-la-olympics-2028-2740090-2025-06-13",
      "headline": "Diya Chitale: The tiny titan of Indian table tennis dreamsDabang Delhi's Diya Chitale believes that India have a proper shot at a table tennis medal at the LA Olympics. India Today spoke to her on the sidelines of Ultimate Table Tennis where she opened up on her journey and the growing Indian TT scene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-visits-ahmedabad-crash-site-day-after-air-india-disaster-killed-256-2740081-2025-06-13",
      "headline": "PM devastated after visiting crash site, meeting survivors: We understand the painPrime Minister Narendra Modi visited the Ahmedabad crash site today, after an Air India disaster killed 265 people. The London-bound flight crashed just moments after take-off from the Ahmedabad airport.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-diwali-gift-now-hindus-jewish-people-can-freely-display-sacred-symbols-religious-symbols-toran-jewish-mezuzah-indian-origin-2739768-2025-06-13",
      "headline": "US state's Diwali gift: Now Hindus can freely display religious symbolsNevada Governor Joe Lombardo has signed Senate Bill 201 into law, allowing religious door displays like Hindu torans and Jewish mezuzahs. The law, effective October 1, ensures residents can freely express their faith at home. The bill also set a new standard by mandating respectful handling of religious displays during home maintenance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sonam-raj-kushwaha-murder-of-raja-raghuvanshi-meghalaya-honeymoon-case-police-shocking-details-plan-2740027-2025-06-13",
      "headline": "Raj mastermind, aides killed as favour: New details in Raja Raghuvanshi's murder caseAccording to Shillong Superintendent of Police Vivek Syiem, the murder was planned 11 days before Sonam's wedding to Raja."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-2-david-bedingham-full-press-conference-2740172-2025-06-13",
      "headline": "Match can go either way, but we've a lot of belief in dressing room: BedinghamSouth Africa batter David Bedingham said that the World Test Championship (WTC) final 2025 hangs in the balance on Day 2, but mentioned that there's enough belief in the dressing room to chase down whatever Australia puts on the board. Australia finished Day 2 on 144/8, leading by 218 runs in their second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-pat-cummins-josh-hazlewood-mitchell-starc-matthew-hayden-2740161-2025-06-13",
      "headline": "Cummins-Hazlewood-Starc better than McGrath-Lee-Gillespie: Hayden's big claimMatthew Hayden has praised the current Australian pace trio of Pat Cummins, Josh Hazlewood and Mitchell Starc after their dominant Day 2 performance in the World Test Championship final. Hayden feels that the trio is better than the pace attack of Glenn McGrath, Jason Gillespie and Glenn McGrath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mlc-2025-finn-allen-shatters-multiple-records-san-franciso-unicorns-2740157-2025-06-13",
      "headline": "Finn Allen shatters multiple records en route 51-ball 151 for San FranciscoNew Zealand batter Finn Allen rewrote the record books with his breathtaking innings of 151 (51) during the opening game of Major League Cricket 2025 (MLC 2025) for San Francisco Unicorns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-tottenham-hotspur-appoint-thomas-frank-ange-postecoglou-2740142-2025-06-13",
      "headline": "Tottenham Hotspur announce Thomas Frank as Ange Postecoglou replacementTottenham Hotspur have appointed Thomas Frank as their new manager on a three-year contract. The Danish coach replaces Ange Postecoglou after a disappointing Premier League season, that saw Spurs finish 17th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-excited-about-being-on-threshold-of-becoming-wtc-winners-david-bedingham-2740131-2025-06-13",
      "headline": "SA excited about being on threshold of becoming WTC winners: David BedinghamSouth Africa batter David Bedingham said that the team is excited about being on the cusp of winning the World Test Championship (WTC) title. South Africa will have to chase down a target in excess of 200 to stake claim of the coveted mace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-rafael-nadal-novak-djokovic-big-three-grand-slam-2740122-2025-06-13",
      "headline": "Was never loved like Roger Federer and Rafael Nadal: Novak DjokovicNovak Djokovic has claimed that he was never loved like Roger Federer and Rafael Nadal during their playing days and felt like the third guy in tennis. Djokovic shared legendary rivalries with both Federer and Nadal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/diya-chitale-ultimate-table-tennis-la-olympics-2028-2740090-2025-06-13",
      "headline": "Diya Chitale: The tiny titan of Indian table tennis dreamsDabang Delhi's Diya Chitale believes that India have a proper shot at a table tennis medal at the LA Olympics. India Today spoke to her on the sidelines of Ultimate Table Tennis where she opened up on her journey and the growing Indian TT scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-2-pat-cummins-full-press-conference-2740086-2025-06-13",
      "headline": "Happy to get a lead of 200, hopefully we get another 20 or 30 tomorrow: Pat CumminsAustralia captain Pat Cummins said that he was delighted with his team crossing the 200-run lead in the second innings of the World Test Championship (WTC) final against South Africa. Australia finished Day 2 at 144/8, leading by 218 runs at the end of the day's play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-india-a-in-4-day-intra-squad-game-in-beckenham-live-streaming-2740078-2025-06-13",
      "headline": "India vs India A in 4-day intra-squad game in Beckenham: Will it be streamed live?India will finalise their preparation for the all-important five-match Test series against England, through a 4-day intra-squad warm-up fixture against India A. However, the match will not be live-streamed for fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-pat-cummins-on-david-bedingham-handling-the-ball-2740058-2025-06-13",
      "headline": "Did Australia withdraw appeal against David Bedingham in WTC final? Cummins revealsAustralia captain Pat Cummins said that they would've withdrawn the appeal against David Bedingham for handling the ball, if the umpires didn't signal dead ball on Day 2 of the World Test Championship (WTC) final 2025 against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-mumbai-league-shreyas-iyer-team-final-defeat-ipl-punjab-2740005-2025-06-13",
      "headline": "From IPL 2025 to T20 Mumbai: Shreyas Iyer endures back-to-back final heartbreaksT20 Mumbai League 2025: Shreyas Iyer endured a second heartbreak in June as his side, SoBo Mumbai Falcons, lost the final of the inaugural edition of the T20 tournament in Mumbai. On June 3, Shreyas's Punjab Kings lost to RCB in the IPL final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/diya-chitale-ultimate-table-tennis-la-olympics-2028-2740090-2025-06-13",
      "headline": "Diya Chitale: The tiny titan of Indian table tennis dreamsDabang Delhi's Diya Chitale believes that India have a proper shot at a table tennis medal at the LA Olympics. India Today spoke to her on the sidelines of Ultimate Table Tennis where she opened up on her journey and the growing Indian TT scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-2-pat-cummins-full-press-conference-2740086-2025-06-13",
      "headline": "Happy to get a lead of 200, hopefully we get another 20 or 30 tomorrow: Pat CumminsAustralia captain Pat Cummins said that he was delighted with his team crossing the 200-run lead in the second innings of the World Test Championship (WTC) final against South Africa. Australia finished Day 2 at 144/8, leading by 218 runs at the end of the day's play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-india-a-in-4-day-intra-squad-game-in-beckenham-live-streaming-2740078-2025-06-13",
      "headline": "India vs India A in 4-day intra-squad game in Beckenham: Will it be streamed live?India will finalise their preparation for the all-important five-match Test series against England, through a 4-day intra-squad warm-up fixture against India A. However, the match will not be live-streamed for fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-pat-cummins-on-david-bedingham-handling-the-ball-2740058-2025-06-13",
      "headline": "Did Australia withdraw appeal against David Bedingham in WTC final? Cummins revealsAustralia captain Pat Cummins said that they would've withdrawn the appeal against David Bedingham for handling the ball, if the umpires didn't signal dead ball on Day 2 of the World Test Championship (WTC) final 2025 against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-mumbai-league-shreyas-iyer-team-final-defeat-ipl-punjab-2740005-2025-06-13",
      "headline": "From IPL 2025 to T20 Mumbai: Shreyas Iyer endures back-to-back final heartbreaksT20 Mumbai League 2025: Shreyas Iyer endured a second heartbreak in June as his side, SoBo Mumbai Falcons, lost the final of the inaugural edition of the T20 tournament in Mumbai. On June 3, Shreyas's Punjab Kings lost to RCB in the IPL final.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}