{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elss-explained-check-tax-benefits-under-section-80c-and-other-key-details-2681815-2025-02-18",
      "headline": "ELSS explained: Check tax benefits under Section 80C and other key details ELSS offers market-linked returns and has the potential to generate higher long-term returns as compared to other Section 80C options, including PPF, ULIPS, and NPS, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-tariffs-could-hurt-indian-exports-which-sectors-are-at-risk-2681818-2025-02-18",
      "headline": "Trump's reciprocal tariffs could hurt Indian exports. Which sectors are at risk?While officials are still waiting for details on how these tariffs will be calculated, they are already preparing countermeasures and working on a trade deal proposal to reduce tariffs and boost two-way trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsSugar price hike: A drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-overseas-bank-iob-rolls-out-aadhaar-based-account-opening-check-details-2681655-2025-02-18",
      "headline": "Indian Overseas Bank rolls out Aadhaar-based account opening. Check detailsThis new initiative allows customers to open savings bank accounts online with minimal documentation, as per Reserve Bank of India's eKYC guidelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-weakness-continues-sensex-nifty-down-again-3-things-to-know-2681648-2025-02-18",
      "headline": "Sensex, Nifty tumble again as volatility grips Dalal Street. 3 things to knowStock Market Today, 18 Feb 2025: Dalal Street remains under pressure with no immediate relief in sight. Here are some key points investors should know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla in India: Tesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-russia-donald-trump-vladimir-putin-ukraine-war-zelenskyy-riyadh-meeting-appont-teams-2681928-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia 'won't tolerate' NATO membership to Ukraine, US agrees to another meetWashington and Moscow agreed to address longstanding tensions in the US-Russia bilateral relationship and the process will begin with efforts to resolve the war in Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/andhra-pradesh-issues-ramzan-order-for-muslims-after-bjp-uproar-over-similar-order-by-telangana-government-2682078-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After BJP uproar over Telangana's Ramzan order, similar move by ally in AndhraThe Andhra Pradesh government has allowed Muslim employees to leave work an hour early during Ramzan, days after Telangana's Congress government issued a similar order, which the BJP slammed as \"appeasement politics\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-signs-executive-order-to-make-ivf-more-affordable-2682087-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump signs order to lower IVF costs, auto tariffs set around 25%Donald Trump signed three executive orders on Tuesday, including one to make IVF more affordable in the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-student-suicide-bhubaneswar-kiit-university-protest-odisha-arrested-2681920-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 Odisha university staffers arrested after protests over Nepal student suicideFive officials, including two security guards, were arrested in connection with the alleged suicide of Nepali student Prakriti Lamsal at KIIT, Bhubaneswar. The arrests followed protests over her death and allegations of forceful actions against protesting students.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/at-home-enema-kits-are-now-on-amazon-would-you-try-one-for-good-poop-2681916-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enema, anytime? DIY kits for constipation relief are viralWhat to do when life is complicated, uhm sorry, constipated? Use at-home enema kits, apparently. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/prosecution-seeks-death-penalty-for-1984-anti-sikh-riots-convict-rarest-of-rare-crime-2682086-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prosecution seeks death penalty for 1984 riots convict: Rarest of rare crimeThe prosecution has sought the death penalty for ex-Congress leader Sajjan Kumar, convicted last week for killing two Sikhs in the 1984 riots, calling it graver than Nirbhaya as it targeted an entire community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhatrapati-sambhaji-maharaj-objectionable-comments-wikipedia-maharashtra-devendra-fadnavis-chhaava-2682002-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wikipedia gets police notice over 'objectionable' content on Sambhaji MaharajObjectionable comments about Chhatrapati Sambhaji Maharaj appeared on Wikipedia days after the release of Chhaava, a Bollywood film starring Vicky Kaushal, based on the life of the second Chhatrapati of the Maratha Empire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-diya-kumaris-lunch-became-a-talking-point-on-rajasthan-budget-2681936-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Diya Kumari's lunch became a talking point on Rajasthan Budget'Green' and 'clean' buzzed as the deputy CM cum finance minister offered broad indicators about her first full-fledged Budget, to be presented on February 19"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/delta-jet-crashed-caught-fire-flipped-toronto-pearson-airport-canada-2681947-2025-02-18?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Moment Delta jet crashed, caught fire and flipped at Canada airportA video going viral on social media captured the moment when a Delta Air Lines jet flipped upside down upon landing at Canada's Toronto Pearson Airport. The video shows the flight landing and catching fire, before the jet flipped on its roof. All 80 people on board managed to survive the crash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-level-fecal-bacteria-sangam-water-ganga-yamuna-cpcb-ngt-prayagraj-high-health-risks-maha-kumbh-2025-2681769-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High levels of faecal bacteria in Sangam water. How high is health risk?The National Green Tribunal has raised concerns over high faecal coliform bacteria levels in water near Sangam in Prayagraj. A report by the Central Pollution Control Board indicated high levels of faecal coliform amid the Maha Kumbh. What are the health risks associated with high levels of faecal bacteria in water?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-dismisses-claims-of-rift-in-mahayuti-shiv-sena-ncp-bjp-devendra-fadnavis-maharashtra-2682042-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eknath Shinde denies rift with Devendra Fadnavis: No cold war between usMaharashtra Deputy Chief Minister Eknath Shinde said there was \"absolutely no cold war\" between him and Chief Minister Devendra Fadnavis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-volodymyr-zelenskyy-kremlin-us-talks-saudi-arabia-visit-postponed-2681963-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No decision on Ukraine war behind Kyiv's back: Zelenskyy on US-Russia talksUkrainian President Volodymyr Zelenskyy postponed his Saudi Arabia visit. He insisted that any peace talks must include Ukraine and stressed the need for US and European involvement in Kyiv's security guarantees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/what-ranveer-allahbadia-did-after-making-crass-joke-audience-member-reveals-2681751-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranveer Allahbadia did this after cracking obscene joke, claims 'audience member'In a now-viral video, a man who claimed to be a member of the audience during the shoot of the controversial episode of India's Got Latent, revealed what Ranveer Allahbadia did after cracking the obscene joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jabs-smriti-irani-past-usaid-role-george-soros-agent-bjp-claps-back-2681976-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress' 'Soros agent' jibe over Smriti Irani's past USAID role, BJP claps backCongress leaders Priyank Kharge and Pawan Khera took a jibe at former Union Minister Smriti Irani, calling her \"real agent of George Soros\". Amit Malviya hit back at the Congress and asked them to \"stop obsessing over Smriti Irani\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-rajkot-maternity-hospital-private-videos-women-patients-sold-online-youtube-telegram-2682044-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Videos of women patients at Gujarat maternity hospital leaked, sold on TelegramVideos of women patients at Payal Maternity Hospital were uploaded to a YouTube channel, with access offered via a Telegram link for a fee ranging from Rs 999 to Rs 1,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-online-buzz-reveals-about-delhi-chief-minister-probables-2681887-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What online buzz reveals about Delhi Chief Minister probablesParvesh Verma, former Leader of Opposition Vijender Gupta, Rekha Gupta, Satish Upadhyay, Ashish Sood, and Jitender Mahajan are among the leading contenders for the Delhi Chief Minister post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-slams-samajwadi-party-for-urdu-bias-uttar-pradesh-vidhan-sabha-2681872-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath's 'English-medium' dig over Urdu translation demand in UP AssemblySamajwadi Party leader Mata Prasad Pandey demanded inclusion of the Urdu translation of House proceedings. The SP leader's remark evoked a sharp response from Yogi Adityanath, who slammed Akhilesh Yadav's party for advocating Urdu only."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/passengers-walk-on-ceiling-to-escape-as-delta-jet-overturns-in-toronto-video-2681914-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Passengers walk on ceiling to escape as Delta jet overturns in TorontoA video of passengers walking on the ceiling of a Delta Air Lines flight to escape as their jet overturned at Toronto Pearson Airport went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2010-a-case-of-inverted-sexuality-2681988-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From the India Today archives (2010) | A case of inverted sexualityThis first collection of short stories by an Indian-American on homosexual pain and longing was the worst kind of decadence one could do without\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/australian-muslim-organisations-support-of-nurses-who-threatened-jewish-patients-2681738-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Muslim outfits rally behind Australian nurses who vowed to kill Israeli patientsSeveral Islamic organisations, including the extremist group Hizb ut-Tahrir, have supported two nurses who had said they would kill Israeli patients. The now-suspended nurses had vowed in the video to send Israelis to \"jahannam\" (hell). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-just-railways-others-might-be-to-blame-for-new-delhi-railway-station-stampede-rpf-grp-delhi-police-special-train-2681708-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Delhi stampede wasn't solely a Railway blunder?The Railways did miss red flags in the recent New Delhi Railway Station stampede in which 18 people were killed. But is it the only agency that is to be blamed for failing to prevent the tragedy or is there a bigger question of intelligence failure and local police inaction? How far is the Railways enabled, technically and manpower-wise, to prevent such tragedies?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/president-droupadi-murmu-prosecution-satyendra-jain-ed-probe-money-laundering-case-2681811-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "President clears prosecution sanction for Satyendar Jain in fraud case: SourcesPresident Droupadi Murmu has given her sanction to prosecute former Delhi minister Satyendra Jain in a money-laundering case. Jain, who was previously arrested by the ED, is out on bail. Arvind Kejriwal has defended him, calling the case politically motivated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/animal-music-composer-harshavardhan-rameshwar-on-prabhas-spirit-we-are-researching-different-tones-2681938-2025-02-19",
      "headline": "Animal music composer on Prabhas' Spirit: We are researching different tonesDirector Sandeep Reddy Vanga and composer Harshavardhan Rameshwar have commenced music sessions for Spirit, Prabhas' upcoming action film. The team is focusing on research and experimentation to create a unique soundscape for the cop drama."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/harsh-gujral-confirms-arjun-kapoor-is-single-after-break-up-with-malaika-arora-2682073-2025-02-18",
      "headline": "Harsh Gujral confirms Arjun Kapoor is single after break-up with Malaika AroraComedian Harsh Gujral recently confirmed Arjun Kapoor's single status during a press conference for their upcoming film. At the same event, Kapoor also shared insights on love triangles and relationship boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/drunk-man-tears-theatre-screen-while-watching-vicky-kaushal-chhaava-viral-video-report-2682061-2025-02-18",
      "headline": "Drunk man tears theatre screen while watching Chhaava: ReportA man, allegedly intoxicated, tore a theatre screen during the screening of Chhaava in Bharuch. The incident, captured on video, is under police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cine-workers-body-appeals-for-vicky-kaushals-chhaava-to-be-made-tax-free-2682001-2025-02-18",
      "headline": "Cine workers' body appeals for Vicky Kaushal's Chhaava to be made tax-freeThe Federation of Western India Cine Employees (FWICE) has appealed to Maharashtra's Chief Minister for tax-free status for the film, Chhaava. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/tom-latham-braces-for-cracking-champions-trophy-opener-vs-pakistan-2682081-2025-02-19",
      "headline": "Tom Latham braces for 'cracking' Champions Trophy opener vs Pakistan Champions Trophy: Tom Latham said that he is expecting for a cracker of a game when New Zealand lock horns with Pakistan on February 19 at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-preview-team-ratings-podcast-india-pakistan-favourites-2682027-2025-02-18",
      "headline": "Champions Trophy preview and team ratings: Are India the favourites?The Champions Trophy returns to the cricket calendar after eight years, marking a significant moment for Pakistan, which hosts a major ICC event for the first time in 29 years. Eight teams will compete for the prestigious title, once famously dubbed the mini-World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-pakistan-opener-rachin-ravindra-update-tom-latham-2682021-2025-02-18",
      "headline": "New Zealand won't rush Rachin Ravindra's recovery for Pakistan openerChampions Trophy 2025: Wicketkeeper-batter Tom Latham, speaking to the press in Karachi on Tuesday, said New Zealand are wary of Rachin Ravindra's head injury and will not rush his recovery for the opening match on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-siraj-india-umrah-trip-2682017-2025-02-18",
      "headline": "Mohammed Siraj goes on Umrah trip ahead of Champions Trophy Indian fast bowler Mohammed Siraj embarked on a spiritual journey to Masjid Al Haram in Saudi Arabia ahead of the Champions Trophy, set to begin on February 19.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-latest-car-audi-rs-3-crore-customised-2681939-2025-02-18",
      "headline": "Watch: Neeraj Chopra adds Rs 3 crore beast to his collection of luxury cars Neeraj Chopra has added a Rs 3 crore customised SUV to his luxury car collection, featuring exclusive blue-themed details and high-performance upgrades. With a top speed of 305 km/h and a roaring custom exhaust, this the car is the most special addition to his garage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-g-kamalini-mumbai-indians-youngest-2681935-2025-02-18",
      "headline": "India U19 hero G Kamalini becomes youngest debutant with Mumbai Indians capWPL 2025: G Kamalini became the youngest debutant in the history of the tournament after getting her maiden cap for the Mumbai Indians (MI) in the clash against Gujarat Giants (GG) on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shardul-thakur-county-championship-essex-contract-ipl-snub-2681912-2025-02-18",
      "headline": "Shardul Thakur signs for Essex, to play County Championship after IPL 2025 snubAll-rounder Shardul Thakur will make his County Championship debut for Essex. The Mumbai star will play the premier first-class tournament in England after having lost out on an IPL contract. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-where-to-watch-live-streaming-full-squads-schedule-2681833-2025-02-18",
      "headline": "Champions Trophy Live Streaming: When and where to watch matches, full squadsThe Champions Trophy 2025 returns to the cricket calendar after a hiatus of nearly 8 years. Here's everything you need to know about the matches, venues, timings and the squads in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammad-rizwan-press-conference-pakistan-will-enjoy-champions-trophy-as-a-nation-2681874-2025-02-18",
      "headline": "Pakistan will enjoy Champions Trophy as a nation: Mohammad Rizwan Champions Trophy 2025: In the press-conference before the clash against New Zealand, Pakistan skipper Mohammad Rizwan welcomed the return of an ICC event to Pakistan after 29 years, and praised the people who worked hard to organise the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-g-kamalini-mumbai-indians-youngest-2681935-2025-02-18",
      "headline": "India U19 hero G Kamalini becomes youngest debutant with Mumbai Indians capWPL 2025: G Kamalini became the youngest debutant in the history of the tournament after getting her maiden cap for the Mumbai Indians (MI) in the clash against Gujarat Giants (GG) on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shardul-thakur-county-championship-essex-contract-ipl-snub-2681912-2025-02-18",
      "headline": "Shardul Thakur signs for Essex, to play County Championship after IPL 2025 snubAll-rounder Shardul Thakur will make his County Championship debut for Essex. The Mumbai star will play the premier first-class tournament in England after having lost out on an IPL contract. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-where-to-watch-live-streaming-full-squads-schedule-2681833-2025-02-18",
      "headline": "Champions Trophy Live Streaming: When and where to watch matches, full squadsThe Champions Trophy 2025 returns to the cricket calendar after a hiatus of nearly 8 years. Here's everything you need to know about the matches, venues, timings and the squads in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammad-rizwan-press-conference-pakistan-will-enjoy-champions-trophy-as-a-nation-2681874-2025-02-18",
      "headline": "Pakistan will enjoy Champions Trophy as a nation: Mohammad Rizwan Champions Trophy 2025: In the press-conference before the clash against New Zealand, Pakistan skipper Mohammad Rizwan welcomed the return of an ICC event to Pakistan after 29 years, and praised the people who worked hard to organise the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-mohammad-rizwan-underestimate-secret-icc-tournament-return-2681862-2025-02-18",
      "headline": "Keep underestimating us: Pakistan captain's plea to pundits before Champions TrophyChampions Trophy 2025: On the eve of Pakistan's opening match against New Zealand in Karachi, captain Mohammad Rizwan addressed the press, discussing the return of an ICC tournament to Pakistan and the team's enduring underdog status at major events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-injury-shikhar-dhawan-2681851-2025-02-18",
      "headline": "India will miss accuracy and calm of Jasprit Bumrah in Champions Trophy: Shikhar DhawanIndia have a strong squad but will miss the accuracy and calm of Jasprit Bumrah in the Champions Trophy, said Shikhar Dhawan. Bumrah has been ruled out of the side due to a back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-king-pakistan-2681839-2025-02-18",
      "headline": "King kar lega? After Babar Azam's plea, Rizwan reacts to viral one-linerChampions Trophy: Mohammad Rizwan responded to repeating Hasan Ali's popular one-liner 'King kar lega' while showing faith in Babar Azam's ability. Rizwan attended the press conference before Pakistan's clash against New Zealand in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-pakistan-opening-2681793-2025-02-18",
      "headline": "Babar Azam is the right man to open in Champions Trophy: Rizwan Champions Trophy 2025: Mohammad Rizwan said that Babar Azam would open the batting in the mega event. Babar has only 88 runs to his name as an ODI opener at an average of 17.60. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-tax-exemption-case-bombay-hight-court-2681754-2025-02-18",
      "headline": "Bombay High Court rules in favour of BCCI in Tax Exemption CaseThe Bombay High Court has quashed an Income Tax Department advisory questioning BCCI's tax-exempt status, ruling that any decision regarding its exemption must follow due statutory process rather than relying on non-statutory communication from tax authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-vs-rayo-controversy-penalty-var-2681703-2025-02-18",
      "headline": "Flick defends VAR after Barcelona return to top of LaLiga with controversial winFC Barcelona regained the lead in LaLiga with a controversial 1-0 win over Rayo Vallecano. Barcelona coach reacted to a contensious decision by VAR which helped Barcelona sneak a win and wipe out their point-difference against bitter rivals Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-pakistan-opening-2681793-2025-02-18",
      "headline": "Babar Azam is the right man to open in Champions Trophy: Rizwan Champions Trophy 2025: Mohammad Rizwan said that Babar Azam would open the batting in the mega event. Babar has only 88 runs to his name as an ODI opener at an average of 17.60. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-tax-exemption-case-bombay-hight-court-2681754-2025-02-18",
      "headline": "Bombay High Court rules in favour of BCCI in Tax Exemption CaseThe Bombay High Court has quashed an Income Tax Department advisory questioning BCCI's tax-exempt status, ruling that any decision regarding its exemption must follow due statutory process rather than relying on non-statutory communication from tax authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-vs-rayo-controversy-penalty-var-2681703-2025-02-18",
      "headline": "Flick defends VAR after Barcelona return to top of LaLiga with controversial winFC Barcelona regained the lead in LaLiga with a controversial 1-0 win over Rayo Vallecano. Barcelona coach reacted to a contensious decision by VAR which helped Barcelona sneak a win and wipe out their point-difference against bitter rivals Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-history-all-editions-mini-world-cup-journey-champions-list-2681700-2025-02-18",
      "headline": "Champions Trophy history: 8 editions, 7 champions in Mini World Cup's wild journeyChampions Trophy 2025: No other tournament in cricket history has faced as many threats of being scrapped, but the Champions Trophy has survived multiple deliberations to return to the ICC calendar after an eight-year gap -- the longest between two editions of the ODI tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-javelin-groin-injury-jan-zelezney-2681679-2025-02-18",
      "headline": "Mission 90m is on: Neeraj Chopra on how legend Zelezny is moulding his techniqueDouble Olympic medallist Neeraj Chopra is working with his new coach Jan Zelezny. The legendary former javelin star has been working on correcting Neeraj's technique post the Paris Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-lockie-ferguson-ruled-out-kyle-jamieson-replacement-2681674-2025-02-18",
      "headline": "Champions Trophy: New Zealand name Jamieson as Lockie Ferguson's replacementChampions Trophy 2025: New Zealand suffered another setback as Lockie Ferguson was ruled out of the Champions Trophy due to injury, with Kyle Jamieson named as his replacement. The Black Caps now await further updates on Rachin Ravindra's fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-icc-tournaments-photoshoot-ravindra-jadeja-shubman-gill-2681658-2025-02-18",
      "headline": "Watch: Rohit featured in his 17th ICC photoshoot, wows Jadeja and GillIndia captain Rohit Sharma stunned teammates Ravindra Jadeja and Shubman Gill as he recalled his 17 ICC tournament appearances ahead of the Champions Trophy, highlighting his immense experience and impressive record in global events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-morne-morkel-father-death-2681626-2025-02-18",
      "headline": "India bowling coach Morne Morkel returns home due to family emergencyChampions Trophy: India bowling coach Morne Morkel has rushed out of Dubai due to a family emergency. Morkel left for South Africa after his father Albert passed away. Morkel was expected to play a crucial part in guiding India's bowling attack in the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-bid-olympics-2036-commonwealth-games-2681615-2025-02-18",
      "headline": "Hosting CWG would be a stepping stone for India's Olympic Dream: CGF CEO SadlierCommonwealth Games Federation CEO Katie Sadleir has said that hosting the CWG 2030 would be the right step in India's hope of hosting the Olympics. India have formally submitted the bid for the 2036 Games and hope to host the event across multiple cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rohit-sharma-virat-kohli-relax-nets-session-mohammed-shami-autographs-2681607-2025-02-18",
      "headline": "Watch: Rohit, Kohli relax after nets, Shami signs autographs for fansIndia skipper Rohit Sharma and Virat Kohli were spotted unwinding after a training session in Dubai ahead of the Champions Trophy, while pacer Mohammed Shami delighted fans by taking time to sign autographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/manu-bhaker-sportswoman-of-the-year-mary-kom-presents-award-2681595-2025-02-18",
      "headline": "Mary Kom presents Manu Bhaker with BBC Sportswoman of the year awardIndian boxing legend Mary Kom presented the BBC Indian Sportswoman of the Year award to Paris Olympics shooting sensation Manu Bhaker on February 17, honouring her remarkable achievements, including two historic bronze medals at the Games, solidifying her legacy in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-perform-like-champion-childhood-coach-batting-from-2681572-2025-02-18",
      "headline": "Virat Kohli will perform like a champion: Childhood coach backs India starChampions Trophy: Virat Kohli's childhood coach, Rajkumar Sharma, has dismissed concerns over the star batter's form, backing him to deliver a \"champion\" performance in the upcoming Champions Trophy despite recent struggles in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-jannik-sinner-doping-ban-favouritism-2681556-2025-02-18",
      "headline": "Novak Djokovic calls out 'favouritism' shown in Jannik Sinner doping banNovak Djokovic slammed WADA for showing \"favouritism\" in Jannik Sinner's doping case, criticising the lenient three-month ban that allows the World No.1 to compete in Grand Slams, calling it unfair treatment compared to other doping cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-india-vice-captain-mvp-opening-batter-2681554-2025-02-18",
      "headline": "Why vice-captain Shubman Gill will be India's MVP in Champions TrophyVice-captain Shubman Gill has stepped up in ODIs for India in a big way in the past few years and could prove to be India's MVP during the upcoming Champions Trophy in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}