{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-346-points-lower-nifty-below-25400-airtel-down-3-percent-2753743-2025-07-10",
      "headline": "Sensex closes 346 points lower, Nifty below 25,400; Airtel down 3%Sensex closes 346 points lower, Nifty below 25,400; Airtel down 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-property-money-trail-ed-probe-income-tax-department-real-estate-2753725-2025-07-10",
      "headline": "Dubai dreams under scanner as ED questions homebuyers: ReportMany of the individuals who bought property in Dubai are now under scrutiny as they failed to provide proper bank transaction records showing how the payments were made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-may-hike-salaries-by-30-34-percent-report-2753705-2025-07-10",
      "headline": "8th Pay Commission may hike salaries by 30–34%: ReportThe 8th Pay Commission could benefit around 11 million people, including about 4.4 million central government employees and nearly 6.8 million pensioners. Once approved, the changes will raise their basic pay, allowances, and retirement benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-itr-filing-deadline-be-extended-again-here-is-why-it-might-2753681-2025-07-10",
      "headline": "Will ITR filing deadline be extended again? Here's why it mightIn May, the CBDT announced extending the ITR filing deadline, citing big changes in the forms and system readiness. It said that the updated ITRs will make compliance simpler and reporting more transparent for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-now-delivery-zepto-blinkit-swiggy-instamart-flipkart-minute-new-rival-delhi-10-minute-delivery-quick-commerce-2753688-2025-07-10",
      "headline": "Zepto, Blinkit, Instamart face a new rival in Delhi's 10-min delivery warThe move brings the e-commerce giant into direct competition with local players such as Blinkit (owned by Eternal), Swiggy Instamart and Zepto, who already dominate the quick delivery space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-subscription-bidding-open-review-good-bad-gmp-today-2753663-2025-07-10",
      "headline": "Smartworks Coworking Spaces IPO open for bidding: Should you subscribe?The bidding window for the IPO will remain open until Monday, July 14. Investors can place bids within the price band of Rs 387 to Rs 407 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-nursery-fees-need-an-emi-coinswitch-co-founder-ashish-singhal-flags-new-middle-class-crisis-2753614-2025-07-10",
      "headline": "When nursery fees need an EMI: CoinSwitch co-founder flags new middle-class crisisOnce believed to be the key to a better life, schooling today has ironically become the heaviest expense for India's middle-class families, who are struggling to keep up, says Ashish Singhal, co-founder of CoinSwitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nvidia-market-cap-usd-4-trillion-5-percent-rise-near-india-gdp-imf-tech-company-number-one-2753589-2025-07-10",
      "headline": "Nvidia now worth nearly as much as India's economy. Details hereAccording to the International Monetary Fund (IMF), India's gross domestic product is currently estimated at $4.2 trillion and is expected to touch $4.27 trillion by the end of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-bitcoin-has-hit-record-high-today-2753574-2025-07-10",
      "headline": "3 key reasons behind Bitcoin's record high todayAt the time of writing, Bitcoin is trading at $111,019.74, rising by 2.27% over the past day. The last record was set on May 22 when it briefly touched $111,970. Since then, Bitcoin has had a bumpy ride, but it seems to be back with a bang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-q1-results-announcement-today-dividend-share-price-target-deals-what-to-expect-from-it-giant-2753551-2025-07-10",
      "headline": "TCS to announce Q1 results today: Here's what to expect from the IT giantTCS Q1 results: Apart from growth numbers, the market will also watch for any announcements on interim dividends, updates on client budgets in sectors like banking, retail, and manufacturing, and comments on the pace of new deal wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-85-points-higher-nifty-above-25400-tata-steel-trent-up-1-percent-2753521-2025-07-10",
      "headline": "Sensex opens 85 points higher, Nifty above 25,400; Tata Steel up 1%The S&P BSE Sensex was down by 43.60 points to 83,492.48, while the NSE Nifty50 lost 15.90 points to 25,460.20 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bitcoin-all-time-high-usd-112000-near-crypto-currency-price-rise-fed-rate-cut-investor-optimism-2753509-2025-07-10",
      "headline": "Bitcoin rockets to a record high, just shy of $112,000. Here's whyAs Bitcoin's market cap has crossed into the trillions, more institutional investors are entering the space. Large firms that once stayed away are now taking positions in digital assets, helping push prices higher."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/baahubali-the-epic-release-date-announced-rajamouli-prabhas-anushka-shetty-rana-daggubati-2753717-2025-07-10",
      "headline": "SS Rajamouli announces Baahubali The Epic on 10th anniversary of Prabhas starrerSS Rajamouli announced the release date of 'Baahubali: The Epic'. It will be a two-part combined film which will include both 'Baahubali: The Beginning' and 'Baahubali 2: The Conclusion'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kd-teaser-sanjay-dutt-dhruva-sarja-action-packed-commercial-entertainer-2753733-2025-07-10",
      "headline": "KD teaser: Sanjay Dutt, Dhruva Sarja promise action-packed commercial entertainerDirected by Prem, of 'Jogi' fame, 'KD - The Devil' features an ensemble cast with Dhruva Sarja, Sanjay Dutt, Shilpa Shetty, Reeshma Nanaiah, Ramesh Aravind, Ravichandran and several others. The makers unveiled the film's teaser on July 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bianca-censoris-latest-look-has-fans-mistaking-her-for-sabrina-carpenter-pics-2753631-2025-07-10",
      "headline": "Bianca Censori's latest look has fans mistaking her for Sabrina Carpenter. PicsBianca Censori and Kanye West have once again set the internet abuzz. This time, following a recent photoshoot, fans are drawing comparisons between the model and pop sensation Sabrina Carpenter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/munmun-dutta-in-bigg-boss-19-all-you-need-to-know-about-taarak-mehta-ka-ooltah-chashmah-actor-2753710-2025-07-10",
      "headline": "Munmun Dutta to join Bigg Boss 19? All you need to know about the TV actorMunmun Dutta, known for her role in 'Taarak Mehta Ka Ooltah Chashmah', has reportedly been approached for 'Bigg Boss 19'. Though nothing is officially confirmed, her name appears on the tentative list of potential contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-silences-no-entry-2-exit-rumours-2753609-2025-07-10",
      "headline": "Diljit Dosanjh silences No Entry 2 exit rumours with a social media post. WatchDiljit Dosanjh playfully addressed rumours of his exit from 'No Entry 2' by sharing a behind-the-scenes video featuring director Anees Bazmee and producer Boney Kapoor. He dismissed speculation with a humorous voiceover, hinting that he's still very much part of the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/10-years-of-baahubali-how-a-colloquial-term-gave-rajamouli-pan-india-blockbuster-2753560-2025-07-10",
      "headline": "10 years of Baahubali: How a colloquial title gave Rajamouli pan India blockbusterAs director SS Rajamouli's 'Baahubali: The Beginning' marks 10 years, a glimpse into what really led to the pan-India success of the epic action-fantasy. Did the colloquial term in the film's title have a special connection to the Hindi heartland and ancient monks? IndiaToday.in shares insights about the Rajamouli-directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-nidimoru-wife-cryptic-post-samantha-romance-rumours-instagram-photos-2753696-2025-07-10",
      "headline": "Raj Nidimoru's wife shares golden rules of life after Samantha's new pics with himRaj Nidimoru's wife shared a post on her Instagram stories a day after Samantha dropped new photos from Detroit featuring the director. The speculations about their relationship began a few years back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tusli-return-good-news-all-kyunki-saas-bhi-kabhi-bahu-thi-views-hotstar-star-smriti-irani-amethi-bollywood-heres-more-2753289-2025-07-10",
      "headline": "Tulsi's return is good news for all. Kyunki saas bhi kabhi viewer thiKyunki Saas Bhi Kabhi Bahu Thi, which was the flagship of the K-phenomenon in India, hooked women, saas and bahu alike, for years. Those viewers have been starved of content, with some taking to Pakistani serials, as the OTT-driven entertainment industry moved on to crime and real-life dramas. Tulsi Virani's return is good for viewers, Smriti Irani, who played the protagonist, and the overall content industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chitrangda-singh-joins-salman-khan-battle-of-galwan-india-china-border-film-2753689-2025-07-10",
      "headline": "Chitrangda Singh joins Salman Khan in Battle of GalwanActor Chitrangda Singh is set to star alongside Salman Khan in the upcoming film 'Battle of Galwan,' directed by Apoorva Lakhia. This marks their first collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-birthday-not-just-a-dancer-heres-what-you-didnt-know-about-the-actor-2753697-2025-07-10",
      "headline": "Not just a dancer, here's what you didn't know about Raghav JuyalRaghav Juyal has impressed audiences with his versatile talents beyond dance. The actor celebrated his 34th birthday on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-starts-shooting-for-d54-with-vignesh-raja-gv-prakash-kumar-2753680-2025-07-10",
      "headline": "Dhanush begins filming for Vignesh Raja's D54 with customary puja. PicsNational Award-winning actor Dhanush started shooting for the film 'D54', directed by Vignesh Raja and produced by Vels Film International. The film features music by renowned composer GV Prakash Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-abhyankkar-20-year-old-tamil-composer-eight-films-allu-arjun-atlee-film-debut-release-2753671-2025-07-10",
      "headline": "This 20-year-old Tamil composer signs 8 films even before debut releaseA 20-year-old Tamil composer, who kicked off his career as an independent musician, will now compose for eight big Tamils in the South. Among the eight films is Allu Arjun's mega-budget film with director Atlee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rashmika-mandanna-janhvi-kapoor-mrunal-thakur-in-allu-arjun-atlee-mega-film-aa22xa6-2753675-2025-07-10",
      "headline": "Rashmika Mandanna, Janhvi Kapoor, Mrunal Thakur in Allu Arjun-Atlee's mega AA22xA6Rashmika Mandanna has joined Atlee's giant project featuring Allu Arjun, tentatively titled 'AA22xA6'. The film also features more popular female names, including Deepika Padukone, Janhvi Kapoor and Mrunal Thakur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-chooses-hot-dog-over-vada-pav-leaves-desi-fans-divided-2753660-2025-07-10",
      "headline": "Priyanka Chopra chooses hot dog over vada pav, leaves desi fans dividedPriyanka Chopra's recent interview sparked mixed reactions online due to her food preferences. Fans expressed disappointment after she chose hot dogs over vada pav, leading to a flurry of comments and debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-fitness-prep-no-alcohol-low-carbs-high-altitude-workouts-galwan-film-2753670-2025-07-10",
      "headline": "Salman Khan's Battle of Galwan prep: No alcohol, low carbs, high-altitude workoutSalman Khan is rigorously preparing for his role as a soldier in the film 'Battle of Galwan'. His strict fitness and diet regimen aims to help him perform in the challenging high-altitude terrain of Leh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-and-director-tamizh-join-hands-for-marshal-1st-poster-teases-retro-vibes-2753644-2025-07-10",
      "headline": "Karthi and director Tamizh join hands for Marshal, 1st poster teases retro vibesKarthi's next film with 'Taanakkaran' director Tamizh, has been titled 'Marshal'. The project was officially launched on July 10 with a title poster that teases a coastal, retro setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-emotional-quote-on-daughters-strength-dedicates-to-malti-marie-2753630-2025-07-10",
      "headline": "Not my shadow, my legacy: Priyanka Chopra's emotional post about daughter MaltiPriyanka Chopra shared a heartfelt post about her daughter Malti Marie, expressing how she carries the strength and legacy of her mother. Priyanka got married to singer Nick Jonas in 2018 and welcomed Malti through surrogacy in January 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-says-she-and-wife-shefali-jariwala-are-together-forever-in-touching-post-2753649-2025-07-10",
      "headline": "Parag Tyagi says she and wife Shefali Jariwala are together forever in touching postParag Tyagi shared a clip remembering his wife, Shefali Jariwala. He remembered the late actor in the post titled 'Together Forever'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sung-jae-to-sung-jin-woo-byeon-woo-seok-to-lead-solo-leveling-live-action-series-2753651-2025-07-10",
      "headline": "Sung-jae to Sung Jin-woo: Byeon Woo-seok to lead Solo Leveling live-action seriesFrom breakout heartthrob to fantasy hero. Actor Byeon Woo-seok gears up to lead one of the most anticipated K-drama adaptations of the decade."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cant-say-there-is-no-logic-supreme-court-hears-plea-against-bihar-voter-list-revision-2753606-2025-07-10",
      "headline": "Supreme Court allows Bihar voter roll review, asks poll body to consider AadhaarHearing a clutch of petitions challenging the Election Commission's decision, the Supreme Court said the poll watchdog had a mandate under the Constitution to conduct the exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-survey-kerala-chief-minister-top-contender-udf-congress-2753693-2025-07-10",
      "headline": "Shashi Tharoor as chief minister? MP shares survey naming him top pick in KeralaShashi Tharoor, whose ties with the Congress have been rocky of late, is preferred by 28.3% of respondents as the UDF's chief ministerial candidate, the survey showed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/exclusive-i-will-be-cm-for-5-years-buzz-on-congress-asking-me-to-step-down-incorrect-says-siddaramaiah-2753590-2025-07-10",
      "headline": "Siddaramaiah shuts leadership change buzz: Seat not empty, here for 5 yearsAmid swirling speculation over a leadership change in Karnataka, Chief Minister Siddaramaiah told India Today TV he will remain in office for a full five-year term and lead Congress into 2028 polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-live-score-day-1-updates-lords-gill-stokes-2753657-2025-07-10",
      "headline": "3rd Test, Day 1 Live: Bumrah keeps Crawley, Duckett under pressureIndia (IND) vs England (ENG), 3rd Test, Day 1 Live Updates: India take on England in the third Test at the iconic Lord's, and Jasprit Bumrah is making the most of the chance to bowl first. After England chose to bat, Bumrah has come out firing with early intensity and purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/wimbledon-2025-watch-collection-rolex-cartier-priyanka-chopra-roger-federer-andrew-garfield-2753695-2025-07-10",
      "headline": "Wimbledon 2025's best looks came with a side of horological flexWhether it's a vintage Cartier peeking from under a linen cuff or a statement Richard Mille flashing courtside, Wimbledon 2025 is proof that 'timing' is everything, on and off the court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sheikh-hasina-protesters-deaths-international-crimes-tribunal-students-protest-2753718-2025-07-10",
      "headline": "Bangladesh tribunal indicts Sheikh Hasina over deaths of protesters during stirA three-member panel, headed by Justice Golam Mortuza Mozumder, indicted Sheikh Hasina, former Home Minister Asaduzzaman Khan and former police chief Chowdhury Abdullah Al-Mamun on five charges. Hasina and Khan are being tried in absentia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/is-shubman-gill-the-serene-skipper-team-india-had-been-waiting-for-2753200-2025-07-09",
      "headline": "Is Shubman Gill the serene skipper Team India had been waiting for?Where Virat Kohli was fire and fury, Gill is ice and intent. Where Rohit Sharma relied on instinct and experience, Gill leans on data and a balanced temperament\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-balrampur-chhangur-baba-alias-jalaluddin-religious-conversion-women-list-rate-police-ats-arrest-foreign-crorefunding-2753686-2025-07-10",
      "headline": "Chhangur Baba, conversions and caste-based rate listFrom selling gemstones on a bicycle to amassing Rs 106 crore, Chhangur Baba alias Jalaluddin's rise has been swift and secretive. Chhangur Baba has been accused of converting hundreds of women and receiving foreign funds illegally. He reportedly maintained a caste-based rate list for converting women to Islam, offering up to Rs 16 lakh for Brahmins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/deadlock-in-bjp-why-7-key-states-still-await-elections-for-chiefs-2753203-2025-07-09",
      "headline": "Deadlock in BJP? Why 7 key states still await elections for chiefsWhile the quorum for the national president's election is complete, the indecision over chiefs in stronghold states reflects factional tensions and strategic uncertainty\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/earthquake-jolts-delhi-ncr-why-the-ground-keeps-shaking-beneath-our-feet-2753646-2025-07-10",
      "headline": "Earthquake jolts Delhi-NCR: Decoding what lies beneath the capitalThe seismic activity in Delhi-NCR is caused not only by distant Himalayan tectonics but also by local geological structures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/malaysian-model-lishalliny-kanaran-alleges-molestation-by-indian-priest-2753735-2025-07-10",
      "headline": "Put his hands inside my blouse: Malaysian model says Hindu priest molested herA Malaysian model has accused a Hindu priest of sexually assaulting her and placing her hands inside her blouse at a temple under the pretext of giving her blessings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-emergency-op-ed-congress-manickam-tagore-india-history-indira-gandhi-2753684-2025-07-10",
      "headline": "Bird becoming parrot: Congress MP's veiled dig at Shashi Thaoor's Emergency op-edShashi Tharoor, in an opinion piece published in the Malayalam daily Deepika, argued that the Emergency should not be remembered solely as a dark chapter in India's history but that its complexities and lessons must be fully understood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-dance-son-daughter-pump-it-up-vs-flavio-cobolli-2753666-2025-07-10",
      "headline": "Djokovic does 'Pump It Up' dance with kids after sealing 14th Wimbledon semisNovak Djokovic reached his 14th Wimbledon semi-final, but it was his fun 'Pump It Up' dance with his kids after the win that stole the show and melted hearts on Centre Court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/sreehari-sukesh-kerala-indian-student-among-two-killed-in-mid-air-collision-in-canada-manitoba-consulate-general-2753668-2025-07-10",
      "headline": "Indian student among two killed as planes collide mid-air in CanadaA 23-year-old student pilot from Kerala was among two killed in a mid-air collision in Canada's Manitoba province. The incident occurred during routine flight training. The body of the Indian student was recovered from the wreckage. India's Consulate General in Toronto confirmed the death and is assisting the family."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-man-loses-mobile-phone-rainwater-poor-drainage-rajasthan-2753738-2025-07-10",
      "headline": "Video: Jaipur man cries after losing phone, frantically looks for it in heavy rainA young man in Jaipur was left heartbroken after his mobile phone slipped into rainwater caused by poor drainage. The emotional incident was captured on video and went viral.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/indian-origin-teens-held-for-targeting-south-asians-2slgbtq-members-in-canada-brampton-crime-peel-regional-police-2753624-2025-07-10",
      "headline": "Indian-origin teens pose as queers, target 2SLGBTQ+ members in Canada, detainedPolice in Canada's Ontario have arrested three Indian-origin teenagers linked to violent robberies in Brampton city, targeting South Asians and members of the 2SLGBTQ+ community. The suspects allegedly posed as members of the queer community to create a sense of trust among their victims. A fourth suspect, a 20-year-old Indian-origin man, remains at large."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tusli-return-good-news-all-kyunki-saas-bhi-kabhi-bahu-thi-views-hotstar-star-smriti-irani-amethi-bollywood-heres-more-2753289-2025-07-10",
      "headline": "Tulsi's return is good news for all. Kyunki saas bhi kabhi viewer thiKyunki Saas Bhi Kabhi Bahu Thi, which was the flagship of the K-phenomenon in India, hooked women, saas and bahu alike, for years. Those viewers have been starved of content, with some taking to Pakistani serials, as the OTT-driven entertainment industry moved on to crime and real-life dramas. Tulsi Virani's return is good for viewers, Smriti Irani, who played the protagonist, and the overall content industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ayurvedas-natural-ozempic-the-truth-about-berberine-for-weight-loss-herbs-daru-haldi-2753658-2025-07-10",
      "headline": "Ayurveda's 'Natural Ozempic': The truth about berberine for weight lossThe surrounding buzz is deafening, fuelled by incredible claims of effortless weight loss. But while berberine, or Daru Haldi, has been used for metabolic health, the truth is often more complex than a trendy nickname suggests. Here's what you actually need to know before considering it"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bihar-assembly-elections-supreme-court-three-things-to-answer-election-commission-opposition-disenfranchisement-2753685-2025-07-10",
      "headline": "3 things to answer: What top court told poll body on Bihar voter rolls revisionThe Supreme Court is hearing a batch of petitions challenging the Election Commission's electoral roll revision in Bihar. The bench noted the practicality of the move, but questioned the timing a few months before the assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-karnataka-plans-to-get-to-the-heart-of-cardiac-deaths-striking-the-young-2753210-2025-07-09",
      "headline": "How Karnataka plans to get to the heart of cardiac deaths striking the youngThe state advocates stronger screening and mandatory reporting of sudden heart-attack deaths among individuals aged under 45 to tackle the rising public health concern\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-review-feminism-sara-ali-khan-neena-gupta-konkana-sen-fatima-sana-sheikh-2753133-2025-07-10",
      "headline": "In Anurag Basu's Metro... In Dino, feminism looks like everyday womenMetro In Dino feminism is distinct, beautiful and relevant. Anurag Basu designs characters who choose themselves, break conventions and decide to make mistakes of their own kind. Sara Ali Khan, Neena Gupta, Konkona Sensharma, Fatima Sana Shaikh and even the teenage girl - all seem relatable and quietly powerful. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/superman-movie-review-james-gunn-david-corenswet-led-dc-hero-2753550-2025-07-10",
      "headline": "Superman review: James Gunn brings the fun back to David Corenswet-led DC heroRelease Date:Fri Jul 11, 2025Superman movie review: James Gunn's new 'Superman' film revives the superhero with a perfect mix of humour and heart, focusing on identity and hope. Featuring David Corenswet and Rachel Brosnahan, the film is a vibrant, feel-good tribute to the Man of Steel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-gaikwad-assault-video-south-indians-run-dance-bars-shinde-sena-mla-canteen-2753557-2025-07-10",
      "headline": "South Indians run dance bars...: Sena MLA's fresh slur after viral assault videoSanjay Gaikwad, a two-term legislator from Buldhana, was caught on video slapping and punching a canteen contractor at the Akashwani MLA residence in Mumbai for allegedly serving stale food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/job-applicant-hilarious-half-printed-resume-says-hire-me-to-unlock-full-potential-viral-reddit-post-2753607-2025-07-10",
      "headline": "Job applicant's hilarious half-printed resume says 'Hire me to unlock full potential'A Reddit post on the popular subreddit r/recruitinghell with the title, \"Resume printed halfway and said: 'Hire me to unlock full potential', has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/baahubali-the-epic-release-date-announced-rajamouli-prabhas-anushka-shetty-rana-daggubati-2753717-2025-07-10",
      "headline": "SS Rajamouli announces Baahubali The Epic on 10th anniversary of Prabhas starrerSS Rajamouli announced the release date of 'Baahubali: The Epic'. It will be a two-part combined film which will include both 'Baahubali: The Beginning' and 'Baahubali 2: The Conclusion'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kd-teaser-sanjay-dutt-dhruva-sarja-action-packed-commercial-entertainer-2753733-2025-07-10",
      "headline": "KD teaser: Sanjay Dutt, Dhruva Sarja promise action-packed commercial entertainerDirected by Prem, of 'Jogi' fame, 'KD - The Devil' features an ensemble cast with Dhruva Sarja, Sanjay Dutt, Shilpa Shetty, Reeshma Nanaiah, Ramesh Aravind, Ravichandran and several others. The makers unveiled the film's teaser on July 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-silences-no-entry-2-exit-rumours-2753609-2025-07-10",
      "headline": "Diljit Dosanjh silences No Entry 2 exit rumours with a social media post. WatchDiljit Dosanjh playfully addressed rumours of his exit from 'No Entry 2' by sharing a behind-the-scenes video featuring director Anees Bazmee and producer Boney Kapoor. He dismissed speculation with a humorous voiceover, hinting that he's still very much part of the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/10-years-of-baahubali-how-a-colloquial-term-gave-rajamouli-pan-india-blockbuster-2753560-2025-07-10",
      "headline": "10 years of Baahubali: How a colloquial title gave Rajamouli pan India blockbusterAs director SS Rajamouli's 'Baahubali: The Beginning' marks 10 years, a glimpse into what really led to the pan-India success of the epic action-fantasy. Did the colloquial term in the film's title have a special connection to the Hindi heartland and ancient monks? IndiaToday.in shares insights about the Rajamouli-directorial."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-lords-test-jasprit-bumrah-shubman-gill-toss-2753737-2025-07-10",
      "headline": "Lord's Test: Jasprit Bumrah back after Shubman Gill loses hat-trick of tossesEngland vs India, 3rd Test: Shubman Gill lost the toss in England for the third straight time. Ben Stokes called it right and opted to bat on a bright morning in London. Jasprit Bumrah replacing Prasidh Krishna was the lone change for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-dance-son-daughter-pump-it-up-vs-flavio-cobolli-2753666-2025-07-10",
      "headline": "Djokovic does 'Pump It Up' dance with kids after sealing 14th Wimbledon semisNovak Djokovic reached his 14th Wimbledon semi-final, but it was his fun 'Pump It Up' dance with his kids after the win that stole the show and melted hearts on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-live-score-day-1-updates-lords-gill-stokes-2753657-2025-07-10",
      "headline": "3rd Test, Day 1 Live: Bumrah keeps Crawley, Duckett under pressureIndia (IND) vs England (ENG), 3rd Test, Day 1 Live Updates: India take on England in the third Test at the iconic Lord's, and Jasprit Bumrah is making the most of the chance to bowl first. After England chose to bat, Bumrah has come out firing with early intensity and purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-steve-harmison-jofra-archer-pat-cummins-2753608-2025-07-10",
      "headline": "Lord's Test: Jofra Archer tipped to make Pat Cummins-esque returnEngland vs India: Steve Harmison has tipped Jofra Archer to make a Pat Cummins-esque return to Test cricket after being back in the England red-ball lineup for the first time in 4 years. Archer will play in the Lord's Test against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hyderabad-cricket-body-chief-jagan-mohan-rao-among-five-held-by-cid-for-ticket-scam-during-ipl-2025-2753592-2025-07-10",
      "headline": "IPL ticket scam: CID arrests Hyderabad cricket chief Jagan Mohan Rao, 4 othersThe Crime Investigation Department (CID) on Wednesday arrested Hyderabad Cricket Association (HCA) President A. Jagan Mohan Rao in connection with a ticketing scandal during the 2025 Indian Premier League (IPL) season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-great-sunil-gavaskar-birthday-fisherman-birth-story-2753577-2025-07-10",
      "headline": "How Sunil Gavaskar escaped becoming a good fisherman and bad batsmanSunil Gavaskar was mistakenly swapped with another baby at birth in the hospital. His uncle noticed the missing birthmark on his ear and alerted the family just in time. Had his uncle not noticed, Gavaskar might have grown up a good fisherman and a bad batsman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-dukes-ball-drama-lords-slope-explained-2753586-2025-07-10",
      "headline": "Dukes ball drama and Lord's slope: ENG vs IND 3rd Test buzz explainedEngland vs India, 3rd Test: The Dukes ball has come under scrutiny in the ENG vs IND series for going soft and losing shape too quickly, frustrating bowlers and prompting calls for change. The Lord's Cricket Ground will present the two teams with another unique challenge -- the slope. Here's all that you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-luka-modric-real-madrid-goodbye-farewell-psg-2753573-2025-07-10",
      "headline": "Luka Modric bids goodbye to Real Madrid after FIFA Club World Cup exitLuka Modric's 13-year journey with Real Madrid ended quietly but emotionally, as the Croatian legend made his final appearance during a 4–0 loss to PSG in the Club World Cup semi-final in New Jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-weather-forecast-pitch-report-lords-2753553-2025-07-10",
      "headline": "ENG vs IND, 3rd Test weather and pitch report: Will rain spoil Lord's clash?After rain-hit Tests in Leeds and Birmingham, fans can finally expect clear skies and uninterrupted cricket at Lord's, with forecasts predicting sunny conditions and steady temperatures throughout the third India vs England Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-iga-swiatek-women-semi-final-anisimova-bencic-2753534-2025-07-10",
      "headline": "Day 11 schedule: Aryna Sabalenka, Iga Swiatek eye spot in finalWimbledon 2025: World No. 1 Aryna Sabalenka and five-time Grand Slam champion Iga Swiatek are each just one win away from a maiden Wimbledon final, but standing in their way are two resurgent forces-Amanda Anisimova and Belinda Bencic-both playing inspired tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-great-sunil-gavaskar-birthday-fisherman-birth-story-2753577-2025-07-10",
      "headline": "How Sunil Gavaskar escaped becoming a good fisherman and bad batsmanSunil Gavaskar was mistakenly swapped with another baby at birth in the hospital. His uncle noticed the missing birthmark on his ear and alerted the family just in time. Had his uncle not noticed, Gavaskar might have grown up a good fisherman and a bad batsman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-dukes-ball-drama-lords-slope-explained-2753586-2025-07-10",
      "headline": "Dukes ball drama and Lord's slope: ENG vs IND 3rd Test buzz explainedEngland vs India, 3rd Test: The Dukes ball has come under scrutiny in the ENG vs IND series for going soft and losing shape too quickly, frustrating bowlers and prompting calls for change. The Lord's Cricket Ground will present the two teams with another unique challenge -- the slope. Here's all that you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-luka-modric-real-madrid-goodbye-farewell-psg-2753573-2025-07-10",
      "headline": "Luka Modric bids goodbye to Real Madrid after FIFA Club World Cup exitLuka Modric's 13-year journey with Real Madrid ended quietly but emotionally, as the Croatian legend made his final appearance during a 4–0 loss to PSG in the Club World Cup semi-final in New Jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-weather-forecast-pitch-report-lords-2753553-2025-07-10",
      "headline": "ENG vs IND, 3rd Test weather and pitch report: Will rain spoil Lord's clash?After rain-hit Tests in Leeds and Birmingham, fans can finally expect clear skies and uninterrupted cricket at Lord's, with forecasts predicting sunny conditions and steady temperatures throughout the third India vs England Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-iga-swiatek-women-semi-final-anisimova-bencic-2753534-2025-07-10",
      "headline": "Day 11 schedule: Aryna Sabalenka, Iga Swiatek eye spot in finalWimbledon 2025: World No. 1 Aryna Sabalenka and five-time Grand Slam champion Iga Swiatek are each just one win away from a maiden Wimbledon final, but standing in their way are two resurgent forces-Amanda Anisimova and Belinda Bencic-both playing inspired tennis."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}