{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-day-2-latest-subscription-booked-8x-expected-listing-gains-2597288-2024-09-10",
      "headline": "Bajaj Housing Finance IPO booked 8x on Day 2. Check expected listing gainsBajaj Housing Finance is offering its shares in the price range of Rs 66-70 each. Investors can apply for a minimum of 214 shares and in multiples thereafter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-assets-hit-record-rs-66-lakh-crore-in-august-amfi-data-sip-2597259-2024-09-10",
      "headline": "Mutual fund assets hit record Rs 66 lakh crore in AugustData from the Association for Mutual Funds in India (AMFI) shows that inflows into equity mutual funds rose by 3% in August, reaching Rs 38,239 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-property-prices-all-time-high-circle-rate-hike-proposal-homebuyers-plight-2597254-2024-09-10",
      "headline": "Noida's housing dream fades as proposed rate hike pushes homes out of reachNoida's once-affordable housing dream is slipping away as soaring property prices and a proposed circle rate hike threaten to push homeownership further out of reach for the urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-driven-by-rally-in-it-pharma-stocks-2597181-2024-09-10",
      "headline": "Sensex, Nifty end higher driven by rally in IT and pharma stocks The S&P BSE Sensex added 361.75 points to end at 81,921.29, while the NSE Nifty50 gained 104.70 points to close at 25,041.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-trump-kamala-harris-risk-looms-over-wall-street-but-there-are-bigger-threats-federal-reserve-rate-2597159-2024-09-10",
      "headline": "US election risk looms over Wall Street, but there are bigger threatsRight now, Wall Street is facing some uncertain moments as investors keep a close eye on the US stock rally, with the presidential election and other big economic factors coming into play."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mahindra-group-denies-conflict-of-interest-allegations-regarding-payments-to-dhaval-buch-2597155-2024-09-10",
      "headline": "Mahindra Group rejects conflict of interest claims over payments to Dhaval BuchIn a stock exchange filing, the Mahindra Group has clarified that Dhaval Buch was hired for his supply chain expertise, unrelated to the Sebi approvals cited by the Congress party. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-plans-to-raise-rs-5000-crore-through-fresh-issue-2597106-2024-09-10",
      "headline": "Swiggy plans to raise Rs 5,000 crore in upcoming IPO through fresh issueThe Bengaluru-based firm had earlier planned to raise Rs 3,750 crore through fresh issue, along with an additional Rs 6,664 crore offer for sale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-4x-expected-listing-gain-gmp-close-to-100-percent-2597080-2024-09-10",
      "headline": "Bajaj Housing Finance IPO subscribed over 4x, GMP nears 100%Bajaj Housing Finance has demonstrated impressive growth, with a compound annual growth rate (CAGR) of 30.9% in AUM from Fiscal 2022 to 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jupiter-wagons-stock-price-down-correction-good-buying-opportunity-2597061-2024-09-10",
      "headline": "Jupiter Wagons stock down 12% in a month. Is it a buying opportunity?On Tuesday, the stock extended its losses, dropping to a day's low of Rs 490. At 1:22 pm, shares of Jupiter Wagons were trading 1.24% lower at Rs 502.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/p-n-gadgil-jewellers-ipo-opens-review-good-bad-subscribe-skip-expert-view-gmp-2597060-2024-09-10",
      "headline": "P N Gadgil Jewellers IPO opens: Should you subscribe or skip?P N Gadgil Jewellers IPO is a book-built issue which includes a fresh issue of 1.77 crore shares, amounting to Rs 850 crore, and an offer for sale of 52 lakh shares, totalling Rs 250 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-power-share-price-gains-today-solar-power-cell-production-explained-2597031-2024-09-10",
      "headline": "Explained: Why Tata Power shares soared over 5% today Tata Power shares jumped after the company's subsidiary, TP Solar, began commercial production of solar cells at its new plant in Tirunelveli, Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-up-5-percent-bull-run-key-triggers-analyst-view-2597004-2024-09-10",
      "headline": "Suzlon Energy shares up 5%. Will positive momentum continue? Suzlon Energy shares were up nearly 5% after the company announced a major 1.17 GW order win from NTPC Green Energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adanis-usd-185-billion-airport-deal-in-kenya-nairobi-jomo-kenyatta-hits-legal-roadblock-2596992-2024-09-10",
      "headline": " Gautam Adani's $1.85 billion airport deal in Kenya hits legal roadblockThe deal faced opposition from various groups in Kenya, with a key legal challenge filed by the Kenya Human Rights Commission and the Law Society of Kenya"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-surges-stock-trend-expert-view-2596958-2024-09-10",
      "headline": "Explained: Why Paytm shares jumped 9% in early tradeIn the past week, Paytm's share price has risen by more than 13%, and in the last month, it has gone up by over 30%. Over the last three months, Paytm's stock has jumped by more than 74%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-join-hands-to-expand-semiconductor-industry-chips-act-itsi-all-you-need-to-know-2596941-2024-09-10",
      "headline": "US, India join hands to expand semiconductor industry. All you need to know The US Department of State will collaborate with the India Semiconductor Mission, under India's Ministry of Electronics and IT, to explore ways to grow and diversify the semiconductor ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-worlds-first-trillionaire-gautam-adani-second-in-line-dubai-based-informa-connect-academy-2596928-2024-09-10",
      "headline": "Elon Musk set to be world's 1st trillionaire, second could be an IndianTesla CEO Elon Musk is set to become the world's first trillionaire, with an Indian business tycoon close behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-marginally-higher-on-positive-global-cues-paytm-up-9-percent-2596922-2024-09-10",
      "headline": "Sensex, Nifty open marginally higher on positive global cues; Paytm up 9%The S&P BSE Sensex was down 47.27 points to 81,512.27, while the NSE Nifty50 shed 18.70 points to 24,917.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wazirx-security-partner-liminal-company-cyberattack-security-breach-audit-findings-2596809-2024-09-09",
      "headline": "Crypto firm WazirX's security partner says no evidence of cyberattack on its systemThe cyberattack on crypto exchange WazirX in July, that led to a loss of about Rs 2,000 crore in digital assets, had originated from their end, according to its security partner and digital asset custody company, Liminal Custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rates-cancer-drugs-namkeen-health-insurance-postponed-nirmala-sitharaman-2596666-2024-09-09",
      "headline": "GST rates on cancer drugs cut, decision on health insurance postponedFinance Minister Nirmala Sitharaman, who chaired the GST Council meeting, said that GST rates on some cancer drugs have been reduced to 5 per cent from 12 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-insurance-premiums-to-next-meeting-report-2596572-2024-09-09",
      "headline": "GST Council delays decision on insurance premiums to next meeting: ReportCurrently, policyholders are paying 18% GST on their premiums, and many hoped this rate would be reduced to ease the financial pressure."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sushil-kumar-shinde-home-minister-jammu-kashmir-scared-visit-bjp-congress-2597261-2024-09-10",
      "headline": "Ex-Home Minister says he was 'scared' of visiting Kashmir, BJP mocks CongressFormer Union Home Minister Sushil Kumar Shinde said he used to be scared of venturing out in the Kashmir Valley during the UPA government. The BJP mocked the Congress, highlighting the changes Jammu and Kashmir has witnessed following the abrogation of Article 370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sebi-chief-madhabi-buch-earned-crores-mahindra-icici-dr-reddys-via-agora-congress-2597084-2024-09-10",
      "headline": "Mahindra clarifies after Congress's 'payments to Sebi chief's husband' chargeMahindra, in a statement, said Dhaval Buch, who joined the company in 2019, was hired solely for his expertise in supply chain management. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-says-sikhs-not-allowed-to-wear-turbans-in-india-bjp-reaction-national-spokesperson-rp-singh-2596960-2024-09-10",
      "headline": "Row over Rahul Gandhi's remark on Sikhs in India, BJP asks 'Remember 1984?'Congress MP Rahul Gandhi sparked controversy with remarks on religious freedom in India, specifically addressing the Sikh community, during an event in Herndon, Virginia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-rape-murder-kolkata-trainee-doctor-protest-mamata-banerjee-trinamool-tmc-going-after-protesters-reclaim-the-night-2596684-2024-09-10",
      "headline": "Unnerved, Mamata and Trinamool are going after protesters, doctors nowProtests in West Bengal, which have continued for a month now, have unnerved Chief Minister Mamata Banerjee. She lied low and waited for the protests over the rape-murder at RG Kar to fizzle out. Seeing that not happening, Mamata and her Trinamool Congress are going after protesters and doctors, and painting them as villains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/what-goes-into-petrichor-perfume-baked-earth-and-bacteria-geosmin-for-mitti-ki-khushboo-in-a-bottle-2597139-2024-09-10",
      "headline": "The making of petrichor perfume: Baked earth and bacteria for mitti ki khushbooFor centuries, perfumers in Kannauj – known as the perfume capital of India – have been making mitti attars, capturing that smell of the season's first rain in little bottles, long before the term petrichor and international perfumes popularised this earthy fragrance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/aap-reactions-slams-bjp-memorandum-dismiss-delhi-government-president-forwards-home-ministry-2597112-2024-09-10",
      "headline": "AAP fumes as President acts on BJP's demand to dismiss Delhi governmentAAP leaders lashed out at the BJP after its memorandum calling for the dismissal of the Delhi government was forwarded to the Union Home Ministry by President Droupadi Murmu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-remarks-on-sikhs-wear-turban-controversy-gurudwara-kripan-religious-freedom-narendra-modi-hardeep-puri-2597094-2024-09-10",
      "headline": "Will a Sikh be allowed to wear turban in India? Now, where did this come from?Sikhs proudly wear the dastar (turban) and kara (steel bangle) in India. They are also allowed to carry a kirpan (sacred dagger) in domestic flights, while even plastic toy knives are confiscated at airports. So, where did Congress leader Rahul Gandhi's remarks on Sikh rights come from?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-social-media-kids-restrictions-ban-prime-minister-anthony-albanese-2597135-2024-09-10",
      "headline": "Australia plans social media minimum age limit, PM wants kids on footy fieldsThe minimum age for children to log into sites such as Facebook, Instagram, and TikTok has not been decided but is expected to be between 14 and 16 years, Australian Prime Minister said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tyreek-hill-arrest-miami-police-releases-video-of-dolphins-stars-detention-2597269-2024-09-10",
      "headline": "Bodycam footage shows cops dragging Dolphins star Tyreek Hill from carNewly released body cam footage shows Miami Dolphins star Tyreek Hill in a heated confrontation with police, following a traffic stop that quickly escalated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/video/locals-in-andhras-guntur-grab-bottles-during-police-disposal-of-seized-alcohol-2596846-2024-09-10",
      "headline": "Video: Andhra cops line up liquor bottles for disposal, locals grab and run offLiquor enthusiasts in Andhra Pradesh's Guntur rushed to grab bottles of alcohol while police were destroying seized illicit liquor at a dumping yard on Etukuru Road."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/internet-suspended-in-manipur-amid-unrest-student-agitation-2597200-2024-09-10",
      "headline": "Internet suspended in Manipur for 5 days amid unrest, student agitationThe Manipur government has suspended internet services across the state for five days in response to rising tensions and ongoing student protests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/visualstories/technology/camera-control-button-on-iphone-16-series-what-all-it-can-do-169615-10-09-2024",
      "headline": "Camera Control button on iPhone 16 series: What all it can doApple has finally launched the iPhone 16 series. And with it, a new Camera Control button has also arrived. let's see how it works"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-four-astronauts-set-to-launch-on-private-polaris-dawn-mission-2588144-2024-09-10",
      "headline": "Video: Polaris Dawn launches to conduct first private spacewalkThis endeavour will test SpaceX's new extravehicular activity (EVA) suits, designed for future long-duration missions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/kolkata-rape-murder-case-doctors-defy-supreme-court-order-continue-protest-demanding-justice-for-victim-2597276-2024-09-10",
      "headline": "Doctors defy Supreme Court order, continue protest against Kolkata rape-murderThe Supreme Court on Monday directed the protesting resident doctors to resume work by 5 pm on Tuesday and said no adverse action shall be taken against them on resumption of work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/narayana-murthy-does-not-believe-in-coaching-classes-says-wrong-way-to-help-children-2597092-2024-09-10",
      "headline": "Narayana Murthy criticises coaching classes, says wrong way to help childrenInfosys co-founder NR Narayana Murthy has expressed his disapproval of coaching classes, stating that they are an inappropriate method for assisting children in passing examinations and that he does not support their use."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-property-prices-all-time-high-circle-rate-hike-proposal-homebuyers-plight-2597254-2024-09-10",
      "headline": "Noida's housing dream fades as proposed rate hike pushes homes out of reachNoida's once-affordable housing dream is slipping away as soaring property prices and a proposed circle rate hike threaten to push homeownership further out of reach for the urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/little-girl-sings-my-heart-will-go-on-titanic-song-with-pianist-viral-video-2597171-2024-09-10",
      "headline": "3-year-old girl sings Titanic song with pianist. Video has 192 million viewsA video of a little girl singing Celine Dion's iconic song My Heart Will Go On from Titanic with a pianist has gone viral with over 192 million views on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-inquiry-wing-commander-accused-rape-woman-flying-officer-jammu-kashmir-2597197-2024-09-10",
      "headline": "Air Force officer accuses Wing Commander at J&K station of rapeAccording to the complainant, the incident occurred on the night of December 31, 2023, during a New Year's party held at the Officers' mess after the officer allegedly sexually assaulted her in his room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-international-students-visa-approvals-projected-drop-halved-study-permit-applyboard-report-2597007-2024-09-10",
      "headline": "Canada's study visa approvals for Indian students to drop by 50% in 2024: ReportIndian students planning to study in Canada are likely to face a major challenge with approvals for study visas expected to drop by nearly 50% this year. A report by ApplyBoard cites stricter immigration policies and higher financial requirements as key reasons behind the decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bjp-releases-second-list-haryana-assembly-elections-vinesh-phogat-captain-yogesh-bairagi-2597161-2024-09-10",
      "headline": "BJP releases 2nd list, fields Captain Yogesh Bairagi against Vinesh Phogat The Bharatiya Janata Party released its second list of candidates for the upcoming Haryana Assembly elections, naming Captain Yogesh Bairagi as its candidate from the Julana constituency against renowned wrestler Vinesh Phogat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/waiter-dragged-food-bill-payment-maharashtra-2597151-2024-09-10",
      "headline": "Video: Waiter dragged, kidnapped after asking to pay bill in MaharashtraThe men also stole ₹11,500 from his pocket, blindfolded him, and took him to an unknown location, where he was held overnight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ios-18-is-coming-next-week-will-it-support-your-iphone-check-the-full-list-of-ios-18-iphones-here-2597058-2024-09-10",
      "headline": "iOS 18 is coming next week, will it support your iPhone?Apple iPhone 16 series is finally out with iOS 18, featuring several customisation options and AI-powered features. iOS 18 will arrive next week but will it come to your current iPhones? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/ranjitsinhji-cricket-prince-first-indian-to-play-for-england-ranji-trophy-2597022-2024-09-10",
      "headline": "Ranjitsinhji, the prince who became the first Asian to play cricket for EnglandRanjitsinhji, the prince of Jamnagar, became the first person of colour in the English cricket team in 1896. He also represented India in the League of Nations after the First World War in 1920. Knighted on three separate occasions, perhaps his most iconic legacy is the Ranji Trophy, which is named after him, though he never played for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/pakistani-woman-cctv-on-head-2597095-2024-09-10",
      "headline": "'He monitors me 24x7': Pakistani woman says father fixed CCTV on her headWhen asked if she had any objections to this, she denied having any and said she felt protected by the decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/how-anurag-kashyaps-gangs-of-wasseypur-changed-indian-cinema-a-gritty-revolution-2597237-2024-09-10",
      "headline": "How Anurag Kashyap's Gangs of Wasseypur changed Indian cinema: A gritty revolutionAnurag Kashyap's Gangs of Wasseypur, released in 2012, revolutionised Indian filmmaking with its gritty, raw storytelling. This two-part epic centred on a decades-long blood feud in the coal mafia of Dhanbad, setting a new standard for Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devara-trailer-jr-ntr-saif-ali-khan-fight-it-out-in-koratala-sivas-film-janhvi-kapoor-anirudh-ravichander-2597263-2024-09-10",
      "headline": "Devara trailer: Jr NTR, Saif Ali Khan fight it out in Koratala Siva's filmThe highly anticipated trailer of Devara, directed by Koratala Siva, has been unveiled, showcasing an epic showdown between Jr NTR and Saif Ali Khan. The film promises a high-octane narrative with emotional depth and complex characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/the-boy-and-the-heron-ott-release-hayao-miyazaki-film-2597230-2024-09-10",
      "headline": "The Boy and the Heron OTT release: When and where to watch Hayao Miyazaki's filmHayao Miyazaki's Oscar-winning film 'The Boy and the Heron' will be available on Netflix starting October 7, excluding Japan and the United States. This marks Miyazaki's first feature film in 10 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-pr-game-damaging-bollywood-exclusive-2597241-2024-09-10",
      "headline": "Exclusive: Siddhant Chaturvedi says perception game by PR 'damaging Bollywood'Siddhant Chaturvedi critiqued Bollywood's PR game in an exclusive interview with IndiaToday.In while promoting his new film Yudhra."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-brad-hoggs-india-playing-xi-ravindra-jadeja-kl-rahul-chennai-2597313-2024-09-10",
      "headline": "Ravindra Jadeja at No.5, No KL Rahul: Brad Hogg's India playing XI vs BangladeshBrag Hogg has included Ravindra Jadeja at No.5 and snubbed KL Rahul from his India's playing XI for the 1st Test against Bangladesh in Chennai. Jadeja and Rahul were included in the squad for the 1st Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-phil-salt-playing-xi-2597286-2024-09-10",
      "headline": "ENG vs AUS: Phil Salt to captain as England hand 3 debuts in 1st T20IEngland announced their playing XI for the 1st T20I match against Australia a day in advance. With Phil Salt captaining, the hosts named three debutants in the first XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/pralympics-medal-wins-india-athletes-rewarded-sports-ministry-mansukh-mandaviya-2597273-2024-09-10",
      "headline": "Sports ministry announces cash rewards for Paralympians after historic campaignThe Indian government on Tuesday, September 10, announced cash rewards for Paralympic medallists. Sports minister Mansukh Mandaviya pledged support from the government for the LA 2028 campaign and said that medal winners would get special prizes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-nahid-rana-training-pace-chennai-2597246-2024-09-10",
      "headline": "IND vs BAN: Bangladesh are well-prepared for India series, says Nahid RanaNahid Rana has claimed that Bangladesh are well-prepared for the tour of India, starting with the Test series. Nahid was one of the stars for Bangladesh during their Test series win against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-career-numbers-india-vs-england-2024-india-vs-bangladesh-2597201-2024-09-10",
      "headline": "Shubman Gill recalls 'confidence boosting' turnaround in England Test seriesStar India batter Shubman Gill recalled how he regained his confidence after a poor start to the England Test series earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronald-koeman-keeps-netherlands-door-open-for-memphis-depay-after-corinthians-move-2597202-2024-09-10",
      "headline": "Ronald Koeman keeps Netherlands door open for Memphis Depay after Corinthians moveNetherlands boss Ronald Koeman has kept the door open for a return to the national team for Memphis Depay, despite his move to join Corinthians. Depay joined the Brazilian club on September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/anwar-ali-mohun-bagan-ban-4-months-indian-football-12-90-crore-compensation-2597199-2024-09-10",
      "headline": "Anwar banned for 4 months, Mohun Bagan eligible for Rs 12.90 crore compensationIndia international Anwar Ali has been banned for four months by the Indian football governing body for illegally terminating his contract with Kolkata giants Mohun Bagan. The Indian Super League club is eligible for Rs 12.90 crore compensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/legendary-f1-designer-adrian-newey-to-join-aston-martin-in-2025-2597192-2024-09-10",
      "headline": "Legendary F1 designer Adrian Newey to join Aston Martin in 2025Formula One's legendary designer Adrian Newey will join Aston Martin as Managing Technical Partner on March 1, 2025. The move is part of Aston Martin's ambitious plans to rise to the top of Formula One."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-virat-kohli-steve-smith-2597191-2024-09-10",
      "headline": "Virat Kohli is the most Australian of Indian players: Steve SmithSenior Australia batter Steve Smith feels that Virat Kohli is Australian in his thoughts and actions. Smith has also revealed that he gets along well with the former India captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-form-france-manager-didier-deschamps-2597180-2024-09-10",
      "headline": "Deschamps confident Mbappe will be back among the goalsFrance coach Didier Deschamps is not concerned about the form of Kylian Mbappe and expects Real Madrid's new forward to rediscover his scoring touch when he reaches full fitness.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-day-2-called-off-no-rain-greater-noida-2597175-2024-09-10",
      "headline": "No rain, but no play: 2nd straight day of AFG v NZ Test washed outThe Day 2 of the one-off Test between Afghanistan and New Zealand was called off despite no rain on September 10, Tuesday. Despite the best efforts of the groundsmen, the outfield at The Shaheed Vijay Singh Pathik Sports Complex in Greater Noida was deemed not fit enough. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/anwar-ali-mohun-bagan-ban-4-months-indian-football-12-90-crore-compensation-2597199-2024-09-10",
      "headline": "Anwar banned for 4 months, Mohun Bagan eligible for Rs 12.90 crore compensationIndia international Anwar Ali has been banned for four months by the Indian football governing body for illegally terminating his contract with Kolkata giants Mohun Bagan. The Indian Super League club is eligible for Rs 12.90 crore compensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/legendary-f1-designer-adrian-newey-to-join-aston-martin-in-2025-2597192-2024-09-10",
      "headline": "Legendary F1 designer Adrian Newey to join Aston Martin in 2025Formula One's legendary designer Adrian Newey will join Aston Martin as Managing Technical Partner on March 1, 2025. The move is part of Aston Martin's ambitious plans to rise to the top of Formula One."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-virat-kohli-steve-smith-2597191-2024-09-10",
      "headline": "Virat Kohli is the most Australian of Indian players: Steve SmithSenior Australia batter Steve Smith feels that Virat Kohli is Australian in his thoughts and actions. Smith has also revealed that he gets along well with the former India captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-form-france-manager-didier-deschamps-2597180-2024-09-10",
      "headline": "Deschamps confident Mbappe will be back among the goalsFrance coach Didier Deschamps is not concerned about the form of Kylian Mbappe and expects Real Madrid's new forward to rediscover his scoring touch when he reaches full fitness.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-day-2-called-off-no-rain-greater-noida-2597175-2024-09-10",
      "headline": "No rain, but no play: 2nd straight day of AFG v NZ Test washed outThe Day 2 of the one-off Test between Afghanistan and New Zealand was called off despite no rain on September 10, Tuesday. Despite the best efforts of the groundsmen, the outfield at The Shaheed Vijay Singh Pathik Sports Complex in Greater Noida was deemed not fit enough. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ind-vs-ban-bangladesh-cricket-team-2597156-2024-09-10",
      "headline": "Shubman Gill expects 'intriguing' contest against Pakistan-beaters Bangladesh Shubman Gill is expecting good contest against Bangladesh in the upcoming two-match Test series beginning from September 19. Bangladesh recently beat Pakistan by 2-0 in the last series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rinku-singh-rishabh-pant-axar-patel-india-b-2597119-2024-09-10",
      "headline": "Duleep Trophy 2024: Rinku Singh replaces Rishabh Pant in India B for second roundRinku Singh has replaced Rishabh Pant in the India B squad for the second round of the Duleep Trophy 2024. The second round begins from September 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-squads-sarfaraz-khan-test-match-vs-bangladesh-2597116-2024-09-10",
      "headline": "Sarfaraz Khan to play another round of Duleep Trophy before Bangladesh TestMiddle-order batter Sarfaraz Khan will play another round of the Duleep Trophy before joining the Test squad for the first match against Bangladesh. The BCCI announced the development on Tuesday while releasing the tournament squads for the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-greater-noida-stadium-washroom-utensils-caterer-exclusive-2597105-2024-09-10",
      "headline": "Photos show caterer cleaning utensils in toilet at Greater Noida stadiumAfghanistan vs New Zealand: A member of the catering staff at the Greater Noida stadium was seen using water from a washroom to wash utensils. The venue has been scrutinised for substandard infrastructure and lack of proper facilities for the spectators.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-rinku-singh-india-test-squad-vs-bangladesh-2597100-2024-09-10",
      "headline": "School kids used to scream Rinku, Rinku: Yash Dayal's father on tough IPL timesSeamer Yash Dayal's father opened up on the tough times his family faced after IPL 2023. Chanderpal Dayal recalled how school kids used to taunt his family by screaming Rinku Singh's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rebecca-cheptegei-murder-burns-former-partner-death-2597086-2024-09-10",
      "headline": "Rebecca Cheptegei's ex-partner, accused of killing her, dies of burns in KenyaThe alleged killer of Ugandan athlete Rebecca Cheptegei has died from the burns sustained during the incident, confirmed the Kenyan hospital where he was being treated. Cheptegei, 33, had died after she was set on fire by her boyfriend during a disagreement over a land deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-steve-smith-opening-test-coach-andrew-mcdonald-2597074-2024-09-10",
      "headline": "Will Steve Smith continue to open in Tests? Australia still undecided, says coachAustralia head coach Andrew McDonald refused to give away details about their plans for the upcoming Test series. McDonald said the team management and captain Pat Cummins have been discussing the team composition, including Steve Smith's role as opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-dhruv-jurel-wicketkeeper-rishabh-pant-australia-deep-dasgupta-2597003-2024-09-10",
      "headline": "Dhruv Jurel is impressive, will be handy in Australian conditions: Deep DasguptaSpeaking to IndiaToday.in, former wicketkeeper Deep Dasgupta backed Dhruv Jurel's chances of making a mark in the upcoming Test season. Dhruv was one of the three wicketkeeper-batters picked in India's squad for their two-match Test series against Bangladesh, starting September 19. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-rinku-singh-india-test-squad-vs-bangladesh-2597100-2024-09-10",
      "headline": "School kids used to scream Rinku, Rinku: Yash Dayal's father on tough IPL timesSeamer Yash Dayal's father opened up on the tough times his family faced after IPL 2023. Chanderpal Dayal recalled how school kids used to taunt his family by screaming Rinku Singh's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rebecca-cheptegei-murder-burns-former-partner-death-2597086-2024-09-10",
      "headline": "Rebecca Cheptegei's ex-partner, accused of killing her, dies of burns in KenyaThe alleged killer of Ugandan athlete Rebecca Cheptegei has died from the burns sustained during the incident, confirmed the Kenyan hospital where he was being treated. Cheptegei, 33, had died after she was set on fire by her boyfriend during a disagreement over a land deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-steve-smith-opening-test-coach-andrew-mcdonald-2597074-2024-09-10",
      "headline": "Will Steve Smith continue to open in Tests? Australia still undecided, says coachAustralia head coach Andrew McDonald refused to give away details about their plans for the upcoming Test series. McDonald said the team management and captain Pat Cummins have been discussing the team composition, including Steve Smith's role as opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-dhruv-jurel-wicketkeeper-rishabh-pant-australia-deep-dasgupta-2597003-2024-09-10",
      "headline": "Dhruv Jurel is impressive, will be handy in Australian conditions: Deep DasguptaSpeaking to IndiaToday.in, former wicketkeeper Deep Dasgupta backed Dhruv Jurel's chances of making a mark in the upcoming Test season. Dhruv was one of the three wicketkeeper-batters picked in India's squad for their two-match Test series against Bangladesh, starting September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-dances-with-us-open-trophy-to-celebrate-3rd-major-triumph-2596999-2024-09-10",
      "headline": "Watch: Aryna Sabalenka dances with US Open Trophy to celebrate 3rd major triumphAryna Sabalenka was seen dancing with the US Open trophy after winning her third major title by beating Jessica Pegula in the final at flushing meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-greater-noida-test-facilities-poor-drainage-2596961-2024-09-10",
      "headline": "Afghanistan vs New Zealand Test in limbo due to poor facilities in Greater Noida Afghanistan vs New Zealand, one-off Test: Poor facilities and lack of proper planning have hampered the Shaheed Vijay Singh Pathik Sports Complex's Test debut. The Greater Noida stadium has come under the scanner after the opening day of the Test was washed out and the start of the second day was delayed due to a wet outfield. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/indian-paralympians-get-rousing-reception-upon-arrival-in-new-delhi-2596945-2024-09-10",
      "headline": "Watch: Indian Paralympians get rousing reception upon arrival in New DelhiThe Indian Paralympic contingent got a rousing reception upon their return from Paris. India recorded their best medal tally at the Paralympics with 29 medals to their name, including seven gold, nine silver and 13 bronze. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-announce-squad-for-womens-t20-world-cup-2024-rosemary-mair-returns-2596936-2024-09-10",
      "headline": "New Zealand announce squad for women's T20 World Cup 2024, Rosemary Mair returnsNew Zealand announced the squad for the women's T20 World Cup 2024 set to be played in UAE from October 3. Sophie Devine is set to lead the team for the final time in T20Is."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}