{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/directorate-general-of-civil-aviation-suspends-akasa-air-officials-lapses-in-pilots-training-2656500-2024-12-27",
      "headline": "Aviation regulator suspends 2 Akasa Air officials for lapses in pilots trainingThe two senior executives of the airline have reportedly failed to ensure compliances with the civil aviation requirements, Directorate General of Civil Aviation said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-ceo-sridhar-vembu-revives-debate-on-70-hour-work-week-advocated-by-infosys-founder-narayana-murthy-2656318-2024-12-27",
      "headline": "Zoho CEO Sridhar Vembu revives debate on 70-hour work weekZoho CEO Sridhar Vembu weighs in on the 70-hour work week debate initiated by Infosys founder Narayana Murthy. Here's his perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dearness-allowance-da-rise-again-in-2025-check-details-how-it-is-calculated-all-you-need-to-know-2656247-2024-12-27",
      "headline": "Will DA rise again in 2025? All you need to knowCentral government employees await a potential DA hike in January 2025, which could offer modest relief amid rising costs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rise-for-2nd-straight-day-as-auto-stocks-rally-2656246-2024-12-27",
      "headline": "Sensex, Nifty rise for 2nd straight day as auto stocks rally The S&P BSE Sensex settled 226.59 points higher at 78,690.07, while the NSE Nifty50 gained 63.20 points to end at 23,813.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-indian-economy-global-standing-key-reforms-1991-economic-liberalisation-2656166-2024-12-27",
      "headline": "How Manmohan Singh revitalised India's economy and global standingAs the chief architect of India's 1991 economic liberalisation, Manmohan Singh's policies helped steer India away from a severe financial crisis, positioning the country as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/osamu-suzuki-former-suzuki-motor-corporation-chairman-dies-at-94-2656153-2024-12-27",
      "headline": "Osamu Suzuki, former Suzuki Motor Corporation chairman, dies at 94Osamu Suzuki steered Suzuki Motor's rise, from pioneering Maruti 800 in India to building a global automotive legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-stock-market-benefitted-under-manmohan-singh-death-news-sensex-nifty-1991-2656149-2024-12-27",
      "headline": "How Indian stock market benefitted under Manmohan SinghManmohan Singh's policies, introduced during a time of economic crisis in the early 1990s, reshaped India's economy and transformed the Indian stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/15-income-tax-changes-in-2024-what-you-need-to-know-for-filing-itr-in-2025-income-tax-rules-stmp-2656139-2024-12-27",
      "headline": "10 income tax changes in 2024: What you need to know for filing ITR in 2025The 2024 income tax reforms introduce revised tax slabs, higher deductions, and simplified TDS and capital gains rules, making tax filing easier and offering potential savings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bumper-market-debut-for-mamata-machinery-should-you-book-profit-or-wait-2656140-2024-12-27",
      "headline": "Bumper stock market debut for Mamata Machinery: Should you book profit or wait? Mamata Machinery stock market listing: A 147% premium debut for Mamata Machinery leaves investors wondering: Is this the peak, or should they hold on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-stock-market-listing-long-term-bet-or-not-expert-views-2656116-2024-12-27",
      "headline": "DAM Capital Advisors makes strong market debut: Is it a long-term bet?DAM Capital Advisors market listing: The listing matched market predictions, as analysts and the grey market premium (GMP) had anticipated a 40%-50% premium, driven by robust demand and positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-market-listing-31-percent-premium-over-ipo-price-hold-or-sell-2656091-2024-12-27",
      "headline": "Sanathan Textiles shares list at 31% premium over IPO price. Hold or sell? Sanathan Textiles stock market debut: The listing comes after the company's initial public offering (IPO) witnessed robust demand, with subscriptions exceeding 36 times the total shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-strong-price-is-down-50-percent-on-some-trading-apps-today-explained-stmp-2656077-2024-12-27",
      "headline": "Explained: Why Mazagon Dock share price is down 50% on some trading apps todayMazagon Dock stock price: Certain trading apps may be displaying the unadjusted previous closing price, leading to the perception of a 50% fall. Adjusted for the split, Mazagon Dock shares were trading 2.13% lower on the Bombay Stock Exchange (BSE) at 11:09 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/transrail-lighting-ipo-share-price-listing-stock-open-at-36-percent-premium-dalal-street-debut-stmp-2656057-2024-12-27",
      "headline": "Transrail Lighting shares list at 36% premium on Dalal Street debut Transrail Lighting share price: The shares opened at Rs 585.15 per share on the Bombay Stock Exchange (BSE). The market debut aligns with market expectations, which was oversubscribed by 81 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-share-price-listing-strong-debut-39-percent-premium-nse-bse-rs-393-stmp-2656049-2024-12-27",
      "headline": "DAM Capital Advisors makes strong debut, shares list at 39% premium DAM Capital Advisors listing: On the BSE, the shares began trading at Rs 392.90, marking a 38.83% premium compared to the issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-listing-share-price-bumper-debut-147-percent-premium-rs-600-nse-bse-stmp-2656037-2024-12-27",
      "headline": "Mamata Machinery shares make bumper debut with 147% premium over IPO priceMamata Machinery listing: Shares of Mamata Machinery made a bumper debut and listed at Rs 600 per share on the NSE, a lot higher than the IPO issue price of Rs 243 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-auto-stocks-shine-tata-motors-bajaj-2656032-2024-12-27",
      "headline": "Sensex, Nifty open higher as auto stocks fuel early rally; Tata Motors up 2%The S&P BSE Sensex was up 323.12 points to 78,795.60, while the NSE Nifty50 gained 101.95 points to 23,852.15 as of 9:44 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-mamata-machinery-concord-transrail-sanathan-textiles-gmp-5-ipos-market-debut-today-2656022-2024-12-27",
      "headline": "Dam Capital to Mamata Machinery: GMPs of 5 IPOs ahead of D-Street debut todayThese initial public offerings (IPOs), which opened for subscription on December 19 and closed on December 23, collectively raised over Rs 2,900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-death-3-key-economic-reforms-liberalisation-licence-raj-mnrega-shaped-modern-india-2656013-2024-12-27",
      "headline": "Manmohan Singh's key reforms that shaped Indian economyDr Manmohan Singh's tenure as Finance Minister in the early 1990s and later as Prime Minister from 2004 to 2014 introduced policies that continue to influence India's growth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-on-work-life-balance-spend-four-hours-with-family-2655881-2024-12-26",
      "headline": "Gautam Adani on work-life balance: Spend at least 4 hours with familyChairperson of Adani Group, Gautam Adani, shared his take on work-life balance and said one must try to spend at least four hours with their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-relief-consideration-government-sources-2655736-2024-12-26",
      "headline": "Government may consider tax relief for income of up to Rs 10.50 lakh: ReportThe move, likely to be announced in the upcoming Budget 2025 on February 1, aims to boost consumption and address concerns over rising living costs amid a slowing economy."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-funeral-cremation-state-mourning-resting-place-congress-2656392-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India to bid goodbye to Manmohan Singh today, funeral march from Congress HQThe funeral procession of Manmohan Singh is scheduled to commence at 9.30 am from the Congress headquarters, with the last rites expected to take place at 11.45 am. The Congress has urged the government to allocate a memorial site for the two-time Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-to-allocate-space-former-prime-minister-manmohan-singhs-memorial-after-row-2656522-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government agrees to allocate space for Manmohan Singh's memorial after rowThe Union Home Ministry said that, meanwhile, cremation and other formalities can happen because a Trust has to be formed and space has to be allocated to it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-weather-cold-wave-fog-imd-prediction-temperature-noida-gurugram-aqi-stmp-2656265-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dark skies, bitter cold after heavy rain in Delhi; hailstorm alert for North IndiaAn 'orange' warning was issued in Delhi after rain lashed several parts of the national capital and adjoining areas on Friday. The rain is expected to continue in the city. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/azerbaijan-airlines-points-to-possible-external-interference-in-kazakhstan-plane-crash-2656347-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "External interference caused Kazakhstan plane crash: Azerbaijan Airlines Azerbaijan Airlines attributed the Kazakhstan plane crash to external interference. Meanwhile, reports alleged Russian anti-aircraft involvement behind the crash. At least 38 died. Russia blamed Ukrainian drones and fog for the diversion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-history-will-be-kinder-remark-weak-silent-leader-scandals-2656169-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yes, history is kinder: In Manmohan Singh tributes, throwback to his iconic quoteManmohan Singh death: The remark by Manmohan Singh, which came amid massive scandals and allegations of 'weak leadership', gained resonance following his death at the age of 92. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-disqualified-world-rapid-and-blitz-championships-wearing-jeans-2656520-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Magnus penalised for wearing jeans, quits World Rapid and Blitz ChampionshipDefending World Rapid and Blitz Champion Magnus Carlsen quit the World Rapid Chess Championship after being penalised for a dress code violation (jeans) and a previous warning. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-virat-kohli-sunil-gavaskar-justin-langer-aus-vs-ind-border-gavaskar-trophy-2656341-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is to blame for Yashasvi Jaiswal-Virat Kohli MCG mix-up? Pundits weigh inFormer cricketers Sunil Gavaskar and Justin Langer have shared their opinion on Virat Kohli-Yashasvi Jaiswal run out on Day 2 of the fourth Test between India and Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/manmohan-singh-the-accidental-prime-minister-who-transformed-india-2656301-2024-12-27?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Manmohan Singh: The 'accidental' Prime Minister who transformed IndiaFrom a small village in undivided Punjab to Cambridge University and the corridors of power in New Delhi, Dr. Manmohan Singh's journey is nothing short of extraordinary. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-curbs-under-grap-3-revoked-air-quality-shows-improvement-2656428-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pollution curbs under GRAP-3 revoked in Delhi-NCR as air quality improvesDelhi Air Quality: The anti-pollution restrictions under Stage 3 of the Graded Response Action Plan (GRAP) were lifted in the Delhi-NCR region on Friday after air quality improved, with the 24-hour average AQI at 324 by 7 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/maga-crowd-demands-no-h-1b-visas-for-indians-vivek-ramaswamy-says-american-parents-raising-their-kids-wrong-2656273-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vivek Ramaswamy says American parents raising their kids wrongTrump supporters are demanding an H-1B freeze but American entrepreneur and politician, Vivek Ramaswamy, has a cultural diagnosis for the country's STEM shortfall. He says American parents are raising their kids wrong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-manali-snowfall-white-christmas-new-year-traffic-jam-adventure-sports-tourism-tourists-2656295-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Snowfall draws thousands to Manali, but traffic chaos dampens holiday spiritOver 30,000 people visited Manali over the past week and around 10,000 vehicles were recorded entering Manali. Authorities are expecting more 20,000 tourists in the hill station for the New Year festivities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-girl-chetna-stuck-borewell-kotputli-rescue-operation-updates-2656317-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan: Rain hits operation to save 3-year-old stuck in borewell for 5 daysA 170-foot tunnel parallel to the borewell has been dug, and an L-shaped pipe system has been installed to reach Chetna. However, heavy rain prevented rescue teams from descending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-anwar-ibrahim-malaysia-prime-minister-personal-story-education-singh-2656232-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I was in jail, Manmohan offered to pay tuition fees for my kids: Malaysian PMEven as leaders from across the world shared messages to condole the death of former Prime Minister Manmohan Singh, an anecdote posted by Malaysian PM Anwar Ibrahim revealed the lesser-known side of the Indian leader. That was an offer of help when Ibrahim was in jail that could have antagonised the Malaysian regime of that time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-flogs-himself-outside-coimbatore-home-tamil-culture-tough-ritual-against-continuous-injustice-dmk-2656056-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Annamalai flogs himself as pledged, says he chose to surrender to 'higher power'K Annamalai, as promised, flogged himself six times outside his residence in Coimbatore in the presence of mediapersons and BJP supporters. He said he chose to perform this \"tough ritual\" to protest against the \"continued injustice\" in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-birthday-bash-cuts-cake-niece-ayat-family-joins-arbaaz-khan-shura-khan-2656128-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inside Salman Khan's birthday bash: Actor cuts cake with niece Ayat, family joins inSalman Khan turned 59 on December 27. An inside video of the actor's midnight celebration has emerged online. Salman shares his birthday with his niece Ayat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/bird-flu-in-us-infection-in-cats-raises-concerns-new-virus-mutation-is-discovered-2656523-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bird flu infection in cats raises concerns in US as virus mutatesA sample of the virus found in a critically ill patient in the US has shown signs of mutating to better suit human airways, although there is no indication it has spread beyond that individual."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-anti-terrorist-squad-arrests-bangladeshi-nationals-illegal-navi-mumbai-thane-2656512-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anti-terror team arrests 13 Bangladeshi nationals living illegally in MaharashtraThree cases have been filed at various police stations under the Foreign Nationals Act, 1946, Passport (Entry into India) Act, 1950, Passport Act, 1967 after the raids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-prime-minister-manmohan-singh-pakistani-village-gah-mourns-his-death-2656494-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Pak village mourns Manmohan Singh: 'Someone from our family has died'The Gah village lies about 100 km southwest of Pakistan's capital Islamabad and was part of Jhelum district when Manmohan Singh was born."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/doctors-review-sharad-kelkar-harleen-sethi-2656330-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Doctors review: An unfiltered glimpse into the lives behind white coatsReleased-Fri Dec 27, 2024Doctors review: The makers of the Sharad Kelkar and Harleen Sethi-led show have done justice to stitching together the personal and professional lives of doctors. They have handled the medical side of the stories well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-himanta-biswa-sarma-launched-his-half-yearly-anti-child-marriage-drive-2655616-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Himanta Biswa Sarma launched his half-yearly anti-child marriage driveAssam's third crackdown against the menace saw 431 arrests. The campaign, coupled with educational incentives, has curbed child marriage notwithstanding allegations of communal bias\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fresh-violence-manipur-imphal-east-security-forces-militant-crossfire-locals-moved-to-safer-locations-2656517-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 injured in fresh violence in Manipur's Imphal, locals moved to safer locationsThe security personnel deployed in the region retaliated, and it resulted in a fierce exchange of fire. The situation was brought under control after a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/azerbaijan-airlines-plane-crash-kazakhstan-survivors-recall-ordeal-loud-bang-heard-2656419-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Azerbaijan Airlines plane crash survivors recall ordeal: 'Loud bang heard...'An Azerbaijan Airlines plane crashed in Kazakhstan, killing 38 passengers after reportedly encountering two loud bangs mid-flight, passengers recalled. Survivors cited oxygen issues. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/raha-saying-bye-to-paps-at-airport-is-the-cutest-thing-on-internet-today-ranbir-kapoor-alia-bhatt-2656444-2024-12-27",
      "headline": "Watch: Raha saying bye to paps at airport is the cutest thing on internet todayRanbir Kapoor and Alia Bhatt left for Germany along with their daughter Raha for New Year vacation. They was clicked at the Mumbai airport today.  However, what caught everyone's attention was little Raha's cute antics. She cutely said hye the paparazzi as Alia took her inside the airport and also blew flying kisses, leaving Alia giggling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/photo/bridgerton-4-goes-on-floors-cast-attend-netflix-show-reading-2656432-2024-12-27",
      "headline": "Bridgerton 4 goes on floors, cast attend Netflix show's readingBridgerton 4 has gone on floors. The cast attended a reading of the Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-nervous-kissing-scene-holi-co-actor-kitu-gidwani-2656431-2024-12-27",
      "headline": "Aamir Khan was nervous during kissing scene, recalls Holi co-actor Kitu GidwaniActor Kitu Gidwani recalled working with a young Aamir Khan in the 1984 film Holi. She described him as a 'quiet and 'nervous' person. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ravi-kishan-casting-couch-faced-many-such-attacks-2656418-2024-12-27",
      "headline": "Ravi Kishan on casting couch: Faced many such attacks in my youthActor Ravi Kishan opened up about facing the casting couch in his youth and urged aspiring actors to avoid taking shortcuts to achieve success.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-bgt-jasprit-bumrah-sam-konstas-mcg-2656526-2024-12-28",
      "headline": "Bumrah breaks silence on Sam Konstas' onslaught from Day 1 of MCG TestIND vs AUS: Star India pacer Jasprit Bumrah breaks his silence on Sam Konstas after their incredible battle on Day 1 of the Boxing Day Test match. Unorthodox Konstas hit Bumrah for 2 sixes. This was the first time in 3 years that Bumrah was hit for a six in Test cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-vinicius-jr-deserved-ballon-dor-over-rodri-cristiano-ronaldo-2656525-2024-12-28",
      "headline": "Vinicius Jr deserved Ballon d'Or over Rodri: Cristiano RonaldoCristiano Ronaldo has said he believes Real Madrid forward Vinícius Júnior was unfairly snubbed for this year's men's Ballon d'Or award. Manchester City midfielder Rodri won the Ballon d'Or 2024. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rishabh-pant-dismissal-boxing-day-test-2656524-2024-12-28",
      "headline": "Rishabh Pant is only hype: Fans slam India wicketkeeper for throwing his wicketAustralia vs India, Boxing Day Test: Fans slammed Rishabh Pant after the Indian wicketkeeper effectively threw his wicket while playing a reckless shot on Day 3 at the MCG. Scott Boland dismissed Pant for 28 in the morning session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-disqualified-world-rapid-and-blitz-championships-wearing-jeans-2656520-2024-12-28",
      "headline": "Magnus penalised for wearing jeans, quits World Rapid and Blitz ChampionshipDefending World Rapid and Blitz Champion Magnus Carlsen quit the World Rapid Chess Championship after being penalised for a dress code violation (jeans) and a previous warning. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/dani-olmo-fc-barcelona-registration-rejected-spanish-court-laliga-2656514-2024-12-28",
      "headline": "FC Barcelona's Dani Olmo registration plea rejected by Spanish courtBarcelona's efforts to extend Dani Olmo's registration were denied, leaving the midfielder ineligible to play after December 31. With La Liga's financial restrictions looming, the club is scrambling to find solutions before the January deadline.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-2-live-scores-reactions-melbourne-updates-boxing-day-2656496-2024-12-28",
      "headline": "Day 3 Live Updates, Reactions: Onus on Jadeja-Pant to rescue IndiaAustralia (AUS) vs India (IND) 4th Test, Day 3 Live Updates, Reactions: All eyes will be on the pair of Rishabh Pant and Ravindra Jadeja as they aim to rescue India after a collapse by the end of Day 2. India still need 111 runs to avoid follow-on as they trail by 310 runs in the fourth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-will-rain-play-spoilsport-on-day-3-of-boxing-day-test-checkout-here-2656489-2024-12-27",
      "headline": "AUS vs IND: Will rain play spoilsport on Day 3 of Boxing Day Test? Checkout hereRain threatens to disrupt Day 3 of the Boxing Day Test at the MCG, with showers expected in the afternoon. Cloudy skies and fluctuating conditions could challenge both teams as India fight to avoid the follow-on against Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-sunil-gavaskar-rohit-sharma-aus-vs-ind-border-gavaskar-trophy-2024-25-melbourne-test-2656468-2024-12-27",
      "headline": "Sunil Gavaskar highlights Rohit Sharma's selection blunders in Melbourne TestFormer India cricketer turned commentator Sunil Gavaskar has expressed disappointment over captain Rohit Sharma's team selection in the ongoing fourth Test against Australia in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kevin-pietersen-backs-virat-kohli-amid-immense-scrutiny-in-melbourne-2656469-2024-12-27",
      "headline": "Kevin Pietersen backs Virat Kohli amid immense scrutiny in MelbourneKevin Pietersen hails Virat Kohli as cricket's ultimate entertainer, defending him amid intense scrutiny during the Melbourne Test. Despite criticism, Pietersen believes Kohli's theatrics and achievements make the game far more captivating than it would be without him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-continue-domination-vs-afghanistan-after-registering-their-highest-ever-test-total-2656463-2024-12-27",
      "headline": "Zimbabwe continue domination vs AFG after registering highest-ever Test totalZimbabwe rewrote history with their highest-ever Test total of 586, powered by centuries from Ervine, Williams, and Bennett. Afghanistan struggled in reply, losing two wickets and trailing by 491 runs, as the hosts maintained their commanding dominance in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-2-live-scores-reactions-melbourne-updates-boxing-day-2656496-2024-12-28",
      "headline": "Day 3 Live Updates, Reactions: Onus on Jadeja-Pant to rescue IndiaAustralia (AUS) vs India (IND) 4th Test, Day 3 Live Updates, Reactions: All eyes will be on the pair of Rishabh Pant and Ravindra Jadeja as they aim to rescue India after a collapse by the end of Day 2. India still need 111 runs to avoid follow-on as they trail by 310 runs in the fourth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-will-rain-play-spoilsport-on-day-3-of-boxing-day-test-checkout-here-2656489-2024-12-27",
      "headline": "AUS vs IND: Will rain play spoilsport on Day 3 of Boxing Day Test? Checkout hereRain threatens to disrupt Day 3 of the Boxing Day Test at the MCG, with showers expected in the afternoon. Cloudy skies and fluctuating conditions could challenge both teams as India fight to avoid the follow-on against Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-sunil-gavaskar-rohit-sharma-aus-vs-ind-border-gavaskar-trophy-2024-25-melbourne-test-2656468-2024-12-27",
      "headline": "Sunil Gavaskar highlights Rohit Sharma's selection blunders in Melbourne TestFormer India cricketer turned commentator Sunil Gavaskar has expressed disappointment over captain Rohit Sharma's team selection in the ongoing fourth Test against Australia in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kevin-pietersen-backs-virat-kohli-amid-immense-scrutiny-in-melbourne-2656469-2024-12-27",
      "headline": "Kevin Pietersen backs Virat Kohli amid immense scrutiny in MelbourneKevin Pietersen hails Virat Kohli as cricket's ultimate entertainer, defending him amid intense scrutiny during the Melbourne Test. Despite criticism, Pietersen believes Kohli's theatrics and achievements make the game far more captivating than it would be without him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-continue-domination-vs-afghanistan-after-registering-their-highest-ever-test-total-2656463-2024-12-27",
      "headline": "Zimbabwe continue domination vs AFG after registering highest-ever Test totalZimbabwe rewrote history with their highest-ever Test total of 586, powered by centuries from Ervine, Williams, and Bennett. Afghanistan struggled in reply, losing two wickets and trailing by 491 runs, as the hosts maintained their commanding dominance in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/corbin-boschs-81-gives-south-africa-an-upper-hand-over-pakistan-on-day-2-2656442-2024-12-27",
      "headline": "Corbin Bosch's 81* gives South Africa an upper hand over Pakistan on Day 2Corbin Bosch's fearless 81 on debut turned the tide for South Africa, giving them a vital 90-run lead. Pakistan now rely on Babar Azam to rescue their innings, with Day 3 poised for a gripping contest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-manjrekar-rohit-sharma-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2656436-2024-12-27",
      "headline": "Sanjay Manjrekar urges team India to get rid of VIP treatment for senior playersFormer India cricketer turned commentator Sanjay Manjrekar has urged the Indian team management to stop VIP treatment of senior players.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/frenkie-de-jong-fc-barcelona-future-agent-reject-saudi-pro-league-links-hansi-flick-2656430-2024-12-27",
      "headline": "De Jong wants to shine at FC Barcelona: Agent brushes off Saudi linksFrenkie de Jong's agent, Ali Dursun, dismissed rumors linking the Barcelona midfielder to a Saudi Pro League transfer, reiterating his commitment to the Catalan club despite recurring injuries and limited appearances during a challenging 2024/25 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-no-support-for-jasprit-bumrah-aus-vs-ind-border-gavaskar-trophy-2024-25-2656413-2024-12-27",
      "headline": "AUS vs IND : Jasprit Bumrah let down by his pace-bowling mates yet againStar India fast bowler Jasprit Bumrah once again found no support from his other seam bowling partners on Day 2 of the fourth Test against Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-reminds-about-andrew-symonds-matthew-hayden-post-2656389-2024-12-27",
      "headline": "Sam Konstas reminded me of my best mate Andrew Symonds: Matthew HaydenMatthew Hayden fondly remembered Andrew Symonds's maiden Test century in 2006, comparing the late cricketer's fearless knock to debutant Sam Konstas's blazing 60-run innings, which set the tone for Australia's dominant position against India in the Melbourne Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-pak-corbin-bosch-breaks-122-year-old-record-with-heroic-81-vs-pakistan-2656386-2024-12-27",
      "headline": "SA vs PAK: Corbin Bosch breaks 122-year-old record with heroic 81* vs Pakistan Corbin Bosch dazzled on debut with a record-breaking 81*, the highest score by a South African No. 8 or below in Tests. His composed knock rescued South Africa from trouble, securing a crucial 90-run lead against Pakistan.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravindra-jadeja-rishabh-pant-melbourne-test-rescue-edgbaston-repeat-2656358-2024-12-27",
      "headline": "Can Jadeja and Pant repeat Edgbaston heroics to rescue India in Melbourne?Rishabh Pant and Ravindra Jadeja are tasked with recreating their iconic Edgbaston partnership as India struggle at 164/5 in the Melbourne Test. Their resilience could be the key to rescuing the side from yet another batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-virat-kohli-sunil-gavaskar-justin-langer-aus-vs-ind-border-gavaskar-trophy-2656341-2024-12-27",
      "headline": "Who is to blame for Yashasvi Jaiswal-Virat Kohli MCG mix-up? Pundits weigh inFormer cricketers Sunil Gavaskar and Justin Langer have shared their opinion on Virat Kohli-Yashasvi Jaiswal run out on Day 2 of the fourth Test between India and Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-reminds-about-andrew-symonds-matthew-hayden-post-2656389-2024-12-27",
      "headline": "Sam Konstas reminded me of my best mate Andrew Symonds: Matthew HaydenMatthew Hayden fondly remembered Andrew Symonds's maiden Test century in 2006, comparing the late cricketer's fearless knock to debutant Sam Konstas's blazing 60-run innings, which set the tone for Australia's dominant position against India in the Melbourne Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-pak-corbin-bosch-breaks-122-year-old-record-with-heroic-81-vs-pakistan-2656386-2024-12-27",
      "headline": "SA vs PAK: Corbin Bosch breaks 122-year-old record with heroic 81* vs Pakistan Corbin Bosch dazzled on debut with a record-breaking 81*, the highest score by a South African No. 8 or below in Tests. His composed knock rescued South Africa from trouble, securing a crucial 90-run lead against Pakistan.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravindra-jadeja-rishabh-pant-melbourne-test-rescue-edgbaston-repeat-2656358-2024-12-27",
      "headline": "Can Jadeja and Pant repeat Edgbaston heroics to rescue India in Melbourne?Rishabh Pant and Ravindra Jadeja are tasked with recreating their iconic Edgbaston partnership as India struggle at 164/5 in the Melbourne Test. Their resilience could be the key to rescuing the side from yet another batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-virat-kohli-sunil-gavaskar-justin-langer-aus-vs-ind-border-gavaskar-trophy-2656341-2024-12-27",
      "headline": "Who is to blame for Yashasvi Jaiswal-Virat Kohli MCG mix-up? Pundits weigh inFormer cricketers Sunil Gavaskar and Justin Langer have shared their opinion on Virat Kohli-Yashasvi Jaiswal run out on Day 2 of the fourth Test between India and Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/feels-like-grade-cricket-nathan-lyon-reveals-sam-konstas-debut-verdict-vs-india-2656345-2024-12-27",
      "headline": "Feels like grade cricket: Nathan Lyon reveals Sam Konstas' debut verdict vs IndiaAt just 19, Sam Konstas stole the spotlight with a fearless 60 on his Boxing Day Test debut. Calm under pressure, the youngest Aussie in decades to hit fifty-plus showed why he's a star in the making. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharmas-test-career-certainly-coming-to-an-end-feels-mark-waugh-kerry-o-keefe-2656272-2024-12-27",
      "headline": "Rohit Sharma's Test career nearing its end? Mark Waugh fears so after MCG flopshowFormer Australia cricketer Mark Waugh feels India captain Rohit Sharma's career is certainly coming to an end if he doesn't do anything in the remaining matches of the ongoing series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-pak-1st-test-babar-azam-imitates-mohammed-siraj-with-stuart-broad-bail-flip-2656278-2024-12-27",
      "headline": "SA vs PAK: Babar Azam imitates Mohammed Siraj with Stuart Broad bail flipBabar Azam adds a playful twist to the Centurion Test, joining cricket's growing bail-switch trend. Following in the footsteps of Stuart Broad and Mohammed Siraj, his light-hearted move reflects the superstitions and humour in the intense world of Test cricket.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-age-making-him-slower-melbourne-test-dismissal-sunil-gavaskar-2656260-2024-12-27",
      "headline": "Age making Rohit Sharma slower: Gavaskar decodes India skipper's strugglesRohit Sharma's struggles continued in the Melbourne Test as Sunil Gavaskar critiqued his slowness, attributing it to age. India's batting collapse left them trailing by 310 runs, with hopes pinned on Pant and Jadeja for a recovery."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}