{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/andhra-pradesh-nara-lokesh-trump-tariff-seafood-hosiery-industry-rajdeep-sardesai-south-conclave-2025-2783719-2025-09-08",
      "headline": "How is Andhra Pradesh dealing with Trump tariffs? Nara Lokesh answersWhen asked about the impact of Trump tariffs on Andhra Pradesh's growth plans, Nara Lokesh described the situation as a challenge but also an opportunity to reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-life-and-health-insurance-how-much-will-you-really-save-2783695-2025-09-08",
      "headline": "No GST on life and health insurance: How much will you really save?Under the proposal, premiums for life and health insurance could be completely exempt from GST. You would pay only the base premium quoted by your insurer, without the 18% tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-much-will-trump-tariffs-hurt-india-here-is-what-top-adviser-said-2783671-2025-09-08",
      "headline": "How much will Trump tariffs hurt India? Here's what top adviser saidTrump doubled tariffs on Indian goods last month, arguing that New Delhi's imports of Russian oil were helping to fund Moscow's war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-government-fixes-september-30-deadline-here-is-what-it-means-2783652-2025-09-08",
      "headline": "UPS to NPS: Government fixes September 30 deadline, here's what it meansThe government has given central employees under the Unified Pension Scheme (UPS) a one-time chance to shift back to the National Pension System (NPS), with 30 September 2025 set as the deadline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-russian-oil-sanctions-tariffs-second-phase-impact-on-india-2783649-2025-09-08",
      "headline": "Trump warns of fresh Russia oil sanctions: Should India worry?Russian barrels have been critical to India's energy needs. At one point, nearly 40% of crude imports came from Russia. The discounted supply saved billions of dollars and kept petrol prices under control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-why-cas-are-seeking-extension-of-september-15-deadline-2783609-2025-09-08",
      "headline": "ITR filing: Why CAs are seeking extension of September 15 deadlineThe pressure on taxpayers is mounting with the September 15 ITR deadline just days away. Professional groups are demanding an extension, citing delays, technical snags, and even natural disasters that have slowed down the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-date-time-value-october-debut-stock-market-report-2783566-2025-09-08",
      "headline": "LG Electronics eyes Rs 15,000 crore IPO debut in October: ReportThe consumer electronics major plans to raise around Rs 15,000 crore through the share sale, making it the largest IPO of 2025 so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hero-motocorp-names-harshavardhan-chitale-as-new-ceo-2783544-2025-09-08",
      "headline": "Who is Harshavardhan Chitale, Hero MotoCorp's incoming CEOHarshavardhan Chitale, who currently heads the professional business of Dutch lighting major Signify, will take over from acting CEO Vikram Kasbekar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/video/upcoming-10-ipos-this-week-will-dalal-street-deliver-big-returns-bt-show-market-opening-2783537-2025-09-08",
      "headline": "10 IPOs lined up this week: Will Dalal Street deliver big returns?While the IPO market remains attractive, the overall market sentiment is improving slowly, and investors should not rush in with high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-supreme-court-case-india-asia-trade-deals-illegal-exports-business-2783161-2025-09-08",
      "headline": "Explained: What happens if US Supreme Court rules against Trump's trade tariffsThe US Supreme Court is hearing a case that could reshape the way America uses tariffs as a tool in trade. The matter at stake is not whether tariffs are allowed at all but who has the constitutional authority to impose them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-24800-tata-steel-gains-over-2-2783524-2025-09-08",
      "headline": "Sensex, Nifty gain as steel stocks lead charge on Dalal StreetThe S&P BSE Sensex rose nearly 200 points to around 80,906, while the NSE Nifty50 advanced over 70 points to trade above 24,810."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-bidding-opening-date-price-band-gmp-listing-gains-allotment-listing-2783517-2025-09-08",
      "headline": "Urban Company IPO to open soon: Check price band, GMP, important datesUrban Company is looking to raise a total of Rs 1,900.00 crores through this public offer, which includes both a fresh issue of shares and an offer for sale by existing shareholders."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehnaaz-gill-reveals-brother-shehbaz-badesha-hospitalised-bigg-boss-19-premiere-salman-khan-wildcard-contestant-2783709-2025-09-08",
      "headline": "Shehnaaz Gill shares brother Shehbaz was hospitalised after Bigg Boss 19 premiereShehnaaz Gill recently revealed that her brother Shehbaz Badesha was hospitalised after the 'Bigg Boss 19' premiere. The actor shared that he was diagnosed with dengue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saba-azad-trolls-dating-hrithik-roshan-songs-of-paradise-soni-razdan-2783615-2025-09-08",
      "headline": "Deep-seated sexism: Saba Azad on trolls asking her to quit work after dating HrithikActor Saba Azad recently addressed trolls criticising her relationship with her actor-boyfriend Hrithik Roshan. She called out sexist remarks from social media users and addressed the challenges female actors face in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shekhar-suman-crumbled-battled-depression-after-son-aayush-death-2783663-2025-09-08",
      "headline": "Shekhar Suman says he crumbled, battled depression after son Aayush's deathActor Shekhar Suman recently opened up about the tragic loss of his elder son Aayush to a rare heart ailment. He reflected on how his wife Alka stood by him in the moment of grief."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-reality-check-to-contestants-on-food-wastage-punjab-floods-2783684-2025-09-08",
      "headline": "Bigg Boss 19: Salman's reality check to contestants on food wastage, Punjab floodsSalman Khan didn't hold back on 'Bigg Boss 19' Weekend Ka Vaar as he schooled contestants for wasting food, drawing a powerful comparison with the devastating Punjab floods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-sreeleela-mark-ganpati-celebrations-together-amid-dating-rumours-2783660-2025-09-08",
      "headline": "Kartik Aaryan, Sreeleela celebrate Ganpati together amid dating rumoursKartik Aaryan and Sreeleela celebrated Ganesh Chaturthi together at Kartik's place. Several pictures of the duo celebrating with their families have gone viral.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tiger-shroff-flaunts-abs-throws-t-shirt-to-fans-at-mumbais-gaiety-galaxy-baaghi-4-watch-2783614-2025-09-08",
      "headline": "Tiger Shroff flaunts abs, throws t-shirt to fans at Mumbai's Gaiety Galaxy. WatchTiger Shroff recently visited the iconic Gaiety Galaxy amid 'Baaghi 4' success. The actor surprised fans after he removed his T-shirt and flaunted his abs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-highlights-salman-khan-shehbaaz-badesha-shehnaaz-gill-wild-card-no-elimination-2783564-2025-09-08",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Shehbaz enters as wild card, no eliminationShehnaaz Gill's brother Shehbaz Badesha entered 'Bigg Boss 19' on Sunday as the first wild card of the season. The 'Weekend Ka Vaar' episode concluded with Salman Khan announcing no elimination, as Kunickaa Sadanand secured immunity in a task.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-box-office-collection-day-3-detailed-report-tiger-shroff-film-marks-record-low-for-action-franchise-opening-weekend-2783586-2025-09-08",
      "headline": "Baaghi 4 box office Day 3: Tiger Shroff's film marks record low for action franchiseTiger Shroff's 'Baaghi 4' has wrapped up its opening weekend on a weak note with just Rs 31 crore nett, marking the lowest three-day collection in the popular action franchise. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/white-lotus-star-patrick-schwarzenegger-marries-abby-champion-idaho-wedding-2783579-2025-09-08",
      "headline": "White Lotus star Patrick Schwarzenegger marries Abby Champion in IdahoPatrick Schwarzenegger of 'The White Lotus' fame and his girlfriend, Abby Champion, got married in a lakeside wedding in Idaho, surrounded by family, friends, and Hollywood celebrities.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-review-must-watch-visual-spectacle-2783543-2025-09-08",
      "headline": "Demon Slayer Kimetsu no Yaiba Infinity Castle review: Must-watch visual spectacleRelease Date:Fri Sep 12, 2025'Demon Slayer: Kimetsu no Yaiba Infinity Castle' continues the saga with intense battles and emotional arcs. Releasing on September 12 in India, this film is a must-watch for anime fans despite minor pacing issues. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vmas-2025-full-winner-list-lady-gaga-rose-katseye-ariana-grande-win-big-2783521-2025-09-08",
      "headline": "VMAs 2025: Lady Gaga, Rose win top honours, complete list of winners outThe 2024 VMAs celebrated global music talent with Lady Gaga winning artist of the year. Rose made history as the first K-pop artist to win song of the year, signalling growing diversity and innovation in music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-shares-selfie-with-harry-potter-draco-malfoy-at-gandhi-premiere-2783509-2025-09-08",
      "headline": "AR Rahman shares selfie with Harry Potter's Draco Malfoy at Gandhi premiereHarry Potter star Tom Felton is set to make his Bollywood debut in Hansal Mehta's 'Gandhi' series, which had its premiere at TIFF 2025. Renowned composer AR Rahman shared a joyful selfie with Felton to mark the occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-superhero-film-unlike-pan-india-films-2782187-2025-09-08",
      "headline": "Why Malayalam superhero film Lokah breaks the pan-Indian blockbuster mouldMalayalam superhero film, 'Lokah: Chapter 1' has done more than deliver a surprise hit - it has redefined the conversation around what a pan-Indian film can be. By blending Kerala's rooted storytelling with the scale of a superhero fantasy, it challenges long-held assumptions that only star-driven, big-budget spectacles can travel across regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-confirms-mammootty-moothon-role-lokah-birthday-2783496-2025-09-08",
      "headline": "Mammootty is Moothon: Dulquer Salmaan confirms his father's cameo in LokahDulquer Salmaan confirmed Mammootty's cameo in 'Lokah' as 'Moothon' on his birthday, ending fan speculation. 'Lokah Chapter 1: Chandra', produced by Salmaan, is setting the box office on fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-wife-sangeetha-son-jason-sanjay-airport-divorce-rumours-2783490-2025-09-08",
      "headline": "Thalapathy Vijay's wife and son Jason Sanjay seen at airport amid divorce rumoursThalapathy Vijay's wife Sangeetha and son Jason were seen at the airport recently. Their appearance came amid their divorce rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-rajinikanth-reunite-new-film-lokesh-kanagaraj-2783484-2025-09-08",
      "headline": "Kamal Haasan on reuniting with Rajinikanth: We were never competitorsKamal Haasan, at the NEXA SIIMA held in Dubai on September 6, confirmed his reunion with Rajinikanth. The two will be joining hands after 46 years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-advance-booking-india-gets-5-am-shows-first-for-any-japanese-film-2783378-2025-09-07",
      "headline": "Demon Slayer Infinity Castle set for historic 5 am shows in IndiaThe highly-anticipated anime film 'Demon Slayer: Infinity Castle' is set to release globally on September 12, including early morning screenings in Mumbai, marking a first for Japanese cinema in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-krishnan-cheers-loudest-for-thalapathy-vijay-wishes-him-well-for-his-next-chapter-siima-2025-2783375-2025-09-07",
      "headline": "Trisha cheers for Thalapathy Vijay, wishes him success in his next chapterAt the 2025 SIIMA awards in Dubai, Trisha Krishnan was honoured for her 25-year journey in South Indian cinema and warmly wished co-star Vijay success in his new ventures. She also praised Ajith Kumar's humility and kindness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoors-emotional-birthday-note-for-wife-mira-rajput-my-love-you-complete-me-2783338-2025-09-07",
      "headline": "My love, you complete me: Shahid Kapoor's emotional birthday note for wife Mira RajputMira Rajput Kapoor turned 31 on Sunday, September 7. On the occasion, her actor-husband Shahid Kapoor had the sweetest birthday note. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-voter-list-revision-vote-chori-electoral-roll-political-rhetoric-free-and-fair-election-india-today-south-conclave-2783603-2025-09-08",
      "headline": "By and large, free and fair: Former poll officers reject 'vote chori rhetoric'Three former Election Commissioners said at the India Today South Conclave that elections in India are largely free and fair, and claims of 'vote chori' are routine political rhetoric. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gen-z-protests-nepal-kp-sharma-oli-corruption-social-media-restrictions-2783683-2025-09-08",
      "headline": "Gen Z revolution in Nepal: Anti-government protests erupt over social media curbsGen Z leads massive protests in Kathmandu against corruption and social media curbs. The unrest has prompted a curfew, highlighting rising tensions with the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-backs-us-tariffs-on-india-trump-right-idea-russian-oil-ukraine-war-sanctions-2783608-2025-09-08",
      "headline": "Right idea to tariff those who...: Zelenskyy amid Trump's India offensiveUkrainian President Volodymyr Zelensky has voiced strong support for imposing secondary tariffs on countries that continue to maintain economic ties with Russia, including the ongoing purchase of Russian oil and gas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/believe-in-pm-modis-leadership-we-will-support-ndas-veep-candidate-nara-lokesh-2783657-2025-09-08",
      "headline": "Asked about Telugu pride, Nara Lokesh says 'Bharat First', backs NDA Veep candidateAt the India Today Conclave South 2025, Andhra Pradesh Minister Nara Lokesh reaffirmed TDP's commitment to the NDA, pledging unconditional support to the coalition and backing its candidate in Vice-Presidential elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-russian-oil-sanctions-tariffs-second-phase-impact-on-india-2783649-2025-09-08",
      "headline": "Trump warns of fresh Russia oil sanctions: Should India worry?Russian barrels have been critical to India's energy needs. At one point, nearly 40% of crude imports came from Russia. The discounted supply saved billions of dollars and kept petrol prices under control. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-man-shot-dead-california-stopping-public-urination-2783677-2025-09-08",
      "headline": "Haryana man, 26, shot dead in US after stopping another from urinating in publicKapil, from Haryana's Jind, was fatally shot in California after intervening in a public urination incident. US authorities yet to arrest a suspect in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mehul-choksi-extradition-case-hearing-india-assures-belgium-on-prison-conditions-says-no-overcrowding-barrack-number-12-2783573-2025-09-08",
      "headline": "No solitary confinement for Mehul Choksi, India assures Belgium for extraditionIndia has assured Belgium that fugitive businessman Mehul Choksi, wanted in the PNB fraud case, will not be kept in solitary confinement if extradited. He will be lodged in Barrack No. 12, which is not overcrowded, and his cell will be monitored round-the-clock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/comeback-kid-congress-will-bihar-walk-rahul-gandhis-voter-adhikar-talk-2783078-2025-09-06",
      "headline": "Comeback kid Congress? Will Bihar walk Rahul Gandhi's Voter Adhikar talk?The Voter Adhikar Yatra, with Tejashwi Yadav and other INDIA leaders, may have just given the Congress what it lacked in the Bihar poll theatre: visibility and legitimacy\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gurugram-gurgaon-urban-floods-waterlogging-sahibi-river-lost-aravalli-hills-delhi-haryana-hydrology-natural-drainage-2781896-2025-09-08",
      "headline": "There was once a river in GurgaonBefore Gurgaon became Gurugram, a city of glass facades and corporate towers, it was shaped by the flow of the Sahibi River. Once a lifeline for farms, wetlands, and wildlife, that river now survives only as the foul-smelling Najafgarh drain that drains into the Yamuna in northern Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-visa-policy-change-ends-third-country-interview-scheduling-for-indian-applicants-2783495-2025-09-08",
      "headline": "New US short-term visa rule means longer waits for IndiansThe US has introduced a new visa rule requiring all non-immigrant visa applicants to attend interviews only in their country of citizenship or residence, a move that is expected to particularly affect Indians and further lengthen already long wait times."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-caught-shoplifting-us-target-store-breaks-down-cops-interrogation-video-bodycam-footage-2783662-2025-09-08",
      "headline": "Indian woman caught shoplifting in US, breaks down as cops interrogate. Video viralIn a viral video, an Indian woman was seen sitting in an interrogation room with folded hands as police officers questioned her. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-cm-rekha-gupta-who-is-husband-manish-gupta-business-income-controversy-official-meeting-aap-bjp-2783618-2025-09-08",
      "headline": "Who's Manish Gupta, Delhi CM Rekha Gupta's husband seen in official meeting?Images of Manish Gupta, the husband of Delhi CM Rekha Gupta, seated next to his wife in an official meeting, have drawn the AAP's criticism. His presence at one such meeting had earlier fuelled charges of a \"Phulera-like system\" of the Panchayat OTT series from the AAP. So, who's Manish Gupta, who Rekha Gupta said, \"did a lot for her\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-reporters-diary-rajgir-india-win-2783462-2025-09-08",
      "headline": "Discovering Rajgir through hockey: A reporter's diary of Asia Cup 2025From sweltering heat to electrifying hockey fever, Rajgir offered unforgettable moments during the Hockey Asia Cup 2025. While India lifted the title, it was the city's passionate fans who stole the show, proving that this ancient cultural hub in Bihar could become a rising center for sports in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-amid-bihar-sir-row-ex-poll-officers-back-idea-but-question-timing-india-today-south-conclave-2025-2783626-2025-09-08",
      "headline": "Exclusive: Amid Bihar SIR row, ex-poll officers back idea but question 'timing'Three former Chief Election Commissioners -- SY Quraishi, OP Rawat, and Ashok Lavasa -- have backed the concept of a Systematic Investigation of Rolls (SIR) but questioned its timing in Bihar, where floods and upcoming elections make the move contentious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-jaipur-restaurant-staff-diners-trade-blows-as-seating-spat-turns-violent-2783689-2025-09-08",
      "headline": "Video: Jaipur restaurant staff, diners trade blows as seating spat turns violentWhat started as a verbal spat soon turned physical, with restaurant staff and customers allegedly attacking each other."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/jerusalem-shooting-casualties-terrorists-killed-terror-attack-israel-news-2783703-2025-09-08",
      "headline": "5 dead, 15 injured in Jerusalem shooting; 2 suspected attackers neutralisedFive people were killed while 15 suffered injuries after unidentified men opened fire on a bus in Jerusalem. Israeli security forces have killed 2 suspected attackers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/hero-xoom-160-review-first-ride-indias-first-affordable-and-usable-maxi-scooter-2783568-2025-09-08",
      "headline": "Hero Xoom 160 review, first ride: India's first affordable and usable maxi-scooter?Just like the Xpulse 200 before it, the Xoom 160 hopes to create a niche that has been long-awaited in our country. But, the similarities between these two products extends beyond just that. We finally got a chance to sample Hero's most powerful and expensive scooter in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/yogi-adityanath-orders-probe-uttar-pradesh-college-universities-accreditation-admissions-fake-course-affidavit-report-2783590-2025-09-08",
      "headline": "Yogi Adityanath orders UP college probe; admissions, courses under scrutinyUttar Pradesh Chief Minister Yogi Adityanath has ordered an intensive inspection of all universities and colleges in the state. The exercise will verify recognition, admissions, and courses, with strict action against institutions running unapproved programmes. Officials said reports must be submitted to the government within 15 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mighty-hurricane-will-strike-gaza-israel-minister-tells-hamas-to-lay-down-arms-or-face-annihilation-2783651-2025-09-08",
      "headline": "Mighty hurricane to hit Gaza: Israel warns Hamas to free hostages or face annihilationIsrael minister issued a warning to Hamas asking them to lay down arms or face 'annihilation'. \"Mighty hurricane will strike Gaza,\" he said in a post on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-backs-x-fact-check-after-trump-aide-peter-navarros-anti-india-rant-says-people-decide-narrative-on-platform-2783499-2025-09-08",
      "headline": "You hear all sides: Elon Musk after X fact-checks Trump aide's anti-India rantWithout naming Peter Navarro, Elon Musk underscored that Community Notes \"corrects everyone without exception\" and ensures that \"people decide the narrative\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/not-just-her-job-why-mens-nutrition-matters-equally-for-fertility-2782969-2025-09-08",
      "headline": "Not just her job: Why men's nutrition matters equally for fertilityThe nutritionist explains how omega-3 fatty acids, antioxidants, CoQ10 and balanced nutrition can improve sperm quality, energy, and male fertility and why it is equally important if not more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-may-refund-half-of-tariffs-imposed-by-donald-trump-what-treasury-chief-said-2783481-2025-09-08",
      "headline": "US may refund half of tariffs imposed by Trump? What treasury chief saidScott Bessent's remarks come after two federal courts ruled that Trump lacked the power to levy tariffs on nearly every country under the International Emergency Economic Powers Act, a 1977 law designed for national security crises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/popcorn-vs-chips-which-is-healthy-snack-weight-loss-2782674-2025-09-08",
      "headline": "Is popcorn the guilt-free snack you have been looking for?Popcorn is emerging as the healthier snacking choice - but is it really better than chips? The answer isn't as black and white as it seems."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-boy-pops-out-of-moving-cars-sunroof-hits-overhead-barrier-viral-video-2783648-2025-09-08",
      "headline": "Bengaluru boy pops out of moving car's sunroof, hits overhead barrier. Video viralA family drive in Bengaluru took a tragic turn when a boy, standing through the sunroof of a moving car, struck an overhead barrier and suffered a serious head injury."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-ready-for-asia-cup-salman-agha-2783665-2025-09-08",
      "headline": "Pakistan in good shape before Asia Cup: Skipper Salman AghaPakistan T20I captain Salman Agha has said that his team is in good shape ahead of the Asia Cup 2025. Pakistan beat Afghanistan in the final of the tri-series and are coming into the tournament with good momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-team-preview-rashid-khan-spin-bowling-2783606-2025-09-08",
      "headline": "Spin-powered Afghanistan are no longer just challengers, but contendersAsia Cup 2025: After their success in the 2024 T20 World Cup, Afghanistan have evolved from being mere challengers to genuine contenders for the ACC Asia Men's T20 Cup, which begins on September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-opener-india-asia-cup-t20-ravi-shastri-shubman-gill-2783584-2025-09-08",
      "headline": "Even Shubman will find it tough to displace Samson as opener: Ravi ShastriFormer India coach Ravi Shastri thinks wicketkeeper Sanju Samson's success as a T20I opener might push the new vice-captain, Shubman Gill, to bat lower in the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-afghanistan-hong-kong-oman-uae-previews-2783374-2025-09-08",
      "headline": "Asia Cup 2025: What to expect from Oman, UAE and Hong Kong?Asia Cup 2025 begins with Afghanistan and Hong Kong opening the tournament in Abu Dhabi. The event features debutants Oman and returning UAE, creating fresh competition dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-comeback-chicago-fan-excitement-2783164-2025-09-08",
      "headline": "AJ Lee make WWE return after a decade, joins Punk vs Seth and Becky feudAJ Lee makes her WWE return after a decade, thrilling fans in Chicago. Her comeback adds new intensity to the Punk, Seth and Becky storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-win-asia-cup-2025-world-cup-qualification-2783473-2025-09-08",
      "headline": "Asia Cup conquered: India's transitioning side ready to chase World Cup gloryIndia have finally slayed the dragon and secured their first Asia Cup title in 8 years with a thumping win in Rajgir. Now with continental success and momentum, the young and transitioning Indian team get ready for the big mission in 2026, the World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-punjab-flood-relief-boats-ambulances-funds-2783464-2025-09-08",
      "headline": "Harbhajan Singh aids Punjab flood relief with boats and fundsFormer India spinner Harbhajan Singh steps up flood relief efforts in Punjab by providing boats and ambulances. His mobilisation of funds and resources highlights urgent community support amid ongoing monsoon challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/battlegrounds-masters-series-season-4-top-teams-qualify-grand-finals-2783483-2025-09-08",
      "headline": "Revenant XSpark tops BGMS Season 4 points table after 84 matchesThe league stage of Battlegrounds Masters Series Season 4 has concluded, with the top four teams securing direct spots in the grand finals. The remaining teams will now battle it out in the semi-finals and playoffs, raising the stakes and intensifying the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-carlos-alcaraz-plan-against-jannik-sinner-2783529-2025-09-08",
      "headline": "How Alcaraz devised masterplan to dethrone Sinner after Wimbledon heartbreakCarlos Alcaraz defeated Jannik Sinner to reclaim the title of World No.1 at the US Open 2025. After the match, Alcaraz explained how he devised a masterplan to defeat Sinner after his Wimbledon heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-next-appearance-2783478-2025-09-08",
      "headline": "AJ Lee to return to WWE in Monday Night Raw match against Becky LynchWWE star AJ Lee returned after a decade to support her husband, CM Punk. Her in-ring comeback on Monday Night Raw ushers in an exciting new chapter for WWE's women's division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/kings-india-beat-korea-4-1-asia-cup-title-hockey-world-cup-special-2783518-2025-09-08",
      "headline": "Kings of Asia: India's dominant Asia Cup victoryIndia's dominant 4-1 victory over South Korea not only secured their fourth Asia Cup crown but also booked a direct berth at the 2026 Hockey World Cup. With four trophies, India are now the second-most successful team in the tournament, behind five-time champions Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-punjab-flood-relief-boats-ambulances-funds-2783464-2025-09-08",
      "headline": "Harbhajan Singh aids Punjab flood relief with boats and fundsFormer India spinner Harbhajan Singh steps up flood relief efforts in Punjab by providing boats and ambulances. His mobilisation of funds and resources highlights urgent community support amid ongoing monsoon challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/battlegrounds-masters-series-season-4-top-teams-qualify-grand-finals-2783483-2025-09-08",
      "headline": "Revenant XSpark tops BGMS Season 4 points table after 84 matchesThe league stage of Battlegrounds Masters Series Season 4 has concluded, with the top four teams securing direct spots in the grand finals. The remaining teams will now battle it out in the semi-finals and playoffs, raising the stakes and intensifying the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-carlos-alcaraz-plan-against-jannik-sinner-2783529-2025-09-08",
      "headline": "How Alcaraz devised masterplan to dethrone Sinner after Wimbledon heartbreakCarlos Alcaraz defeated Jannik Sinner to reclaim the title of World No.1 at the US Open 2025. After the match, Alcaraz explained how he devised a masterplan to defeat Sinner after his Wimbledon heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-next-appearance-2783478-2025-09-08",
      "headline": "AJ Lee to return to WWE in Monday Night Raw match against Becky LynchWWE star AJ Lee returned after a decade to support her husband, CM Punk. Her in-ring comeback on Monday Night Raw ushers in an exciting new chapter for WWE's women's division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/kings-india-beat-korea-4-1-asia-cup-title-hockey-world-cup-special-2783518-2025-09-08",
      "headline": "Kings of Asia: India's dominant Asia Cup victoryIndia's dominant 4-1 victory over South Korea not only secured their fourth Asia Cup crown but also booked a direct berth at the 2026 Hockey World Cup. With four trophies, India are now the second-most successful team in the tournament, behind five-time champions Korea."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}