{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-oil-prices-israel-iran-conflict-situation-under-control-interview-2743301-2025-06-19",
      "headline": "Oil prices stable, situation not alarming: Union Minister amid Middle East tensionsUnion Petroleum Minister Hardeep Singh Puri allayed concerns about a spike in oil prices amid the Israel-Iran conflict, saying the situation was manageable and energy rates were under control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/crashed-dreamliner-well-maintained-next-major-check-was-due-in-dec-air-india-ceo-2743296-2025-06-19",
      "headline": "Crashed Dreamliner well-maintained, next major check was due in Dec: Air India CEOAir India CEO Campbell Wilson on Thursday said that the Boeing 787-8 Dreamliner, that crashed in Ahmedbad on June 12, was well maintained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-replace-compensation-cess-with-new-levies-july-meeting-2743163-2025-06-19",
      "headline": "GST Council may replace compensation cess with 2 new levies: ReportIf approved, the dual cess structure could redefine how India funds health and green goals, but only if the Centre and states agree on who pays, who gains, and who decides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-gold-loan-rules-cash-flow-assessment-nbfc-challenges-stricter-ltv-norms-2743130-2025-06-19",
      "headline": "Explained: How India's new gold loan rules will impact lendersThe RBI's directive requires a move towards cash flow-based credit assessments. This means lenders must go beyond just considering the gold's value as collateral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-ends-83-points-lower-nifty-below-24800-adani-ports-down-3-percent-titan-mahindra-2743129-2025-06-19",
      "headline": "Sensex ends 83 points lower, Nifty below 24,800; Adani Ports down 3%The S&P BSE Sensex was down by 82.79 points to end at 81,361.87, while the NSE Nifty50 lost 18.80 points to close at 24,793.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rice-prices-india-rise-global-demand-weaker-rupee-boost-exports-2743123-2025-06-19",
      "headline": "India's rice exports gain edge as Vietnam, Thailand face subdued markets: ReportIndia's rice supply remains strong, with government reserves reported at 59.5 million metric tonnes as of June 1. This figure is over four times the official target for July, highlighting the country's substantial rice stockpile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-oversubscribed-strong-listing-gains-expected-stock-market-debut-latest-gmp-2743119-2025-06-19",
      "headline": "Oswal Pumps IPO listing: Will it make a bumper debut? Check latest GMPOswal Pumps is set to debut on Dalal Street on June 19 with high investor expectations. The IPO of Oswal Pumps was oversubscribed by more than 34 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-it-sector-techies-12-hour-working-shifts-state-government-andhra-report-2743077-2025-06-19",
      "headline": "Karnataka plans 10-hour days for tech sector employees: ReportAt present, Section 7 of the Karnataka Shops and Commercial Establishments Act, 1961, limits working hours to nine per day, and allows a maximum of 10 hours of overtime in three months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/savings-accounts-fixed-deposits-lose-value-inflation-outpaces-interest-india-2743044-2025-06-19",
      "headline": "Your savings account is quietly robbing you, says financial advisorFinancial advisor Lovish Anand has issued a sharp reality check for Indian savers in a recent LinkedIn post titled: \"Your Savings Account Is Quietly Robbing You.\""
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sitaare-zameen-par-screening-meets-actors-aamir-khan-gauri-spratt-2743461-2025-06-20",
      "headline": "Shah Rukh Khan lights up Sitaare Zameen Par screening, hugs and poses with actorsShah Rukh Khan attended the screening of Aamir Khan's 'Sitaare Zameen Par' in Mumbai on Thursday. He was seen interacting and taking pictures with the actors of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/china-uses-ai-to-revive-100-classic-kung-fu-films-glbs-2743434-2025-06-20",
      "headline": "China uses AI to revive 100 classic Kung Fu filmsChina is launching an AI-driven project to revive 100 classic martial arts films, including works by Bruce Lee and Jackie Chan, blending restoration with innovation for modern audiences and global appeal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anna-camp-goes-public-with-girlfriend-jade-whipkey-at-bride-hard-premiere-glbs-2743429-2025-06-20",
      "headline": "Anna Camp goes public with girlfriend Jade Whipkey at Bride Hard premiereAnna Camp made her red carpet debut with girlfriend Jade Whipkey at the Bride Hard premiere, confirming their relationship after months of speculation and celebrating her new film in Los Angeles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kajol-gets-candid-on-trolling-and-the-scrutiny-of-star-kids-no-one-can-touch-my-children-exclusive-2743293-2025-06-19",
      "headline": "No one can touch my children: Kajol on trolling and public scrutinyActor Kajol opened up about the social media trolling faced by star kids today. The actor, in an exclusive interview with IndiaToday.in, highlighted the importance of love and emotional strength in parenting amid constant criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sunil-grover-mimics-salman-khan-kapil-sharma-says-itna-attitude-in-the-great-indian-kapil-show-season-3-2743278-2025-06-19",
      "headline": "Sunil Grover mimics Salman Khan, Kapil Sharma says itna attitude. WatchSalman Khan will be the first guest on 'The Great Indian Kapil Show' Season 3, premiering June 21 on Netflix. A hilarious new promo featuring the superstar, Kapil Sharma, and Sunil Grover promises a laughter-packed start to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-kareena-kapoor-saif-ali-khan-sunjay-kapur-funeral-in-delhi-2743269-2025-06-19",
      "headline": "Karisma Kapoor, Kareena-Saif at Sunjay Kapur's funeral in DelhiKarisma Kapoor, along with sister Kareena and Saif Ali Khan, were clicked at Lodhi crematorium in New Delhi for Sunjay Kapur's funeral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-avoid-paps-at-mumbai-airport-2743249-2025-06-19",
      "headline": "Vijay Deverakonda, Rashmika avoid paps as they arrive together at airport. WatchActors Vijay Deverakonda and Rashmika Mandanna avoided paparazzi as they returned to Mumbai on June 19. A video of the two exiting airport has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonali-bendre-says-pati-patni-aur-panga-is-like-a-page-of-my-marriage-2743242-2025-06-19",
      "headline": "Host Sonali Bendre says Pati, Patni Aur Panga is like a page of my marriageSonali Bendre is making a comeback as a TV host for the upcoming reality show 'Pati, Patni Aur Panga', featuring real-life celebrity couples in fun relationship challenges. Calling it a reflection of her own marriage, she said the show celebrates everyday moments that make love real."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-working-equation-with-husband-ajay-devgn-we-are-not-civilised-2743203-2025-06-19",
      "headline": "Kajol on working equation with husband Ajay Devgn: We are not civilisedKajol opened up about working with husband Ajay Devgn, sharing how they openly call each other out on set but never cross boundaries. She also said she keeps a polite and professional attitude while shooting to maintain a comfortable work environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-to-reunite-with-hi-nanna-director-shouryuv-for-pan-india-rom-com-2743180-2025-06-19",
      "headline": "Nani to reunite with Hi Nanna director Shouryuv for pan-India rom-com: ReportNani is set to reunite with 'Hi Nanna' director Shouryuv for a light-hearted romantic comedy. The shooting for the film is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-acquires-rights-blake-lively-and-taylor-swift-chats-2743142-2025-06-19",
      "headline": "Justin Baldoni acquires rights to read Blake Lively-Taylor Swift's private chatsIn a recent development in the 'It Ends With Us' row, actor-filmmaker Justin Baldoni acquired the rights to access messages between actor Blake Lively and her singer friend Taylor Swift. Here's what it means.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dna-movie-review-atharvaa-nimisha-sajayan-nelson-venkatesan-film-neat-thriller-with-few-unwanted-detours-2743173-2025-06-19",
      "headline": "DNA review: Atharvaa-Nimisha's film is a smart thriller with few unwanted detoursReleased-Fri Jun 20, 2025DNA movie review: Director Nelson Venkatesan's film, starring Atharvaa and Nimisha Sajayan, is a neatly crafted thriller about organised crime. The film boasts enough thrills with a few unwanted detours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-calls-hyderabads-ramoji-film-city-haunted-leaves-internet-divided-2743178-2025-06-19",
      "headline": "Kajol calls Hyderabad's Ramoji Film City haunted, leaves internet dividedKajol's remarks about Ramoji Film City being haunted have stirred controversy among Hyderabadis and internet users. While some dismiss it as superstition, others recall similar spooky experiences at the iconic film studio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/madonna-reacts-to-ties-with-pope-leo-xiv-jolie-bieber-also-among-his-relatives-2743070-2025-06-19",
      "headline": "Madonna reacts to ties with Pope Leo XIV; Jolie, Bieber also among his relativesSinger-songwriter Madonna responded to a recent report suggesting she is related to Pope Leo XIV. The report also mentioned that several other celebrities have ties to the Vatican."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahmed-khan-cites-pahalgam-attack-kashmir-schedule-for-welcome-to-the-jungle-delay-2743166-2025-06-19",
      "headline": "Ahmed Khan cites Pahalgam attack, Kashmir schedule for Welcome to the Jungle delay'Welcome to The Jungle' director Ahmed Khan clarified that they were scheduled to shoot in Kashmir this month, but had to let go of the location in the aftermath of the Pahalgam attack. His statement came when several reports suggested financial issues as the reason behind the delay in the film's shooting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-praises-meiyazhagan-emotional-drama-favourite-film-decade-2743136-2025-06-19",
      "headline": "Nani calls Meiyazhagan absolute beauty, one of his favourite films of the decadeActor Nani calls 'Meiyazhagan' an absolute beauty and one of his favourite films of the decade. The film's emotional depth and personal storytelling have left a lasting impact on him amidst big-budget cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mannara-chopra-pays-final-respect-to-her-father-holds-his-photo-close-at-prayer-meet-2743140-2025-06-19",
      "headline": "Mannara Chopra pays final respect to her father, holds his photo close at prayer meetThe prayer meet for Mannara Chopra's father was held on Thursday. The actor appeared heartbroken as she held his photo close while the family visited a Gurudwara for the ceremony.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-i-knew-thugs-of-hindostan-would-fail-but-aditya-chopra-didnt-agree-2743139-2025-06-19",
      "headline": "I knew Thugs of Hindostan would fail but Aditya Chopra didn't agree: Aamir KhanAamir Khan recalls telling Aditya Chopra that their film 'Thugs of Hindostan' needed changes for it to work for the audience, but none of them agreed with his feedback. The actor explains what went wrong with the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-tiger-tiger-burning-brightcaption-sparks-jr-ntr-neel-collab-rumours-2743098-2025-06-19",
      "headline": "Actor Rukmini Vasanth's \"Tiger Tiger...\" caption sparks collab rumours with Jr NTRDirector Prashanth Neel's upcoming film, tentatively titled 'NTR-Neel', starring Jr NTR is yet to reveal the rest of the cast. Ahead of this, an Instagram post by actor Rukmini Vasanth has gone viral for its caption, \"Tiger Tiger Burning Bright\", sparking rumours of her casting in the film. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-fires-missiles-with-cluster-munitions-as-conflict-with-israel-enters-day-eight-glbs-2743445-2025-06-20",
      "headline": "Iran fires missiles with cluster bombs as conflict with Israel enters day eightTensions continued to rise on Friday as Israel struck Iranian nuclear sites and Tehran responded with missiles armed with cluster munitions. Netanyahu says Israel is ahead in its campaign, while Trump weighs US support amid nuclear fears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Conflict enters second week, Iran to meet European officialsIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other as their conflict stretched into its eighth day, showing no signs of de-escalation. Iran has appointed a new intelligence chief for the Revolutionary Guards following the killing of his predecessor in an Israeli strike last week, according to state media. Meanwhile, the White House said President Donald Trump will decide within two weeks on possible US military action against Iran, indicating that diplomacy remains an option for now. Earlier, in a live address, Iran's Supreme Leader Ali Khamenei declared that the nation remains united and will not bow to external pressure. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-preview-team-news-leeds-weather-prediction-2743428-2025-06-20",
      "headline": "New era. No mercy. Trial by Bazball awaits Shubman Gill's new-look IndiaEngland vs India, 1st Test preview: Shubman Gill will lead a new-look Indian side at Headingley, facing the daunting task of challenging a Bazballing England in their own backyard. The transition has been swift, offering no time to ease in. Can the young Indian side spring a surprise in Leeds?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-quietly-pulled-military-jets-from-qatar-airbase-satellite-images-show-glbs-2743433-2025-06-20",
      "headline": "US quietly pulled military jets from Qatar airbase, satellite images showSatellite images show that the US removed most of its aircraft from Al Udeid Air Base in Qatar between June 5 and 19, amid rising tensions with Iran. Only three aircraft remained visible by June 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-virat-kohli-2743326-2025-06-20",
      "headline": "Gavaskar, Sachin, Dravid or Kohli: Who's India's best? Sherlock Holmes investigatesCricket meets mystery in this puzzle for the ages. Virat Kohli has just retired from Test cricket and touched off a debate on who's the best Test batter ever from the short list of Gavaskar, Tendulkar, Dravid and Kohli. It's a debate wrapped inside a mystery that has layers and layers of facts, data and emotions. So, the writer summons the Sherlok Holmes inside him to crack Open the case of the #FabFourDebate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-will-make-decision-on-whether-to-attack-iran-within-two-weeks-says-white-house-2743364-2025-06-19",
      "headline": "Trump will decide on whether to attack Iran within 2 weeks: White HouseA day after reports claiming that Donald Trump has expressed support for plans to strike Iran but has yet to issue a final order, the White House on Thursday said that the US President will make a decision on whether to attack Iran within two weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/indian-student-tanya-tyagi-dies-in-canada-consulate-extends-support-glbs-2743431-2025-06-20",
      "headline": "Indian student from Delhi dies in Canada, cause of death unclearTanya Tyagi, an Indian student from Delhi at the University of Calgary, died on June 17. The cause of her death remains unknown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-hit-our-airbases-pakistan-deputy-pms-big-admission-on-operation-sindoor-glbs-2743418-2025-06-20",
      "headline": "India hit our airbases: Pakistan Deputy PM's big admission on Operation SindoorPakistan's Deputy PM Ishaq Dar confirmed that India struck key military bases -- Nur Khan and Shorkot -- during Operation Sindoor, in response to the Pahalgam terror attack. Dar also revealed that Saudi Arabia tried to calm tension by contacting India on Pakistan's behalf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/iran-israel-conflict-ayatollah-khamenei-khaybar-tweet-benjamin-netanyahu-2743292-2025-06-20",
      "headline": "Khamenei's Khaybar tweet: A sword, a signal, a storyIran's Supreme Leader Ayatollah Khamenei's tweet featured a digitally-illustrated painting: a luminous warrior gripping a double-bladed sword, flanked by two lions, striding toward a burning fortress under a rain of fire. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-20-pm-to-visit-bihar-odisha-israel-iran-conflict-intensifies-2743449-2025-06-20",
      "headline": "News Menu, June 20: PM to visit Bihar, Odisha; Israel-Iran conflict intensifiesIn today's News Menu: Iran-Israel conflict enters its eighth day, PM Modi is set to visit Bihar and Odisha, IMD clears cloud-seeding pilot project to combat air pollution in Delhi and Amit Shah's Chhattisgarh visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-war-barabanki-to-tehran-ayatolla-khomeini-up-roots-iran-revolution-2743441-2025-06-20",
      "headline": "Barabanki to Tehran: Khomeini's UP roots in spotlight amid Israel-Iran tensionsKintoor, a village in Uttar Pradesh, India, with ancestral links to Ayatollah Khomeini, responds to the Israel-Iran conflict with calls for peace, reminding the world of its quiet yet powerful connection to Iranian history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-led-axiom-mission-4-delayed-again-nasa-stands-down-from-june-22-launch-2743438-2025-06-20",
      "headline": "Shubhanshu Shukla-led Axiom-4 mission delayed again, no launch on June 22The Axiom-4 mission to the International Space Station has been postponed once again. NASA is standing down from a launch on Sunday, June 22, and will target a new launch date in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/this-gulf-war-will-boomerang-iran-israel-conflict-trump-pakistan-army-chief-asim-munir-2743254-2025-06-19",
      "headline": "This Gulf War will BoomerangThe new Gulf war is a boomerang with worse aim than a drunk dart player and, like every misadventure from Kabul to Baghdad, is a masterclass in shooting your own foot while aiming for the moon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-declared-dead-for-land-shows-im-alive-paper-at-government-office-2743440-2025-06-20",
      "headline": "Declared dead for land, UP woman shows 'I'm alive' paper at government officeA woman in Uttar Pradesh showed up at the District Magistrate's office with a paper that read 'I am alive' after being declared dead in a land dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/post-islamic-republic-iran-talks-have-begun-exiled-prince-reza-pahlavi-glbs-2743450-2025-06-20",
      "headline": "Post-Islamic Republic Iran talks have begun: Exiled prince Reza PahlaviExiled crown prince Reza Pahlavi declares Iran's regime is collapsing, urging nationwide uprising and military defection, calling this the irreversible start of a post-Islamic Republic future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kajol-gets-candid-on-trolling-and-the-scrutiny-of-star-kids-no-one-can-touch-my-children-exclusive-2743293-2025-06-19",
      "headline": "No one can touch my children: Kajol on trolling and public scrutinyActor Kajol opened up about the social media trolling faced by star kids today. The actor, in an exclusive interview with IndiaToday.in, highlighted the importance of love and emotional strength in parenting amid constant criticism."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bringing-a-king-cobra-to-bhopal-wasnt-a-good-idea-2743224-2025-06-19",
      "headline": "Why bringing a King Cobra to Bhopal wasn't a good ideaA King Cobra dies at a national park in Madhya Pradesh, where the alien species had been brought at the CM's behest, even as his forest department plans to get more fancy animals like giraffes, rhinos and zebras.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-trade-partnership-pakistan-army-chief-asim-munir-meeting-white-house-2743365-2025-06-19",
      "headline": "Trump expressed keen interest in forging trade ties with Islamabad: Pak ArmyUS President Donald Trump who met Pakistan Army Chief Asim Munir at the White House, expressed \"keen interest\" in developing \"mutually beneficial\" trade partnership with Pakistan, according to the country's army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/boeing-ghost-flights-china-iran-air-route-raises-eyebrows-in-israel-conflict-glbs-2743423-2025-06-20",
      "headline": "Boeing ghost flights: China-Iran air route raises eyebrows in Israel conflictMultiple Boeing 747 cargo planes flying from China to Iran have mysteriously vanished near Iranian airspace, sparking speculation that Beijing may be secretly supplying Tehran with weapons amid rising tensions with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/worry-window-mental-health-tips-to-manage-anxiety-stress-2742676-2025-06-20",
      "headline": "It's worry'o clock, time to manage anxiety in 5 stepsWhen worries pop into your head in the middle of a workday, don't silence them completely. Instead, block time on your calendar for later and let them feel heard. It's expert-approved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-cop-wife-cuts-birthday-cake-police-car-bonnet-case-driver-congress-reacts-2743239-2025-06-20",
      "headline": "Cop's wife cuts birthday cake on police car's bonnet, case against driverA senior police officer's wife in Chhattisgarh cut her birthday cake on a moving police car's bonnet as seen in a viral video. Despite the misuse of a government vehicle, police filed a case against an \"unnamed driver\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-ali-khamenei-bunker-video-analysis-israel-iran-conflict-2743285-2025-06-19",
      "headline": "Video forensic suggests Khamenei may have moved away from residenceIn a forensics analysis, India Today's Open-Source Intelligence (OSINT) noticed unusual technical deviations in the production of the latest video as against previous videos released by his office.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-leadership-india-vs-england-test-series-2743448-2025-06-20",
      "headline": "India need their Spidey to lead: Rishabh Pant's test of maturity beginsRishabh Pant, India's beloved 'Spidey', steps into a leadership-heavy Test series with a fresh mantle. As Shubman Gill takes charge, India need Pant to evolve from chaos creator to steady saviour in their post-Kohli, Rohit red-ball era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sitaare-zameen-par-screening-meets-actors-aamir-khan-gauri-spratt-2743461-2025-06-20",
      "headline": "Shah Rukh Khan lights up Sitaare Zameen Par screening, hugs and poses with actorsShah Rukh Khan attended the screening of Aamir Khan's 'Sitaare Zameen Par' in Mumbai on Thursday. He was seen interacting and taking pictures with the actors of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/china-uses-ai-to-revive-100-classic-kung-fu-films-glbs-2743434-2025-06-20",
      "headline": "China uses AI to revive 100 classic Kung Fu filmsChina is launching an AI-driven project to revive 100 classic martial arts films, including works by Bruce Lee and Jackie Chan, blending restoration with innovation for modern audiences and global appeal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anna-camp-goes-public-with-girlfriend-jade-whipkey-at-bride-hard-premiere-glbs-2743429-2025-06-20",
      "headline": "Anna Camp goes public with girlfriend Jade Whipkey at Bride Hard premiereAnna Camp made her red carpet debut with girlfriend Jade Whipkey at the Bride Hard premiere, confirming their relationship after months of speculation and celebrating her new film in Los Angeles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/rekha-vicky-kaushal-jackie-shroff-and-celebs-at-sitaare-zameen-par-screening-2743328-2025-06-19",
      "headline": "Rekha, Vicky Kaushal, Jackie Shroff, and celebs at Sitaare Zameen Par screeningThe premiere event of 'Sitaare Zameen Par' witnessed many Bollywood celebrities as the attendees. Aamir Khan, Rekha, Vicky Kaushal and Jackie Shroff were amongst the prominent names from the Indian film industry."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-paris-live-streaming-info-schedule-2743469-2025-06-20",
      "headline": "Neeraj Chopra Paris Diamond League 2025 Live Streaming: When and where to watch?Neeraj Chopra, Paris Diamond League 2025: Reigning world champion Neeraj Chopra is set to compete in the Paris Diamond League 2025 on June 20 (June 21 IST), marking his second appearance of the season after Doha. In Doha, Neeraj broke the elusive 90m barrier for the first time with a throw of 90.23m, surpassing his previous best of 89.94m."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-drop-marnus-labuschagne-steve-smith-injured-west-indies-test-series-2743463-2025-06-20",
      "headline": "Australia drop Labuschagne, rule out Smith for 1st Test vs West IndiesAustralia have dropped Marnus Labuschagne and will be without star batter Steve Smith due to injury for the opening Test against the West Indies, beginning on 25 June in Barbados."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-1st-test-leeds-weather-forecast-2743457-2025-06-20",
      "headline": "1st Test Leeds Weather forecast: Will rain play spoilsport in series opener?India and England are set to kick off their 2025–27 World Test Championship campaign with the first of five Tests at Headingley, Leeds, starting June 20. While anticipation is high for the Anderson-Tendulkar Trophy opener, all eyes will be on the skies, with typical English weather raising concerns over possible rain interruptions on the opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-leadership-india-vs-england-test-series-2743448-2025-06-20",
      "headline": "India need their Spidey to lead: Rishabh Pant's test of maturity beginsRishabh Pant, India's beloved 'Spidey', steps into a leadership-heavy Test series with a fresh mantle. As Shubman Gill takes charge, India need Pant to evolve from chaos creator to steady saviour in their post-Kohli, Rohit red-ball era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-virat-kohli-2743326-2025-06-20",
      "headline": "Gavaskar, Sachin, Dravid or Kohli: Who's India's best? Sherlock Holmes investigatesCricket meets mystery in this puzzle for the ages. Virat Kohli has just retired from Test cricket and touched off a debate on who's the best Test batter ever from the short list of Gavaskar, Tendulkar, Dravid and Kohli. It's a debate wrapped inside a mystery that has layers and layers of facts, data and emotions. So, the writer summons the Sherlok Holmes inside him to crack Open the case of the #FabFourDebate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-preview-team-news-leeds-weather-prediction-2743428-2025-06-20",
      "headline": "New era. No mercy. Trial by Bazball awaits Shubman Gill's new-look IndiaEngland vs India, 1st Test preview: Shubman Gill will lead a new-look Indian side at Headingley, facing the daunting task of challenging a Bazballing England in their own backyard. The transition has been swift, offering no time to ease in. Can the young Indian side spring a surprise in Leeds?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-galle-test-day-3-pathum-nissanka-reply-2743370-2025-06-19",
      "headline": "Pathum Nissanka 187 leads Sri Lanka's solid response after Bangladesh post 495Pathum Nissanka's sublime 187 lit up the third day in Colombo as Sri Lanka closed in on Bangladesh's total, keeping hopes alive for a strong comeback in the opening Test of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-headingley-test-playing-xi-tv-channel-livestreaming-leeds-2743335-2025-06-19",
      "headline": "ENG vs IND, Headingley Test: All you need to know about Gill era's debutENG vs IND: India and England begin a high-stakes five-Test series at Headingley, as Shubman Gill steps into leadership and Bazball faces its first home challenge against India after a crushing 4-1 defeat away earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-vs-england-leeds-press-conference-analysis-2743294-2025-06-19",
      "headline": "Solid in defence: New captain Gill quietly confident in England Test presserIndia tour of England: Speaking to the press for the first time as India's Test captain in England, Shubman Gill exuded quiet confidence. He offered just enough of a glimpse into his mindset to intrigue, but remained guarded while addressing tricky questions in Leeds on Thursday, June 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-leeds-test-shubman-gill-press-conference-captain-2743299-2025-06-19",
      "headline": "Shubman Gill calm and composed in first presser as Test captainIndia tour of England: It may not have matched the flamboyance of his one-day batting, but in his first press conference as Test captain in England, Shubman Gill exuded the quiet confidence of a man ready for the long haul-prepared for the patience and grind that the traditional format demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/england-vs-india-ben-stokes-adapt-better-message-bazball-2743291-2025-06-19",
      "headline": "Play bazball, but adapt better: Ben Stokes's message to England for India TestsEngland skipper Ben Stokes backed the team's Bazball approach ahead of the India series but stressed the need for situational adaptability, urging his players to stay fearless while also adjusting to conditions across the five-match Test battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-galle-test-day-3-pathum-nissanka-reply-2743370-2025-06-19",
      "headline": "Pathum Nissanka 187 leads Sri Lanka's solid response after Bangladesh post 495Pathum Nissanka's sublime 187 lit up the third day in Colombo as Sri Lanka closed in on Bangladesh's total, keeping hopes alive for a strong comeback in the opening Test of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-headingley-test-playing-xi-tv-channel-livestreaming-leeds-2743335-2025-06-19",
      "headline": "ENG vs IND, Headingley Test: All you need to know about Gill era's debutENG vs IND: India and England begin a high-stakes five-Test series at Headingley, as Shubman Gill steps into leadership and Bazball faces its first home challenge against India after a crushing 4-1 defeat away earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-vs-england-leeds-press-conference-analysis-2743294-2025-06-19",
      "headline": "Solid in defence: New captain Gill quietly confident in England Test presserIndia tour of England: Speaking to the press for the first time as India's Test captain in England, Shubman Gill exuded quiet confidence. He offered just enough of a glimpse into his mindset to intrigue, but remained guarded while addressing tricky questions in Leeds on Thursday, June 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-leeds-test-shubman-gill-press-conference-captain-2743299-2025-06-19",
      "headline": "Shubman Gill calm and composed in first presser as Test captainIndia tour of England: It may not have matched the flamboyance of his one-day batting, but in his first press conference as Test captain in England, Shubman Gill exuded the quiet confidence of a man ready for the long haul-prepared for the patience and grind that the traditional format demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/england-vs-india-ben-stokes-adapt-better-message-bazball-2743291-2025-06-19",
      "headline": "Play bazball, but adapt better: Ben Stokes's message to England for India TestsEngland skipper Ben Stokes backed the team's Bazball approach ahead of the India series but stressed the need for situational adaptability, urging his players to stay fearless while also adjusting to conditions across the five-match Test battle."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}