{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-stock-market-rally-sensex-nifty-gain-auto-sector-shines-on-robust-december-sales-2658216-2025-01-01",
      "headline": "Auto stocks drive Sensex, Nifty gains on 2025's first trading dayStock market rally: The S&P BSE Sensex added 368.40 points to end at 78,507.41, while the NSE Nifty50 gained 98.10 points to close at 23,742.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/whatsapp-pays-upi-services-to-cover-all-indian-users-check-details-npci-lifts-cap-2658208-2025-01-01",
      "headline": "WhatsApp Pay's UPI services to cover all Indian users. Check details NPCI's decision allows WhatsApp Pay to serve over 500 million WhatsApp users in the country, a huge leap from earlier restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-sensex-jumps-over-600-points-2-reasons-why-banking-auto-stock-surge-2658190-2025-01-01",
      "headline": "Sensex jumps over 600 points: 2 reasons why stock market is rising todayThe S&P BSE Sensex was up 470.08 points to 78,609.09, while the NSE Nifty50 added 138.85 points to 23,783.65 as of 2:20 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-nirmala-sitharaman-focus-on-boosting-consumption-slow-growth-high-inflation-2658158-2025-01-01",
      "headline": "Budget 2025: Should Nirmala Sitharaman focus on boosting consumption? India's GDP growth slowed to 5.4% in the second quarter of the current fiscal year, marking an 18-month low. This was primarily due to weak consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nishant-pitti-resigns-easy-trip-planners-ceo-sights-personal-reason-141-percent-divestment-stake-2658101-2025-01-01",
      "headline": "Nishant Pitti resigns as Easy Trip Planners CEO after divesting stakeIn a stock exchange filing, Nishant Pitti cited personal reasons for stepping down as the CEO of Easy Trip Planners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ireda-share-price-multibagger-stock-jumps-8-per-cent-today-reason-here-is-why-stmp-2658092-2025-01-01",
      "headline": "IREDA share price: Multibagger stock jumps 8% today. Here's why IREDA's share price touched an intraday high of Rs 227.65 on the National Stock Exchange (NSE), marking a 5.76% increase from its previous close. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-rise-8-percent-today-reason-why-mou-bihar-pumped-storage-power-project-2658087-2025-01-01",
      "headline": "Explained: Why SJVN share price rose 8% today SJVN shares were trading at Rs 110.33 as of 11 AM on the National Stock Exchange (NSE). The sharp rise in the stock was accompanied by heavy trading volumes, with over two crore shares changing hands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-wilmar-share-price-stocks-recover-rises-5-percent-in-ealry-trade-adani-enterprises-exit-stock-market-today-stmp-2658080-2025-01-01",
      "headline": "Adani Wilmar stocks recover as share price rises 5% in ealry tradeAdani Wilmar share price: The recovery follows a sharp decline of 7% on Tuesday after Adani Enterprises Ltd (AEL) announced its decision to sell its entire 44% stake in Adani Wilmar Ltd (AWL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-day-2-latest-subscription-gmp-allotment-listing-date-stmp-2658068-2025-01-01",
      "headline": "Indo Farm Equipment IPO Day 2: Check latest subscription, GMPThe IPO is a book-built issue valued at Rs 260.15 crore. It includes a fresh issue of 86 lakh shares, amounting to Rs 184.90 crore, and an offer for sale (OFS) of 35 lakh shares, valued at Rs 75.25 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-bse-nse-closed-on-january-1-for-new-year-2025-stmp-2658057-2025-01-01",
      "headline": "Are BSE, NSE closed on January 1 for New year 2025?In India, the stock markets operate from Monday to Friday and remain closed on weekends, i.e., Saturdays and Sundays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-today-sensex-nifty-open-flat-in-first-trading-session-of-2025-stmp-2658055-2025-01-01",
      "headline": "Stock market today: Sensex, Nifty open flat in first trading session of 2025The S&P BSE Sensex was up by 33.99 points to 78,173.00, while the NSE Nifty50 gained 1.85 points to 23,646.65 as of 9:31 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-kekius-maximus-memecoin-elon-musk-new-identity-on-x-price-of-kekius-2657805-2024-12-31",
      "headline": "What is Kekius Maximus? Elon Musk's new identity on XBy adopting the name 'Kekius Maximus' on X, Musk sent the KEKIUS memecoin soaring 500%, sparking renewed interest in the crypto market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-marginally-lower-in-last-trading-session-of-2024-2657803-2024-12-31",
      "headline": "Sensex, Nifty end marginally lower in last trading session of 2024The S&P BSE Sensex fell by 109.12 points to settle at 78,139.01, while the Nifty50 edged down by 0.10 points, closing at 23,644.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-in-2025-sensex-and-nifty-dalal-street-turbulence-continue-experts-2657741-2024-12-31",
      "headline": "Sensex and Nifty in 2025: Will Dalal Street's turbulent run continue?Following a volatile 2024 that saw significant gains in the first half before moderating, market experts anticipate single-digit returns in the coming year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-extended-for-belated-revised-return-cbdt-new-date-income-tax-check-all-details-stmp-2657711-2024-12-31",
      "headline": "ITR filing deadline extended for belated/revised return. Check all detailsUnion Minister of State for Finance Pankaj Chaudhary recently revealed in Parliament that only 6.68% of India's population filed ITRs in the fiscal year 2023-24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-2025-investment-tips-top-9-stocks-portfolio-new-year-shriram-finance-fortis-doms-airtel-2657699-2024-12-31",
      "headline": "Looking to invest in stocks in 2025? 9 picks for your portfolio this New YearThe year 2024 has been decent for Indian stock markets. Both key market indices - the NSE Nifty 50 and the S&P BSE Sensex - went up by 9% during the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rites-share-price-surged-10-percent-today-explained-stmp-2657681-2024-12-31",
      "headline": "Explained: Why RITES share price surged 10% todayRITES stock price: The stock opened at Rs 267.15 and soared to an intraday high of Rs 302.80, supported by increased investor interest and heightened trading activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-extends-vivad-se-vishwas-scheme-2024-deadline-to-january-31-key-penalty-interest-details-2657664-2024-12-31",
      "headline": "Income Tax extends Vivad Se Vishwas deadline to January 31. Key penalty detailsThe Income Tax Department has extended the Vivad Se Vishwas Scheme deadline to January 31, 2025, offering taxpayers a chance to settle disputes at reduced rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-share-price-rebounds-after-falling-in-previous-session-explained-stmp-2657653-2024-12-31",
      "headline": "Dam Capital share price rebounds after Monday's slump. Here's whyDam Capital stock price:  By 11 am, the shares were trading 3.60% higher at Rs 385.70, recovering some ground lost during Monday's profit booking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-continues-positive-rally-reaches-all-time-high-stmp-2657642-2024-12-31",
      "headline": "ITI share price hits record high as positive rally continuesITI share price: The recent rally has propelled ITI Ltd. above its 5-day, 20-day, 50-day, 100-day, and 200-day moving averages, underlining its robust performance across short- and long-term benchmarks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vehicle-rams-into-crowd-new-orleans-louisiana-dead-injured-2658246-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 killed after truck rams crowd in US's New Orleans, suspect killedA vehicle crashed into a crowd at the intersection of Bourbon Street and Iberville in New Orleans city and the driver exited the vehicle and started firing at people. The accused driver, Shamsud Din Jabbar, 42, was killed during a shootout with police."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-bakery-owner-puneet-khurana-suicide-sister-wife-mental-torture-hanging-big-claim-2658289-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Wife's family dared him to die by suicide': Big claim by bakery owner's sisterThe family of Puneet Khurana, a Delhi-based bakery owner, who died by suicide, alleged that his estranged wife mentally tortured him and repeatedly demanded her share of their bakery business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/12-dead-injured-in-gaza-as-israel-intensifies-attacks-to-stop-hamas-from-regrouping-2658386-2025-01-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12 killed in Gaza as Israel intensifies attacks to stop Hamas from regroupingWith the war in Gaza now over a year, Israel is focusing its operations in the north and centre of the enclave in what it says is a campaign to stop Hamas militants from waging attacks and regrouping."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/girl-fell-inside-borewell-rajasthan-kotputli-declared-dead-10-days-operation-2658295-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan girl pulled out 10 days after falling into borewell, declared deadAfter 10 days of searching, three-year-old Chetna's body was found in Kotputli. She was declared dead at the hospital. A post-mortem is underway as authorities continue investigating the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-modi-meeting-punjabi-singer-memorable-internation-bjp-2658337-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi meets Diljit Dosanjh, heaps praise on him in 'memorable interaction'Diljit, who recently concluded his months-long pan-India Dil-Luminati tour, took to his Instagram page and posted the glimpse of his meeting with the Prime Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sydney-weather-report-rain-to-effect-new-year-test-2658302-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IND vs AUS, Sydney Weather Report: Rain set to affect New Year's TestIndia are set to play their final Test match of the Border-Gavaskar Trophy against Trophy in Sydney. India will need to win the final Test match to remain in the hunt for the World Test Championship Final. The Sydney weather might make life tricky for Indian players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tesla-truck-catches-fire-donald-trump-las-vegas-hotel-dead-injured-2658387-2025-01-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 dead after Tesla truck catches fire, explodes outside Trump's Las Vegas hotelAt least one person died, and seven others were injured after a Tesla Cybertruck caught fire and exploded outside President-elect Donald Trump's hotel, the Las Vegas Metropolitan Police said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/easyjet-flight-turkey-london-teenage-girl-open-door-midair-outburst-emergency-landing-2658326-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "London-bound flight makes emergency landing after teen tries to open door midairA chaotic EasyJet flight from Turkey to London saw a 16-year-old attempt to open an emergency door mid-air, forcing an emergency landing in Italy and leaving passengers traumatised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/video/gunshots-panic-bodies-lying-around-moments-after-deadly-new-orleans-attack-2658283-2025-01-01?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Gunshots, panic, bodies lying around: Moments after deadly New Orleans attackAt least 10 people were killed and over 30 injured after a vehicle ploughed into a crowd of people in central New Orleans on Wednesday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/gautam-adani-trial-by-fire-newsmakers-of-the-year-2024-2657771-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gautam Adani: Trial by fireThe Adani Group chairman retains his business resilience in the face of accusations of bribery and concealment of information, and the attendant political backlash"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nagpur-engineering-student-strangled-mother-stabbed-father-after-differences-over-college-2658324-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nagpur man kills parents over being asked to switch college after failing examsA 25-year-old man was arrested in Nagpur for allegedly killing his parents over academic pressure and being asked to transfer to another college."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-cold-day-conditions-maximum-temperature-big-dip-safdarjung-palam-stations-2658323-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi sees 'cold day' for third consecutive day, big dip in maximum temperatureDelhi continued to shiver in cold day conditions for a third consecutive day as the maximum temperature was recorded at 15 degrees Celsius, which is 4.3 degrees below the normal range."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deva-poster-out-shahid-kapoor-look-rosshan-andrrews-film-wows-fans-pooja-hegde-pavail-gulati-2658285-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deva poster: Shahid Kapoor's look from Rosshan Andrrews' film wows fansZee Studios and Roy Kapur Films have released the first poster of Deva, starring Shahid Kapoor and directed by Rosshan Andrrews. The film is slated for a January 31, 2025 release, with the poster stirring excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-suggests-places-for-manmohan-singhs-memorial-options-sent-to-his-family-2658251-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre suggests places for Manmohan Singh's memorial, options sent to his familyThe central government has begun the process of building a memorial for former PM Dr Manmohan Singh, with his family asked to choose from proposed sites near Rajghat, Rashtriya Smriti Sthal, or Kisan Ghat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-orleans-mass-casualty-accident-us-truck-rams-crowd-new-year-eve-2658292-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Driver tried to 'run over as many as possible', then fired: All about US attackAt least 10 people were killed and over 35 injured when a truck intentionally drove into a large crowd on Canal and Bourbon Street in New Orleans on New Year's Eve. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/video/video-pm-modi-adds-beats-as-diljit-dosanjh-sings-devotional-song-2658338-2025-01-01?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: PM Modi adds beats as Diljit Dosanjh sings devotional songPrime Minister Narendra Modi met Punjabi singer and actor Diljit Dosanjh in New Delhi on Wednesday. During his interaction with the Prime Minister, Dosanjh sang a devotional song, Dhiaan Dhar Mehsoos Kar, and PM Modi added beats to the song by tapping on the table in front of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-jasprit-bumrah-bs-chandrasekhar-record-india-vs-australia-2658307-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah eyes BS Chandrasekhar's historic 52-year-old recordBorder Gavaskar Trophy, IND vs AUS: Indian fast bowler Jasprit Bumrah has been phenomenal in the ongoing series, having taken 30 wickets from four Tests with three five-wicket hauls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/photo/in-pics-from-paris-to-mumbai-2025-welcomed-with-grand-celebrations-fireworks-2658031-2025-01-01?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "In pics: From Paris to Mumbai, 2025 welcomed with grand celebrations, fireworksHappy New Year 2025: People across the world welcome New Year in great pomp. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-hazaribag-man-jumps-in-well-after-dispute-with-wife-4-rescuers-dead-2658309-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man jumps into well after domestic dispute, 4 follow to rescue him, all deadThe incident took place at Charhi when Sundar Karmali (27) jumped into a well after a domestic dispute with his wife, Rupa Devi, the official added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/mumbais-popular-local-train-station-welcomes-2025-with-horn-blowing-ceremony-2658343-2025-01-01?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Mumbai's popular local train station welcomes 2025 with horn blowing ceremonyMumbai local trains welcomed the New Year by blowing their horn simultaneously as the clock struck 12 am. Railways Minister Ashwini Vaishnaw shared a video of it on X and wrote, \"Happy New Year to everyone.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/yoga-for-a-beautiful-mind-trends-to-embrace-in-2025-2657767-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yoga for a beautiful mind: Trends to embrace in 2025Optimising emotional and psychological wellbeing through yoga will be the way to go in the New Year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-india-sydney-test-record-2658280-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can India retain Border Gavaskar Trophy at SCG? Here's what history saysBorder Gavaskar Trophy, IND vs AUS: India have won only 1 out of 13 Test matches at the Sydney Cricket Ground. India's New Year's Test against Pat Cummins' Australia starts on January 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/weather-update-2024-warmest-year-in-india-since-1901-surpassed-2016s-record-says-imd-2658287-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2024 warmest year in India since 1901, surpassed 2016's record: Weather bodyThe year 2024 now ranks as the warmest year on record since 1901, surpassing 2016, which had recorded a mean land surface air temperature 0.54 degrees Celsius above normal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-dressing-room-gautam-gambhir-leak-irfan-pathan-criticism-2658124-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian dressing room leaks from Australia leave ex-cricketers shockedFormer cricketers, including Irfan Pathan, have condemned the leaks from the Indian dressing room during the Border-Gavaskar Trophy, following a news report about Gautam Gambhir's stern address to the team after their Boxing Day Test defeat. The controversy has added to the mounting pressure on the Indian team, which trails 1-2 in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/video/video-pm-modi-adds-beats-as-diljit-dosanjh-sings-devotional-song-2658338-2025-01-01",
      "headline": "Video: PM Modi adds beats as Diljit Dosanjh sings devotional songPrime Minister Narendra Modi met Punjabi singer and actor Diljit Dosanjh in New Delhi on Wednesday. During his interaction with the Prime Minister, Dosanjh sang a devotional song, Dhiaan Dhar Mehsoos Kar, and PM Modi added beats to the song by tapping on the table in front of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-modi-meeting-punjabi-singer-memorable-internation-bjp-2658337-2025-01-01",
      "headline": "PM Modi meets Diljit Dosanjh, heaps praise on him in 'memorable interaction'Diljit, who recently concluded his months-long pan-India Dil-Luminati tour, took to his Instagram page and posted the glimpse of his meeting with the Prime Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/payal-kapadia-lucky-for-all-we-imagine-as-light-ott-release-savitribai-phules-birth-anniversary-january-3-2658329-2025-01-01",
      "headline": "Payal Kapadia 'lucky' for All We Imagine… OTT release on Savitribai Phule's anniversaryFilmmaker Payal Kapadia celebrates the release of her film All We Imagine as Light on Disney+ Hotstar, coinciding with the birth anniversary of Savitribai Phule. The film will debut on the OTT platform on January 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/7g-rainbow-colony-2-selvaraghavan-shares-first-look-of-the-much-awaited-sequel-2658297-2025-01-01",
      "headline": "7/G Rainbow Colony 2: Selvaraghavan shares first look of the much-awaited sequelThe first look of the highly anticipated sequel to the classic 7/G Rainbow Colony has been released. Directed by Selvaraghavan, the film features Ravi Krishna reprising his iconic role, with Anaswara Rajan joining the cast. Produced by Sri Surya Movies and AM Rathnam, 7/G Rainbow Colony 2 promises to take audiences on an emotional journey."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-trent-alexnder-arnold-free-transfer-liverpool-january-move-rejected-premier-league-2658367-2025-01-01",
      "headline": "Real Madrid eyeing Trent Arnold free transfer from Liverpool: ReportsLiverpool rejected Real Madrid's January bid for Trent Alexander-Arnold, emphasizing their intent to retain the defender despite his expiring contract. Real Madrid, known for strategic acquisitions, remains optimistic about securing Alexander-Arnold on a free transfer by summer 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-afghanistan-2nd-test-live-streaming-when-and-where-to-watch-2658341-2025-01-01",
      "headline": "Zimbabwe vs Afghanistan 2nd Test: When and Where to watch liveZIM vs AFG, 2nd Test: Zimbabwe and Afghanistan will face each other in the second Test, starting Thursday, January 2 at the Queen's Sports Club in Bulawayo. The first Test in Bulawayo ended in a draw. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-nepomniachtchi-world-blitz-championship-hans-niemann-investigation-viral-video-2658336-2025-01-01",
      "headline": "Niemann calls for investigation into Carlsen-Nepo tie after viral videoHans Niemann demanded a FIDE investigation into Magnus Carlsen and Ian Nepomniachtchi's viral video, which sparked controversy over their shared 2024 World Blitz Championship title, alleging collusion and raising concerns about the integrity of professional chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-australian-pm-india-vs-australia-cheeky-law-2658334-2025-01-01",
      "headline": "Bumrah to bowl left-handed? Australian PM suggests cheeky new 'law'Border Gavaskar Trophy, IND vs AUS: Anthony Albanese, the Australian Prime Minister, jokingly said that Australia could pass a law which would allow Jasprit Bumrah to bowl only left-handed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-michael-clarke-retirement-india-vs-australia-sydney-test-2658328-2025-01-01",
      "headline": "Rohit Sharma has earned the right to walk away on his own terms: ClarkeBorder Gavaskar Trophy, IND vs AUS: Michael Clarke said that Rohit Sharma will get some leeway amid his poor run of form and will play in the New Year's Test at the Sydney Cricket Ground. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-hits-out-fake-manchester-united-exit-reports-stellar-agency-2658325-2025-01-01",
      "headline": "Rashford hits out at fake Manchester United exit articles: Getting ridiculousMarcus Rashford slammed reports of meeting with Stellar agency, dismissing claims about engineering a transfer from Manchester United as \"fake\" and \"ridiculous,\" while uncertainties around his role under Ruben Amorim continue to spark transfer speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-kl-rahul-new-year-celebration-wife-athiya-shetty-sydney-fifth-test-2658314-2025-01-01",
      "headline": "KL Rahul's stylish New Year celebration with wife Athiya Shetty in SydneyKL Rahul celebrated New Year with wife Athiya Shetty under Sydney's iconic fireworks, ahead of India's crucial fifth Test against Australia. The match carries high stakes for India's World Test Championship qualification hopes and Border-Gavaskar Trophy defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ms-dhoni-dressing-room-leak-india-vs-australia-melbourne-2658293-2025-01-01",
      "headline": "When Dhoni ridiculed dressing room leaks in 2014-15 Australia tourBorder Gavaskar Trophy, IND vs AUS: Amid reports of tensions in the dressing room where head coach Gautam Gambhir criticised the players after the MCG Test defeat, a video has been circulating where MS Dhoni tactfully dodged questions about the rift between the players on India's 2014-15 tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-jasprit-bumrah-bs-chandrasekhar-record-india-vs-australia-2658307-2025-01-01",
      "headline": "Jasprit Bumrah eyes BS Chandrasekhar's historic 52-year-old recordBorder Gavaskar Trophy, IND vs AUS: Indian fast bowler Jasprit Bumrah has been phenomenal in the ongoing series, having taken 30 wickets from four Tests with three five-wicket hauls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sydney-weather-report-rain-to-effect-new-year-test-2658302-2025-01-01",
      "headline": "IND vs AUS, Sydney Weather Report: Rain set to affect New Year's TestIndia are set to play their final Test match of the Border-Gavaskar Trophy against Trophy in Sydney. India will need to win the final Test match to remain in the hunt for the World Test Championship Final. The Sydney weather might make life tricky for Indian players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-released-from-hospital-kambli-health-update-vinod-kambli-hospital-treatment-2658300-2025-01-01",
      "headline": "'Fully fit' Vinod Kambli discharged from hospital after successful treatmentFormer India cricketer Vinod Kambli has been released from hospital after being declared fully fit by the doctors.  Kambli was initially admitted to Akruti Hospital on December 21 for urinary infection and cramps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-kl-rahul-new-year-celebration-wife-athiya-shetty-sydney-fifth-test-2658314-2025-01-01",
      "headline": "KL Rahul's stylish New Year celebration with wife Athiya Shetty in SydneyKL Rahul celebrated New Year with wife Athiya Shetty under Sydney's iconic fireworks, ahead of India's crucial fifth Test against Australia. The match carries high stakes for India's World Test Championship qualification hopes and Border-Gavaskar Trophy defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ms-dhoni-dressing-room-leak-india-vs-australia-melbourne-2658293-2025-01-01",
      "headline": "When Dhoni ridiculed dressing room leaks in 2014-15 Australia tourBorder Gavaskar Trophy, IND vs AUS: Amid reports of tensions in the dressing room where head coach Gautam Gambhir criticised the players after the MCG Test defeat, a video has been circulating where MS Dhoni tactfully dodged questions about the rift between the players on India's 2014-15 tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-jasprit-bumrah-bs-chandrasekhar-record-india-vs-australia-2658307-2025-01-01",
      "headline": "Jasprit Bumrah eyes BS Chandrasekhar's historic 52-year-old recordBorder Gavaskar Trophy, IND vs AUS: Indian fast bowler Jasprit Bumrah has been phenomenal in the ongoing series, having taken 30 wickets from four Tests with three five-wicket hauls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sydney-weather-report-rain-to-effect-new-year-test-2658302-2025-01-01",
      "headline": "IND vs AUS, Sydney Weather Report: Rain set to affect New Year's TestIndia are set to play their final Test match of the Border-Gavaskar Trophy against Trophy in Sydney. India will need to win the final Test match to remain in the hunt for the World Test Championship Final. The Sydney weather might make life tricky for Indian players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-released-from-hospital-kambli-health-update-vinod-kambli-hospital-treatment-2658300-2025-01-01",
      "headline": "'Fully fit' Vinod Kambli discharged from hospital after successful treatmentFormer India cricketer Vinod Kambli has been released from hospital after being declared fully fit by the doctors.  Kambli was initially admitted to Akruti Hospital on December 21 for urinary infection and cramps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-calendar-australia-vs-england-uefa-champions-league-india-vs-australia-2025-2658294-2025-01-01",
      "headline": "Ashes, Champions League, Grand Slams: Full list of major sports events in 20252025 promises a blockbuster year for sports fans worldwide, with cricket, football, athletics, and more delivering high-stakes events, thrilling rivalries, and iconic moments that will capture global attention and celebrate the unifying spirit of sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-india-sydney-test-record-2658280-2025-01-01",
      "headline": "Can India retain Border Gavaskar Trophy at SCG? Here's what history saysBorder Gavaskar Trophy, IND vs AUS: India have won only 1 out of 13 Test matches at the Sydney Cricket Ground. India's New Year's Test against Pat Cummins' Australia starts on January 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-stunning-catch-big-bash-league-2024-25-bbl-2024-25-brisbane-heat-vs-melbourne-stars-2658278-2025-01-01",
      "headline": "Watch: Glenn Maxwell's mind-boggling take on boundary during Big Bash League gameAustralia all-rounder Glenn Maxwell took a stunning catch on the boundary during Match 19 of the Big Bash League 2024-25 between Brisbane Heat and Melbourne Stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-jasprit-bumrah-sam-konstas-brother-pictures-prime-minister-2658276-2025-01-01",
      "headline": "See pics: Kohli, Bumrah pose with Sam Konstas's brothers on New Year's DayVirat Kohli and Jasprit Bumrah shared a light moment with Sam Konstas's brothers during a New Year celebration hosted by Australian PM Anthony Albanese, setting aside their on-field rivalries ahead of the Sydney Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-gautam-gambhir-not-first-choice-coach-dont-recover-melbourne-reports-2658256-2025-01-01",
      "headline": "Gautam Gambhir was not first choice coach, his position not safe: ReportGautam Gambhir's tenure as India's head coach faces scrutiny amid dressing room unrest, team selection debates, and disappointing performances in the Border-Gavaskar Trophy, with the Champions Trophy now looming as a decisive test for his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-women-2025-harmanpreet-kaur-rcb-u19-world-cup-2657999-2025-01-01",
      "headline": "Litmus test for Harmanpreet, U19 title defence and WPL festival in 2025Women's cricket will be aplenty in 2025 with the national team also set to play in the ODI World Cup at home. Niki Prasad's troops will be defending India's U19 T20 World Cup title. The focus will also be on Royal Challengers Bengaluru (RCB), the defending champions of the Women's Premier League (WPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-anthony-albanese-hosts-india-and-australia-ind-vs-aus-border-gavaskar-trophy-2024-25-2658245-2025-01-01",
      "headline": "AUS vs IND: Australian PM Anthony Albanese hosts both teams ahead of Sydney TestAustralian Prime Minister Anthony Albanese hosted the Australian and Indian Cricket teams ahead of the fifth Test scheduled to be held in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/united-cup-2024-elena-rybakina-kazakhstan-vs-germany-quarterfinal-2658242-2025-01-01",
      "headline": "Rybakina stars as Kazakhstan knock defending champion Germany outUnited Cup 2024: Kazakhstan knocked defending champion Germany out of the competition. Poland also secured their berth in the quarters after taking down the Czech Republic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-gautam-gambhir-not-first-choice-coach-dont-recover-melbourne-reports-2658256-2025-01-01",
      "headline": "Gautam Gambhir was not first choice coach, his position not safe: ReportGautam Gambhir's tenure as India's head coach faces scrutiny amid dressing room unrest, team selection debates, and disappointing performances in the Border-Gavaskar Trophy, with the Champions Trophy now looming as a decisive test for his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-women-2025-harmanpreet-kaur-rcb-u19-world-cup-2657999-2025-01-01",
      "headline": "Litmus test for Harmanpreet, U19 title defence and WPL festival in 2025Women's cricket will be aplenty in 2025 with the national team also set to play in the ODI World Cup at home. Niki Prasad's troops will be defending India's U19 T20 World Cup title. The focus will also be on Royal Challengers Bengaluru (RCB), the defending champions of the Women's Premier League (WPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-anthony-albanese-hosts-india-and-australia-ind-vs-aus-border-gavaskar-trophy-2024-25-2658245-2025-01-01",
      "headline": "AUS vs IND: Australian PM Anthony Albanese hosts both teams ahead of Sydney TestAustralian Prime Minister Anthony Albanese hosted the Australian and Indian Cricket teams ahead of the fifth Test scheduled to be held in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/united-cup-2024-elena-rybakina-kazakhstan-vs-germany-quarterfinal-2658242-2025-01-01",
      "headline": "Rybakina stars as Kazakhstan knock defending champion Germany outUnited Cup 2024: Kazakhstan knocked defending champion Germany out of the competition. Poland also secured their berth in the quarters after taking down the Czech Republic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-sydney-test-sydney-cricket-ground-pitch-report-border-gavaskar-trophy-2024-25-2658223-2025-01-01",
      "headline": "AUS vs IND: Sydney curator gives first update on the pitch for the fifth TestSydney Cricket Ground (SCG) pitch curator Adam Lewis shared first update on the surface ahead of the fifth Test between Australia and India set to be played from January 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-nitish-kumar-reddy-australia-vs-india-aus-vs-ind-border-gavaskar-trophy-2024-25-2658202-2025-01-01",
      "headline": "Michael Clarke wants 'genius' Nitish Kumar Reddy to bat at number 6 in Sydney TestFormer Australia captain Michael Clarke has suggested pushing India all-rounder Nitish Kumar Reddy to bat at number 6 in the upcoming fifth Test in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/glenn-mcgrath-pink-test-interview-jasprit-bumrah-massive-fan-2658193-2025-01-01",
      "headline": "I am a massive fan of Jasprit Bumrah, says legendary Glenn McGrathSpeaking to the press on New Year's Day in Sydney, legendary Glenn McGrath said he is a fan of Jasprit Bumrah. The former Australian fast bowler praised Bumrah for his ability to evolve and outsmart batters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-virat-kohli-slips-to-24th-rohit-sharma-on-40-after-mcg-test-2658187-2025-01-01",
      "headline": "ICC Test Rankings: Virat Kohli slips to 24th, Rohit Sharma on 40 after MCG TestStar India batters Virat Kohli and Rohit Sharma have suffered massive drops in the ICC Test batting rankings following their continuous poor outings in the ongoing Test series against Australia."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}