{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-mukesh-ambani-bullish-on-reliances-growth-no-word-on-jio-retail-ipos-2590174-2024-08-29",
      "headline": "RIL AGM: Mukesh Ambani bullish on Reliance's growth; no word on Jio, Retail IPOsMukesh Ambani was bullish on the conglomerate's growth and said that Reliance was on track to more than double in size before the end of this decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shah-rukh-khan-debuts-on-hurun-india-rich-list-with-rs-7300-crore-net-worth-2590133-2024-08-29",
      "headline": "Shah Rukh Khan enters Hurun India Rich List with Rs 7,300 crore net worthKnown for his recent hits like 'Jawan' and 'Pathaan', Khan's wealth isn't just from his successful film career but also from his stakes in the IPL team, Kolkata Knight Riders, which have significantly increased in value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-end-higher-driven-record-high-gains-in-ril-stock-2590085-2024-08-29",
      "headline": "Sensex, Nifty end higher driven by gains in RIL stock The S&P BSE Sensex added 349.05 points to end at 82,134.61, while the NSE Nifty50 gained 99.60 points to close at 25,151.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-live-updates-reliance-retail-in-top-5-globally-in-terms-of-stores-mukesh-ambani-2590067-2024-08-29",
      "headline": "RIL AGM: Reliance retail in top 5 globally in terms of stores The company also ranks among the top ten retailers worldwide in terms of market capitalisation and is in the top twenty for the number of employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-relinace-becomes-indias-first-company-to-surpass-rs-10-lakh-crore-annual-revenue-mukesh-ambani-2590049-2024-08-29",
      "headline": "RIL becomes India's first company to surpass Rs 10 lakh crore in annual revenueThis milestone was announced at the RIL AGM (annual general meeting), making Reliance the first Indian company to reach this landmark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-live-updates-reliance-industries-set-to-discuss-11-bonus-shares-for-shareholders-september-5-2590037-2024-08-29",
      "headline": "RIL AGM: Reliance Industries set to discuss 1:1 bonus shares on September 5RIL chairman Mukesh Ambani said that Reliance rewards its shareholders when the conglomerate grows at its AGM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-record-highs-as-financials-it-lead-gains-ril-agm-shares-2590003-2024-08-29",
      "headline": "Sensex, Nifty hit record highs as financials and IT lead gainsThe S&P BSE Sensex added 361.46 points to reach 82,147.02, while the NSE Nifty50 added 85.70 points at 25,138.05 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-jump-5-percent-today-approval-paytm-payments-services-price-target-brokerage-firms-2589993-2024-08-29",
      "headline": "Paytm shares jump 5% today. Check price targetsPaytm plans to reapply for a payment aggregator (PA) licence, which analysts see as a positive move that may alleviate regulatory concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-india-rich-list-2024-check-top-10-richest-individuals-youngest-billionaire-key-details-2589987-2024-08-29",
      "headline": "Hurun India Rich List 2024: Check top 10, youngest billionaire and other details With India's billionaire count rocketing to 334, this year's list showcases an extraordinary leap, marking a sixfold increase since its debut 13 years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indigo-interglobe-aviation-shares-fell-3-percent-early-trade-today-block-deal-rakesh-gangwal-chinkerpoo-family-trust-2589977-2024-08-29",
      "headline": "Explained: Why IndiGo shares fell 3% in early trade todayAround 6% of the stake in IndiGo's parent company was sold in a block deal during Thursday's trading session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/resourceful-automobile-ipo-shares-flat-listing-disappointed-investors-after-huge-ipo-bids-419-times-2589962-2024-08-29",
      "headline": "Why Resourceful Automobile IPO disappointed investors after huge IPO bidsInvestors poured money into the SME IPO, as it got bids close to Rs 5,000 crore, which is huge for a firm that operates with just 8 employees and 2 outlets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-tops-2024-hurun-india-rich-list-2024-surpasses-mukesh-ambani-2589954-2024-08-29",
      "headline": "Gautam Adani tops 2024 Hurun India Rich List 2024, surpasses Mukesh AmbaniHurun India Rich List 2024: Gautam Adani, 62, and his family have dethroned Ambani, who now holds the second position with a fortune of Rs 10.14 lakh crore.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-disney-merger-deal-clearer-cci-key-concerns-explained-2589945-2024-08-29",
      "headline": "Reliance-Disney merger cleared, but what were the key concerns? The approval came with significant scrutiny, especially regarding the dominance of the two companies in sports broadcasting and advertising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-agm-5-top-expectations-where-to-watch-ipos-mukesh-ambani-leadership-transition-2589920-2024-08-29",
      "headline": "Reliance AGM: 5 top expectations to watch out for, where to watchThe Reliance AGM will begin at 2:00 PM and Mukesh Ambani, the Chairman of RIL, will address shareholders and provide updates on several important aspects of the company's operations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-agm-2024-live-updates-key-announcements-expectations-mukesh-ambani-jio-2589890-2024-08-29",
      "headline": "Reliance AGM 2024: RIL on track to double in size by decade's end, says Mukesh AmbaniAt the Reliance AGM 2024, Mukesh Ambani highlighted several key developments. Jio has become the world's largest mobile data company, managing nearly 8% of global traffic and solidifying India's position as the top data market. Ambani announced the Jio AI-Cloud Welcome offer, launching this Diwali, which will provide up to 100 GB of free cloud storage and competitive pricing for additional storage, reflecting Jio's \"AI Everywhere For Everyone\" vision. Reliance's FY24 R&D investment exceeded Rs 3,643 crore (US$ 437 million), underscoring its commitment to innovation. The new Jio Brain suite aims to enhance AI adoption across Jio and other Reliance businesses. Additionally, Ambani revealed plans for the Dhirubhai Ambani Green Energy Giga Manufacturing Complex in Jamnagar, set to be the world's largest and most advanced solar production facility, driving the company's New Energy ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/resourceful-automobile-shares-list-flat-rs-117-at-issue-price-despite-huge-bidding-419-times-2589874-2024-08-29",
      "headline": "Resourceful Automobile shares list flat at issue price despite huge bidding Resourceful Automobile listing: The stock, which attracted bids worth Rs 4,800 crore for its Rs 12 crore IPO, was listed at its exact IPO price of Rs 117 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/berkshire-hathaway-warren-buffet-first-non-tech-us-firm-to-hit-usd-1-trillion-market-cap-2589862-2024-08-29",
      "headline": "Berkshire Hathaway becomes first non-tech US firm to hit $1 trillion market capThe company's stocks have climbed 30% in 2024, outperforming the S&P 500's gain of 18% so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-august-29-2024-precious-metals-record-hike-on-mcx-2589861-2024-08-29",
      "headline": "Gold, silver price today, August 29, 2024: Precious metals record hike on MCXGold Price Today August 29, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-cnn-interview-us-election-tim-walz-democratic-nominee-donald-trump-united-states-2590469-2024-08-30",
      "headline": "Same old, tired playbook: Kamala Harris claps back after Trump's racial attackDemocratic nominee for the US Presidential election and Vice President Kamala Harris sat for her first interview on Thursday since launching her campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-shivaji-statue-collapse-case-arrest-structural-consultant-chetan-patil-2590509-2024-08-30",
      "headline": "Maharashtra structural consultant arrested in Shivaji statue collapse caseStructural consultant Chetan Patil was arrested from Kolhapur in connection with the collapse of Chhatrapati Shivaji Maharaj's statue in Maharashtra's Sindhudurg district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-hit-and-run-case-suv-hits-bike-two-arrested-police-goregaon-2590405-2024-08-29",
      "headline": "Man, 24, dies after SUV driven by 17-year-old boy hits his bike in MumbaiAn SUV driven allegedly by a 17-year-old boy hit a 24-year-old biker in Mumbai, killing him. The teen was arrested when he tried to escape after his SUV crashed into an electric pole."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/tiny-kitchen-mini-cutlery-42-million-views-why-do-miniature-videos-go-viral-2590063-2024-08-30",
      "headline": "Tiny kitchen, mini cutlery, 42 million views: Why do miniature videos go viral?A viral video on Instagram, of someone cooking chicken biryani, has an unbelievable 42 million views. The twist? Everything is tiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/finance-ministry-lgbtq-community-joint-bank-accounts-supreme-court-rbi-2590470-2024-08-30",
      "headline": "LGBTQ persons can now open joint bank accounts, Centre says 'no restrictions'The Finance Ministry has clarified that there are no restrictions on LGBTQ+ individuals opening joint bank accounts or nominating their partners as beneficiaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-asna-in-gujarat-monsoon-rain-several-dead-injured-in-ahmedabad-vadodara-surat-saurashtra-kutch-2590474-2024-08-30",
      "headline": "Gujarat braces for Cyclone Asna, heavy rain batters Saurashtra-Kachchh regionThe deep depression over Saurashtra and Kutch has started moving slowly westwards at a speed of around three kilometres per hour during the past six hours and is expected to hit the coast on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-carlos-alcaraz-knocked-out-second-round-botic-van-de-zandschulp-2590510-2024-08-30",
      "headline": "Carlos Alcaraz knocked out as Van de Zandschulp stuns World No.3 US Open 2024: Botic van de Zandschulp of the Netherlands pulled off a massive heist after beating World No.3 Carlos Alcaraz in straight sets on Centre Court on Thursday night in two hours and 21 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-ivf-government-insurance-companies-to-pay-abortion-ban-reproductive-rights-2590475-2024-08-30",
      "headline": "Want more babies: Trump says would fund IVF, then 'backs' abortion rightsUS Election: Republican presidential nominee Donald Trump said, if elected, he would make the government or insurance companies cover the costs of in vitro fertilisation, and also criticised Florida's six-week abortion ban."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/kannada-actor-darshan-renukaswamy-murder-case-vip-treatment-ballari-jail-sunglasses-bengaluru-2590456-2024-08-30",
      "headline": "Action against cop after actor Darshan seen entering Ballari jail with 'sunglasses'Kannada actor Darshan Thogudeepa, accused in a murder case, faced a new controversy after he was seen entering the Ballari jail with 'sunglasses' hanging on his branded T-shirt. A police officer was facing disciplinary action over the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/navi-mumbai-double-murder-case-contract-killing-fails-land-deal-dispute-police-arrested-accused-2590421-2024-08-30",
      "headline": "Navi Mumbai property dealer's contract to kill friend backfires in stunning twistA property dealer from Navi Mumbai hired a contract killer to kill his friend over a dispute regarding a land deal. While his friend was killed, he too was murdered after the killers demanded the full amount from him while suspecting foul play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-fighting-pauses-fighting-polio-vaccinations-who-ceasefire-2590455-2024-08-30",
      "headline": "Israel, Hamas agree to 3-day pause in fighting for Gaza polio vaccinations: WHOIsrael and Hamas have agreed to a three-day pause in fighting in Gaza to allow the first round of polio vaccination of 640,000 children in the war-torn Palestinian enclave. The vaccinations will begin from Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-in-tears-film-maria-8-minute-standing-ovation-venice-film-festival-2590499-2024-08-30",
      "headline": "Angelina Jolie in tears as her film 'Maria' gets 8-minute standing ovationActor Angelina Jolie was visibly moved after her film 'Maria' received an eight-minute standing ovation at the Venice Film Festival. The film is a biographical drama about the Greek opera singer Maria Callas. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-leader-ram-chander-u-turn-bjp-switch-delhi-arvind-kejriwal-manish-sisodia-2590335-2024-08-29",
      "headline": "To BJP and back in 4 days, AAP leader says 'Arvind Kejriwal came in my dream'Ram Chander, a former MLA from Bawana Assembly and currently a sitting councillor, expressed regret over his brief stint with the BJP. He said his decision to return to AAP was influenced by a dream he had."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-frantic-calls-doctor-family-reveal-shocking-details-about-her-death-2590069-2024-08-29",
      "headline": "'She died by suicide, hurry', Kolkata doctor's family was told in frantic callsIndia Today TV has accessed the audio recordings of the three calls made from the RG Kar hospital to the parents of a 31-year-old trainee doctor, who was raped and murdered at the hospital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/girl-raped-ghaziabad-angry-mob-vehicles-ablaze-vandalise-shop-2590246-2024-08-29",
      "headline": "Minor raped in Ghaziabad, angry mob vandalises shops, sets vehicles ablazeA scrap dealer broke into the minor's home and then assaulted her along with his accomplices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-sensed-danger-meeting-amitabh-bachchan-first-time-2590122-2024-08-29",
      "headline": "When Jaya Bachchan sensed 'danger' upon meeting Big B for the 1st timeIn the early 70s, Amitabh Bachchan and Jaya Bhaduri met for the first time on the sets of 'Guddi', sparking a connection that led to a lifelong partnership. Jaya later revealed she sensed 'danger' upon meeting Big B, as he was the only person who could influence her actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-test-cricket-break-back-injury-afghanistan-vs-new-zealand-2590340-2024-08-29",
      "headline": "Afghanistan's Rashid Khan takes break from Test cricket to manage injury issuesAfghanistan's star spinner Rashid Khan will take a lengthy break from Test cricket to maintain his workload. Rashid has been dealing with back injury concerns after having had surgery last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/defamation-proceedings-against-shashi-tharoor-over-remark-on-pm-modi-to-continue-2590213-2024-08-29",
      "headline": "Court refuses to cancel case against Shashi Tharoor over 'scorpion' remark on PMTharoor had, in 2018, claimed that some RSS leader had compared Prime Minister Modi to \"a scorpion sitting on a Shivling\". He called it an \"extraordinarily striking metaphor\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-cops-arrested-stealing-rifle-bjp-mla-kh-joykishan-singh-farmhouse-court-remand-2590422-2024-08-30",
      "headline": "4 Manipur cops among 5 arrested over stealing of rifles from BJP MLA's farmhouseFour police personnel were among the five arrested in connection with the stealing of rifles of BJP MLA Kh Joykishan Singh from his farmhouse in Manipur. The accused were remanded to police custody for 10 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/remembering-dhyan-chand-the-hockey-maestro-who-refused-to-salute-hitler-2589936-2024-08-29",
      "headline": "Remembering Dhyan Chand, the hockey legend who refused to salute HitlerMajor Dhyan Chand captained the Indian hockey team to three Olympic gold medals, an extraordinary achievement that remains unparalleled in the sport. On his birth anniversary, know about his alleged interaction with Adolf Hitler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jjp-inld-haryana-assembly-elections-asp-chandrashekhar-azad-bsp-mayawati-dushyant-chautala-bjp-congress-2590418-2024-08-30",
      "headline": "Why JJP, INLD may not benefit after allying with Chandrashekhar Azad's party, BSP?To woo Dalit voters in the upcoming Haryana Assembly polls, the JJP and INLD have allied with Chandrashekhar Azad's ASP (Kanshiram) and BSP. According to analysts, the alliances may benefit little to the parties for various reasons. Read more to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/supreme-court/story/supreme-court-money-laundering-pmla-cases-manish-sisodia-k-kavitha-bail-liquor-policy-case-2590472-2024-08-30",
      "headline": "Bail in money laundering cases a domino effect of Manish Sisodia's bail order?When India Today spoke to legal experts to understand if the Supreme Court's order granting bail to Manish Sisodia in the liquor policy case will affect Arvind Kejriwal's case, they said the same will also affect other cases under PMLA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-presidential-election-swedish-music-abba-donald-trump-asked-to-not-use-music-2590485-2024-08-30",
      "headline": "ABBA asks Donald Trump not to play their music while campaigningBBA joins a long list of performers who've objected to Trump using their songs. Ahead of the 2020 election, that included Bruce Springsteen, Rihanna, Phil Collins, Pharrell, John Fogerty, Neil Young, Eddy Grant, Panic! at the Disco, R.E.M. and Guns N' Roses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-talk-show-interviews-ram-gopal-varma-prime-video-show-2590528-2024-08-30",
      "headline": "Pics: Rana Daggubati interviews Ram Gopal Varma for a new showActor Rana Daggubati interviewed filmmaker Ram Gopal Varma for a new Prime Video show. The director shared BTS (behind-the scenes) photos from the shooting spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-adorable-reaction-priyanka-chopra-very-demure-pics-2590517-2024-08-30",
      "headline": "Nick Jonas's adorable reaction to Priyanka Chopra's 'very demure' picsNick Jonas couldn't resist sharing his heartfelt reaction to his wife Priyanka Chopra's latest photoshoot pictures. In addition to him, several other celebrities, including Bhumi Pednekar, also reacted to the stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-dance-video-rumoured-boyfriend-kabir-bahia-comment-watch-2590505-2024-08-30",
      "headline": "Kriti Sanon's dance video gets a playful comment from rumoured boyfriend Kabir BahiaActor Kriti Sanon's rumoured boyfriend, Kabir Bahia, left a comment on her latest dance video. Some social media users took his comment as an official confirmation of their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-in-tears-film-maria-8-minute-standing-ovation-venice-film-festival-2590499-2024-08-30",
      "headline": "Angelina Jolie in tears as her film 'Maria' gets 8-minute standing ovationActor Angelina Jolie was visibly moved after her film 'Maria' received an eight-minute standing ovation at the Venice Film Festival. The film is a biographical drama about the Greek opera singer Maria Callas. \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tabraiz-shamsi-slammed-for-poking-fun-at-suryakumar-yadavs-t20-wc-final-catch-2590515-2024-08-30",
      "headline": "Tabraiz Shamsi slammed for poking fun at Suryakumar Yadav's T20 WC final catchSouth Africa spinner Tabraiz Shamsi was slammed by fans for poking fun at Suryakumar Yadav's incredible catch from the T20 World Cup 2024 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-carlos-alcaraz-knocked-out-second-round-botic-van-de-zandschulp-2590510-2024-08-30",
      "headline": "Carlos Alcaraz knocked out as Van de Zandschulp stuns World No.3 US Open 2024: Botic van de Zandschulp of the Netherlands pulled off a massive heist after beating World No.3 Carlos Alcaraz in straight sets on Centre Court on Thursday night in two hours and 21 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-to-resign-as-new-zealand-t20i-skipper-after-womens-t20-world-cup-2590502-2024-08-30",
      "headline": "Devine to resign as White Ferns T20I skipper after T20 World CupVeteran all-rounder Sophie Devine said that she will step down as the New Zealand in T20Is after the World Cup, but will continue leading the White Ferns in ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-joe-root-remembers-graham-thorpe-after-lords-ton-2590486-2024-08-30",
      "headline": "ENG vs SL: Joe Root remembers Graham Thorpe after record-levelling ton at Lord'sStar England batter Joe Root remembered former England cricketer Graham Thorpe after his record-levelling ton against Sri Lanka on Day 1 of the second Test at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-breezes-past-fabian-marozsan-to-advance-to-third-round-2590476-2024-08-30",
      "headline": "US Open: Daniil Medvedev breezes past Fábián Marozsán to advance to third roundDaniil Medvedev beat Fábián Marozsán by 6-3, 6-2, 7-6 (5) at Louis Armstrong Stadium to advance to the third round of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-karolina-muchova-naomi-osaka-2590465-2024-08-30",
      "headline": "US Open: Karolína Muchová knocks out Naomi Osaka in second round after thrillerKarolína Muchová knocked out two-time champion Naomi Osaka in the second round of the US Open women's singles at Arthur Ashe Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-elena-rybakina-withdraws-injury-concerns-second-round-2590420-2024-08-30",
      "headline": "US Open: Elena Rybakina withdraws from US Open due to injuryElena Rybakina's US Open run ended in disappointment as the world number four withdrew due to injury before her second-round match, dashing her hopes of finally making a deep run at the only Grand Slam she hasn't mastered yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-rohan-bopanna-matthew-ebden-winning-start-iga-swiatek-round-three-2590419-2024-08-30",
      "headline": "US Open: Bopanna-Ebden make winning start, Iga Switek storms into Round 3US Open Day 4 saw Rohan Bopanna and Matthew Ebden kick off their campaign with a strong-fought win in their men's doubles first round clash against Haase and Arends. On the same day, Iga Swaitek eased past Ena Shibara to move into round three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paralympics-sheetal-devi-india-archery-personal-best-ranking-round-2590417-2024-08-30",
      "headline": "Sheetal Devi leads Indian archers' impressive show in ranking roundIndia's 17-year-old armless archer Sheetal Devi delivered a remarkable performance in the women's individual compound open ranking round at the Paris Paralympics, securing second place with 703 points and advancing directly to the round of 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-third-round-50-wins-tour-hubert-hurkacz-stunned-2nd-round-2590416-2024-08-30",
      "headline": "In love with New York, Jannik Sinner eases into Round 3 after 'special 50'US Open 2024: Jannik Sinner became the first man to complete 50 wins on the tour in men's singles in 2024. He achieved the milestone when he hammered USA's Alex Michelsen 6-4, 6-0, 6-2 in the second round on Thursday, August 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-team-draw-new-format-real-madrid-liverpool-fc-barcelona-2590409-2024-08-30",
      "headline": "Champions League set for new era: Madrid vs Liverpool, Barcelona vs BayernAs the UEFA Champions League steps into a new era under its brand-new format, the league phase draw on August 29 has revealed who the top European sides will go up against in the competition. Real Madrid against Liverpool, Barcelona against Bayern Munich are some of the headline clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-elena-rybakina-withdraws-injury-concerns-second-round-2590420-2024-08-30",
      "headline": "US Open: Elena Rybakina withdraws from US Open due to injuryElena Rybakina's US Open run ended in disappointment as the world number four withdrew due to injury before her second-round match, dashing her hopes of finally making a deep run at the only Grand Slam she hasn't mastered yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-rohan-bopanna-matthew-ebden-winning-start-iga-swiatek-round-three-2590419-2024-08-30",
      "headline": "US Open: Bopanna-Ebden make winning start, Iga Switek storms into Round 3US Open Day 4 saw Rohan Bopanna and Matthew Ebden kick off their campaign with a strong-fought win in their men's doubles first round clash against Haase and Arends. On the same day, Iga Swaitek eased past Ena Shibara to move into round three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paralympics-sheetal-devi-india-archery-personal-best-ranking-round-2590417-2024-08-30",
      "headline": "Sheetal Devi leads Indian archers' impressive show in ranking roundIndia's 17-year-old armless archer Sheetal Devi delivered a remarkable performance in the women's individual compound open ranking round at the Paris Paralympics, securing second place with 703 points and advancing directly to the round of 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-third-round-50-wins-tour-hubert-hurkacz-stunned-2nd-round-2590416-2024-08-30",
      "headline": "In love with New York, Jannik Sinner eases into Round 3 after 'special 50'US Open 2024: Jannik Sinner became the first man to complete 50 wins on the tour in men's singles in 2024. He achieved the milestone when he hammered USA's Alex Michelsen 6-4, 6-0, 6-2 in the second round on Thursday, August 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-team-draw-new-format-real-madrid-liverpool-fc-barcelona-2590409-2024-08-30",
      "headline": "Champions League set for new era: Madrid vs Liverpool, Barcelona vs BayernAs the UEFA Champions League steps into a new era under its brand-new format, the league phase draw on August 29 has revealed who the top European sides will go up against in the competition. Real Madrid against Liverpool, Barcelona against Bayern Munich are some of the headline clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-2-full-schedule-medal-events-avani-lekhara-2590404-2024-08-30",
      "headline": "India at Paralympics, Day 2 Full Schedule: Medal events begin in para-athletics Paralympics 2024 India Schedule Day 2 (August 30): Team India will look to open its medal tally at the 2024 Paris Paralympic Games on Friday, with Avani Lekhara and Manish Narwal set to kick off their campaigns.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jasmine-paolini-karolina-pliskova-injury-anna-kalinskaya-2590407-2024-08-29",
      "headline": "Jasmine Paolini continues dream run in 2024, Anna Kalinskaya advancesUS Open 2024: Jasmine Paolini continued her dream run this year, progressing to the third round of the US Open for the first time in her career. She spent less than 10 minutes on the court on Thursday as her opponent -- former World No. 1 Karolina Pliskova, retired in the first game after an ankle injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-tennis-players-take-naps-before-matches-especially-late-ones-2590406-2024-08-29",
      "headline": "US Open tennis players take naps before matches, especially late onesUS Open 2024: Tennis players are increasingly valuing naps to enhance their performance, especially before night matches. With facilities like the 'Player Quiet Room' and personal routines, athletes find various ways to catch some extra sleep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deandra-dottin-back-in-west-indies-squad-for-t20-world-cup-2590398-2024-08-29",
      "headline": "Deandra Dottin back in West Indies squad for T20 World CupDeandra Dottin has been picked in the West Indies squad for the next T20 World Cup, just a month after reconsidering her international retirement. Dottin, who scored the fastest century in women's T20Is, unexpectedly quit international cricket in 2022, claiming issues with the team climate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-lords-test-day-1-report-joe-root-hundred-atkinson-fifty-2590394-2024-08-29",
      "headline": "Joe Root 143, Atkinson fifty deflate Sri Lanka on Day 1Joe Root's masterful 143 and Gus Atkinson's impressive fifty led England to a strong position of 358 for 7 against Sri Lanka on the first day of the Lord's Test. Despite early wickets, England's resilience shone through with significant partnerships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-2nd-test-live-streaming-team-news-prediction-2590375-2024-08-29",
      "headline": "PAK vs BAN, 2nd Test: Bangladesh look to add to mystery of wounded PakistanPakistan vs Bangladesh, 2nd Test: Pakistan will look to bounce back from the defeat in the first Test and level the series. They have dropped fast bowler Shaheen Afridi and are likely to play spinner Abrar Ahmed in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-mason-mount-ruled-out-muscle-injury-2590364-2024-08-29",
      "headline": "Manchester United's Mason Mount ruled out with muscle injuryMason Mount has expressed \"frustration\" after being ruled out with a muscle injury, the latest blow in his injury-plagued Manchester United career. The offensive midfielder suffered an injury during the first half of Saturday's 2-1 loss against Brighton and was replaced at halftime.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-test-cricket-break-back-injury-afghanistan-vs-new-zealand-2590340-2024-08-29",
      "headline": "Afghanistan's Rashid Khan takes break from Test cricket to manage injury issuesAfghanistan's star spinner Rashid Khan will take a lengthy break from Test cricket to maintain his workload. Rashid has been dealing with back injury concerns after having had surgery last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-lords-test-day-1-report-joe-root-hundred-atkinson-fifty-2590394-2024-08-29",
      "headline": "Joe Root 143, Atkinson fifty deflate Sri Lanka on Day 1Joe Root's masterful 143 and Gus Atkinson's impressive fifty led England to a strong position of 358 for 7 against Sri Lanka on the first day of the Lord's Test. Despite early wickets, England's resilience shone through with significant partnerships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-2nd-test-live-streaming-team-news-prediction-2590375-2024-08-29",
      "headline": "PAK vs BAN, 2nd Test: Bangladesh look to add to mystery of wounded PakistanPakistan vs Bangladesh, 2nd Test: Pakistan will look to bounce back from the defeat in the first Test and level the series. They have dropped fast bowler Shaheen Afridi and are likely to play spinner Abrar Ahmed in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-mason-mount-ruled-out-muscle-injury-2590364-2024-08-29",
      "headline": "Manchester United's Mason Mount ruled out with muscle injuryMason Mount has expressed \"frustration\" after being ruled out with a muscle injury, the latest blow in his injury-plagued Manchester United career. The offensive midfielder suffered an injury during the first half of Saturday's 2-1 loss against Brighton and was replaced at halftime.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-test-cricket-break-back-injury-afghanistan-vs-new-zealand-2590340-2024-08-29",
      "headline": "Afghanistan's Rashid Khan takes break from Test cricket to manage injury issuesAfghanistan's star spinner Rashid Khan will take a lengthy break from Test cricket to maintain his workload. Rashid has been dealing with back injury concerns after having had surgery last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-honored-uefa-as-champions-league-all-time-top-goalscorer-2590338-2024-08-29",
      "headline": "Cristiano Ronaldo, Champions League's all-time scorer, honoured by UEFACristiano Ronaldo, the all-time leading goalscorer in the UEFA Champions League, was honoured with a special award by UEFA President Aleksander Ceferin. The award recognises Ronaldo's remarkable achievements and enduring legacy in European club football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/romelu-lukaku-napoli-transfer-three-year-contract-italy-serie-a-chelsea-as-roma-2590334-2024-08-29",
      "headline": "Lukaku continues Italy tour, signs for Napoli from Chelsea on 3-year dealNapoli have completed the signing Romelu Lukaku from Chelsea on a 3-year-contract, which further extends his Italian journey across three of the top Serie A clubs - Inter Milan, AS Roma, and now the Gil Azzuri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-2nd-test-coach-chandika-hathurusingha-press-rawalpindi-2590332-2024-08-29",
      "headline": "Bangladesh expect good fight from Pakistan in 2nd Test: Coach HathurusinghaPakistan vs Bangladesh, 2nd Test: Speaking to the press on the eve of the 2nd Test, coach Chandika Hathurusingha said Bangladesh are confident of doing well in the series finale and said he expects a good fight from the hosts in Rawalpindi. Pakistan were handed a shock loss in the series opener last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-joe-root-test-hundred-alastair-cook-england-record-most-centuries-2590313-2024-08-29",
      "headline": "Joe Root equals Alastair Cook's England Test record with 33rd hundredEngland vs Sri Lanka: Joe Root hit his 33rd hundred on the opening day of the second Test to equal Alastair Cook's record of most Test centuries for England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}